{
    "uid": "107-D",
    "url": "https://codeforces.com/contest/107/problem/D",
    "tags": [
        "dp",
        " graphs",
        " matrices"
    ],
    "title": "107-D",
    "statement": "D. Crime Managementtime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutZeyad wants to commitncrimes in Egypt and not be punished at the end. There are several types of crimes. For example, bribery is a crime but is not considered such when repeated twice. Therefore, bribery is not considered a crime when repeated an even number of times. Speeding is a crime, but is not considered such when repeated a number of times which is a multiple of five.More specifically,cconditions on crime repetitions are known. Each condition describes the crime typetiand its multiplicitymi. If the number of times Zeyad committed the crimetiis a multiple ofmi, Zeyad will not be punished for crimeti. Some crimes may be listed more than once. In this case fulfilling at least one condition for this crime is enough to not be punished for it. Of course, if for certain crime the number of times Zeyad committed it is zero, he is innocent with respect to this crime.Now Zeyad is interested in a number of ways he can commit exactlyncrimes without any punishment.The order of commiting the crimes matters. More formally, two ways, sequencesw1andw2, of committingncrimes are equal ifw1i=w2i, for all1 ≤i≤n.InputThe first line contains two integersnandc(0 ≤n≤ 1018, 0 ≤c≤ 1000) — the number of crimes Zeyad would like to commit and the number of conditions he is aware of.Then the definitions forcconditions follow. There are26types of crimes. Each crime definition consists of crime type — a capital Latin letter — and its multiplicity.The multiplicity of each crime is a positive integer number and the product of all multiplicities does not exceed123. Some conditions may be repeated in the input more than once.Crime of multiplicity1is not yielding any punishment regardless of the number of times it was committed. The strictness of the law is compensated by the fact that it's non-mandatory.Obviously, if some crime is not listed in the set of conditions, then Zeyad will not consider it, as committing it would unavoidably lead to the punishment.Please, do not use the%lldspecificator to read or write 64-bit integers in С++. It is preferred to use thecinstream (you may also use the%I64dspecificator).OutputOutput the number of different ways Zeyad can commit exactlyncrimes with no punishment modulo12345.ExamplesInput5 2A 1B 2Output16Input6 3A 1B 2C 3Output113Input8 3A 2A 3B 2Output128NoteIn the first test case, the 16 ways are: AAAAA, AAABB, AABAB, AABBA, ABAAB, ABABA, ABBAA, BAAAB, BAABA, BABAA, BBAAA, ABBBB, BABBB, BBABB, BBBAB, BBBBA.",
    "source": "CF",
    "vjudge": false
}