{
    "uid": "113-E",
    "url": "https://codeforces.com/contest/113/problem/E",
    "tags": [
        "combinatorics",
        " implementation",
        " math"
    ],
    "title": "113-E",
    "statement": "E. Sleepingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day Vasya was lying in bed watching his electronic clock to fall asleep quicker.Vasya lives in a strange country, where days havehhours, and every hour hasmminutes. Clock shows time in decimal number system, in formatH:M, where the stringHalways has a fixed length equal to the number of digits in the decimal representation of numberh- 1. To achieve this, leading zeros are added if necessary. The stringMhas a similar format, and its length is always equal to the number of digits in the decimal representation of numberm- 1. For example, ifh= 17,m= 1000, then time equal to 13 hours and 75 minutes will be displayed as \"13:075\".Vasya had been watching the clock fromh1hoursm1minutes toh2hoursm2minutes inclusive, and then he fell asleep. Now he asks you to count how many times he saw the moment at which at leastkdigits changed on the clock simultaneously.For example, when switching 04:19→04:20 two digits change. When switching 23:59→00:00, four digits change.Consider that Vasya has been watching the clock for strictly less than one day. Note that the last time Vasya saw on the clock before falling asleep was \"h2:m2\". That is, Vasyadidn't seethe moment at which time \"h2:m2\" switched to the next value.InputThe first line of the input file contains three space-separated integersh,mandk(2 ≤h,m≤ 109,1 ≤k≤ 20). The second line contains space-separated integersh1,m1(0 ≤h1<h,0 ≤m1<m). The third line contains space-separated integersh2,m2(0 ≤h2<h,0 ≤m2<m).OutputPrint a single number — the number of times Vasya saw the moment of changing at leastkdigits simultaneously.Please do not use the%lldspecificator to read or write 64-bit integers in C++. It is preferred to use thecinstream (also you may use the%I64dspecificator).ExamplesInput5 5 24 42 1Output3Input24 60 10 023 59Output1439Input24 60 323 5923 59Output0NoteIn the first example Vasya will see the following moments of time: 4:40:0→0:1→0:2→0:3→0:41:0→1:1→1:2→1:3→1:42:0→2:1→2:2→2:3→2:4. Double arrow () marks the sought moments of time (in this example — when Vasya sees two numbers changing simultaneously).In the second examplek= 1. Any switching time can be accepted, since during switching of the clock at least one digit is changed. Total switching equals to24·60 = 1440, but Vasya have not seen one of them — the switching of 23:5900:00.In the third example Vasya fell asleep immediately after he began to look at the clock, so he did not see any change.",
    "source": "CF",
    "vjudge": false
}