{
    "uid": "119-C",
    "url": "https://codeforces.com/contest/119/problem/C",
    "tags": [
        "dp"
    ],
    "title": "119-C",
    "statement": "C. Education Reformtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYet another education system reform has been carried out in Berland recently. The innovations are as follows:An academic year now consists ofndays. Each day pupils study exactly one ofmsubjects, besides, each subject is studied for no more than one day. After the lessons of thei-th subject pupils get the home task that contains no less thanaiand no more thanbiexercises. Besides, each subject has a special attribute, the complexity (ci). A school can make its own timetable, considering the following conditions are satisfied:the timetable should contain the subjects in the order of the complexity's strict increasing;each day, except for the first one, the task should contain eitherktimes more exercises, or more bykcompared to the previous day (more formally: let's call the number of home task exercises in thei-th day asxi, then for eachi(1 <i≤n): eitherxi=k+xi- 1orxi=k·xi- 1must be true);the total number of exercises in all home tasks should be maximal possible.All limitations are separately set for each school.It turned out that in many casesaiandbireach1016(however, as the Berland Minister of Education is famous for his love to half-measures, the value ofbi-aidoesn't exceed100). That also happened in the Berland School №256. Nevertheless, you as the school's principal still have to work out the timetable for the next academic year...InputThe first line contains three integersn,m,k(1 ≤n≤m≤ 50,1 ≤k≤ 100) which represent the number of days in an academic year, the number of subjects and thekparameter correspondingly. Each of the followingmlines contains the description of a subject as three integersai,bi,ci(1 ≤ai≤bi≤ 1016,bi-ai≤ 100,1 ≤ci≤ 100) — two limitations to the number of exercises on thei-th subject and the complexity of thei-th subject, correspondingly. Distinct subjects can have the same complexity. The subjects are numbered with integers from1tom.Please do not use the%lldspecificator to read or write 64-bit numbers in С++. It is preferred to use thecinstream or the%I64dspecificator.OutputIf no valid solution exists, print the single word \"NO\" (without the quotes). Otherwise, the first line should contain the word \"YES\" (without the quotes) and the nextnlines should contain any timetable that satisfies all the conditions. Thei+ 1-th line should contain two positive integers: the number of the subject to study on thei-th day and the number of home task exercises given for this subject. The timetable should contain exactlynsubjects.ExamplesInput4 5 21 10 11 10 21 10 31 20 41 100 5OutputYES2 83 104 205 40Input3 4 31 3 12 4 42 3 32 2 2OutputNO",
    "source": "CF",
    "vjudge": false
}