{
    "uid": "119-A",
    "url": "https://codeforces.com/contest/119/problem/A",
    "tags": [
        "implementation"
    ],
    "title": "119-A",
    "statement": "A. Epic Gametime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSimon and Antisimon play a game. Initially each player receives one fixed positive integer that doesn't change throughout the game. Simon receives numberaand Antisimon receives numberb. They also have a heap ofnstones. The players take turns to make a move and Simon starts. During a move a player should take from the heap the number of stones equal to the greatest common divisor of the fixed number he has received and the number of stones left in the heap. A player loses when he cannot take the required number of stones (i. e. the heap hasstrictlyless stones left than one needs to take).Your task is to determine by the givena,bandnwho wins the game.InputThe only string contains space-separated integersa,bandn(1 ≤a,b,n≤ 100) — the fixed numbers Simon and Antisimon have received correspondingly and the initial number of stones in the pile.OutputIf Simon wins, print \"0\" (without the quotes), otherwise print \"1\" (without the quotes).ExamplesInput3 5 9Output0Input1 1 100Output1NoteThe greatest common divisor of two non-negative integersaandbis such maximum positive integerk, thatais divisible bykwithout remainder and similarly,bis divisible bykwithout remainder. Letgcd(a,b)represent the operation of calculating the greatest common divisor of numbersaandb. Specifically,gcd(x, 0) =gcd(0,x) =x.In the first sample the game will go like that:Simon should takegcd(3, 9) = 3stones from the heap. After his move the heap has6stones left.Antisimon should takegcd(5, 6) = 1stone from the heap. After his move the heap has5stones left.Simon should takegcd(3, 5) = 1stone from the heap. After his move the heap has4stones left.Antisimon should takegcd(5, 4) = 1stone from the heap. After his move the heap has3stones left.Simon should takegcd(3, 3) = 3stones from the heap. After his move the heap has0stones left.Antisimon should takegcd(5, 0) = 5stones from the heap. As0 < 5, it is impossible and Antisimon loses.In the second sample each player during each move takes one stone from the heap. Asnis even, Antisimon takes the last stone and Simon can't make a move after that.",
    "source": "CF",
    "vjudge": false
}