{
    "uid": "123-E",
    "url": "https://codeforces.com/contest/123/problem/E",
    "tags": [
        "dfs and similar",
        " dp",
        " probabilities",
        " trees"
    ],
    "title": "123-E",
    "statement": "E. Mazetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA maze is represented by a tree (an undirected graph, where exactly one way exists between each pair of vertices). In the maze the entrance vertex and the exit vertex are chosen with some probability. The exit from the maze is sought by Deep First Search. If there are several possible ways to move, the move is chosen equiprobably. Consider the following pseudo-code:DFS(x)if x == exit vertex thenfinish searchflag[x] <- TRUErandom shuffle the vertices' order in V(x) // here all permutations have equal probability to be chosenfor i <- 1 to length[V] doif flag[V[i]] = FALSE thencount++;DFS(y);count++;V(x)is the list vertices adjacent tox. Theflagarray is initially filled asFALSE.DFSinitially starts with a parameter of an entrance vertex. When thesearch is finished, variablecountwill contain the number of moves.Your task is to count the mathematical expectation of the number of moves one has to do to exit the maze.InputThe first line determines the number of vertices in the graphn(1 ≤n≤ 105). The nextn- 1lines contain pairs of integersaiandbi, which show the existence of an edge betweenaiandbivertices (1 ≤ai,bi≤n). It is guaranteed that the given graph is a tree.Nextnlines contain pairs of non-negative numbersxiandyi, which represent the probability of choosing thei-th vertex as an entrance and exit correspondingly. The probabilities to choose vertexias an entrance and an exit equalandcorrespondingly. The sum of allxiand the sum of allyiare positive and do not exceed106.OutputPrint the expectation of the number of moves. The absolute or relative error should not exceed10- 9.ExamplesInput21 20 11 0Output1.00000000000000000000Input31 21 31 00 20 3Output2.00000000000000000000Input71 21 32 42 53 63 71 11 11 11 11 11 11 1Output4.04081632653NoteIn the first sample the entrance vertex is always 1 and the exit vertex is always 2.In the second sample the entrance vertex is always 1 and the exit vertex with the probability of 2/5 will be 2 of with the probability if 3/5 will be 3. The mathematical expectations for the exit vertices 2 and 3 will be equal (symmetrical cases). During the first move one can go to the exit vertex with the probability of 0.5 or to go to a vertex that's not the exit vertex with the probability of 0.5. In the first case the number of moves equals 1, in the second one it equals 3. The total mathematical expectation is counted as2 / 5 × (1 × 0.5 + 3 × 0.5) + 3 / 5 × (1 × 0.5 + 3 × 0.5)",
    "source": "CF",
    "vjudge": false
}