{
    "uid": "1446-B",
    "url": "https://codeforces.com/contest/1446/problem/B",
    "tags": [
        "dp",
        " strings"
    ],
    "title": "1446-B",
    "statement": "B. Catching Cheaterstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two strings $$$A$$$ and $$$B$$$ representing essays of two students who are suspected cheaters. For any two strings $$$C$$$, $$$D$$$ we define their similarity score $$$S(C,D)$$$ as $$$4\\\\cdot LCS(C,D) - |C| - |D|$$$, where $$$LCS(C,D)$$$ denotes the length of the Longest CommonSubsequenceof strings $$$C$$$ and $$$D$$$.You believe that only some part of the essays could have been copied, therefore you're interested in theirsubstrings.Calculate the maximal similarity score over all pairs of substrings. More formally, output maximal $$$S(C, D)$$$ over all pairs $$$(C, D)$$$, where $$$C$$$ is some substring of $$$A$$$, and $$$D$$$ is some substring of $$$B$$$.If $$$X$$$ is a string, $$$|X|$$$ denotes its length.A string $$$a$$$ is asubstringof a string $$$b$$$ if $$$a$$$ can be obtained from $$$b$$$ by deletion of several (possibly, zero or all) characters from the beginning and several (possibly, zero or all) characters from the end.A string $$$a$$$ is asubsequenceof a string $$$b$$$ if $$$a$$$ can be obtained from $$$b$$$ by deletion of several (possibly, zero or all) characters.Pay attention to the difference between thesubstringandsubsequence, as they both appear in the problem statement.You may wish to read theWikipedia page about the Longest Common Subsequence problem.InputThe first line contains two positive integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n, m \\\\leq 5000$$$) — lengths of the two strings $$$A$$$ and $$$B$$$.The second line contains a string consisting of $$$n$$$ lowercase Latin letters — string $$$A$$$.The third line contains a string consisting of $$$m$$$ lowercase Latin letters — string $$$B$$$.OutputOutput maximal $$$S(C, D)$$$ over all pairs $$$(C, D)$$$, where $$$C$$$ is some substring of $$$A$$$, and $$$D$$$ is some substring of $$$B$$$.ExamplesInput4 5 abba bababOutput5Input8 10 bbbbabab bbbabaaaaaOutput12Input7 7 uiibwws qhtkxcnOutput0NoteFor the first case:abbfrom the first string andababfrom the second string have LCS equal toabb.The result is $$$S(abb, abab) = (4 \\\\cdot |abb|$$$) - $$$|abb|$$$ - $$$|abab|$$$ = $$$4 \\\\cdot 3 - 3 - 4 = 5$$$.",
    "source": "CF",
    "vjudge": false
}