{
    "uid": "149-B",
    "url": "https://codeforces.com/contest/149/problem/B",
    "tags": [
        "implementation"
    ],
    "title": "149-B",
    "statement": "B. Martian Clocktime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutHaving stayed home alone, Petya decided to watch forbidden films on the Net in secret. \"What ungentlemanly behavior!\" — you can say that, of course, but don't be too harsh on the kid. In his country films about the Martians and other extraterrestrial civilizations are forbidden. It was very unfair to Petya as he adored adventure stories that featured lasers and robots.Today Petya is watching a shocking blockbuster about the Martians called \"R2:D2\". What can \"R2:D2\" possibly mean? It might be the Martian time represented in the Martian numeral system. Petya knows that time on Mars is counted just like on the Earth (that is, there are24hours and each hour has60minutes). The time is written as \"a:b\", where the stringastands for the number of hours (from0to23inclusive), and stringbstands for the number of minutes (from0to59inclusive). The only thing Petya doesn't know is in what numeral system the Martian time is written.Your task is to print the radixes of all numeral system which can contain the time \"a:b\".InputThe first line contains a single string as \"a:b\" (without the quotes). Thereais a non-empty string, consisting of numbers and uppercase Latin letters. Stringashows the number of hours. Stringbis a non-empty string that consists of numbers and uppercase Latin letters. Stringbshows the number of minutes. The lengths of stringsaandbare from1to5characters, inclusive. Please note that stringsaandbcan have leading zeroes that do not influence the result in any way (for example, string \"008:1\" in decimal notation denotes correctly written time).We consider characters0,1, ...,9as denoting the corresponding digits of the number's representation in some numeral system, and charactersA,B, ...,Zcorrespond to numbers10,11, ...,35.OutputPrint the radixes of the numeral systems that can represent the time \"a:b\" in the increasing order. Separate the numbers with spaces or line breaks. If there is no numeral system that can represent time \"a:b\", print the single integer0. If there are infinitely many numeral systems that can represent the time \"a:b\", print the single integer-1.Note that on Mars any positional numeral systems with positive radix strictly larger than one are possible.ExamplesInput11:20Output3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22Input2A:13Output0Input000B:00001Output-1NoteLet's consider the first sample. String \"11:20\" can be perceived, for example, as time4:6, represented in the ternary numeral system or as time17:32in hexadecimal system.Let's consider the second sample test. String \"2A:13\" can't be perceived as correct time in any notation. For example, let's take the base-11 numeral notation. There the given string represents time32:14that isn't a correct time.Let's consider the third sample. String \"000B:00001\" can be perceived as a correct time in the infinite number of numeral systems. If you need an example, you can take any numeral system with radix no less than12.",
    "source": "CF",
    "vjudge": false
}