{
    "uid": "151-B",
    "url": "https://codeforces.com/contest/151/problem/B",
    "tags": [
        "implementation",
        " strings"
    ],
    "title": "151-B",
    "statement": "B. Phone Numberstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutWinters are just damn freezing cold in Nvodsk! That's why a group ofnfriends prefers to take a taxi, order a pizza and call girls. The phone numbers in the city consist of three pairs of digits (for example, 12-34-56). Each friend has a phonebook of sizesi(that's the number of phone numbers). We know that taxi numbers consist of six identical digits (for example, 22-22-22), the numbers of pizza deliveries should necessarily be decreasing sequences of six different digits (for example, 98-73-21), all other numbers are the girls' numbers.You are given your friends' phone books. Calculate which friend is best to go to when you are interested in each of those things (who has maximal number of phone numbers of each type).If the phone book of one person contains some number two times, you should count ittwice. That is, each number should be taken into consideration the number of times it occurs in the phone book.InputThe first line contains an integern(1 ≤n≤ 100) — the number of friends.Then followndata blocks that describe each friend's phone books. Each block is presented in the following form: first goes the line that contains integersiand stringnamei(0 ≤si≤ 100) — the number of phone numbers in the phone book of thei-th friend and the name of thei-th friend. The name is a non-empty sequence of uppercase and lowercase Latin letters, containing no more than20characters. Nextsilines contain numbers as \"XX-XX-XX\", where X is arbitrary digits from0to9.OutputIn the first line print the phrase \"If you want to call a taxi, you should call:\". Then print names of all friends whose phone books contain maximal number of taxi phone numbers.In the second line print the phrase \"If you want to order a pizza, you should call:\". Then print names of all friends who have maximal number of pizza phone numbers.In the third line print the phrase \"If you want to go to a cafe with a wonderful girl, you should call:\". Then print names of all friends who have maximal number of girls' phone numbers.Print the names in the order in whichthey are given in the input data. Separate two consecutive names with a comma and a space. Each line should end with exactly one point. For clarifications concerning the output form, see sample tests. It is necessary that youfollow the output form strictly. Extra spaces are not allowed.ExamplesInput42 Fedorov22-22-2298-76-543 Melnikov75-19-0923-45-6799-99-987 Rogulenko22-22-2211-11-1133-33-3344-44-4455-55-5566-66-6695-43-213 Kaluzhin11-11-1199-99-9998-65-32OutputIf you want to call a taxi, you should call: Rogulenko.If you want to order a pizza, you should call: Fedorov, Rogulenko, Kaluzhin.If you want to go to a cafe with a wonderful girl, you should call: Melnikov.Input35 Gleb66-66-6655-55-5501-01-0165-43-2112-34-563 Serega55-55-5587-65-4365-55-215 Melnik12-42-1287-73-0136-04-1288-12-2282-11-43OutputIf you want to call a taxi, you should call: Gleb.If you want to order a pizza, you should call: Gleb, Serega.If you want to go to a cafe with a wonderful girl, you should call: Melnik.Input33 Kulczynski22-22-2265-43-2198-12-004 Pachocki11-11-1111-11-1111-11-1198-76-540 SmietankaOutputIf you want to call a taxi, you should call: Pachocki.If you want to order a pizza, you should call: Kulczynski, Pachocki.If you want to go to a cafe with a wonderful girl, you should call: Kulczynski.NoteIn the first sample you are given four friends.Fedorov's phone book contains one taxi number and one pizza delivery number,Melnikov's phone book only has3numbers of girls,Rogulenko's one has6taxi numbers and one pizza delivery number,Kaluzhin's one contains2taxi numbers and one pizza delivery number.Thus, if you need to order a taxi, you should obviously callRogulenko, if you need to order a pizza you should call anybody of the following:Rogulenko,Fedorov,Kaluzhin(each of them has one number).Melnikovhas maximal number of phone numbers of girls.",
    "source": "CF",
    "vjudge": false
}