{
    "uid": "154-E",
    "url": "https://codeforces.com/contest/154/problem/E",
    "tags": [
        "geometry"
    ],
    "title": "154-E",
    "statement": "E. Martian Colonytime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe first ship with the Earth settlers landed on Mars. The colonists managed to buildnnecessary structures on the surface of the planet (which can be regarded as a plane, and the construction can be regarded as points on it). But one day the scanners recorded suspicious activity on the outskirts of the colony. It was decided to use the protective force field generating system to protect the colony against possible trouble.The system works as follows: the surface contains a number of generators of the field (they can also be considered as points). The active range of each generator is a circle of radiusrcentered at the location of the generator (the boundary of the circle is also included in the range). After the system is activated, it stretches the protective force fieldonly over the part of the surface, which is within the area of all generators' activity. That is, the protected part is theintersectionof the generators' active ranges.The number of generators available to the colonists is not limited, but the system of field generation consumes a lot of energy. More precisely, the energy consumption does not depend on the number of generators, but it is directly proportional to thearea, which is protected by the field. Also, it is necessary that all the existing buildings are located within the protected area.Determine the smallest possible area of the protected part of the surface containing all the buildings.InputThe first line contains two integersnandr(1 ≤n≤ 105,1 ≤r≤ 50000) — the number of buildings and the active ranges of the generators, correspondingly.Nextnlines contains the buildings' coordinates. Thei+ 1-th (1 ≤i≤n) line contains two real numbers with at most three digits after the decimal pointxiandyi(|xi|, |yi| ≤ 50000) — coordinates of thei-th building. It is guaranteed that no two buildings are located at the same point, and no two different buildings are located closer than1.It is guaranteed that there exists a circle with radiusrthat contains all the buildings.OutputPrint the single real number — the minimum area of the protected part containing all the buildings. The answer is accepted if absolute or relative error doesn't exceed10- 4.ExamplesInput3 50.00 0.0000.0 8.006 8.00Output78.5398163397Input4 10000.0 0.00 2.002.00 22.0 0.00Output4.0026666140Input4 53.00 0.0-3 0.000.000 10.0 -1.00Output8.1750554397NoteIn the first sample the given radius equals the radius of the circle circumscribed around the given points. That's why the circle that corresponds to it is the sought area. The answer is25π.In the second sample the area nearly coincides with the square which has vertexes in the given points.The area for the third sample is shown on the picture below.",
    "source": "CF",
    "vjudge": false
}