{
    "uid": "154-A",
    "url": "https://codeforces.com/contest/154/problem/A",
    "tags": [
        "greedy"
    ],
    "title": "154-A",
    "statement": "A. Hometasktime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSergey attends lessons of theN-ish language. Each lesson he receives a hometask. This time the task is to translate some sentence to theN-ish language. Sentences of theN-ish language can be represented as strings consisting of lowercase Latin letters without spaces or punctuation marks.Sergey totally forgot about the task until half an hour before the next lesson and hastily scribbled something down. But then he recollected that in the last lesson he learned the grammar ofN-ish. The spelling rules state thatN-ish contains some \"forbidden\" pairs of letters: such letters can never occur in a sentence next to each other. Also, the order of the letters doesn't matter (for example, if the pair of letters \"ab\" is forbidden, then any occurrences of substrings \"ab\" and \"ba\" are also forbidden). Also, each pair has different letters and each letter occurs in no more than one forbidden pair.Now Sergey wants to correct his sentence so that it doesn't contain any \"forbidden\" pairs of letters that stand next to each other. However, he is running out of time, so he decided to simply cross out some letters from the sentence. What smallest number of letters will he have to cross out? When a letter is crossed out, it is \"removed\" so that the letters to its left and right (if they existed), become neighboring. For example, if we cross out the first letter from the string \"aba\", we get the string \"ba\", and if we cross out the second letter, we get \"aa\".InputThe first line contains a non-empty strings, consisting of lowercase Latin letters — that's the initial sentence inN-ish, written by Sergey. The length of stringsdoesn't exceed105.The next line contains integerk(0 ≤k≤ 13) — the number of forbidden pairs of letters.Nextklines contain descriptions of forbidden pairs of letters. Each line contains exactly two different lowercase Latin letters without separators that represent the forbidden pairs. It is guaranteed that each letter is included in no more than one pair.OutputPrint the single number — the smallest number of letters that need to be removed to get a string without any forbidden pairs of neighboring letters. Please note that the answer always exists as it is always possible to remove all letters.ExamplesInputababa1abOutput2Inputcodeforces2docsOutput1NoteIn the first sample you should remove two lettersb.In the second sample you should remove the second or the third letter. The second restriction doesn't influence the solution.",
    "source": "CF",
    "vjudge": false
}