{
    "uid": "1555-D",
    "url": "https://codeforces.com/contest/1555/problem/D",
    "tags": [
        "brute force",
        " constructive algorithms",
        " dp",
        " strings"
    ],
    "title": "1555-D",
    "statement": "D. Say No to Palindromestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's call the stringbeautifulif it does not contain a substring of length at least $$$2$$$, which is a palindrome. Recall that a palindrome is a string that reads the same way from the first character to the last and from the last character to the first. For example, the stringsa,bab,acca,bcabcbacbare palindromes, but the stringsab,abbbaa,cccbare not.Let's definecostof a string as the minimum number of operations so that the string becomes beautiful, if in one operation it is allowed to change any character of the string to one of the first $$$3$$$ letters of the Latin alphabet (in lowercase).You are given a string $$$s$$$ of length $$$n$$$, each character of the string is one of the first $$$3$$$ letters of the Latin alphabet (in lowercase).You have to answer $$$m$$$ queries — calculate the cost of the substring of the string $$$s$$$ from $$$l_i$$$-th to $$$r_i$$$-th position, inclusive.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 2 \\\\cdot 10^5$$$) — the length of the string $$$s$$$ and the number of queries.The second line contains the string $$$s$$$, it consists of $$$n$$$ characters, each character one of the first $$$3$$$ Latin letters.The following $$$m$$$ lines contain two integers $$$l_i$$$ and $$$r_i$$$ ($$$1 \\\\le l_i \\\\le r_i \\\\le n$$$) — parameters of the $$$i$$$-th query.OutputFor each query, print a single integer — the cost of the substring of the string $$$s$$$ from $$$l_i$$$-th to $$$r_i$$$-th position, inclusive.ExampleInput5 4 baacb 1 3 1 5 4 5 2 3Output1 2 0 1NoteConsider the queries of the example test.in the first query, the substring isbaa, which can be changed tobacin one operation;in the second query, the substring isbaacb, which can be changed tocbacbin two operations;in the third query, the substring iscb, which can be left unchanged;in the fourth query, the substring isaa, which can be changed tobain one operation.",
    "source": "CF",
    "vjudge": false
}