{
    "uid": "156-C",
    "url": "https://codeforces.com/contest/156/problem/C",
    "tags": [
        "combinatorics",
        " dp"
    ],
    "title": "156-C",
    "statement": "C. Ciphertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSherlock Holmes found a mysterious correspondence of two VIPs and made up his mind to read it. But there is a problem! The correspondence turned out to be encrypted. The detective tried really hard to decipher the correspondence, but he couldn't understand anything.At last, after some thought, he thought of something. Let's say there is a words, consisting of|s|lowercase Latin letters. Then for oneoperationyou can choose a certain positionp(1 ≤p< |s|) and perform one of the following actions:either replace letterspwith the one that alphabeticallyfollowsit and replace lettersp+ 1with the one that alphabeticallyprecedesit;or replace letterspwith the one that alphabeticallyprecedesit and replace lettersp+ 1with the one that alphabeticallyfollowsit.Let us note that letter \"z\" doesn't have a defined following letter and letter \"a\" doesn't have a defined preceding letter. That's why the corresponding changes are not acceptable. If the operation requires performing at least one unacceptable change, then such operation cannot be performed.Two wordscoincide in their meaningiff one of them can be transformed into the other one as a result of zero or more operations.Sherlock Holmes needs to learn to quickly determine the following for each word: how many words can exist that coincide in their meaning with the given word, but differs from the given word in at least one character? Count this number for him modulo1000000007(109+ 7).InputThe input data contains several tests. The first line contains the only integert(1 ≤t≤ 104) — the number of tests.Nexttlines contain the words, one per line. Each word consists of lowercase Latin letters and has length from1to100, inclusive. Lengths of words can differ.OutputFor each word you should print the number of differentotherwords that coincide with it in their meaning — not from the words listed in the input data, but from all possible words. As the sought number can be very large, print its value modulo1000000007(109+ 7).ExamplesInput1abOutput1Input1aaaaaaaaaaaOutput0Input2yaklmbfxzbOutput24320092793NoteSome explanations about theoperation:Note that for each letter, we can clearly define the letter that follows it. Letter \"b\" alphabetically follows letter \"a\", letter \"c\" follows letter \"b\", ..., \"z\" follows letter \"y\".Preceding letters are defined in the similar manner: letter \"y\" precedes letter \"z\", ..., \"a\" precedes letter \"b\".Note that the operation never changes a word's length.In the first sample you can obtain the only other word \"ba\". In the second sample you cannot obtain any other word, so the correct answer is0.Consider the third sample. One operation can transform word \"klmbfxzb\" into word \"klmcexzb\": we should choosep= 4, and replace the fourth letter with the following one (\"b\"→\"c\"), and the fifth one — with the preceding one (\"f\"→\"e\"). Also, we can obtain many other words from this one. An operation can transform word \"ya\" only into one other word \"xb\".Word \"ya\" coincides in its meaning with words \"xb\", \"wc\", \"vd\", ..., \"ay\" (overall there are24other words). The word \"klmbfxzbhas many more variants — there are3320092814other words that coincide with in the meaning. So the answer for the first word equals24and for the second one equals320092793— the number3320092814modulo109+ 7",
    "source": "CF",
    "vjudge": false
}