{
    "uid": "156-D",
    "url": "https://codeforces.com/contest/156/problem/D",
    "tags": [
        "combinatorics",
        " graphs"
    ],
    "title": "156-D",
    "statement": "D. Cluestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAs Sherlock Holmes was investigating another crime, he found a certain number of clues. Also, he has already founddirect linksbetween some of those clues. The direct links between the clues are mutual. That is, the direct link between cluesAandBand the direct link between cluesBandAis the same thing. No more than one direct link can exist between two clues.Of course Sherlock is able to find direct links between all clues. But it will take too much time and the criminals can use this extra time to hide. To solve the crime, Sherlock needs each clue to be linked to all other clues (maybe not directly, via some other clues). CluesAandBare considered linked either if there is a direct link between them or if there is a direct link betweenAand some other clueCwhich is linked toB.Sherlock Holmes counted the minimum number of additional direct links that he needs to find to solve the crime. As it turns out, it equalsT.Please count the number of different ways to find exactlyTdirect links between the clues so that the crime is solved in the end. Two ways to find direct links are considered different if there exist two clues which have a direct link in one way and do not have a direct link in the other way.As the number of different ways can turn out rather big, print it modulok.InputThe first line contains three space-separated integersn,m,k(1 ≤n≤ 105, 0 ≤m≤ 105,1 ≤k≤ 109) — the number of clues, the number of direct clue links that Holmes has already found and the divisor for the modulo operation.Each of nextmlines contains two integersaandb(1 ≤a,b≤n,a≠b), that represent a direct link between clues. It is guaranteed that any two clues are linked by no more than one direct link. Note that the direct links between the clues are mutual.OutputPrint the single number — the answer to the problem modulok.ExamplesInput2 0 1000000000Output1Input3 0 100Output3Input4 1 10000000001 4Output8NoteThe first sample only has two clues and Sherlock hasn't found any direct link between them yet. The only way to solve the crime is to find the link.The second sample has three clues and Sherlock hasn't found any direct links between them. He has to find two of three possible direct links between clues to solve the crime — there are3ways to do it.The third sample has four clues and the detective has already found one direct link between the first and the fourth clue. There are8ways to find two remaining clues to solve the crime.",
    "source": "CF",
    "vjudge": false
}