{
    "uid": "156-A",
    "url": "https://codeforces.com/contest/156/problem/A",
    "tags": [
        "brute force"
    ],
    "title": "156-A",
    "statement": "A. Messagetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDr. Moriarty is about to send a message to Sherlock Holmes. He has a strings.Stringpis called asubstringof stringsif you can read it starting from some position in the strings. For example, string \"aba\" has six substrings: \"a\", \"b\", \"a\", \"ab\", \"ba\", \"aba\".Dr. Moriarty plans to take stringsand cut out some substring from it, let's call itt. Then he needs tochangethe substringtzero or more times. As a result, he should obtain a fixed stringu(which is the string that should be sent to Sherlock Holmes). One change is defined as making one of the following actions:Insert one letter to any end of the string.Delete one letter from any end of the string.Change one letter into any other one.Moriarty is very smart and after he chooses some substringt, he always makes the minimal number of changes to obtainu.Help Moriarty choose the best substringtfrom all substrings of the strings. The substringtshould minimize the number of changes Moriarty should make to obtain the stringufrom it.InputThe first line contains a non-empty strings, consisting of lowercase Latin letters. The second line contains a non-empty stringu, consisting of lowercase Latin letters. The lengths of both strings are in the range from1to2000, inclusive.OutputPrint the only integer — the minimum number of changes that Dr. Moriarty has to make with the string that you choose.ExamplesInputaaaaaaaaOutput0InputabcabcbcdOutput1InputabcdefklmnopqOutput7NoteIn the first sample Moriarty can take any substring of length3, and it will be equal to the required messageu, so Moriarty won't have to make any changes.In the second sample you should take a substring consisting of characters from second to fourth (\"bca\") or from fifth to sixth (\"bc\"). Then you will only have to make one change: to change or to add the last character.In the third sample the initial stringsdoesn't contain any character that the message should contain, so, whatever string you choose, you will have to make at least7changes to obtain the required message.",
    "source": "CF",
    "vjudge": false
}