{
    "uid": "160-E",
    "url": "https://codeforces.com/contest/160/problem/E",
    "tags": [
        "binary search",
        " data structures",
        " sortings"
    ],
    "title": "160-E",
    "statement": "E. Buses and Peopletime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe main Bertown street is represented by a straight line. There are109bus stops located on the line. The stops are numbered with integers from1to109in the order in which they follow on the road. The city hasnbuses. Every day thei-th bus drives from stop numbersito stop numberfi(si<fi), it stops on all intermediate stops and returns only at night. The bus starts driving at timetiand drives so fast that it finishes driving also at timeti. The timetiis different for all buses. The buses have infinite capacity.Bertown hasmcitizens. Today thei-th person should get from stop numberlito stop numberri(li<ri); thei-th citizen comes to his initial stop (li) at timebi. Each person, on the one hand, wants to get to the destination point as quickly as possible, and on the other hand, definitely does not want to change the buses as he rides. More formally: thei-th person chooses busj, with minimum timetj, such thatsj≤li,ri≤fjandbi≤tj.Your task is to determine for each citizen whether he can ride to the destination point today and if he can, find the number of the bus on which the citizen will ride.InputThe first line contains two integersnandm(1 ≤n,m≤ 105) — the number of buses and the number of people.Thennlines follow, each of them contains three integers:si,fi,ti(1 ≤si,fi,ti≤ 109,si<fi) — the description of the buses. It is guaranteed that allti-s are different.Thenmlines follow, each of them contains three integers:li,ri,bi(1 ≤li,ri,bi≤ 109,li<ri) — the Bertown citizens' description. Somebi-s could coincide.OutputIn the first line printmspace-separated integers: thei-th number should be equal either to -1, if the person numberican't get to the destination point, or to the number of the bus that will ride the person numberi. The buses are numbered with integers from1tonin the input order.ExamplesInput4 31 10 105 6 26 7 35 7 45 7 11 2 11 10 11Output4 1 -1Input1 11 1000000000 10000000001 1000000000 1000000000Output1",
    "source": "CF",
    "vjudge": false
}