{
    "uid": "1617-A",
    "url": "https://codeforces.com/contest/1617/problem/A",
    "tags": [
        "constructive algorithms",
        " greedy",
        " sortings",
        " strings"
    ],
    "title": "1617-A",
    "statement": "A. Forbidden Subsequencetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given strings $$$S$$$ and $$$T$$$, consisting of lowercase English letters. It is guaranteed that $$$T$$$ is a permutation of the stringabc.Find string $$$S'$$$, thelexicographically smallestpermutation of $$$S$$$ such that $$$T$$$ isnota subsequence of $$$S'$$$.String $$$a$$$ is apermutationof string $$$b$$$ if the number of occurrences of each distinct character is the same in both strings.A string $$$a$$$ is asubsequenceof a string $$$b$$$ if $$$a$$$ can be obtained from $$$b$$$ by deletion of several (possibly, zero or all) elements.A string $$$a$$$ islexicographically smallerthan a string $$$b$$$ if and only if one of the following holds:$$$a$$$ is a prefix of $$$b$$$, but $$$a \\\\ne b$$$;in the first position where $$$a$$$ and $$$b$$$ differ, the string $$$a$$$ has a letter that appears earlier in the alphabet than the corresponding letter in $$$b$$$.InputEach test contains multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases. Description of the test cases follows.The first line of each test case contains a string $$$S$$$ ($$$1 \\\\le |S| \\\\le 100$$$), consisting of lowercase English letters.The second line of each test case contains a string $$$T$$$ that is a permutation of the stringabc. (Hence, $$$|T| = 3$$$).Note that there is no limit on the sum of $$$|S|$$$ across all test cases.OutputFor each test case, output a single string $$$S'$$$, the lexicographically smallest permutation of $$$S$$$ such that $$$T$$$ is not a subsequence of $$$S'$$$.ExampleInput7 abacaba abc cccba acb dbsic bac abracadabra abc dddddddddddd cba bbc abc ac abcOutputaaaacbb abccc bcdis aaaaacbbdrr dddddddddddd bbc acNoteIn the first test case, bothaaaabbcandaaaabcbare lexicographically smaller thanaaaacbb, but they containabcas a subsequence.In the second test case,abcccis the smallest permutation ofcccbaand does not containacbas a subsequence.In the third test case,bcdisis the smallest permutation ofdbsicand does not containbacas a subsequence.",
    "source": "CF",
    "vjudge": false
}