{
    "uid": "163-B",
    "url": "https://codeforces.com/contest/163/problem/B",
    "tags": [
        "binary search"
    ],
    "title": "163-B",
    "statement": "B. Lemmingstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAs you know, lemmings like jumping. For the next spectacular group jumpnlemmings gathered near a high rock withkcomfortable ledges on it. The first ledge is situated at the height ofhmeters, the second one is at the height of2hmeters, and so on (thei-th ledge is at the height ofi·hmeters). The lemmings are going to jump at sunset, and there's not much time left.Each lemming is characterized by its climbing speed ofvimeters per minute and its weightmi. This means that thei-th lemming can climb to thej-th ledge inminutes.To make the jump beautiful, heavier lemmings should jump from higher ledges: if a lemming of weightmijumps from ledgei, and a lemming of weightmjjumps from ledgej(fori<j), then the inequationmi≤mjshould be fulfilled.Since there arenlemmings and onlykledges (k≤n), theklemmings that will take part in the jump need to be chosen. The chosen lemmings should be distributed on the ledges from1tok, one lemming per ledge. The lemmings are to be arranged in the order of non-decreasing weight with the increasing height of the ledge. In addition, each lemming should have enough time to get to his ledge, that is, the time of his climb should not exceedtminutes. The lemmings climb to their ledges all at the same time and they do not interfere with each other.Find the way to arrange the lemmings' jump so that timetis minimized.InputThe first line contains space-separated integersn,kandh(1 ≤k≤n≤ 105,1 ≤h≤ 104) — the total number of lemmings, the number of ledges and the distance between adjacent ledges.The second line containsnspace-separated integersm1,m2, ...,mn(1 ≤mi≤ 109), wheremiis the weight ofi-th lemming.The third line containsnspace-separated integersv1,v2, ...,vn(1 ≤vi≤ 109), whereviis the speed ofi-th lemming.OutputPrintkdifferent numbers from1ton— the numbers of the lemmings who go to ledges at heightsh, 2h, ...,kh, correspondingly, if the jump is organized in an optimal way. If there are multiple ways to select the lemmings, pick any of them.ExamplesInput5 3 21 2 3 2 11 2 1 2 10Output5 2 4Input5 3 103 4 3 2 15 4 3 2 1Output4 3 1NoteLet's consider the first sample case. The fifth lemming (speed 10) gets to the ledge at height 2 inminutes; the second lemming (speed 2) gets to the ledge at height 4 in 2 minutes; the fourth lemming (speed 2) gets to the ledge at height 6 in 3 minutes. All lemmings manage to occupy their positions in 3 minutes.",
    "source": "CF",
    "vjudge": false
}