{
    "uid": "173-A",
    "url": "https://codeforces.com/contest/173/problem/A",
    "tags": [
        "implementation",
        " math"
    ],
    "title": "173-A",
    "statement": "A. Rock-Paper-Scissorstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutNikephoros and Polycarpus play rock-paper-scissors. The loser gets pinched (not too severely!).Let us remind you the rules of this game. Rock-paper-scissors is played by two players. In each round the players choose one of three items independently from each other. They show the items with their hands: a rock, scissors or paper. The winner is determined by the following rules: the rock beats the scissors, the scissors beat the paper and the paper beats the rock. If the players choose the same item, the round finishes with a draw.Nikephoros and Polycarpus have playednrounds. In each round the winner gave the loser a friendly pinch and the loser ended up with a fresh and new red spot on his body. If the round finished in a draw, the players did nothing and just played on.Nikephoros turned out to have worked out the following strategy: before the game began, he chose some sequence of itemsA= (a1,a2, ...,am), and then he cyclically showed the items from this sequence, starting from the first one. Cyclically means that Nikephoros shows signs in the following order:a1,a2,...,am,a1,a2,...,am,a1,...and so on. Polycarpus had a similar strategy, only he had his own sequence of itemsB= (b1,b2, ...,bk).Determine the number of red spots on both players after they've playednrounds of the game. You can consider that when the game began, the boys had no red spots on them.InputThe first line contains integern(1 ≤n≤ 2·109) — the number of the game's rounds.The second line contains sequenceAas a string ofmcharacters and the third line contains sequenceBas a string ofkcharacters (1 ≤m,k≤ 1000). The given lines only contain characters \"R\", \"S\" and \"P\". Character \"R\" stands for the rock, character \"S\" represents the scissors and \"P\" represents the paper.OutputPrint two space-separated integers: the numbers of red spots Nikephoros and Polycarpus have.ExamplesInput7RPSRSPPOutput3 2Input5RRRRRRRRROutput0 0NoteIn the first sample the game went like this:R - R. Draw.P - S. Nikephoros loses.S - P. Polycarpus loses.R - P. Nikephoros loses.P - R. Polycarpus loses.S - S. Draw.R - P. Nikephoros loses.Thus, in total Nikephoros has3losses (and3red spots), and Polycarpus only has2.",
    "source": "CF",
    "vjudge": false
}