{
    "uid": "183-E",
    "url": "https://codeforces.com/contest/183/problem/E",
    "tags": [
        "greedy"
    ],
    "title": "183-E",
    "statement": "E. Candy Shoptime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe prestigious Codeforces kindergarten consists ofnkids, numbered1throughn. Each of them are given allowance in rubles by their parents.Today, they are going to the most famous candy shop in the town. The shop sells candies in packages: for allibetween1andm, inclusive, it sells a package containing exactlyicandies. A candy costs one ruble, so a package containingxcandies costsxrubles.The kids will purchase candies in turns, starting from kid 1. In a single turn, kidiwill purchase one candy package. Due to the highly competitive nature of Codeforces kindergarten, during a turn, the number of candies contained in the package purchased by the kid will always be strictly greater than the number of candies contained in the package purchased by the kid in the preceding turn (an exception is in the first turn: the first kid may purchase any package). Then, the turn proceeds to kidi+ 1, or to kid1if it was kidn's turn. This process can be ended at any time, but at the end of the purchase process, all the kidsmust have the same number of candy packages. Of course, the amount spent by each kid on the candies cannot exceed their allowance.You work at the candy shop and would like to prepare the candies for the kids. Print the maximum number of candies that can be sold by the candy shop to the kids. If the kids cannot purchase any candy (due to insufficient allowance), print0.InputThe first line contains two space-separated integersnandm(2 ≤n≤ 2·105, 2 ≤m≤ 5·106,n≤m), denoting the number of kids and the maximum number of candies in a package sold by the candy shop, respectively.Thennlines follow, each line will contain a single positive integer not exceedingdenoting the allowance of a kid in rubles. The allowances are given in order from kid1to kidn.Please, do not use the%lldspecificator to read or write 64-bit integers in C++. It is recommended to usecin,coutstreams (also you may use%I64dspecificator).OutputPrint a single integer denoting the maximum number of candies that can be sold by the candy shop.ExamplesInput2 5510Output13Input3 881613Output32Input2 50000001250000250000012500002500000Output12500002500000NoteFor the first example, one of the scenarios that will result in13purchased candies is as follows.Turn 1. Kid 1 purchases 1 candy.Turn 2. Kid 2 purchases 3 candies.Turn 3. Kid 1 purchases 4 candies.Turn 4. Kid 2 purchases 5 candies.",
    "source": "CF",
    "vjudge": false
}