{
    "uid": "1837-C",
    "url": "https://codeforces.com/contest/1837/problem/C",
    "tags": [
        "constructive algorithms",
        " greedy"
    ],
    "title": "1837-C",
    "statement": "C. Best Binary Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$ consisting of the characters0,1and/or?. Let's call it apattern.Let's say that the binary string (a string where each character is either0or1)matchesthepatternif you can replace each character?with0or1(for each character, the choice is independent) so that the strings become equal. For example,0010matches?01?, but010doesn't match1??,??, or????.Let's define thecostof the binary string as the minimum number of operations of the form \"reverse an arbitrary contiguous substring of the string\" required to sort the string in non-descending order.You have to find a binary string with the minimum possible cost among those that match the given pattern. If there are multiple answers, print any of them.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 3 \\\\cdot 10^4$$$) — the number of test cases.The first and only line of each test case contains the string $$$s$$$ ($$$1 \\\\le |s| \\\\le 3 \\\\cdot 10^5$$$) consisting of characters0,1, and/or?.The sum of the string lengths over all test cases does not exceed $$$3 \\\\cdot 10^5$$$.OutputFor each test case, print a binary string with the minimum possible cost among those that match the given pattern. If there are multiple answers, print any of them.ExampleInput4??01?101001??10?0?1?10?10Output00011 10100 111101 011110010NoteIn the first test case of the example, the cost of the resulting string is $$$0$$$.In the second test case, the cost of the resulting string is $$$2$$$: we can reverse the substring from the $$$1$$$-st character to the $$$5$$$-th character, and we obtain the string00101. Then we reverse the substring from the $$$3$$$-rd to the $$$4$$$-th character, and we obtain the string00011, which is sorted in non-descending order.",
    "source": "CF",
    "vjudge": false
}