{
    "uid": "187-E",
    "url": "https://codeforces.com/contest/187/problem/E",
    "tags": [
        "data structures",
        " greedy"
    ],
    "title": "187-E",
    "statement": "E. Heaven Tourtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe story was not finished as PMP thought. God offered him one more chance to reincarnate and come back to life. But before he can come back, God told him that PMP should askngreat men including prominent programmers about their life experiences.The men are standing on a straight line. They are numbered1throughnfrom left to right. The coordinate of thei-th man isxi(xi<xi+ 1,i<n). PMP should visit all these people one by one in arbitrary order. Each men should be visitedexactly once. At the beginning of his tour, he starts at location ofs-th man and asks him about his experiences.Each time PMP wants to change his location, he should give a ticket to an angel and the angel carries him to his destination. Angels take PMP from one location, fly to his destination and put him down there. Nobody else is visited in this movement. Moving fromi-th man toj-th man, takes|xi-xj|time. PMP can get back to life as soon as he visits all men.There are two types of angels: Some angels are going to the right and they only accept right tickets. Others are going the left and they only accept left tickets. There are an unlimited number of angels of each type. PMP haslleft tickets andn- 1 -lright tickets.PMP wants to get back to life as soon as possible to be able to compete in this year's final instead of the final he missed last year. He wants to know the quickest way to visit all the men exactly once. He also needs to know the exact sequence moves he should make.InputThe first line of input contains three space-separated integersn,l,s(2 ≤n≤ 105, 0 ≤l<n, 1 ≤s≤n) — the number of people to visit, the number left tickets PMP got, and initial location of PMP. Next line containsnspace-separated integers. Thei-th integer in this line isxi(0 =x1<x2< ... <xn≤ 109) — the location ofi-th man.OutputIf PMP cannot visit all men with the tickets he got print -1 in the only line of output. Otherwise, in the first line you should print the minimum time PMP can visit all men. In the second line you should printn- 1integers that are the numbers of the men that PMP should visit in order in one optimal solution. If there are multiple answers, output any of them.Please do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to usecin,coutstreams or the%I64dspecifier.ExamplesInput5 2 20 10 11 21 22Output331 3 5 4Input4 3 10 1 2 3Output-1Input7 3 20 100 200 201 301 303 305Output4091 3 4 7 6 5NoteLet us remind here, a great contestant of all times, who left us about a year ago. May Renat Mullakhanov rest in peace.",
    "source": "CF",
    "vjudge": false
}