{
    "uid": "19-A",
    "url": "https://codeforces.com/contest/19/problem/A",
    "tags": [
        "implementation"
    ],
    "title": "19-A",
    "statement": "A. World Football Cuptime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutEveryone knows that 2010 FIFA World Cup is being held in South Africa now. By the decision of BFA (Berland's Football Association) next World Cup will be held in Berland. BFA took the decision to change some World Cup regulations:the final tournament featuresnteams (nis always even)the firstn/ 2teams (according to the standings) come through to the knockout stagethe standings are made on the following principle: for a victory a team gets 3 points, for a draw — 1 point, for a defeat — 0 points. In the first place, teams are ordered in the standings in decreasing order of their points; in the second place — in decreasing order of the difference between scored and missed goals; in the third place — in the decreasing order of scored goalsit's written in Berland's Constitution that the previous regulation helps to order the teams without ambiguity.You are asked to write a program that, by the given list of the competing teams and the results of all the matches, will find the list of teams that managed to get through to the knockout stage.InputThe first input line contains the only integern(1 ≤n≤ 50) — amount of the teams, taking part in the final tournament of World Cup. The followingnlines contain the names of these teams, a name is a string of lower-case and upper-case Latin letters, its length doesn't exceed 30 characters. The followingn·(n- 1) / 2lines describe the held matches in the formatname1-name2 num1:num2, wherename1,name2— names of the teams;num1,num2(0 ≤num1,num2 ≤ 100) — amount of the goals, scored by the corresponding teams. Accuracy of the descriptions is guaranteed: there are no two team names coinciding accurate to the letters' case; there is no match, where a team plays with itself; each match is met in the descriptions only once.OutputOutputn/ 2lines — names of the teams, which managed to get through to the knockout stage in lexicographical order. Output each name in a separate line. No odd characters (including spaces) are allowed. It's guaranteed that the described regulations help to order the teams without ambiguity.ExamplesInput4ABCDA-B 1:1A-C 2:2A-D 1:0B-C 1:0B-D 0:3C-D 0:3OutputADInput2aAa-A 2:1Outputa",
    "source": "CF",
    "vjudge": false
}