{
    "uid": "192-B",
    "url": "https://codeforces.com/contest/192/problem/B",
    "tags": [
        "brute force",
        " implementation"
    ],
    "title": "192-B",
    "statement": "B. Walking in the Raintime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn Berland the opposition is going to arrange mass walking on the boulevard. The boulevard consists ofntiles that are lain in a row and are numbered from1tonfrom right to left. The opposition should start walking on the tile number1and the finish on the tile numbern. During the walk it is allowed to move from right to left between adjacent tiles in a row, and jump over a tile. More formally, if you are standing on the tile numberi(i<n- 1), you can reach the tiles numberi+ 1or the tile numberi+ 2from it (if you stand on the tile numbern- 1, you can only reach tile numbern). We can assume that all the opposition movements occur instantaneously.In order to thwart an opposition rally, the Berland bloody regime organized the rain. The tiles on the boulevard are of poor quality and they are rapidly destroyed in the rain. We know that thei-th tile is destroyed afteraidays of rain (on dayaitile isn't destroyed yet, and on dayai+ 1it is already destroyed). Of course, no one is allowed to walk on the destroyed tiles! So the walk of the opposition is considered thwarted, if either the tile number1is broken, or the tile numbernis broken, or it is impossible to reach the tile numbernfrom the tile number1if we can walk on undestroyed tiles.The opposition wants to gather more supporters for their walk. Therefore, the more time they have to pack, the better. Help the opposition to calculate how much time they still have and tell us for how many days the walk from the tile number1to the tile numbernwill be possible.InputThe first line contains integern(1 ≤n≤ 103) — the boulevard's length in tiles.The second line containsnspace-separated integersai— the number of days after which thei-th tile gets destroyed (1 ≤ai≤ 103).OutputPrint a single number — the sought number of days.ExamplesInput410 3 5 10Output5Input510 2 8 3 5Output5NoteIn the first sample the second tile gets destroyed after day three, and the only path left is1 → 3 → 4. After day five there is a two-tile gap between the first and the last tile, you can't jump over it.In the second sample path1 → 3 → 5is available up to day five, inclusive. On day six the last tile is destroyed and the walk is thwarted.",
    "source": "CF",
    "vjudge": false
}