{
    "uid": "193-C",
    "url": "https://codeforces.com/contest/193/problem/C",
    "tags": [
        "constructive algorithms",
        " greedy",
        " math",
        " matrices"
    ],
    "title": "193-C",
    "statement": "C. Hamming Distancetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutHamming distancebetween stringsaandbof equal length (denoted byh(a,b)) is equal to the number of distinct integersi(1 ≤i≤ |a|), such thatai≠bi, whereaiis thei-th symbol of stringa,biis thei-th symbol of stringb. For example, the Hamming distance between strings \"aba\" and \"bba\" equals1, they have different first symbols. For strings \"bbba\" and \"aaab\" the Hamming distance equals4.John Doe had a paper on which four strings of equal lengths1,s2,s3ands4were written. Each stringsiconsisted only of lowercase letters \"a\" and \"b\". John found the Hamming distances between all pairs of strings he had. Then he lost the paper with the strings but he didn't lose the Hamming distances between all pairs.Help John restore the strings; find some four stringss'1,s'2,s'3,s'4of equal length that consist only of lowercase letters \"a\" and \"b\", such that the pairwise Hamming distances between them are the same as between John's strings. More formally, sets'imust satisfy the condition.To make the strings easier to put down on a piece of paper, you should choose among all suitable sets of strings the one that has strings ofminimum length.InputThe first line contains space-separated integersh(s1,s2),h(s1,s3),h(s1,s4). The second line contains space-separated integersh(s2,s3)andh(s2,s4). The third line contains the single integerh(s3,s4).All given integersh(si,sj)are non-negative and do not exceed105. It is guaranteed that at least one numberh(si,sj)is positive.OutputPrint -1 if there's no suitable set of strings.Otherwise print on the first line numberlen— the length of each string. On thei-th of the next four lines print strings'i. If there are multiple sets with the minimum length of the strings, print any of them.ExamplesInput4 4 44 44Output6aaaabbaabbaabbaaaabbbbbb",
    "source": "CF",
    "vjudge": false
}