{
    "uid": "201-C",
    "url": "https://codeforces.com/contest/201/problem/C",
    "tags": [
        "dp"
    ],
    "title": "201-C",
    "statement": "C. Fragile Bridgestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are playing a video game and you have just reached the bonus level, where the only possible goal is to score as many points as possible. Being a perfectionist, you've decided that you won't leave this level until you've gained the maximum possible number of points there.The bonus level consists ofnsmall platforms placed in a line and numbered from1tonfrom left to right and (n- 1) bridges connecting adjacent platforms. The bridges between the platforms are very fragile, and for each bridge the number of times one can pass this bridge from one of its ends to the other before it collapses forever is known in advance.The player's actions are as follows. First, he selects one of the platforms to be the starting position for his hero. After that the player can freely move the hero across the platforms moving by the undestroyed bridges. As soon as the hero finds himself on a platform with no undestroyed bridge attached to it, the level is automatically ended. The number of points scored by the player at the end of the level is calculated as the number of transitions made by the hero between the platforms. Note that if the hero started moving by a certain bridge, he has to continue moving in the same direction until he is on a platform.Find how many points you need to score to be sure that nobody will beat your record, and move to the next level with a quiet heart.InputThe first line contains a single integern(2 ≤n≤ 105) — the number of platforms on the bonus level. The second line contains (n- 1) integersai(1 ≤ai≤ 109,1 ≤i<n) — the number of transitions from one end to the other that the bridge between platformsiandi+ 1can bear.OutputPrint a single integer — the maximum number of points a player can get on the bonus level.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput52 1 2 1Output5NoteOne possibility of getting5points in the sample is starting from platform3and consequently moving to platforms4,3,2,1and2. After that the only undestroyed bridge is the bridge between platforms4and5, but this bridge is too far from platform2where the hero is located now.",
    "source": "CF",
    "vjudge": false
}