{
    "uid": "204-C",
    "url": "https://codeforces.com/contest/204/problem/C",
    "tags": [
        "math",
        " probabilities"
    ],
    "title": "204-C",
    "statement": "C. Little Elephant and Furik and Rubiktime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Elephant loves Furik and Rubik, who he met in a small city Kremenchug.The Little Elephant has two strings of equal lengthaandb, consisting only of uppercase English letters. The Little Elephant selects a pair of substrings of equal length — the first one from stringa, the second one from stringb. The choice is equiprobable among all possible pairs. Let's denote the substring ofaasx, and the substring ofb— asy. The Little Elephant gives stringxto Furik and stringy— to Rubik.Let's assume thatf(x,y)is the number of such positions ofi(1 ≤i≤ |x|), thatxi=yi(where|x|is the length of linesxandy, andxi,yiare thei-th characters of stringsxandy, correspondingly). Help Furik and Rubik find the expected value off(x,y).InputThe first line contains a single integern(1 ≤n≤ 2·105) — the length of stringsaandb. The second line contains stringa, the third line contains stringb. The strings consist of uppercase English letters only. The length of both strings equalsn.OutputOn a single line print a real number — the answer to the problem. The answer will be considered correct if its relative or absolute error does not exceed10- 6.ExamplesInput2ABBAOutput0.400000000Input3AABCAAOutput0.642857143NoteLet's assume that we are given stringa=a1a2...a|a|, then let's denote the string's length as|a|, and itsi-th character — asai.A substringa[l...r](1 ≤l≤r≤ |a|)of stringais stringalal+ 1...ar.Stringais a substring of stringb, if there exists such pair of integerslandr(1 ≤l≤r≤ |b|), thatb[l...r] =a.Let's consider the first test sample. The first sample has5possible substring pairs:(\"A\", \"B\"), (\"A\", \"A\"), (\"B\", \"B\"), (\"B\", \"A\"), (\"AB\", \"BA\"). For the second and third pair valuef(x,y)equals1, for the rest it equals0. The probability of choosing each pair equals, that's why the answer is·0+·1+·1+·0+·0==0.4.",
    "source": "CF",
    "vjudge": false
}