{
    "uid": "208-D",
    "url": "https://codeforces.com/contest/208/problem/D",
    "tags": [
        "implementation"
    ],
    "title": "208-D",
    "statement": "D. Prizes, Prizes, more Prizestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya, like many others, likes to participate in a variety of sweepstakes and lotteries. Now he collects wrappings from a famous chocolate bar \"Jupiter\". According to the sweepstake rules, each wrapping has an integer written on it — the number of points that the participant adds to his score as he buys the bar. After a participant earns a certain number of points, he can come to the prize distribution center and exchange the points for prizes. When somebody takes a prize, the prize's cost is simply subtracted from the number of his points.Vasya didn't only bought the bars, he also kept a record of how many points each wrapping cost. Also, he remembers that he always stucks to the greedy strategy — as soon as he could take at least one prize, he went to the prize distribution centre and exchanged the points for prizes. Moreover, if he could choose between multiple prizes, he chose the most expensive one. If after an exchange Vasya had enough points left to get at least one more prize, then he continued to exchange points.The sweepstake has the following prizes (the prizes are sorted by increasing of their cost):a mug (costsapoints),a towel (costsbpoints),a bag (costscpoints),a bicycle (costsdpoints),a car (costsepoints).Now Vasya wants to recollect what prizes he has received. You know sequencep1,p2, ...,pn, wherepiis the number of points Vasya got for thei-th bar. The sequence of points is given in the chronological order. You also know numbersa,b,c,d,e. Your task is to find, how many prizes Vasya received, what prizes they are and how many points he's got left after all operations are completed.InputThe first line contains a single integern(1 ≤n≤ 50) — the number of chocolate bar wrappings that brought points to Vasya. The second line contains space-separated integersp1,p2, ...,pn(1 ≤pi≤ 109). The third line contains 5 integersa,b,c,d,e(1 ≤a<b<c<d<e≤ 109) — the prizes' costs.OutputPrint on the first line 5 integers, separated by a space — the number of mugs, towels, bags, bicycles and cars that Vasya has got, respectively. On the second line print a single integer — the number of points Vasya will have left after all operations of exchange are completed.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput33 10 42 4 10 15 20Output1 1 1 0 01Input410 4 39 23 5 10 11 12Output3 0 1 0 30NoteIn the first sample Vasya gets3points after eating the first chocolate bar. Then he exchanges2points and gets a mug. Vasya wins abagafter eating the second chocolate bar. Then he wins atowelafter eating the third chocolate bar. After all chocolate bars3 - 2 + 10 - 10 + 4 - 4 = 1points remains.",
    "source": "CF",
    "vjudge": false
}