{
    "uid": "215-B",
    "url": "https://codeforces.com/contest/215/problem/B",
    "tags": [
        "greedy",
        " math"
    ],
    "title": "215-B",
    "statement": "B. Olympic Medaltime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe World Programming Olympics Medal is a metal disk, consisting of two parts: the first part is a ring with outer radius ofr1cm, inner radius ofr2cm,(0 <r2 <r1)made of metal with densityp1g/cm3. The second part is an inner disk with radiusr2cm, it is made of metal with densityp2g/cm3. The disk is nested inside the ring.The Olympic jury decided thatr1will take one of possible values ofx1,x2, ...,xn. It is up to jury to decide which particular valuer1will take. Similarly, the Olympic jury decided thatp1will take one of possible value ofy1,y2, ...,ym, andp2will take a value from listz1,z2, ...,zk.According to most ancient traditions the ratio between the outer ring massmoutand the inner disk massminmust equal, whereA,Bare constants taken from ancient books. Now, to start making medals, the jury needs to take values forr1,p1,p2and calculate the suitable value ofr2.The jury wants to choose the value that would maximize radiusr2. Help the jury find the sought value ofr2. Valuer2doesn't have to be an integer.Medal has a uniform thickness throughout the area, the thickness of the inner disk is the same as the thickness of the outer ring.InputThe first input line contains an integernand a sequence of integersx1,x2, ...,xn. The second input line contains an integermand a sequence of integersy1,y2, ...,ym. The third input line contains an integerkand a sequence of integersz1,z2, ...,zk. The last line contains two integersAandB.All numbers given in the input are positive and do not exceed 5000. Each of the three sequences contains distinct numbers. The numbers in the lines are separated by spaces.OutputPrint a single real number — the sought valuer2with absolute or relative error of at most10- 6. It is guaranteed that the solution that meets the problem requirements exists.ExamplesInput3 1 2 31 23 3 2 11 2Output2.683281573000Input4 2 3 6 42 1 23 10 6 82 1Output2.267786838055NoteIn the first sample the jury should choose the following values:r1= 3,p1= 2,p2= 1.",
    "source": "CF",
    "vjudge": false
}