{
    "uid": "223-D",
    "url": "https://codeforces.com/contest/223/problem/D",
    "tags": [
        "geometry",
        " graphs"
    ],
    "title": "223-D",
    "statement": "D. Spidertime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA plane contains a not necessarily convex polygon without self-intersections, consisting ofnvertexes, numbered from 1 ton. There is a spider sitting on the border of the polygon, the spider can move like that:Transfer.The spider moves from the pointp1with coordinates(x1,y1), lying on the polygon border, to the pointp2with coordinates(x2,y2), also lying on the border. The spider can't go beyond the polygon border as it transfers, that is, the spider's path from pointp1to pointp2goes along the polygon border. It's up to the spider to choose the direction of walking round the polygon border (clockwise or counterclockwise).Descend.The spider moves from pointp1with coordinates(x1,y1)to pointp2with coordinates(x2,y2), at that pointsp1andp2must lie on one vertical straight line (x1=x2), pointp1must be not lower than pointp2(y1≥y2) and segmentp1p2mustn't have points, located strictly outside the polygon (specifically, the segment can have common points with the border).Initially the spider is located at the polygon vertex with numbers. Find the length of the shortest path to the vertex numbert, consisting of transfers and descends. The distance is determined by the usual Euclidean metric.InputThe first line contains integern(3 ≤n≤ 105) — the number of vertexes of the given polygon. Nextnlines contain two space-separated integers each — the coordinates of the polygon vertexes. The vertexes are listed in the counter-clockwise order. The coordinates of the polygon vertexes do not exceed104in their absolute value.The last line contains two space-separated integerssandt(1 ≤s,t≤n) — the start and the end vertexes of the sought shortest way.Consider the polygon vertexes numbered in the order they are given in the input, that is, the coordinates of the first vertex are located on the second line of the input and the coordinates of then-th vertex are on the(n+ 1)-th line. It is guaranteed that the given polygon is simple, that is, it contains no self-intersections or self-tangencies.OutputIn the output print a single real number — the length of the shortest way from vertexsto vertext. The answer is considered correct, if its absolute or relative error does not exceed10- 6.ExamplesInput40 01 01 10 11 4Output1.000000000000000000e+000Input40 01 10 2-1 13 3Output0.000000000000000000e+000Input50 05 01 40 22 13 1Output5.650281539872884700e+000NoteIn the first sample the spider transfers along the side that connects vertexes 1 and 4.In the second sample the spider doesn't have to transfer anywhere, so the distance equals zero.In the third sample the best strategy for the spider is to transfer from vertex 3 to point (2,3), descend to point (2,1), and then transfer to vertex 1.",
    "source": "CF",
    "vjudge": false
}