{
    "uid": "227-A",
    "url": "https://codeforces.com/contest/227/problem/A",
    "tags": [
        "geometry"
    ],
    "title": "227-A",
    "statement": "A. Where do I Turn?time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTrouble came from the overseas lands: a three-headed dragon Gorynych arrived. The dragon settled at pointCand began to terrorize the residents of the surrounding villages.A brave hero decided to put an end to the dragon. He moved from pointAto fight with Gorynych. The hero rode from pointAalong a straight road and met pointBon his way. The hero knows that in this land for every pair of roads it is true that they are either parallel to each other, or lie on a straight line, or are perpendicular to each other. He also knows well that pointsBandCare connected by a road. So the hero must either turn 90 degrees to the left or continue riding straight ahead or turn 90 degrees to the right. But he forgot where the pointCis located.Fortunately, a Brave Falcon flew right by. It can see all three points from the sky. The hero asked him what way to go to get to the dragon's lair.If you have not got it, you are the falcon. Help the hero and tell him how to get him to pointC: turn left, go straight or turn right.At this moment the hero is believed to stand at pointB, turning his back to pointA.InputThe first input line contains two space-separated integersxa,ya(|xa|, |ya| ≤ 109)— the coordinates of pointA. The second line contains the coordinates of pointBin the same form, the third line contains the coordinates of pointC.It is guaranteed that all points are pairwise different. It is also guaranteed that either pointBlies on segmentAC, or angleABCis right.OutputPrint a single line. If a hero must turn left, print \"LEFT\" (without the quotes); If he must go straight ahead, print \"TOWARDS\" (without the quotes); if he should turn right, print \"RIGHT\" (without the quotes).ExamplesInput0 00 11 1OutputRIGHTInput-1 -1-3 -3-4 -4OutputTOWARDSInput-4 -6-3 -7-2 -6OutputLEFTNoteThe picture to the first sample:The red color shows points A, B and C. The blue arrow shows the hero's direction. The green color shows the hero's trajectory.The picture to the second sample:",
    "source": "CF",
    "vjudge": false
}