{
    "uid": "237-E",
    "url": "https://codeforces.com/contest/237/problem/E",
    "tags": [
        "flows",
        " graphs"
    ],
    "title": "237-E",
    "statement": "E. Build Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou desperately need to build some stringt. For that you've gotnmore stringss1,s2, ...,sn. To build stringt, you are allowed to perform exactly|t|(|t|is the length of stringt) operations on these strings. Each operation looks like that:choose any non-empty string from stringss1,s2, ...,sn;choose an arbitrary character from the chosen string and write it on a piece of paper;remove the chosen character from the chosen string.Note that after you perform the described operation, the total number of characters in stringss1,s2, ...,sndecreases by 1. We are assumed to build stringt, if the characters, written on the piece of paper, in the order of performed operations form stringt.There are other limitations, though. For each stringsiyou know numberai— the maximum number of characters you are allowed to delete from stringsi. You also know that each operation that results in deleting a character from stringsi, costsirubles. That is, an operation on strings1is the cheapest (it costs1ruble), and the operation on stringsnis the most expensive one (it costsnrubles).Your task is to count the minimum amount of money (in rubles) you will need to build stringtby the given rules. Consider the cost of building stringtto be the sum of prices of the operations you use.InputThe first line of the input contains stringt— the string that you need to build.The second line contains a single integern(1 ≤n≤ 100)— the number of strings to which you are allowed to apply the described operation. Each of the nextnlines contains a string and an integer. Thei-th line contains space-separated stringsiand integerai(0 ≤ai≤ 100). Numberairepresents the maximum number of characters that can be deleted from stringsi.All strings in the input only consist of lowercase English letters. All strings are non-empty. The lengths of all strings do not exceed100characters.OutputPrint a single number — the minimum money (in rubles) you need in order to build stringt. If there is no solution, print -1.ExamplesInputbbaze3bzb 2aeb 3ba 10Output8Inputabacaba4aba 2bcc 1caa 2bbb 5Output18Inputxyz4axx 8za 1efg 4t 1Output-1NoteNotes to the samples:In the first sample from the first string you should take characters \"b\" and \"z\" with price1ruble, from the second string characters \"a\", \"e\" и \"b\" with price2rubles. The price of the stringtin this case is2·1 + 3·2 = 8.In the second sample from the first string you should take two characters \"a\" with price1ruble, from the second string character \"c\" with price2rubles, from the third string two characters \"a\" with price3rubles, from the fourth string two characters \"b\" with price4rubles. The price of the stringtin this case is2·1 + 1·2 + 2·3 + 2·4 = 18.In the third sample the solution doesn't exist because there is no character \"y\" in given strings.",
    "source": "CF",
    "vjudge": false
}