{
    "uid": "237-B",
    "url": "https://codeforces.com/contest/237/problem/B",
    "tags": [
        "implementation",
        " sortings"
    ],
    "title": "237-B",
    "statement": "B. Young Tabletime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got tablea, consisting ofnrows, numbered from 1 ton. Thei-th line of tableacontainscicells, at that for alli(1 <i≤n)holdsci≤ci- 1.Let's denotesas the total number of cells of tablea, that is,. We know that each cell of the table contains a single integer from1tos, at that all written integers are distinct.Let's assume that the cells of thei-th row of tableaare numbered from 1 toci, then let's denote the number written in thej-th cell of thei-th row asai,j. Your task is to perform several swap operations to rearrange the numbers in the table so as to fulfill the following conditions:for alli,j(1 <i≤n; 1 ≤j≤ci)holdsai,j>ai- 1,j;for alli,j(1 ≤i≤n; 1 <j≤ci)holdsai,j>ai,j- 1.In one swap operation you are allowed to choose two different cells of the table and swap the recorded there numbers, that is the number that was recorded in the first of the selected cells before the swap, is written in the second cell after it. Similarly, the number that was recorded in the second of the selected cells, is written in the first cell after the swap.Rearrange the numbers in the required manner. Note that you are allowed to perform any number of operations, but not more thans. You do not have to minimize the number of operations.InputThe first line contains a single integern(1 ≤n≤ 50)that shows the number of rows in the table. The second line containsnspace-separated integersci(1 ≤ci≤ 50;ci≤ci- 1)— the numbers of cells on the corresponding rows.Nextnlines contain tableа. Thei-th of them containscispace-separated integers: thej-th integer in this line representsai,j.It is guaranteed that all the given numbersai,jare positive and do not exceeds. It is guaranteed that allai,jare distinct.OutputIn the first line print a single integerm(0 ≤m≤s), representing the number of performed swaps.In the nextmlines print the description of these swap operations. In thei-th line print four space-separated integersxi,yi,pi,qi(1 ≤xi,pi≤n; 1 ≤yi≤cxi; 1 ≤qi≤cpi). The printed numbers denote swapping the contents of cellsaxi,yiandapi,qi. Note that a swap operation can change the contents ofdistincttable cells. Print the swaps in the order, in which they should be executed.ExamplesInput33 2 14 3 56 12Output21 1 2 22 1 3 1Input144 3 2 1Output21 1 1 41 2 1 3",
    "source": "CF",
    "vjudge": false
}