{
    "uid": "240-F",
    "url": "https://codeforces.com/contest/240/problem/F",
    "tags": [
        "data structures"
    ],
    "title": "240-F",
    "statement": "F. TorCodertime limit per test3 secondsmemory limit per test256 megabytesinputinput.txtoutputoutput.txtA boy named Leo doesn't miss a single TorCoder contest round. On the last TorCoder round number 100666 Leo stumbled over the following problem. He was given a strings, consisting ofnlowercase English letters, andmqueries. Each query is characterised by a pair of integersli,ri(1 ≤li≤ri≤n).We'll consider the letters in the string numbered from 1 tonfrom left to right, that is,s=s1s2...sn.After each query he must swap letters with indexes fromlitoriinclusive in stringsso as to make substring(li,ri)a palindrome. If there are multiple such letter permutations, you should choose the one where string(li,ri)will be lexicographically minimum. If no such permutation exists, you should ignore the query (that is, not change strings).Everybody knows that on TorCoder rounds input line and array size limits never exceed60, so Leo solved this problem easily. Your task is to solve the problem on a little bit larger limits. Given stringsandmqueries, print the string that results after applying allmqueries to strings.InputThe first input line contains two integersnandm(1 ≤n,m≤ 105)— the string length and the number of the queries.The second line contains strings, consisting ofnlowercase Latin letters.Each of the nextmlines contains a pair of integersli,ri(1 ≤li≤ri≤n) — a query to apply to the string.OutputIn a single line print the result of applyingmqueries to strings. Print the queries in the order in which they are given in the input.ExamplesInput7 2aabcbaa1 35 7OutputabacabaInput3 2abc1 22 3OutputabcNoteAsubstring(li,ri)1 ≤li≤ri≤n)of strings=s1s2...snof lengthnis a sequence of charactersslisli+ 1...sri.A string is apalindrome, if it reads the same from left to right and from right to left.Stringx1x2...xpislexicographically smallerthan stringy1y2...yq, if eitherp<qandx1=y1,x2=y2, ... ,xp=yp, or exists such numberr(r<p,r<q), thatx1=y1,x2=y2, ... ,xr=yrandxr+ 1<yr+ 1.",
    "source": "CF",
    "vjudge": false
}