{
    "uid": "250-D",
    "url": "https://codeforces.com/contest/250/problem/D",
    "tags": [
        "geometry",
        " ternary search",
        " two pointers"
    ],
    "title": "250-D",
    "statement": "D. Building Bridgetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutTwo villages are separated by a river that flows from the north to the south. The villagers want to build a bridge across the river to make it easier to move across the villages.The river banks can be assumed to be vertical straight linesx=aandx=b(0 <a<b).The west village lies in a steppe at pointO= (0, 0). There arenpathways leading from the village to the river, they end at pointsAi= (a,yi). The villagers there are plain and simple, so their pathways are straight segments as well.The east village has reserved and cunning people. Their village is in the forest on the east bank of the river, but its exact position is not clear. There aremtwisted paths leading from this village to the river and ending at pointsBi= (b,y'i). The lengths of all these paths are known, the length of the path that leads from the eastern village to pointBi, equalsli.The villagers want to choose exactly one point on the left bank of riverAi, exactly one point on the right bankBjand connect them by a straight-line bridge so as to make the total distance between the villages (the sum of|OAi| + |AiBj| +lj, where|XY|is the Euclidean distance between pointsXandY) were minimum. The Euclidean distance between points(x1,y1)and(x2,y2)equals.Help them and find the required pair of points.InputThe first line contains integersn,m,a,b(1 ≤n,m≤ 105,0 <a<b< 106).The second line containsnintegers in the ascending order: thei-th integer determines the coordinate of pointAiand equalsyi(|yi| ≤ 106).The third line containsmintegers in the ascending order: thei-th integer determines the coordinate of pointBiand equalsy'i(|y'i| ≤ 106).The fourth line containsmmore integers: thei-th of them determines the length of the path that connects the eastern village and pointBi, and equalsli(1 ≤li≤ 106).It is guaranteed, that there is such a pointCwith abscissa at leastb, that|BiC| ≤lifor alli(1 ≤i≤m). It is guaranteed that no two pointsAicoincide. It is guaranteed that no two pointsBicoincide.OutputPrint two integers — the numbers of points on the left (west) and right (east) banks, respectively, between which you need to build a bridge. You can assume that the points on the west bank are numbered from1ton, in the order in which they are given in the input. Similarly, the points on the east bank are numbered from1tomin the order in which they are given in the input.If there are multiple solutions, print any of them. The solution will be accepted if the final length of the path will differ from the answer of the jury by no more than10- 6in absolute or relative value.ExamplesInput3 2 3 5-2 -1 4-1 27 3Output2 2",
    "source": "CF",
    "vjudge": false
}