{
    "uid": "251-B",
    "url": "https://codeforces.com/contest/251/problem/B",
    "tags": [
        "implementation",
        " math"
    ],
    "title": "251-B",
    "statement": "B. Playing with Permutationstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya likes permutations a lot. Recently his mom has presented him permutationq1,q2, ...,qnof lengthn.Apermutationaof lengthnis a sequence of integersa1,a2, ...,an(1 ≤ai≤n), all integers there are distinct.There is only one thing Petya likes more than permutations: playing with little Masha. As it turns out, Masha also has a permutation of lengthn. Petya decided to get the same permutation, whatever the cost may be. For that, he devised a game with the following rules:Before the beginning of the game Petya writes permutation1, 2, ...,non the blackboard. After that Petya makes exactlykmoves, which are described below.During a move Petya tosses a coin. If the coin shows heads, he performs point 1, if the coin shows tails, he performs point 2.Let's assume that the board contains permutationp1,p2, ...,pnat the given moment. Then Petya removes the written permutationpfrom the board and writes another one instead:pq1,pq2, ...,pqn. In other words, Petya applies permutationq(which he has got from his mother) to permutationp.All actions are similar to point 1, except that Petya writes permutationton the board, such that:tqi=pifor allifrom 1 ton. In other words, Petya applies a permutation that is inverse toqto permutationp.We know that after thek-th move the board contained Masha's permutations1,s2, ...,sn. Besides, we know that throughout the game process Masha's permutationnever occurred on the boardbefore thek-th move. Note that the game has exactlykmoves, that is, throughout the game the coin was tossed exactlyktimes.Your task is to determine whether the described situation is possible or else state that Petya was mistaken somewhere. See samples and notes to them for a better understanding.InputThe first line contains two integersnandk(1 ≤n,k≤ 100). The second line containsnspace-separated integersq1,q2, ...,qn(1 ≤qi≤n) — the permutation that Petya's got as a present. The third line contains Masha's permutations, in the similar format.It is guaranteed that the given sequencesqandsare correct permutations.OutputIf the situation that is described in the statement is possible, print \"YES\" (without the quotes), otherwise print \"NO\" (without the quotes).ExamplesInput4 12 3 4 11 2 3 4OutputNOInput4 14 3 1 23 4 2 1OutputYESInput4 34 3 1 23 4 2 1OutputYESInput4 24 3 1 22 1 4 3OutputYESInput4 14 3 1 22 1 4 3OutputNONoteIn the first sample Masha's permutation coincides with the permutation that was written on the board before the beginning of the game. Consequently, that violates the condition that Masha's permutation never occurred on the board beforekmoves were performed.In the second sample the described situation is possible, in case if after we toss a coin, we get tails.In the third sample the possible coin tossing sequence is: heads-tails-tails.In the fourth sample the possible coin tossing sequence is: heads-heads.",
    "source": "CF",
    "vjudge": false
}