{
    "uid": "257-E",
    "url": "https://codeforces.com/contest/257/problem/E",
    "tags": [
        "data structures",
        " implementation"
    ],
    "title": "257-E",
    "statement": "E. Greedy Elevatortime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThem-floor(m> 1)office of international corporation CodeForces has the advanced elevator control system established. It works as follows.All office floors are sequentially numbered with integers from 1 tom. At timet= 0, the elevator is on the first floor, the elevator is empty and nobody is waiting for the elevator on other floors. Next, at timesti(ti> 0)people come to the elevator. For simplicity, we assume that one person uses the elevator only once during the reported interval. For every person we know three parameters: the time at which the person comes to the elevator, the floor on which the person is initially, and the floor to which he wants to go.The movement of the elevator between the floors is as follows. At timet(t≥ 0,tis an integer) the elevator is always at some floor. First the elevator releases all people who are in the elevator and want to get to the current floor. Then it lets in all the people waiting for the elevator on this floor. If a person comes to the elevator exactly at timet, then he has enough time to get into it. We can assume that all of these actions (going in or out from the elevator) are made instantly. After that the elevator decides, which way to move and at time(t+ 1)the elevator gets to the selected floor.The elevator selects the direction of moving by the following algorithm.If the elevator is empty and at the current time no one is waiting for the elevator on any floor, then the elevator remains at the current floor.Otherwise, let's assume that the elevator is on the floor numberx(1 ≤x≤m). Then elevator calculates the directions' \"priorities\"pupandpdown:pupis the sum of the number of people waiting for the elevator on the floors with numbers greater thanx, and the number of people in the elevator, who want to get to the floors with the numbers greater thanx;pdownis the sum of the number of people waiting for the elevator on the floors with numbers less thanx, and the number of people in the elevator, who want to get to the floors with the numbers less thanx. Ifpup≥pdown, then the elevator goes one floor above the current one (that is, from floorxto floorx+ 1), otherwise the elevator goes one floor below the current one (that is, from floorxto floorx- 1).Your task is to simulate the work of the elevator and for each person to tell the time when the elevator will get to the floor this person needs. Please note that the elevator is large enough to accommodate all the people at once.InputThe first line contains two space-separated integers:n,m(1 ≤n≤ 105, 2 ≤m≤ 105)— the number of people and floors in the building, correspondingly.Nextnlines each contain three space-separated integers:ti,si,fi(1 ≤ti≤ 109, 1 ≤si,fi≤m,si≠fi)— the time when thei-th person begins waiting for the elevator, the floor number, where thei-th person was initially located, and the number of the floor, where he wants to go.OutputPrintnlines. In thei-th line print a single number — the moment of time, when thei-th person gets to the floor he needs. The people are numbered in the order, in which they are given in the input.Please don't use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput3 101 2 73 6 53 4 8Output7118Input2 101 2 57 4 5Output59NoteIn the first sample the elevator worked as follows:t= 1. The elevator is on the floor number1. The elevator is empty. The floor number2has one person waiting.pup= 1 + 0 = 1,pdown= 0 + 0 = 0,pup≥pdown. So the elevator goes to the floor number2.t= 2. The elevator is on the floor number2. One person enters the elevator, he wants to go to the floor number7.pup= 0 + 1 = 1,pdown= 0 + 0 = 0,pup≥pdown. So the elevator goes to the floor number3.t= 3. The elevator is on the floor number3. There is one person in the elevator, he wants to go to floor7. The floors number4and6have two people waiting for the elevator.pup= 2 + 1 = 3,pdown= 0 + 0 = 0,pup≥pdown. So the elevator goes to the floor number4.t= 4. The elevator is on the floor number4. There is one person in the elevator who wants to go to the floor number7. One person goes into the elevator, he wants to get to the floor number8. The floor number6has one man waiting.pup= 1 + 2 = 3,pdown= 0 + 0 = 0,pup≥pdown. So the elevator goes to the floor number5.t= 5. The elevator is on the floor number5. There are two people in the elevator, they want to get to the floors number7and8, correspondingly. There is one person waiting for the elevator on the floor number6.pup= 1 + 2 = 3,pdown= 0 + 0 = 0,pup≥pdown. So the elevator goes to the floor number6.t= 6. The elevator is on the floor number6. There are two people in the elevator, they want to get to the floors number7and8, correspondingly. One man enters the elevator, he wants to get to the floor number5.pup= 0 + 2 = 2,pdown= 0 + 1 = 1,pup≥pdown. So the elevator goes to the floor number7.t= 7. The elevator is on the floor number7. One person leaves the elevator, this person wanted to get to the floor number7. There are two people in the elevator, they want to get to the floors with numbers8and5, correspondingly.pup= 0 + 1 = 1,pdown= 0 + 1 = 1,pup≥pdown. So the elevator goes to the floor number8.t= 8. The elevator is on the floor number8. One person leaves the elevator, this person wanted to go to the floor number8. There is one person in the elevator, he wants to go to the floor number5.pup= 0 + 0 = 0,pdown= 0 + 1 = 1,pup<pdown. So the elevator goes to the floor number7.t= 9. The elevator is on the floor number7. There is one person in the elevator, this person wants to get to the floor number5.pup= 0 + 0 = 0,pdown= 0 + 1 = 1,pup<pdown. So the elevator goes to the floor number6.t= 10. The elevator is on the floor number6. There is one person in the elevator, he wants to get to the floor number5.pup= 0 + 0 = 0,pdown= 0 + 1 = 1,pup<pdown. So the elevator goes to the floor number5.t= 11. The elevator is on the floor number5. One person leaves the elevator, this person initially wanted to get to the floor number5. The elevator is empty and nobody needs it, so the elevator remains at the floor number5.",
    "source": "CF",
    "vjudge": false
}