{
    "uid": "271-E",
    "url": "https://codeforces.com/contest/271/problem/E",
    "tags": [
        "constructive algorithms",
        " math",
        " number theory"
    ],
    "title": "271-E",
    "statement": "E. Three Horsestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere are three horses living in a horse land: one gray, one white and one gray-and-white. The horses are really amusing animals, which is why they adore special cards. Each of those cards must contain two integers, the first one on top, the second one in the bottom of the card. Let's denote a card withaon the top andbin the bottom as(a,b).Each of the three horses can paint the special cards. If you show an(a,b)card to the gray horse, then the horse can paint a new(a+ 1,b+ 1)card. If you show an(a,b)card, such thataandbare even integers, to the white horse, then the horse can paint a newcard. If you show two cards(a,b)and(b,c)to the gray-and-white horse, then he can paint a new(a,c)card.Polycarpus really wants to getnspecial cards(1,a1),(1,a2),...,(1,an). For that he is going to the horse land. He can take exactly one(x,y)card to the horse land, such that1 ≤x<y≤m. How many ways are there to choose the card so that he can perform some actions in the horse land and get the required cards?Polycarpus can get cards from the horses only as a result of the actions that are described above. Polycarpus is allowed to get additional cards besides the cards that he requires.InputThe first line contains two integersn,m(1 ≤n≤ 105, 2 ≤m≤ 109). The second line contains the sequence of integersa1,a2, ...,an(2 ≤ai≤ 109). Note, that the numbers in the sequence can coincide.The numbers in the lines are separated by single spaces.OutputPrint a single integer — the answer to the problem.Please, do not use the%lldspecifier to read or write 64-bit integers inC++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput1 62Output11Input1 67Output14Input2 1013 7Output36",
    "source": "CF",
    "vjudge": false
}