{
    "uid": "271-B",
    "url": "https://codeforces.com/contest/271/problem/B",
    "tags": [
        "binary search",
        " brute force",
        " math",
        " number theory"
    ],
    "title": "271-B",
    "statement": "B. Prime Matrixtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got ann×mmatrix. The matrix consists of integers. In one move, you can apply a single transformation to the matrix: choose an arbitrary element of the matrix and increase it by1. Each element can be increased an arbitrary number of times.You are really curious about prime numbers. Let us remind you that aprime numberis a positive integer that has exactly two distinct positive integer divisors: itself and number one. For example, numbers 2, 3, 5 are prime and numbers 1, 4, 6 are not.A matrix isprimeif at least one of the two following conditions fulfills:the matrix has a row with prime numbers only;the matrix has a column with prime numbers only;Your task is to count the minimum number of moves needed to get a prime matrix from the one you've got.InputThe first line contains two integersn,m(1 ≤n,m≤ 500)— the number of rows and columns in the matrix, correspondingly.Each of the followingnlines containsmintegers — the initial matrix. All matrix elements are positive integers. All numbers in the initial matrix do not exceed105.The numbers in the lines are separated by single spaces.OutputPrint a single integer — the minimum number of moves needed to get a prime matrix from the one you've got. If you've got a prime matrix, print 0.ExamplesInput3 31 2 35 6 14 4 1Output1Input2 34 8 89 2 9Output3Input2 21 34 2Output0NoteIn the first sample you need to increase number 1 in cell (1, 1). Thus, the first row will consist of prime numbers: 2, 2, 3.In the second sample you need to increase number 8 in cell (1, 2) three times. Thus, the second column will consist of prime numbers: 11, 2.In the third sample you don't have to do anything as the second column already consists of prime numbers: 3, 2.",
    "source": "CF",
    "vjudge": false
}