{
    "uid": "291-E",
    "url": "https://codeforces.com/contest/291/problem/E",
    "tags": [
        "*special",
        " dfs and similar",
        " hashing",
        " strings"
    ],
    "title": "291-E",
    "statement": "E. Tree-String Problemtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutArooted treeis a non-directed connected graph without any cycles with a distinguished vertex, which is called the tree root. Consider the vertices of a rooted tree, that consists ofnvertices, numbered from 1 ton. In this problem the tree root is the vertex number 1.Let's represent the length of the shortest by the number of edges path in the tree between verticesvanduasd(v,u).Aparentof vertexvin the rooted tree with the root in vertexr(v≠r)is vertexpv, such thatd(r,pv) + 1 =d(r,v)andd(pv,v) = 1. For example, on the picture the parent of vertexv= 5is vertexp5= 2.One day Polycarpus came across a rooted tree, consisting ofnvertices. The tree wasn't exactly ordinary: it had strings written on its edges. Polycarpus positioned the tree on the plane so as to make all edges lead from top to bottom if you go from the vertex parent to the vertex (see the picture). For any edge that lead from vertexpvto vertexv(1 <v≤n), he knows stringsvthat is written on it. All strings are written on the edges from top to bottom. For example, on the pictures7=\"ba\". The characters in the strings are numbered starting from 0.An example of Polycarpus's tree (corresponds to the example from the statement)Polycarpus defines thepositionin this tree as a specific letter on a specific string. The position is written as a pair of integers(v,x)that means that the position is thex-th letter of the stringsv(1 <v≤n,0 ≤x< |sv|), where|sv|is the length of stringsv. For example, the highlighted letters are positions (2, 1) and (3, 1).Let's consider the pair of positions(v,x)and(u,y)in Polycarpus' tree, such that the way from the first position to the second goes down on each step. We will consider that the pair of such positions defines stringz. Stringzconsists of all letters on the way from(v,x)to(u,y), written in the order of this path. For example, in the picture the highlighted positions define string \"bacaba\".Polycarpus has a stringt, he wants to know the number of pairs of positions that define stringt. Note that the way from the first position to the second in the pair must go down everywhere. Help him with this challenging tree-string problem!InputThe first line contains integern(2 ≤n≤ 105)— the number of vertices of Polycarpus's tree. Nextn- 1lines contain the tree edges. Thei-th of them contains numberpi+ 1and stringsi+ 1(1 ≤pi+ 1≤n;pi+ 1≠ (i+ 1)). Stringsi+ 1is non-empty and consists of lowercase English letters. The last line contains stringt. Stringtconsists of lowercase English letters, its length is at least 2.It is guaranteed that the input contains at most3·105English letters.OutputPrint a single integer — the required number.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput71 ab5 bacaba1 abacaba2 aca5 ba2 baabaOutput6Input71 ab5 bacaba1 abacaba2 aca5 ba2 babacabaOutput4NoteIn the first test case string \"aba\" is determined by the pairs of positions: (2, 0) and (5, 0); (5, 2) and (6, 1); (5, 2) and (3, 1); (4, 0) and (4, 2); (4, 4) and (4, 6); (3, 3) and (3, 5).Note that the string is not defined by the pair of positions (7, 1) and (5, 0), as the way between them doesn't always go down.",
    "source": "CF",
    "vjudge": false
}