{
    "uid": "291-D",
    "url": "https://codeforces.com/contest/291/problem/D",
    "tags": [
        "*special",
        " greedy"
    ],
    "title": "291-D",
    "statement": "D. Parallel Programmingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPolycarpus has a computer withnprocessors. Also, his computer hasnmemory cells. We'll consider the processors numbered by integers from 1 tonand that the memory cells are consecutively numbered by integers from 1 ton.Polycarpus needs to come up with a parallel program model. For each memory cell numberithis program must record the valuen-ito this cell. In other words, for each cell you've got to find the distance to celln.Let's denote the value that is written in thei-th cell asai. Initially,ai= 1(1 ≤i<n)andan= 0. We will consider that only processorican write values in the memory cell numberi. All processors can read an information from some cell (several processors can read an information from some cell simultaneously).The parallel program is executed in several steps. During each step we execute theparallel version of the increment operation. Executing the parallel version of the increment operation goes as follows:Each processor independently of the other ones chooses some memory cell. Let's say that processorihas chosen a cell with numberci(1 ≤ci≤n).All processorssimultaneouslyexecute operationai=ai+aci.Help Polycarpus come up with the parallel program model that is executed in exactlyksteps. Calculate the operations that need to be executed. Note that afterksteps for alli's valueaimust be equaln-i.InputThe first line contains two space-separated integersnandk(1 ≤n≤ 104, 1 ≤k≤ 20).It is guaranteed that at the givennandkthe required sequence of operations exists.OutputPrint exactlyn·kintegers inklines. In the first line print numbersc1,c2, ...,cn(1 ≤ci≤n)for the first increment operation. In the second line print the numbers for the second increment operation. In thek-th line print the numbers for thek-th increment operation.As a result of the printed operations for anyivalueaimust equaln-i.ExamplesInput1 1Output1Input3 2Output2 3 33 3 3",
    "source": "CF",
    "vjudge": false
}