{
    "uid": "297-C",
    "url": "https://codeforces.com/contest/297/problem/C",
    "tags": [
        "constructive algorithms"
    ],
    "title": "297-C",
    "statement": "C. Splitting the Uniquenesstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPolar bears likeunique arrays— that is, arrays without repeated elements.You have got a unique arrayswith lengthncontaining non-negative integers. Since you are good friends with Alice and Bob, you decide to split the array in two. Precisely, you need to construct two arraysaandbthat are also of lengthn, with the following conditions for alli(1 ≤i≤n):ai,biare non-negative integers;si=ai+bi.Ideally,aandbshould also be unique arrays. However, life in the Arctic is hard and this is not always possible. Fortunately, Alice and Bob are still happy if their arrays arealmost unique. We define an array of lengthnto be almost unique, if and only if it can be turned into a unique array by removing no more thanentries.For example, the array[1, 2, 1, 3, 2]is almost unique because after removing the first two entries, it becomes[1, 3, 2]. The array[1, 2, 1, 3, 1, 2]is not almost unique because we need to remove at least3entries to turn it into a unique array.So, your task is to split the given unique arraysinto two almost unique arraysaandb.InputThe first line of the input contains integern(1 ≤n≤ 105).The second line containsndistinct integerss1,s2, ...sn(0 ≤si≤ 109).OutputIf it is possible to make Alice and Bob happy (if you can split the given array), print \"YES\" (without quotes) in the first line. In the second line, print the arraya. In the third line, print the arrayb. There may be more than one solution. Any of them will be accepted.If it is impossible to splitsinto almost unique arraysaandb, print \"NO\" (without quotes) in the first line.ExamplesInput612 5 8 3 11 9OutputYES6 2 6 0 2 46 3 2 3 9 5NoteIn the sample, we can remove the first two entries fromaand the second entry frombto make them both unique.",
    "source": "CF",
    "vjudge": false
}