{
    "uid": "301-C",
    "url": "https://codeforces.com/contest/301/problem/C",
    "tags": [
        "constructive algorithms"
    ],
    "title": "301-C",
    "statement": "C. Yaroslav and Algorithmtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYaroslav likes algorithms. We'll describe one of his favorite algorithms.The algorithm receives a string as the input. We denote this input string asa.The algorithm consists of some number of command. Сommand numberilooks either assi>>wi, or assi<>wi, wheresiandwiare some possibly empty strings of length at most7, consisting of digits and characters \"?\".At each iteration, the algorithm looks for a command with the minimum indexi, such thatsioccurs inaas a substring. If this command is not found the algorithm terminates.Let's denote the number of the found command ask. In stringathe first occurrence of the stringskis replaced by stringwk. If the found command at that had formsk>>wk, then the algorithm continues its execution and proceeds to the next iteration. Otherwise, the algorithm terminates.The value of stringaafter algorithm termination is considered to be the output of the algorithm.Yaroslav has a set ofnpositive integers, he needs to come up with his favorite algorithm that will increase each of the given numbers by one. More formally, if we consider each number as a string representing the decimal representation of the number, then being run on each of these strings separately, the algorithm should receive the output string that is a recording of the corresponding number increased by one.Help Yaroslav.InputThe first line contains integern(1 ≤n≤ 100)— the number of elements in the set. The nextnlines contains one positive integer each. All the given numbers are less than1025.OutputPrint the algorithm which can individually increase each number of the set. In thei-th line print the command numberiwithout spaces.Your algorithm will be launched for each of these numbers. The answer will be considered correct if:Each line will a correct algorithm command (see the description in the problem statement).The number of commands should not exceed50.The algorithm will increase each of the given numbers by one.To get a respond, the algorithm will perform no more than200iterations for each number.ExamplesInput21079Output10<>1179<>80",
    "source": "CF",
    "vjudge": false
}