{
    "uid": "309-B",
    "url": "https://codeforces.com/contest/309/problem/B",
    "tags": [
        "dp",
        " two pointers"
    ],
    "title": "309-B",
    "statement": "B. Context Advertisingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAdvertising has become part of our routine. And now, in the era of progressive technologies, we need your ideas to make advertising better!In this problem we'll look at a simplified version of context advertising. You've got a text, consisting of exactlynwords. A standard advertising banner has exactlyrlines, each line can contain at mostccharacters. The potential customer always likes it when they can see lots of advertising, so you should determine which maximum number of consecutive words from the text can be written on the banner. Single words in one line of the banner should be separated by spaces. You are allowed to insert more than one space at once. Note that you are not allowed to break the words, that is, each word in the text must occupy exactly one line in the banner. Besides, you cannot change the word order, that is, if you read the banner text consecutively, from top to bottom and from left to right, you should get some consecutive part of the advertisement text.More formally, the statement can be written like that. Let's say that all words are indexed from1tonin the order in which they occur in the advertisement text. Then you have to choose all words, starting from somei-th one and ending with somej-th one(1 ≤i≤j≤n), so that all of them could be written on the banner. There must be as many words as possible. See the samples for clarifications.InputThe first input line contains three integersn,r,c(1 ≤n,r,c≤ 106;r×c≤ 106). The next line contains a text, consisting ofnwords. The words consist only of lowercase English letters and are not empty. The words in the lines are separated by single spaces. The total number of characters in all words doesn't exceed5·106.OutputPrint at mostrlines, in each line print at mostccharacters — the optimal advertisement banner. If there are multiple advertisement banners, print any of them.Note that some lines of the bannercan be empty. You are allowed not to print such lines.ExamplesInput9 4 12this is a sample text for croc final roundOutputthis is asample textfor crocfinal roundInput9 1 9this is a sample text for croc final roundOutputthis is aInput6 2 3croc a a a croc aOutputa aaInput2 2 5first secondOutputfirst",
    "source": "CF",
    "vjudge": false
}