{
    "uid": "321-B",
    "url": "https://codeforces.com/contest/321/problem/B",
    "tags": [
        "dp",
        " flows",
        " greedy"
    ],
    "title": "321-B",
    "statement": "B. Ciel and Dueltime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutFox Ciel is playing a card game with her friend Jiro.Jiro hasncards, each one has two attributes:position(Attack or Defense) andstrength. Fox Ciel hasmcards, each one has these two attributes too. It's known that position of all Ciel's cards is Attack.Now is Ciel's battle phase, Ciel can do the following operation many times:Choose one of her cardsX. This card mustn't be chosen before.If Jiro has no alive cards at that moment, he gets the damage equal to (X's strength). Otherwise, Ciel needs to choose one Jiro's alive cardY, then:IfY's position is Attack, then (X's strength)≥(Y's strength) must hold. After this attack, cardYdies, and Jiro gets the damage equal to (X's strength) - (Y's strength).IfY's position is Defense, then (X's strength)>(Y's strength) must hold. After this attack, cardYdies, but Jiro gets no damage.Ciel can end her battle phase at any moment (so, she can use not all her cards). Help the Fox to calculate the maximal sum of damage Jiro can get.InputThe first line contains two integersnandm(1 ≤n,m≤ 100) — the number of cards Jiro and Ciel have.Each of the nextnlines contains a stringpositionand an integerstrength(0 ≤strength≤ 8000)— the position and strength of Jiro's current card. Position is the string \"ATK\" for attack, and the string \"DEF\" for defense.Each of the nextmlines contains an integerstrength(0 ≤strength≤ 8000) — the strength of Ciel's current card.OutputOutput an integer: the maximal damage Jiro can get.ExamplesInput2 3ATK 2000DEF 1700250025002500Output3000Input3 4ATK 10ATK 100ATK 10001111011001Output992Input2 4DEF 0ATK 00011Output1NoteIn the first test case, Ciel has 3 cards with samestrength. The best strategy is as follows. First she uses one of these 3 cards to attack \"ATK 2000\" card first, this attack destroys that card and Jiro gets2500 - 2000 = 500damage. Then she uses the second card to destroy the \"DEF 1700\" card. Jiro doesn't get damage that time. Now Jiro has no cards so she can use the third card to attack and Jiro gets2500damage. So the answer is500 + 2500 = 3000.In the second test case, she should use the \"1001\" card to attack the \"ATK 100\" card, then use the \"101\" card to attack the \"ATK 10\" card. Now Ciel still has cards but she can choose to end her battle phase. The total damage equals(1001 - 100) + (101 - 10) = 992.In the third test case note that she can destroy the \"ATK 0\" card by a card with strength equal to 0, but she can't destroy a \"DEF 0\" card with that card.",
    "source": "CF",
    "vjudge": false
}