{
    "uid": "333-B",
    "url": "https://codeforces.com/contest/333/problem/B",
    "tags": [
        "greedy"
    ],
    "title": "333-B",
    "statement": "B. Chipstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutGerald plays the following game. He has a checkered field of sizen×ncells, wheremvarious cells are banned. Before the game, he has to put a few chips on some border (but not corner) board cells. Then forn- 1minutes, Gerald every minute moves each chip into an adjacent cell. He moves each chip from its original edge to the opposite edge. Gerald loses in this game in each of the three cases:At least one of the chips at least once fell to the banned cell.At least once two chips were on the same cell.At least once two chips swapped in a minute (for example, if you stand two chips on two opposite border cells of a row with even length, this situation happens in the middle of the row).In that case he loses and earns0points. When nothing like that happened, he wins and earns the number of points equal to the number of chips he managed to put on the board. Help Gerald earn the most points.InputThe first line contains two space-separated integersnandm(2 ≤n≤ 1000,0 ≤m≤ 105) — the size of the field and the number of banned cells. Nextmlines each contain two space-separated integers. Specifically, thei-th of these lines contains numbersxiandyi(1 ≤xi,yi≤n) — the coordinates of thei-th banned cell. All given cells are distinct.Consider the field rows numbered from top to bottom from 1 ton, and the columns — from left to right from 1 ton.OutputPrint a single integer — the maximum points Gerald can earn in this game.ExamplesInput3 12 2Output0Input3 0Output1Input4 33 13 23 3Output1NoteIn the first test the answer equals zero as we can't put chips into the corner cells.In the second sample we can place one chip into either cell (1, 2), or cell (3, 2), or cell (2, 1), or cell (2, 3). We cannot place two chips.In the third sample we can only place one chip into either cell (2, 1), or cell (2, 4).",
    "source": "CF",
    "vjudge": false
}