{
    "uid": "339-D",
    "url": "https://codeforces.com/contest/339/problem/D",
    "tags": [
        "data structures",
        " trees"
    ],
    "title": "339-D",
    "statement": "D. Xenia and Bit Operationstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutXenia the beginner programmer has a sequencea, consisting of2nnon-negative integers:a1,a2, ...,a2n. Xenia is currently studying bit operations. To better understand how they work, Xenia decided to calculate some valuevfora.Namely, it takes several iterations to calculate valuev. At the first iteration, Xenia writes a new sequencea1ora2,a3ora4, ...,a2n- 1ora2n, consisting of2n- 1elements. In other words, she writes down the bit-wise OR of adjacent elements of sequencea. At the second iteration, Xenia writes the bitwiseexclusiveOR of adjacent elements of the sequence obtained after the first iteration. At the third iteration Xenia writes the bitwise OR of the adjacent elements of the sequence obtained after the second iteration. And so on; the operations of bitwise exclusive OR and bitwise OR alternate. In the end, she obtains a sequence consisting of one element, and that element isv.Let's consider an example. Suppose that sequencea= (1, 2, 3, 4). Then let's write down all the transformations(1, 2, 3, 4)→(1or2 = 3, 3or4 = 7)→(3xor7 = 4). The result isv= 4.You are given Xenia's initial sequence. But to calculate valuevfor a given sequence would be too easy, so you are given additionalmqueries. Each query is a pair of integersp,b. Queryp,bmeans that you need to perform the assignmentap=b. After each query, you need to print the new valuevfor the new sequencea.InputThe first line contains two integersnandm(1 ≤n≤ 17, 1 ≤m≤ 105). The next line contains2nintegersa1,a2, ...,a2n(0 ≤ai< 230). Each of the nextmlines contains queries. Thei-th line contains integerspi,bi(1 ≤pi≤ 2n, 0 ≤bi< 230)— thei-th query.OutputPrintmintegers — thei-th integer denotes valuevfor sequenceaafter thei-th query.ExamplesInput2 41 6 3 51 43 41 21 2Output1333NoteFor more information on the bit operations, you can follow this link:http://en.wikipedia.org/wiki/Bitwise_operation",
    "source": "CF",
    "vjudge": false
}