{
    "uid": "340-C",
    "url": "https://codeforces.com/contest/340/problem/C",
    "tags": [
        "combinatorics",
        " implementation",
        " math"
    ],
    "title": "340-C",
    "statement": "C. Tourist Problemtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIahub is a big fan of tourists. He wants to become a tourist himself, so he planned a trip. There arendestinations on a straight road that Iahub wants to visit. Iahub starts the excursion from kilometer 0. Thendestinations are described by a non-negative integers sequencea1,a2, ...,an. The numberakrepresents that thekth destination is at distanceakkilometers from the starting point. No two destinations are located in the same place.Iahub wants to visit each destination only once. Note that, crossing through a destination is not considered visiting, unless Iahub explicitly wants to visit it at that point. Also, after Iahub visits his last destination, he doesn't come back to kilometer 0, as he stops his trip at the last destination.The distance between destination located at kilometerxand next destination, located at kilometery, is|x-y|kilometers. We call a \"route\" an order of visiting the destinations. Iahub can visit destinations in any order he wants, as long as he visits allndestinations and he doesn't visit a destination more than once.Iahub starts writing out on a paper all possible routes and for each of them, he notes the total distance he would walk. He's interested in the average number of kilometers he would walk by choosing a route. As he got bored of writing out all the routes, he asks you to help him.InputThe first line contains integern(2 ≤n≤ 105). Next line containsndistinct integersa1,a2, ...,an(1 ≤ai≤ 107).OutputOutput two integers — the numerator and denominator of a fraction which is equal to the wanted average number. The fraction must be irreducible.ExamplesInput32 3 5Output22 3NoteConsider 6 possible routes:[2, 3, 5]: total distance traveled: |2 – 0| + |3 – 2| + |5 – 3| = 5;[2, 5, 3]: |2 – 0| + |5 – 2| + |3 – 5| = 7;[3, 2, 5]: |3 – 0| + |2 – 3| + |5 – 2| = 7;[3, 5, 2]: |3 – 0| + |5 – 3| + |2 – 5| = 8;[5, 2, 3]: |5 – 0| + |2 – 5| + |3 – 2| = 9;[5, 3, 2]: |5 – 0| + |3 – 5| + |2 – 3| = 8.The average travel distance is==.",
    "source": "CF",
    "vjudge": false
}