{
    "uid": "350-C",
    "url": "https://codeforces.com/contest/350/problem/C",
    "tags": [
        "greedy",
        " implementation",
        " sortings"
    ],
    "title": "350-C",
    "statement": "C. Bombstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got a robot, its task is destroying bombs on a square plane. Specifically, the square plane containsnbombs, thei-th bomb is at point with coordinates(xi,yi). We know that no two bombs are at the same point and that no bomb is at point with coordinates(0, 0). Initially, the robot is at point with coordinates(0, 0). Also, let's mark the robot's current position as(x,y). In order to destroy all the bombs, the robot can perform three types of operations:Operation has format \"1 k dir\". To perform the operation robot have to move in directiondirk(k≥ 1) times. There are only4directions the robot can move in: \"R\", \"L\", \"U\", \"D\". During one move the robot can move from the current point to one of following points:(x+ 1,y),(x- 1,y),(x,y+ 1),(x,y- 1)(corresponding to directions). It is forbidden to move from point(x,y), if at least one point on the path (besides the destination point) contains a bomb.Operation has format \"2\". To perform the operation robot have to pick a bomb at point(x,y)and put it in a special container. Thus, the robot can carry the bomb from any point to any other point. The operation cannot be performed if point(x,y)has no bomb. It is forbidden to pick a bomb if the robot already has a bomb in its container.Operation has format \"3\". To perform the operation robot have to take a bomb out of the container and destroy it. You are allowed to perform this operation only if the robot is at point(0, 0). It is forbidden to perform the operation if the container has no bomb.Help the robot and find the shortest possible sequence of operations he can perform to destroy all bombs on the coordinate plane.InputThe first line contains a single integern(1 ≤n≤ 105) — the number of bombs on the coordinate plane. Nextnlines contain two integers each. Thei-th line contains numbers(xi,yi)(- 109≤xi,yi≤ 109) — the coordinates of thei-th bomb. It is guaranteed that no two bombs are located at the same point and no bomb is at point(0, 0).OutputIn a single line print a single integerk— the minimum number of operations needed to destroy all bombs. On the next lines print the descriptions of thesekoperations. If there are multiple sequences, you can print any of them. It is guaranteed that there is the solution wherek≤ 106.ExamplesInput21 1-1 -1Output121 1 R1 1 U21 1 L1 1 D31 1 L1 1 D21 1 R1 1 U3Input35 00 51 0Output121 1 R21 1 L31 5 R21 5 L31 5 U21 5 D3",
    "source": "CF",
    "vjudge": false
}