{
    "uid": "350-B",
    "url": "https://codeforces.com/contest/350/problem/B",
    "tags": [
        "graphs"
    ],
    "title": "350-B",
    "statement": "B. Resorttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutValera's finally decided to go on holiday! He packed up and headed for a ski resort.Valera's fancied a ski trip but he soon realized that he could get lost in this new place. Somebody gave him a useful hint: the resort hasnobjects (we will consider the objects indexed in some way by integers from1ton), each object is either a hotel or a mountain.Valera has also found out that the ski resort had multiple ski tracks. Specifically, for each objectv, the resort has at most one objectu, such that there is a ski track built from objectuto objectv. We also know that no hotel has got a ski track leading from the hotel to some object.Valera is afraid of getting lost on the resort. So he wants you to come up with a path he would walk along. The path must consist of objectsv1,v2, ...,vk(k≥ 1) and meet the following conditions:Objects with numbersv1,v2, ...,vk- 1are mountains and the object with numbervkis the hotel.For any integeri(1 ≤i<k), there isexactly oneski track leading from objectvi. This track goes to objectvi+ 1.The path contains as many objects as possible (kis maximal).Help Valera. Find such path that meets all the criteria of our hero!InputThe first line contains integern(1 ≤n≤ 105) — the number of objects.The second line containsnspace-separated integerstype1,type2, ...,typen— the types of the objects. Iftypeiequals zero, then thei-th object is the mountain. Iftypeiequals one, then thei-th object is the hotel. It is guaranteed that at least one object is a hotel.The third line of the input containsnspace-separated integersa1,a2, ...,an(0 ≤ai≤n) — the description of the ski tracks. If numberaiequals zero, then there is no such objectv, that has a ski track built fromvtoi. If numberaidoesn't equal zero, that means that there is a track built from objectaito objecti.OutputIn the first line printk— the maximum possible path length for Valera. In the second line printkintegersv1,v2, ...,vk— the path. If there are multiple solutions, you can print any of them.ExamplesInput50 0 0 0 10 1 2 3 4Output51 2 3 4 5Input50 0 1 0 10 1 2 2 4Output24 5Input41 0 0 02 3 4 2Output11",
    "source": "CF",
    "vjudge": false
}