{
    "uid": "354-D",
    "url": "https://codeforces.com/contest/354/problem/D",
    "tags": [
        "dp"
    ],
    "title": "354-D",
    "statement": "D. Transferring Pyramidtime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya and Petya are using an interesting data storing structure: a pyramid.The pyramid consists ofnrows, thei-th row containsicells. Each row is shifted half a cell to the left relative to the previous row. The cells are numbered by integers from 1 toas shown on the picture below.An example of a pyramid atn= 5is:This data structure can perform operations of two types:Change the value of a specific cell. It is described by three integers:\"tiv\", wheret= 1(the type of operation),i— the number of the cell to change andvthe value to assign to the cell.Change the value of some subpyramid. The picture shows a highlighted subpyramid with the top in cell5. It is described bys+ 2numbers:\"tiv1v2...vs\", wheret= 2,i— the number of the top cell of the pyramid,s— the size of the subpyramid (the number of cells it has),vj— the value you should assign to thej-th cell of the subpyramid.Formally: a subpyramid with top at thei-th cell of thek-th row (the5-th cell is the second cell of the third row) will contain cells from rows fromkton, the(k+p)-th row contains cells from thei-th to the(i+p)-th (0 ≤p≤n-k).Vasya and Petya had two identical pyramids. Vasya changed some cells in his pyramid and he now wants to send his changes to Petya. For that, he wants to find a sequence of operations at which Petya can repeat all Vasya's changes. Among all possible sequences, Vasya has to pick the minimum one (the one that contains the fewest numbers).You have a pyramid ofnrows withkchanged cells. Find the sequence of operations which result ineach of thekchanged cells being changed by at least one operation. Among all the possible sequences pickthe one that contains the fewest numbers.InputThe first line contains two integersnandk(1 ≤n,k≤ 105).The nextklines contain the coordinates of the modified cellsriandci(1 ≤ci≤ri≤n)— the row and the cell's number in the row. All cells are distinct.OutputPrint a single number showing how many numbers the final sequence has.ExamplesInput4 53 13 34 14 34 4Output10Input7 112 23 14 35 15 25 56 47 27 37 47 5Output26NoteOne of the possible solutions of the first sample consists of two operations:2 4v4v7v82 6v6v9v10The picture shows the changed cells color-highlighted. The subpyramid used by the first operation is highlighted blue and the subpyramid used by the first operation is highlighted yellow:",
    "source": "CF",
    "vjudge": false
}