{
    "uid": "358-D",
    "url": "https://codeforces.com/contest/358/problem/D",
    "tags": [
        "dp",
        " greedy"
    ],
    "title": "358-D",
    "statement": "D. Dima and Harestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDima liked the present he got from Inna very much. He liked the present he got from Seryozha even more.Dima felt so grateful to Inna about the present that he decided to buy hernhares. Inna was very happy. She lined up the hares in a row, numbered them from 1 tonfrom left to right and started feeding them with carrots. Inna was determined to feed each hare exactly once. But in what order should she feed them?Inna noticed that each hare radiates joy when she feeds it. And the joy of the specific hare depends on whether Inna fed its adjacent hares before feeding it. Inna knows how much joy a hare radiates if it eats when either both of his adjacent hares are hungry, or one of the adjacent hares is full (that is, has been fed), or both of the adjacent hares are full. Please note that hares number 1 andndon't have a left and a right-adjacent hare correspondingly, so they can never have two full adjacent hares.Help Inna maximize the total joy the hares radiate. :)InputThe first line of the input contains integern(1 ≤n≤ 3000)— the number of hares. Then three lines follow, each line hasnintegers. The first line contains integersa1a2...an. The second line containsb1,b2, ...,bn. The third line containsc1,c2, ...,cn. The following limits are fulfilled:0 ≤ai,bi,ci≤ 105.Numberaiin the first line shows the joy that hare numberigets if his adjacent hares are both hungry. Numberbiin the second line shows the joy that hare numberiradiates if he has exactly one full adjacent hare. Numberсiin the third line shows the joy that hare numberiradiates if both his adjacent hares are full.OutputIn a single line, print the maximum possible total joy of the hares Inna can get by feeding them.ExamplesInput41 2 3 44 3 2 10 1 1 0Output13Input78 5 7 6 1 8 92 7 9 5 4 3 12 3 3 4 1 1 3Output44Input31 1 11 2 11 1 1Output4",
    "source": "CF",
    "vjudge": false
}