{
    "uid": "363-D",
    "url": "https://codeforces.com/contest/363/problem/D",
    "tags": [
        "binary search",
        " greedy"
    ],
    "title": "363-D",
    "statement": "D. Renting Bikestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA group ofnschoolboys decided to ride bikes. As nobody of them has a bike, the boys need to rent them.The renting site offered themmbikes. The renting price is different for different bikes, renting thej-th bike costspjrubles.In total, the boys' shared budget isarubles. Besides, each of them has his own personal money, thei-th boy hasbipersonal rubles. The shared budget can be spent on any schoolchildren arbitrarily, but each boy's personal money can be spent on renting only this boy's bike.Each boy can rentat most one bike, one cannot give his bike to somebody else.What maximum number of schoolboys will be able to ride bikes? What minimum sum of personal money will they have to spend in total to let as many schoolchildren ride bikes as possible?InputThe first line of the input contains three integersn,manda(1 ≤n,m≤ 105;0 ≤a≤ 109). The second line contains the sequence of integersb1,b2, ...,bn(1 ≤bi≤ 104), wherebiis the amount of thei-th boy's personal money. The third line contains the sequence of integersp1,p2, ...,pm(1 ≤pj≤ 109), wherepjis the price for renting thej-th bike.OutputPrint two integersrands, whereris the maximum number of schoolboys that can rent a bike andsis the minimum total personal money needed to rentrbikes. If the schoolchildren cannot rent any bikes, thenr=s= 0.ExamplesInput2 2 105 57 6Output2 3Input4 5 28 1 1 26 3 7 5 2Output3 8NoteIn the first sample both schoolchildren can rent a bike. For instance, they can split the shared budget in half (5 rubles each). In this case one of them will have to pay 1 ruble from the personal money and the other one will have to pay 2 rubles from the personal money. In total, they spend 3 rubles of their personal money. This way of distribution of money minimizes the amount of spent personal money.",
    "source": "CF",
    "vjudge": false
}