{
    "uid": "374-E",
    "url": "https://codeforces.com/contest/374/problem/E",
    "tags": [
        "binary search",
        " data structures",
        " dsu",
        " geometry",
        " implementation"
    ],
    "title": "374-E",
    "statement": "E. Inna and Babiestime limit per test6 secondsmemory limit per test256 megabytesinputstdinoutputstdoutInna, Dima and Sereja are in one room together. It's cold outside, so Sereja suggested to play a board game called \"Babies\".The babies playing board is an infinite plane containingnblue babies andmred ones. Each baby is a segment that grows in time. At time momenttthe blue baby(x,y)is a blue segment with ends at points(x-t,y+t),(x+t,y-t). Similarly, at timetthe red baby(x,y)is a red segment with ends at points(x+t,y+t),(x-t,y-t)of the plane. Initially, at timet= 0all babies are points on the plane.The goal of the game is to find the first integer moment of time when the plane contains a rectangle of a non-zero area which sides are fully covered by some babies. A side may be covered by multiple babies. More formally, each point of each side of the rectangle should be covered by at least one baby of any color. At that, you must assume that the babies are closed segments, that is, they contain their endpoints.You are given the positions of all babies — help Inna and Dima to find the required moment of time.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 2000).Nextnlines contain the coordinates of the blue babies. Thei-th line contains integersxi,yi— a baby's coordinates. Nextmlines contain the coordinates ofmred babies in the similar form.All coordinates of the input don't exceed106in their absolute value. Note that all babies stand in distinct points.OutputIn the single line print a single integer — the answer to the problem.If the rectangle never appears on the plane, print \"Poor Sereja!\" without the quotes.ExamplesInput2 22 25 53 75 1Output3Input3 22 23 26 24 25 2Output1",
    "source": "CF",
    "vjudge": false
}