{
    "uid": "388-E",
    "url": "https://codeforces.com/contest/388/problem/E",
    "tags": [
        "geometry"
    ],
    "title": "388-E",
    "statement": "E. Fox and Meteor Showertime limit per test6 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere is a meteor shower on the sky and there arenmeteors. The sky can be viewed as a 2D Euclid Plane and the meteor is point on this plane.Fox Ciel looks at the sky. She finds out that the orbit of each meteor is a straight line, and each meteor has a constant velocity. Now Ciel wants to know: what is the maximum number ofmeteorssuch that any pair met at the same position at a certain time? Note that the time is not limited and can be also negative. The meteors will never collide when they appear at the same position at the same time.InputThe first line contains an integern(1 ≤n≤ 1000). Each of the nextnlines contains six integers:t1,x1,y1,t2,x2,y2— the description of a meteor's orbit: at timet1, the current meteor is located at the point (x1,y1) and at timet2, the meteor is located at point (x2,y2) (- 106≤t1,x1,y1,t2,x2,y2≤ 106;t1≠t2).There will be no two meteors are always in the same position for any time.OutputPrint a single integer — the maximum number of meteors such that any pair met at the same position at a certain time.ExamplesInput20 0 1 1 0 20 1 0 1 2 0Output2Input3-1 -1 0 3 3 00 2 -1 -1 3 -2-2 0 -1 6 0 3Output3Input40 0 0 1 0 10 0 1 1 1 10 1 1 1 1 00 1 0 1 0 0Output1Input10 0 0 1 0 0Output1NoteIn example 1, meteor 1 and 2 meet int=-1 at (0, 0).In example 2, meteor 1 and 2 meet int=1 at (1, 0), meteor 1 and 3 meet int=0 at (0, 0) and meteor 2 and 3 meet int=2 at (0, 1).In example 3, no two meteor meet.In example 4, there is only 1 meteor, and its velocity is zero.If your browser doesn't support animation png, please see the gif version here:http://assets.codeforces.com/images/388e/example1.gifhttp://assets.codeforces.com/images/388e/example2.gifhttp://assets.codeforces.com/images/388e/example3.gifhttp://assets.codeforces.com/images/388e/example4.gif",
    "source": "CF",
    "vjudge": false
}