{
    "uid": "39-B",
    "url": "https://codeforces.com/contest/39/problem/B",
    "tags": [
        "greedy"
    ],
    "title": "39-B",
    "statement": "B. Company Income Growthtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutPetya works as a PR manager for a successful Berland company BerSoft. He needs to prepare a presentation on the company income growth since2001(the year of its founding) till now. Petya knows that in2001the company income amounted toa1billion bourles, in2002— toa2billion, ..., and in the current(2000 +n)-th year —anbillion bourles. On the base of the information Petya decided to show in his presentation the linear progress history which is in his opinion perfect. According to a graph Petya has already made, in the first year BerSoft company income must amount to1billion bourles, in the second year —2billion bourles etc., each following year the income increases by1billion bourles. Unfortunately, the real numbers are different from the perfect ones. Among the numbersaican even occur negative ones that are a sign of the company’s losses in some years. That is why Petya wants to ignore some data, in other words, cross some numbersaifrom the sequence and leave only some subsequence that has perfect growth.Thus Petya has to choose a sequence of yearsy1,y2, ...,yk,so that in the yeary1the company income amounted to1billion bourles, in the yeary2—2billion bourles etc., in accordance with the perfect growth dynamics. Help him to choose the longest such sequence.InputThe first line contains an integern(1 ≤n≤ 100). The next line containsnintegersai(- 100 ≤ai≤ 100). The numberaidetermines the income of BerSoft company in the(2000 +i)-th year. The numbers in the line are separated by spaces.OutputOutputk— the maximum possible length of a perfect sequence. In the next line output the sequence of yearsy1,y2, ...,yk. Separate the numbers by spaces. If the answer is not unique, output any. If no solution exist, output one number0.ExamplesInput10-2 1 1 3 2 3 4 -10 -2 5Output52002 2005 2006 2007 2010Input3-1 -2 -3Output0",
    "source": "CF",
    "vjudge": false
}