{
    "uid": "405-C",
    "url": "https://codeforces.com/contest/405/problem/C",
    "tags": [
        "implementation",
        " math"
    ],
    "title": "405-C",
    "statement": "C. Unusual Producttime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutLittle Chris is a huge fan of linear algebra. This time he has been given a homework about theunusual squareof a square matrix.Thedot productof two integer number vectorsxandyof sizenis the sum of the products of the corresponding components of the vectors. Theunusual squareof ann×nsquare matrixAis defined as the sum ofndot products. Thei-th of them is the dot product of thei-th row vector and thei-th column vector in the matrixA.Fortunately for Chris, he has to work only inGF(2)! This means that all operations (addition, multiplication) are calculated modulo 2. In fact, the matrixAis binary: each element ofAis either 0 or 1. For example, consider the following matrixA:The unusual square ofAis equal to(1·1 + 1·0 + 1·1) + (0·1 + 1·1 + 1·0) + (1·1 + 0·1 + 0·0) = 0 + 1 + 1 = 0.However, there is much more to the homework. Chris has to processqqueries; each query can be one of the following:given a row indexi, flip all the values in thei-th row inA;given a column indexi, flip all the values in thei-th column inA;find the unusual square ofA.To flip a bit valuewmeans to change it to1 -w, i.e., 1 changes to 0 and 0 changes to 1.Given the initial matrixA, output the answers for each query of the third type! Can you solve Chris's homework?InputThe first line of input contains an integern(1 ≤n≤ 1000), the number of rows and the number of columns in the matrixA. The nextnlines describe the matrix: thei-th line containsnspace-separated bits and describes thei-th row ofA. Thej-th number of thei-th lineaij(0 ≤aij≤ 1) is the element on the intersection of thei-th row and thej-th column ofA.The next line of input contains an integerq(1 ≤q≤ 106), the number of queries. Each of the nextqlines describes a single query, which can be one of the following:1i— flip the values of thei-th row;2i— flip the values of thei-th column;3 — output the unusual square ofA.Note: since the size of the input and output could be very large, don't use slow output techniques in your language. For example, do not use input and output streams (cin, cout) in C++.OutputLet the number of the 3rd type queries in the input bem. Output a single stringsof lengthm, where thei-th symbol ofsis the value of the unusual square ofAfor thei-th query of the 3rd type as it appears in the input.ExamplesInput31 1 10 1 11 0 01232 332 22 21 3331 22 11 13Output01001",
    "source": "CF",
    "vjudge": false
}