{
    "uid": "406-D",
    "url": "https://codeforces.com/contest/406/problem/D",
    "tags": [
        "dfs and similar",
        " geometry",
        " trees"
    ],
    "title": "406-D",
    "statement": "D. Hill Climbingtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThis problem has nothing to do with Little Chris. It is about hill climbers instead (and Chris definitely isn't one).There arenhills arranged on a line, each in the form of a vertical line segment with one endpoint on the ground. The hills are numbered with numbers from 1 tonfrom left to right. Thei-th hill stands at positionxiwith its top at heightyi. For every two hillsaandb, if the top of hillacan be seen from the top of hillb, their tops are connected by a rope. Formally, the tops of two hills are connected if the segment connecting their top points does not intersect or touch any of the other hill segments. Using these ropes, the hill climbers can move from hill to hill.There aremteams of climbers, each composed of exactly two members. The first and the second climbers of thei-th team are located at the top of theai-th andbi-th hills, respectively. They want to meet together at the top of some hill. Now, each of two climbers move according to the following process:if a climber is at the top of the hill where the other climber is already located or will come eventually, the former climber stays at this hill;otherwise, the climber picks a hill to the right of his current hill that is reachable by a rope andis the rightmost possible, climbs this hill and continues the process (the climber can also climb a hill whose top is lower than the top of his current hill).For each team of climbers, determine the number of the meeting hill for this pair!InputThe first line of input contains a single integern(1 ≤n≤ 105), the number of hills. The nextnlines describe the hills. Thei-th of them contains two space-separated integersxi,yi(1 ≤xi≤ 107;1 ≤yi≤ 1011), the position and the height of thei-th hill. The hills are given in the ascending order ofxi, i.e.,xi<xjfori<j.The next line of input contains a single integerm(1 ≤m≤ 105), the number of teams. The nextmlines describe the teams. Thei-th of them contains two space-separated integersai,bi(1 ≤ai,bi≤n), the numbers of the hills where the climbers of thei-th team are located. It is possible thatai=bi.OutputIn a single line outputmspace-separated integers, where thei-th integer is the number of the meeting hill for the members of thei-th team.ExamplesInput61 42 13 24 36 47 433 15 62 3Output5 6 3",
    "source": "CF",
    "vjudge": false
}