{
    "uid": "414-C",
    "url": "https://codeforces.com/contest/414/problem/C",
    "tags": [
        "combinatorics",
        " divide and conquer"
    ],
    "title": "414-C",
    "statement": "C. Mashmokh and Reverse Operationtime limit per test4 secondsmemory limit per test512 megabytesinputstdinoutputstdoutMashmokh's boss, Bimokh, didn't like Mashmokh. So he fired him. Mashmokh decided to go to university and participate in ACM instead of finding a new job. He wants to become a member of Bamokh's team. In order to join he was given some programming tasks and one week to solve them. Mashmokh is not a very experienced programmer. Actually he is not a programmer at all. So he wasn't able to solve them. That's why he asked you to help him with these tasks. One of these tasks is the following.You have an arrayaof length2nandmqueries on it. Thei-th query is described by an integerqi. In order to perform thei-th query you must:split the array into2n-qiparts, where each part is a subarray consisting of2qinumbers; thej-th subarray(1 ≤j≤ 2n-qi)should contain the elementsa[(j- 1)·2qi+ 1],a[(j- 1)·2qi+ 2], ...,a[(j- 1)·2qi+ 2qi];reverse each of the subarrays;join them into a single array in the same order (this array becomes new arraya);output the number of inversions in the newa.Given initial arrayaand all the queries. Answer all the queries. Please, note that the changes from some query is saved for further queries.InputThe first line of input contains a single integern(0 ≤n≤ 20).The second line of input contains2nspace-separated integersa[1],a[2], ...,a[2n] (1 ≤a[i] ≤ 109), the initial array.The third line of input contains a single integerm(1 ≤m≤ 106).The fourth line of input containsmspace-separated integersq1,q2, ...,qm(0 ≤qi≤n), the queries.Note: since the size of the input and output could be very large, don't use slow output techniques in your language. For example, do not use input and output streams (cin, cout) in C++.OutputOutputmlines. In thei-th line print the answer (the number of inversions) for thei-th query.ExamplesInput22 1 4 341 2 0 2Output0660Input11 230 1 1Output010NoteIf we reverse an arrayx[1],x[2], ...,x[n]it becomes new arrayy[1],y[2], ...,y[n], wherey[i] =x[n-i+ 1]for eachi.The number of inversions of an arrayx[1],x[2], ...,x[n]is the number of pairs of indicesi,jsuch that:i<jandx[i] >x[j].",
    "source": "CF",
    "vjudge": false
}