{
    "uid": "433-E",
    "url": "https://codeforces.com/contest/433/problem/E",
    "tags": [
        "dp"
    ],
    "title": "433-E",
    "statement": "E. Tachibana Kanade's Tofutime limit per test5 secondsmemory limit per test512 megabytesinputstdinoutputstdoutTachibana Kanade likes Mapo Tofu very much. One day, the canteen cooked all kinds of tofu to sell, but not all tofu is Mapo Tofu, only those spicy enough can be called Mapo Tofu.Each piece of tofu in the canteen is given am-based number, all numbers are in the range[l,r](landrbeingm-based numbers), and for everym-based integer in the range[l,r], there exists a piece of tofu with that number.To judge what tofu is Mapo Tofu, Tachibana Kanade chosenm-based number strings, and assigned a value to each string. If a string appears in the number of a tofu, the value of the string will be added to the value of that tofu. If a string appears multiple times, then the value is also added that many times. Initially the value of each tofu is zero.Tachibana Kanade considers tofu with values no more thankto be Mapo Tofu. So now Tachibana Kanade wants to know, how many pieces of tofu are Mapo Tofu?InputThe first line contains three integersn,mandk(1 ≤n≤ 200; 2 ≤m≤ 20; 1 ≤k≤ 500). Wherendenotes the number of strings,mdenotes the base used, andkdenotes the limit of the value for Mapo Tofu.The second line represents the numberl. The first integer in the line islen(1 ≤len≤ 200), describing the length (number of digits in basem) ofl. Then followlenintegersa1,a2, ...,alen(0 ≤ai<m;a1> 0)separated by spaces, representing the digits ofl, witha1being the highest digit andalenbeing the lowest digit.The third line represents the numberrin the same format asl. It is guaranteed that1 ≤l≤r.Then follownlines, each line describing a number string. Thei-th line contains thei-th number string andvi— the value of thei-th string (1 ≤vi≤ 200). All number strings are described in almost the same format asl, the only difference is number strings may contain necessary leading zeros (see the first example). The sum of the lengths of all number strings does not exceed200.OutputOutput the number of pieces of Mapo Tofu modulo1000000007(109+ 7). The answer should be a decimal integer.ExamplesInput2 10 11 13 1 0 01 1 11 0 1Output97Input2 10 122 5 96 6 3 5 4 9 72 0 6 13 6 7 2 1Output635439Input4 2 66 1 0 1 1 1 06 1 1 0 1 0 01 1 23 0 1 0 54 0 1 1 0 43 1 0 1 2Output2NoteIn the first sample, 10, 11 and 100 are the only three decimal numbers in[1, 100]with a value greater than 1. Here the value of 1 is 1 but not 2, since numbers cannot contain leading zeros and thus cannot be written as \"01\".In the second sample, no numbers in the given interval have a value greater than 12.In the third sample, 110000 and 110001 are the only two binary numbers in the given interval with a value no greater than 6.",
    "source": "CF",
    "vjudge": false
}