{
    "uid": "435-E",
    "url": "https://codeforces.com/contest/435/problem/E",
    "tags": [],
    "title": "435-E",
    "statement": "E. Special Graphtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn this problem you will need to deal with ann×mgrid graph. The graph's vertices are the nodes of then×mgrid. The graph's edges are all the sides and diagonals of the grid's unit squares.The figure below shows a3 × 5graph. The black lines are the graph's edges, the colored circles are the graph's vertices. The vertices of the graph are painted on the picture for a reason: the coloring is a correct vertex coloring of the3 × 5graph into four colors. A graph coloring is correct if and only if each vertex is painted and no two vertices connected by an edge are painted the same color.You are given the size of the grid graphn×mand the colors of some of its vertices. Find any way how to paint the unpainted vertices of the graph in 4 colors to make the final coloring a correct vertex graph coloring. If there is no such correct vertex coloring, say that the answer doesn't exist.InputThe first line contains two integersnandm(2 ≤n,m≤ 1000). Each of the nextnlines consists ofmcharacters — the given graph. Each character is either «0», «1», «2», «3», «4». Character «0» means that the corresponding vertex is unpainted, otherwise the character means the color of the vertex.Assume that all the available colors are numbered from1to4.OutputIf there is no way to get correct vertex coloring of the graph, print 0 in a single line. Otherwise print the coloredn×mgraph. Print the graph in the same format as in the input.If multiple answers exist, print any of them.ExamplesInput3 5101010002001000Output131314242431313Input2 20000Output1234Input2 21100Output0NoteThe answer to the first sample is shown on the picture (1 — green color, 2 — blue, 3 — dark blue, 4 — pink).In the second sample there exists 4! answers, each of them is considered correct.In the third sample two vertices with equal colors are connected. So the correct vertex coloring couldn't be obtained.",
    "source": "CF",
    "vjudge": false
}