{
    "uid": "436-B",
    "url": "https://codeforces.com/contest/436/problem/B",
    "tags": [
        "implementation",
        " math"
    ],
    "title": "436-B",
    "statement": "B. Om Nom and Spiderstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOm Nom really likes candies and doesn't like spiders as they frequently steal candies. One day Om Nom fancied a walk in a park. Unfortunately, the park has some spiders and Om Nom doesn't want to see them at all.The park can be represented as a rectangularn×mfield. The park haskspiders, each spider at time 0 is at some cell of the field. The spiders move all the time, and each spider always moves in one of the four directions (left, right, down, up). In a unit of time, a spider crawls from his cell to the side-adjacent cell in the corresponding direction. If there is no cell in the given direction, then the spider leaves the park. The spiders do not interfere with each other as they move. Specifically, one cell can have multiple spiders at the same time.Om Nom isn't yet sure where to start his walk from but he definitely wants:to start walking at time 0 at an upper row cell of the field (it is guaranteed that the cells in this row do not contain any spiders);to walk by moving down the field towards the lowest row (the walk ends when Om Nom leaves the boundaries of the park).We know that Om Nom moves by jumping. One jump takes one time unit and transports the little monster from his cell to either a side-adjacent cell on the lower row or outside the park boundaries.Each time Om Nom lands in a cell he sees all the spiders that have come to that cell at this moment of time. Om Nom wants to choose the optimal cell to start the walk from. That's why he wonders: for each possible starting cell, how many spiders will he see during the walk if he starts from this cell? Help him and calculate the required value for each possible starting cell.InputThe first line contains three integersn,m,k(2 ≤n,m≤ 2000; 0 ≤k≤m(n- 1)).Each of the nextnlines containsmcharacters — the description of the park. The characters in thei-th line describe thei-th row of the park field. If the character in the line equals \".\", that means that the corresponding cell of the field is empty; otherwise, the character in the line will equal one of the four characters: \"L\" (meaning that this cell has a spider at time 0, moving left), \"R\" (a spider moving right), \"U\" (a spider moving up), \"D\" (a spider moving down).It is guaranteed that the first row doesn't contain any spiders. It is guaranteed that the description of the field contains no extra characters. It is guaranteed that at time 0 the field contains exactlykspiders.OutputPrintmintegers: thej-th integer must show the number of spiders Om Nom will see if he starts his walk from thej-th cell of the first row. The cells in any row of the field are numbered from left to right.ExamplesInput3 3 4...R.LR.UOutput0 2 2Input2 2 2..RLOutput1 1Input2 2 2..LROutput0 0Input3 4 8....RRLLUUUUOutput1 3 3 1Input2 2 2..UUOutput0 0NoteConsider the first sample. The notes below show how the spider arrangement changes on the field over time:...        ...        ..U       ...R.L   ->   .*U   ->   L.R   ->  ...R.U        .R.        ..R       ...Character \"*\" represents a cell that contains two spiders at the same time.If Om Nom starts from the first cell of the first row, he won't see any spiders.If he starts from the second cell, he will see two spiders at time 1.If he starts from the third cell, he will see two spiders: one at time 1, the other one at time 2.",
    "source": "CF",
    "vjudge": false
}