{
    "uid": "437-A",
    "url": "https://codeforces.com/contest/437/problem/A",
    "tags": [
        "implementation"
    ],
    "title": "437-A",
    "statement": "A. The Child and Homeworktime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOnce upon a time a child got a test consisting of multiple-choice questions as homework. A multiple-choice question consists of four choices:A,B,CandD. Each choice has a description, and the child should find out the only one that is correct.Fortunately the child knows how to solve such complicated test. The child will follow the algorithm:If there is some choice whose description at least twice shorter than all other descriptions, or at least twice longer than all other descriptions, then the child thinks the choice is great.If there is exactly one great choice then the child chooses it. Otherwise the child choosesC(the child think it is the luckiest choice).You are given a multiple-choice questions, can you predict child's choose?InputThe first line starts with \"A.\" (without quotes), then followed the description of choiceA. The next three lines contains the descriptions of the other choices in the same format. They are given in order:B,C,D.Please note, that the description goes after prefix \"X.\", so the prefix mustn't be counted in description's length.Each description is non-empty and consists of at most100characters. Each character can be either uppercase English letter or lowercase English letter, or \"_\".OutputPrint a single line with the child's choice: \"A\", \"B\", \"C\" or \"D\" (without quotes).ExamplesInputA.VFleaKing_is_the_author_of_this_problemB.Picks_is_the_author_of_this_problemC.Picking_is_the_author_of_this_problemD.Ftiasch_is_cuteOutputDInputA.abB.abcdeC.abD.abcOutputCInputA.cB.ccC.cD.cOutputBNoteIn the first sample, the first choice has length 39, the second one has length 35, the third one has length 37, and the last one has length 15. The choiceD(length 15) is twice shorter than all other choices', so it is great choice. There is no other great choices so the child will chooseD.In the second sample, no choice is great, so the child will choose the luckiest choiceC.In the third sample, the choiceB(length 2) is twice longer than all other choices', so it is great choice. There is no other great choices so the child will chooseB.",
    "source": "CF",
    "vjudge": false
}