{
    "uid": "439-D",
    "url": "https://codeforces.com/contest/439/problem/D",
    "tags": [
        "binary search",
        " sortings",
        " ternary search",
        " two pointers"
    ],
    "title": "439-D",
    "statement": "D. Devu and his Brothertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDevu and his brother love each other a lot. As they are super geeks, they only like to play with arrays. They are given two arraysaandbby their father. The arrayais given to Devu andbto his brother.As Devu is really a naughty kid, he wants the minimum value of his arrayashould be at least as much as the maximum value of his brother's arrayb.Now you have to help Devu in achieving this condition. You can perform multiple operations on the arrays. In a single operation, you are allowed to decrease or increase any element of any of the arrays by 1. Note that you are allowed to apply the operation on any index of the array multiple times.You need to find minimum number of operations required to satisfy Devu's condition so that the brothers can play peacefully without fighting.InputThe first line contains two space-separated integersn,m(1 ≤n,m≤ 105). The second line will containnspace-separated integers representing content of the arraya(1 ≤ai≤ 109). The third line will containmspace-separated integers representing content of the arrayb(1 ≤bi≤ 109).OutputYou need to output a single integer representing the minimum number of operations needed to satisfy Devu's condition.ExamplesInput2 22 33 5Output3Input3 21 2 33 4Output4Input3 24 5 61 2Output0NoteIn example1, you can increasea1by1and decreaseb2by1and then again decreaseb2by1. Now arrayawill be [3;3] and arraybwill also be [3;3]. Here minimum element ofais at least as large as maximum element ofb. So minimum number of operations needed to satisfy Devu's condition are3.In example3, you don't need to do any operation, Devu's condition is already satisfied.",
    "source": "CF",
    "vjudge": false
}