{
    "uid": "441-A",
    "url": "https://codeforces.com/contest/441/problem/A",
    "tags": [
        "implementation"
    ],
    "title": "441-A",
    "statement": "A. Valera and Antique Itemstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutValera is a collector. Once he wanted to expand his collection with exactly one antique item.Valera knowsnsellers of antiques, thei-th of them auctionedkiitems. Currently the auction price of thej-th object of thei-th seller issij. Valera gets on well with each of thensellers. He is perfectly sure that if he outbids the current price of one of the items in the auction (in other words, offers the seller the money that is strictly greater than the current price of the item at the auction), the seller of the object will immediately sign a contract with him.Unfortunately, Valera has onlyvunits of money. Help him to determine which of thensellers he can make a deal with.InputThe first line contains two space-separated integersn,v(1 ≤n≤ 50; 104≤v≤ 106)— the number of sellers and the units of money the Valera has.Thennlines follow. Thei-th line first contains integerki(1 ≤ki≤ 50)the number of items of thei-th seller. Then gokispace-separated integerssi1,si2, ...,siki(104≤sij≤ 106)— the current prices of the items of thei-th seller.OutputIn the first line, print integerp— the number of sellers with who Valera can make a deal.In the second line printpspace-separated integersq1,q2, ...,qp(1 ≤qi≤n)— the numbers of the sellers with who Valera can make a deal. Print the numbers of the sellersin the increasing order.ExamplesInput3 500001 400002 20000 600003 10000 70000 190000Output31 2 3Input3 500001 500003 100000 120000 1100003 120000 110000 120000Output0NoteIn the first sample Valera can bargain with each of the sellers. He can outbid the following items: a40000item from the first seller, a20000item from the second seller, and a10000item from the third seller.In the second sample Valera can not make a deal with any of the sellers, as the prices of all items in the auction too big for him.",
    "source": "CF",
    "vjudge": false
}