{
    "uid": "466-E",
    "url": "https://codeforces.com/contest/466/problem/E",
    "tags": [
        "dfs and similar",
        " dsu",
        " graphs",
        " trees"
    ],
    "title": "466-E",
    "statement": "E. Information Graphtime limit per test1 secondmemory limit per test512 megabytesinputstdinoutputstdoutThere arenemployees working in company \"X\" (let's number them from 1 tonfor convenience). Initially the employees didn't have any relationships among each other. On each ofmnext days one of the following events took place:either employeeybecame the boss of employeex(at that, employeexdidn't have a boss before);or employeexgets a packet of documents and signs them; then he gives the packet to his boss. The boss signs the documents and gives them to his boss and so on (the last person to sign the documents sends them to the archive);or comes a request of type \"determine whether employeexsigns certain documents\".Your task is to write a program that will, given the events, answer the queries of the described type. At that, it is guaranteed that throughout the whole working time the company didn't have cyclic dependencies.InputThe first line contains two integersnandm(1 ≤n,m≤ 105) — the number of employees and the number of events.Each of the nextmlines contains the description of one event (the events are given in the chronological order). The first number of the line determines the type of eventt(1 ≤t≤ 3).Ift= 1, then next follow two integersxandy(1 ≤x,y≤n)— numbers of the company employees. It is guaranteed that employeexdoesn't have the boss currently.Ift= 2, then next follow integerx(1 ≤x≤n)— the number of the employee who got a document packet.Ift= 3, then next follow two integersxandi(1 ≤x≤n; 1 ≤i≤[number of packets that have already been given])— the employee and the number of the document packet for which you need to find out information. The document packets are numbered started from 1 in the chronological order.It is guaranteed that the input has at least one query of the third type.OutputFor each query of the third type print \"YES\" if the employee signed the document package and \"NO\" otherwise. Print all the words without the quotes.ExamplesInput4 91 4 32 43 3 11 2 32 23 1 21 3 12 23 1 3OutputYESNOYES",
    "source": "CF",
    "vjudge": false
}