{
    "uid": "479-D",
    "url": "https://codeforces.com/contest/479/problem/D",
    "tags": [
        "binary search",
        " greedy",
        " implementation"
    ],
    "title": "479-D",
    "statement": "D. Long Jumpstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutValery is a PE teacher at a school in Berland. Soon the students are going to take a test in long jumps, and Valery has lost his favorite ruler!However, there is no reason for disappointment, as Valery has found another ruler, its length islcentimeters. The ruler already hasnmarks, with which he can make measurements. We assume that the marks are numbered from 1 tonin the order they appear from the beginning of the ruler to its end. The first point coincides with the beginning of the ruler and represents the origin. The last mark coincides with the end of the ruler, at distancelfrom the origin. This ruler can be repesented by an increasing sequencea1,a2, ...,an, whereaidenotes the distance of thei-th mark from the origin (a1= 0,an=l).Valery believes that with a ruler he can measure the distance ofdcentimeters, if there is a pair of integersiandj(1 ≤i≤j≤n), such that the distance between thei-th and thej-th mark is exactly equal tod(in other words,aj-ai=d).Under the rules, the girls should be able to jump at leastxcentimeters, and the boys should be able to jump at leasty(x<y) centimeters. To test the children's abilities, Valery needs a ruler to measure each of the distancesxandy.Your task is to determine what is the minimum number of additional marks you need to add on the ruler so that they can be used to measure the distancesxandy. Valery can add the marks at any integer non-negative distance from the origin not exceeding the length of the ruler.InputThe first line contains four positive space-separated integersn,l,x,y(2 ≤n≤ 105,2 ≤l≤ 109,1 ≤x<y≤l) — the number of marks, the length of the ruler and the jump norms for girls and boys, correspondingly.The second line contains a sequence ofnintegersa1,a2, ...,an(0 =a1<a2< ... <an=l), whereaishows the distance from thei-th mark to the origin.OutputIn the first line print a single non-negative integerv— the minimum number of marks that you need to add on the ruler.In the second line printvspace-separated integersp1,p2, ...,pv(0 ≤pi≤l). Numberpimeans that thei-th mark should be at the distance ofpicentimeters from the origin. Print the marks in any order. If there are multiple solutions, print any of them.ExamplesInput3 250 185 2300 185 250Output1230Input4 250 185 2300 20 185 250Output0Input2 300 185 2300 300Output2185 230NoteIn the first sample it is impossible to initially measure the distance of230centimeters. For that it is enough to add a20centimeter mark or a230centimeter mark.In the second sample you already can use the ruler to measure the distances of185and230centimeters, so you don't have to add new marks.In the third sample the ruler only contains the initial and the final marks. We will need to add two marks to be able to test the children's skills.",
    "source": "CF",
    "vjudge": false
}