{
    "uid": "48-C",
    "url": "https://codeforces.com/contest/48/problem/C",
    "tags": [
        "math"
    ],
    "title": "48-C",
    "statement": "C. The Racetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutEvery year a race takes place on the motorway between cities A and B. This year Vanya decided to take part in the race and drive his own car that has been around and bears its own noble name — The Huff-puffer.So, Vasya leaves city A on the Huff-puffer, besides, at the very beginning he fills the petrol tank withαliters of petrol (α ≥ 10is Vanya's favorite number, it is not necessarily integer). Petrol stations are located on the motorway at an interval of100kilometers, i.e. the first station is located100kilometers away from the city A, the second one is200kilometers away from the city A, the third one is300kilometers away from the city A and so on. The Huff-puffer spends10liters of petrol every100kilometers.Vanya checks the petrol tank every time he passes by a petrol station. If the petrol left in the tank is not enough to get to the next station, Vanya fills the tank withαliters of petrol. Otherwise, he doesn't stop at the station and drives on.For example, ifα = 43.21, then the car will be fuelled up for the first time at the station number4, when there'll be3.21petrol liters left. After the fuelling up the car will have46.42liters. Then Vanya stops at the station number8and ends up with6.42 + 43.21 = 49.63liters. The next stop is at the station number12,9.63 + 43.21 = 52.84. The next stop is at the station number17and so on.You won't believe this but the Huff-puffer has been leading in the race! Perhaps it is due to unexpected snow. Perhaps it is due to video cameras that have been installed along the motorway which register speed limit breaking. Perhaps it is due to the fact that Vanya threatened to junk the Huff-puffer unless the car wins. Whatever the reason is, the Huff-puffer is leading, and jealous people together with other contestants wrack their brains trying to think of a way to stop that outrage.One way to do this is to mine the next petrol station where Vanya will stop. Your task is to calculate at which station this will happen and warn Vanya. You don't know theαnumber, however, you are given the succession of the numbers of the stations where Vanya has stopped. Find the number of the station where the next stop will be.InputThe first line contains an integern(1 ≤n≤ 1000) which represents the number of petrol stations where Vanya has stopped. The next line hasnspace-separated integers which represent the numbers of the stations. The numbers are positive and do not exceed106, they are given in the increasing order. No two numbers in the succession match. It is guaranteed that there exists at least one numberα ≥ 10, to which such a succession of stops corresponds.OutputPrint in the first line \"unique\" (without quotes) if the answer can be determined uniquely. In the second line print the number of the station where the next stop will take place. If the answer is not unique, print in the first line \"not unique\".ExamplesInput31 2 4Outputunique5Input21 2Outputnot uniqueNoteIn the second example the answer is not unique. For example, ifα = 10, we'll have such a sequence as1,2,3, and ifα = 14, the sequence will be1,2,4.",
    "source": "CF",
    "vjudge": false
}