{
    "uid": "48-F",
    "url": "https://codeforces.com/contest/48/problem/F",
    "tags": [
        "greedy",
        " sortings"
    ],
    "title": "48-F",
    "statement": "F. Snow sellerstime limit per test10 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe New Year celebrations in Berland lastndays. Only this year the winter is snowless, that’s why the winter celebrations’ organizers should buy artificial snow. There aremsnow selling companies in Berland. Every day thei-th company produceswicubic meters of snow. Next day the snow thaws and the company has to producewicubic meters of snow again. During the celebration new year discounts are on, that’s why the snow cost decreases every day. It is known that on the first day the total cost of all the snow produced by thei-th company is equal tocibourles. Every day this total cost decreases byaibourles, i.e. on the second day it is equal toci-ai,and on the third day — toci- 2ai, and so on. It is known that for one company the cost of the snow produced by it does not get negative or equal to zero. You have to organize the snow purchase so as to buy every day exactlyWsnow cubic meters. At that it is not necessary to buy from any company all the snow produced by it. If you buynicubic meters of snow (0 ≤ni≤wi, the numberniis not necessarily integer!) from thei-th company at one of the days when the cost of its snow is equal tosi, then its price will total tobourles. During one day one can buy the snow from several companies. In different days one can buy the snow from different companies. It is required to make the purchases so as to spend as little money as possible. It is guaranteed that the snow produced by the companies will be enough.InputThe first line contains integersn,mandW(1 ≤n≤ 100,1 ≤m≤ 500000,1 ≤W≤ 109) which represent the number of days, the number of companies and the amount of snow that needs to be purchased on every one of thendays. The second line containsmintegerswi. The third line containsmintegersci. The fourth line containsmintegersai. All the numbers are strictly positive and do not exceed109. For all theithe inequationci- (n- 1)ai> 0holds true.OutputPrint a single number — the answer to the given problem. Print the answer in the format with the decimal point (even if the answer is integer, it must contain the decimal point), without \"e\" and without leading zeroes. The answer should differ with the right one by no more than10- 9.ExamplesInput2 3 104 4 45 5 81 2 5Output22.000000000000000Input100 2 1000000000999999998 9999999991000000000 10000000001 1Output99999995149.999995249999991",
    "source": "CF",
    "vjudge": false
}