{
    "uid": "48-G",
    "url": "https://codeforces.com/contest/48/problem/G",
    "tags": [
        "dp",
        " trees",
        " two pointers"
    ],
    "title": "48-G",
    "statement": "G. Galaxy Uniontime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn a far away galaxy there areninhabited planets numbered with numbers from1ton. One day the presidents of all thenplanets independently from each other came up with an idea of creating the Galaxy Union. Now they need to share this wonderful idea with their galaxymates, that’s why each president is busy working out a project of negotiating with the other presidents.For negotiations between some pairs of the planets there are bidirectional communication channels, each of which is characterized with \"dial duration\"tiwhich, as a rule, takes several hours and exceeds the call duration greatly. Overall the galaxy hasncommunication channels and they unite all the planets into a uniform network. That means that it is possible to phone to any planetvfrom any planetu, perhaps, using some transitional planetsv1,v2, ...,vmvia the existing channels betweenuandv1,v1andv2, ...,vm- 1andvm,vmandv. At that the dial duration fromutovwill be equal to the sum of dial durations of the used channels.So, every president has to talk one by one to the presidents of all the restn- 1planets. At that the negotiations take place strictly consecutively, and until the negotiations with a planet stop, the dial to another one does not begin. As the matter is urgent, from the different ways to call the needed planet every time the quickest one is chosen. Little time is needed to assure another president on the importance of the Galaxy Union, that’s why the duration of the negotiations with each planet can be considered equal to the dial duration time for those planets. As the presidents know nothing about each other’s plans, they do not take into consideration the possibility that, for example, the sought president may call himself or already know about the founding of the Galaxy Union from other sources.The governments of all thenplanets asked you to work out the negotiation plans. First you are to find out for every president how much time his supposed negotiations will take.InputThe first line contains an integern(3 ≤n≤ 200000) which represents the number of planets in the Galaxy and the number of communication channels equal to it. The nextnlines contain three integers eachai,biandti(1 ≤ai,bi≤n,ai≠bi, 1 ≤ti≤ 103) that represent the numbers of planet joined by a communication channel and its \"dial duration\". There can be no more than one communication channel between a pair of planets.OutputIn the first line outputnintegers — the durations of the supposed negotiations for each president. Separate the numbers by spaces.ExamplesInput31 2 32 3 21 3 1Output4 5 3Input31 2 32 3 21 3 5Output8 5 7Input41 2 32 3 23 4 14 1 4Output12 8 8 8",
    "source": "CF",
    "vjudge": false
}