{
    "uid": "482-E",
    "url": "https://codeforces.com/contest/482/problem/E",
    "tags": [
        "data structures",
        " trees"
    ],
    "title": "482-E",
    "statement": "E. ELCAtime limit per test8 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou have a root tree containingnvertexes. Let's number the tree vertexes with integers from1ton. The tree root is in the vertex1.Each vertex (except fot the tree root)vhas a direct ancestorpv. Also each vertexvhas its integer valuesv.Your task is to perform following queries:Pvu(u≠v). Ifuisn't in subtree ofv, you must perform the assignmentpv=u. Otherwise you must perform assignmentpu=v. Note that after this query the graph continues to be a tree consisting ofnvertexes.Vvt. Perform assignmentsv=t.Your task is following. Before starting performing queries and after each query you have to calculate expected value written on the lowest common ancestor of two equiprobably selected verticesiandj. Here lowest common ancestor ofiandjis the deepest vertex that lies on the both of the path from the root to vertexiand the path from the root to vertexj. Please note that the verticesiandjcan be the same (in this case their lowest common ancestor coincides with them).InputThe first line of the input contains integern(2 ≤n≤ 5·104) — the number of the tree vertexes.The second line containsn- 1integerp2,p3, ...,pn(1 ≤pi≤n) — the description of the tree edges. It is guaranteed that those numbers form a tree.The third line containsnintegers —s1,s2, ...sn(0 ≤si≤ 106) — the values written on each vertex of the tree.The next line contains integerq(1 ≤q≤ 5·104) — the number of queries. Each of the followingqlines contains the description of the query in the format described in the statement. It is guaranteed that query argumentsuandvlie between1andn. It is guaranteed that argumenttin the queries of typeVmeets limits0 ≤t≤ 106.OutputPrintq+ 1number — the corresponding expected values. Your answer will be considered correct if its absolute or relative error doesn't exceed10- 9.ExamplesInput51 2 2 11 2 3 4 55P 3 4P 4 5V 2 3P 5 2P 1 4Output1.6400000001.8000000002.2800000002.3200000002.8000000001.840000000NoteNote that in the queryPvuifulies in subtree ofvyou must perform assignmentpu=v. An example of such case is the last query in the sample.",
    "source": "CF",
    "vjudge": false
}