{
    "uid": "484-C",
    "url": "https://codeforces.com/contest/484/problem/C",
    "tags": [
        "implementation",
        " math"
    ],
    "title": "484-C",
    "statement": "C. Strange Sortingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutHow many specific orders do you know? Ascending order, descending order, order of ascending length, order of ascending polar angle... Let's have a look at another specific order:d-sorting. This sorting is applied to the strings of length at leastd, wheredis some positive integer. The characters of the string are sorted in following manner: first come all the 0-th characters of the initial string, then the 1-st ones, then the 2-nd ones and so on, in the end go all the(d- 1)-th characters of the initial string. By thei-th characters we mean all the character whose positions are exactlyimodulod. If two characters stand on the positions with the same remainder of integer division byd, their relative order after the sorting shouldn't be changed. The string is zero-indexed. For example, for string 'qwerty':Its 1-sorting is the string 'qwerty' (all characters stand on 0 positions),Its 2-sorting is the string 'qetwry' (characters 'q', 'e' and 't' stand on 0 positions and characters 'w', 'r' and 'y' are on 1 positions),Its 3-sorting is the string 'qrwtey' (characters 'q' and 'r' stand on 0 positions, characters 'w' and 't' stand on 1 positions and characters 'e' and 'y' stand on 2 positions),Its 4-sorting is the string 'qtwyer',Its 5-sorting is the string 'qywert'.You are given stringSof lengthnandmshufflingoperations of this string. Eachshufflingoperation accepts two integer argumentskanddand transforms stringSas follows. For eachifrom0ton-kin the increasing order we apply the operation ofd-sorting to the substringS[i..i+k- 1]. HereS[a..b]represents a substring that consists of characters on positions fromatobinclusive.After eachshufflingoperation you need to print stringS.InputThe first line of the input contains a non-empty stringSof lengthn, consisting of lowercase and uppercase English letters and digits from 0 to 9.The second line of the input contains integerm– the number ofshufflingoperations (1 ≤m·n≤ 106).Followingmlines contain the descriptions of the operations consisting of two integerskandd(1 ≤d≤k≤n).OutputAfter each operation print the current state of stringS.ExamplesInputqwerty34 26 35 2OutputqertwyqtewryqetyrwNoteHere is detailed explanation of the sample. The first modification is executed with argumentsk= 4,d= 2. That means that you need to apply 2-sorting for each substring of length 4 one by one moving from the left to the right. The string will transform in the following manner:qwerty→qewrty→qerwty→qertwyThus, stringSequals 'qertwy' at the end of first query.The second modification is executed with argumentsk= 6,d= 3. As a result of this operation the whole stringSis replaced by its 3-sorting:qertwy→qtewryThe third modification is executed with argumentsk= 5,d= 2.qtewry→qertwy→qetyrw",
    "source": "CF",
    "vjudge": false
}