{
    "uid": "486-E",
    "url": "https://codeforces.com/contest/486/problem/E",
    "tags": [
        "data structures",
        " dp",
        " greedy",
        " hashing",
        " math"
    ],
    "title": "486-E",
    "statement": "E. LIS of Sequencetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe next \"Data Structures and Algorithms\" lesson will be about Longest Increasing Subsequence (LIS for short) of a sequence. For better understanding, Nam decided to learn it a few days before the lesson.Nam created a sequenceaconsisting ofn(1 ≤n≤ 105) elementsa1,a2, ...,an(1 ≤ai≤ 105). A subsequenceai1,ai2, ...,aikwhere1 ≤i1<i2< ... <ik≤nis called increasing ifai1<ai2<ai3< ... <aik. An increasing subsequence is called longest if it has maximum length among all increasing subsequences.Nam realizes that a sequence may have several longest increasing subsequences. Hence, he divides all indexesi(1 ≤i≤n), into three groups:group of allisuch thataibelongs to no longest increasing subsequences.group of allisuch thataibelongs to at least onebut not everylongest increasing subsequence.group of allisuch thataibelongs to every longest increasing subsequence.Since the number of longest increasing subsequences ofamay be very large, categorizing process is very difficult. Your task is to help him finish this job.InputThe first line contains the single integern(1 ≤n≤ 105) denoting the number of elements of sequencea.The second line containsnspace-separated integersa1,a2, ...,an(1 ≤ai≤ 105).OutputPrint a string consisting ofncharacters.i-th character should be '1', '2' or '3' depending on which group among listed above indexibelongs to.ExamplesInput14Output3Input41 3 2 5Output3223Input41 5 2 3Output3133NoteIn the second sample, sequenceaconsists of 4 elements:{a1,a2,a3,a4}={1, 3, 2, 5}. Sequenceahas exactly 2 longest increasing subsequences of length 3, they are{a1,a2,a4}={1, 3, 5}and{a1,a3,a4}={1, 2, 5}.In the third sample, sequenceaconsists of 4 elements:{a1,a2,a3,a4}={1, 5, 2, 3}. Sequenceahave exactly 1 longest increasing subsequence of length 3, that is{a1,a3,a4}={1, 2, 3}.",
    "source": "CF",
    "vjudge": false
}