{
    "uid": "500-C",
    "url": "https://codeforces.com/contest/500/problem/C",
    "tags": [
        "constructive algorithms",
        " greedy",
        " implementation",
        " math"
    ],
    "title": "500-C",
    "statement": "C. New Year Book Readingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutNew Year is coming, and Jaehyun decided to read many books during 2015, unlike this year. He hasnbooks numbered by integers from 1 ton. The weight of thei-th (1 ≤i≤n) book iswi.As Jaehyun's house is not large enough to have a bookshelf, he keeps thenbooks by stacking them vertically. When he wants to read a certain bookx, he follows the steps described below.Heliftsall the books above bookx.He pushes bookxout of the stack.He puts down the lifted books without changing their order.After reading bookx, he puts bookxon the top of the stack.He decided to read books formdays. In thej-th (1 ≤j≤m) day, he will read the book that is numbered with integerbj(1 ≤bj≤n). To read the book, he has to use the process described in the paragraph above. It is possible that he decides to re-read the same book several times.After making this plan, he realized that the total weight of books he shouldliftduringmdays would be too heavy. So, he decided to change the order of the stacked books before the New Year comes, and minimize the total weight. You may assume that books can be stacked in any possible order. Note that book that he is going to read on certain step isn't considered asliftedon that step. Can you help him?InputThe first line contains two space-separated integersn(2 ≤n≤ 500) andm(1 ≤m≤ 1000) — the number of books, and the number of days for which Jaehyun would read books.The second line containsnspace-separated integersw1,w2, ...,wn(1 ≤wi≤ 100) — the weight of each book.The third line containsmspace separated integersb1,b2, ...,bm(1 ≤bj≤n) — the order of books that he would read. Note that he can read the same book more than once.OutputPrint the minimum total weight of books he shouldlift, which can be achieved by rearranging the order of stacked books.ExamplesInput3 51 2 31 3 2 3 1Output12NoteHere's a picture depicting the example. Each vertical column presents the stacked books.",
    "source": "CF",
    "vjudge": false
}