{
    "uid": "507-E",
    "url": "https://codeforces.com/contest/507/problem/E",
    "tags": [
        "dfs and similar",
        " dp",
        " graphs",
        " shortest paths"
    ],
    "title": "507-E",
    "statement": "E. Breaking Goodtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBreaking Good is a new video game which a lot of gamers want to have. There is a certain level in the game that is really difficult even for experienced gamers.Walter William, the main character of the game, wants to join a gang called Los Hermanos (The Brothers). The gang controls the whole country which consists ofncities withmbidirectional roads connecting them. There is no road is connecting a city to itself and for any two cities there is at most one road between them. The country is connected, in the other words, it is possible to reach any city from any other city using the given roads.The roads aren't all working. There are some roads which need some more work to be performed to be completely functioning.The gang is going to rob a bank! The bank is located in city1. As usual, the hardest part is to escape to their headquarters where the police can't get them. The gang's headquarters is in cityn. To gain the gang's trust, Walter is in charge of this operation, so he came up with a smart plan.First of all the path which they are going to use on their way back from city1to their headquartersnmust beas short as possible, since it is important to finish operation as fast as possible.Then, gang has to blow up all other roads in country that don't lay on this path, in order to prevent any police reinforcements. In case of non-working road, they don't have to blow up it as it is already malfunctional.If the chosen path has some roads that doesn't work they'll have to repair those roads before the operation.Walter discovered that there was a lot of paths that satisfied the condition of being shortest possible so he decided to choose among them a path that minimizes the total number of affected roads (both roads that have to be blown up and roads to be repaired).Can you help Walter complete his task and gain the gang's trust?InputThe first line of input contains two integersn,m(2 ≤n≤ 105,), the number of cities and number of roads respectively.In followingmlines there are descriptions of roads. Each description consists of three integersx,y,z(1 ≤x,y≤n,) meaning that there is a road connecting cities numberxandy. Ifz= 1, this road is working, otherwise it is not.OutputIn the first line output one integerk, the minimum possible number of roads affected by gang.In the followingklines output three integers describing roads that should be affected. Each line should contain three integersx,y,z(1 ≤x,y≤n,), cities connected by a road and the new state of a road.z= 1indicates that the road between citiesxandyshould be repaired andz= 0means that road should be blown up.You may output roads in any order. Each affected road should appear exactly once. You may output cities connected by a single road in any order. If you output a road, it's original state should be different fromz.After performing all operations accroding to your plan, there should remain working only roads lying on some certain shortest past between city1andn.If there are multiple optimal answers output any.ExamplesInput2 11 2 0Output11 2 1Input4 41 2 11 3 02 3 13 4 1Output31 2 01 3 12 3 0Input8 91 2 08 3 02 3 11 4 18 7 01 5 14 6 15 7 06 8 0Output32 3 01 5 06 8 1NoteIn the first test the only path is1 - 2In the second test the only shortest path is1 - 3 - 4In the third test there are multiple shortest paths but the optimal is1 - 4 - 6 - 8",
    "source": "CF",
    "vjudge": false
}