{
    "uid": "510-C",
    "url": "https://codeforces.com/contest/510/problem/C",
    "tags": [
        "dfs and similar",
        " graphs",
        " sortings"
    ],
    "title": "510-C",
    "statement": "C. Fox And Namestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutFox Ciel is going to publish a paper on FOCS (Foxes Operated Computer Systems, pronounce: \"Fox\"). She heard a rumor: the authors list on the paper is always sorted in thelexicographicalorder.After checking some examples, she found out that sometimes it wasn't true. On some papers authors' names weren't sorted inlexicographicalorder in normal sense. But it was always true that after some modification of the order of letters in alphabet, the order of authors becomeslexicographical!She wants to know, if there exists an order of letters in Latin alphabet such that the names on the paper she is submitting are following in thelexicographicalorder. If so, you should find out any such order.Lexicographicalorder is defined in following way. When we comparesandt, first we find the leftmost position with differing characters:si≠ti. If there is no such position (i. e.sis a prefix oftor vice versa) the shortest string is less. Otherwise, we compare characterssiandtiaccording to their order in alphabet.InputThe first line contains an integern(1 ≤n≤ 100): number of names.Each of the followingnlines contain one stringnamei(1 ≤ |namei| ≤ 100), thei-th name. Each name contains only lowercase Latin letters. All names are different.OutputIf there exists such order of letters that the given names are sorted lexicographically, output any such order as a permutation of characters 'a'–'z' (i. e. first output the first letter of the modified alphabet, then the second, and so on).Otherwise output a single word \"Impossible\" (without quotes).ExamplesInput3rivestshamiradlemanOutputbcdefghijklmnopqrsatuvwxyzInput10touristpetrwjmzbmryeputonsvepifanovscottwuoooooooooooooooosubscriberrowdarktankengineerOutputImpossibleInput10petregorendagorionfeferivanilovetanyaromanovakostkadmitriyhmaratsnowbearbredorjaguarturnikcgyforeverOutputaghjlnopefikdmbcqrstuvwxyzInput7carcarecarefulcarefullybecarefuldontforgetsomethingotherwiseyouwillbehackedgoodluckOutputacbdefhijklmnogpqrstuvwxyz",
    "source": "CF",
    "vjudge": false
}