{
    "uid": "513-C",
    "url": "https://codeforces.com/contest/513/problem/C",
    "tags": [
        "bitmasks",
        " probabilities"
    ],
    "title": "513-C",
    "statement": "C. Second price auctiontime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutNowadays, most of the internet advertisements are not statically linked to a web page. Instead, what will be shown to the person opening a web page is determined within 100 milliseconds after the web page is opened. Usually, multiple companies compete for each ad slot on the web page in an auction. Each of them receives a request with details about the user, web page and ad slot and they have to respond within those 100 milliseconds with a bid they would pay for putting an advertisement on that ad slot. The company that suggests the highest bid wins the auction and gets to place its advertisement. If there are several companies tied for the highest bid, the winner gets picked at random.However, the company that won the auction does not have to pay the exact amount of its bid. In most of the cases, a second-price auction is used. This means that the amount paid by the company is equal to the maximum of all the other bids placed for this ad slot.Let's consider one such bidding. There arencompanies competing for placing an ad. Thei-th of these companies will bid an integer number of microdollars equiprobably randomly chosen from the range betweenLiandRi, inclusive. In the other words, the value of thei-th company bid can be any integer from the range[Li,Ri]with the same probability.Determine the expected value that the winner will have to pay in a second-price auction.InputThe first line of input contains an integer numbern(2 ≤n≤ 5).nlines follow, thei-th of them containing two numbersLiandRi(1 ≤Li≤Ri≤ 10000) describing thei-th company's bid preferences.This problem doesn't have subproblems. You will get 8 points for the correct submission.OutputOutput the answer with absolute or relative error no more than1e- 9.ExamplesInput34 78 105 5Output5.7500000000Input32 53 41 6Output3.5000000000NoteConsider the first example. The first company bids a random integer number of microdollars in range[4, 7]; the second company bids between8and10, and the third company bids5microdollars. The second company will win regardless of the exact value it bids, however the price it will pay depends on the value of first company's bid. With probability0.5the first company will bid at most5microdollars, and the second-highest price of the whole auction will be5. With probability0.25it will bid6microdollars, and with probability0.25it will bid7microdollars. Thus, the expected value the second company will have to pay is0.5·5 + 0.25·6 + 0.25·7 = 5.75.",
    "source": "CF",
    "vjudge": false
}