{
    "uid": "527-E",
    "url": "https://codeforces.com/contest/527/problem/E",
    "tags": [
        "dfs and similar",
        " graphs"
    ],
    "title": "527-E",
    "statement": "E. Data Center Dramatime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe project of a data center of a Big Software Company consists ofncomputers connected bymcables. Simply speaking, each computer can be considered as a box with multiple cables going out of the box. Very Important Information is transmitted along each cable in one of the two directions. As the data center plan is not yet approved, it wasn't determined yet in which direction information will go along each cable. The cables are put so that each computer is connected with each one, perhaps through some other computers.The person in charge of the cleaning the data center will be Claudia Ivanova, the janitor. She loves to tie cables into bundles using cable ties. For some reasons, she groups the cables sticking out of a computer into groups of two, and if it isn't possible, then she gets furious and attacks the computer with the water from the bucket.It should also be noted that due to the specific physical characteristics of the Very Important Information, it is strictly forbidden to connect in one bundle two cables where information flows in different directions.The management of the data center wants to determine how to send information along each cable so that Claudia Ivanova is able to group all the cables coming out of each computer into groups of two, observing the condition above. Since it may not be possible with the existing connections plan, you are allowed to add the minimum possible number of cables to the scheme, and then you need to determine the direction of the information flow for each cable (yes, sometimes data centers are designed based on the janitors' convenience...)InputThe first line contains two numbers,nandm(1 ≤n≤ 100 000,1 ≤m≤ 200 000) — the number of computers and the number of the already present cables, respectively.Each of the next lines contains two numbersai,bi(1 ≤ai,bi≤n) — the indices of the computers connected by thei-th cable. The data centers often have a very complex structure, so a pair of computers may have more than one pair of cables between them and some cables may connect a computer with itself.OutputIn the first line print a single numberp(p≥m) — the minimum number of cables in the final scheme.In each of the nextplines print a pair of numbersci,di(1 ≤ci,di≤n), describing another cable. Such entry means that information will go along a certain cable in direction fromcitodi.Among the cables you printed there should be all the cables presented in the original plan in some of two possible directions. It is guaranteed that there is a solution wherepdoesn't exceed500 000.If there are several posible solutions with minimum possible value ofp, print any of them.ExamplesInput4 61 22 33 44 11 31 3Output61 23 41 43 21 31 3Input3 41 22 31 13 3Output62 12 31 13 33 11 1NotePicture for the first sample test. The tied pairs of cables are shown going out from the same point.Picture for the second test from the statement. The added cables are drawin in bold.Alternative answer for the second sample test:",
    "source": "CF",
    "vjudge": false
}