{
    "uid": "536-D",
    "url": "https://codeforces.com/contest/536/problem/D",
    "tags": [
        "dp",
        " games"
    ],
    "title": "536-D",
    "statement": "D. Tavas in Kansastime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputTavas lives in Kansas. Kansas hasncities numbered from 1 tonconnected withmbidirectional roads. We can travel from any city to any other city via these roads. Kansas is as strange as Tavas. So there may be a road between a city and itself or more than one road between two cities.Tavas invented a game and called it \"Dashti\". He wants to play Dashti with his girlfriends, Nafas.In this game, they assign an arbitrary integer value to each city of Kansas. The value ofi-th city equals topi.During the game, Tavas is in citysand Nafas is in cityt. They play in turn and Tavas goes first. A player in his/her turn, must choose a non-negative integerxand his/her score increases by the sum of values of all cities with (shortest) distance no more thanxfrom his/her city. Each city may be used once, or in the other words, after first time a player gets score from a city, city score becomes zero.There is an additional rule: the player must choosexsuch that he/she gets the point of at least one city that was not used before. Note that city may initially have value 0, such city isn't considered as been used at the beginning of the game, i. e. each player may use it to fullfill this rule.The game ends when nobody can make a move.A player's score is the sum of the points he/she earned during the game. The winner is the player with greater score, or there is a draw if players score the same value. Both players start game with zero points.If Tavas wins, he'll break his girlfriend's heart, and if Nafas wins, Tavas will cry. But if their scores are equal, they'll be happy and Tavas will give Nafas flowers.They're not too emotional after all, so they'll play optimally. Your task is to tell Tavas what's going to happen after the game ends.InputThe first line of input contains two integersnandm(2 ≤n≤ 2000,n- 1 ≤m≤ 105).The second line of input contains two integerssandt(1 ≤s,t≤n,s≠t).The next line containsnintegersp1,p2, ...,pnseparated by spaces (|pi| ≤ 109).The nextmlines contain the roads. Each line contains three integersv,u,wand it means that there's an road with lengthwbetween citiesvandu(1 ≤u,v≤nand0 ≤w≤ 109). The road may lead from the city to itself, there may be several roads between each pair of cities.OutputIf Tavas wins, print \"Break a heart\". If Nafas wins print \"Cry\" and if nobody wins (i. e. the game ended with draw) print \"Flowers\".ExamplesInput4 41 23 2 5 -111 4 23 4 23 1 53 2 1OutputCryInput5 41 22 2 -5 -4 61 2 42 3 52 4 24 5 2OutputBreak a heartInput2 11 2-5 -51 2 10OutputFlowers",
    "source": "CF",
    "vjudge": false
}