{
    "uid": "538-C",
    "url": "https://codeforces.com/contest/538/problem/C",
    "tags": [
        "binary search",
        " brute force",
        " greedy",
        " implementation",
        " math"
    ],
    "title": "538-C",
    "statement": "C. Tourist's Notestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA tourist hiked along the mountain range. The hike lasted forndays, during each day the tourist noted height above the sea level. On thei-th day height was equal to some integerhi. The tourist pick smooth enough route for his hike, meaning that the between any two consecutive days height changes by at most 1, i.e. for alli's from 1 ton- 1the inequality|hi-hi+ 1| ≤ 1holds.At the end of the route the tourist rafted down a mountain river and some notes in the journal were washed away. Moreover, the numbers in the notes could have been distorted. Now the tourist wonders what could be the maximum height during his hike. Help him restore the maximum possible value of the maximum height throughout the hike or determine that the notes were so much distorted that they do not represent any possible height values that meet limits|hi-hi+ 1| ≤ 1.InputThe first line contains two space-separated numbers,nandm(1 ≤n≤ 108,1 ≤m≤ 105) — the number of days of the hike and the number of notes left in the journal.Nextmlines contain two space-separated integersdiandhdi(1 ≤di≤n,0 ≤hdi≤ 108) — the number of the day when thei-th note was made and height on thedi-th day. It is guaranteed that the notes are given in the chronological order, i.e. for allifrom 1 tom- 1the following condition holds:di<di+ 1.OutputIf the notes aren't contradictory, print a single integer — the maximum possible height value throughout the whole route.If the notes do not correspond to any set of heights, print a single word 'IMPOSSIBLE' (without the quotes).ExamplesInput8 22 07 0Output2Input8 32 07 08 3OutputIMPOSSIBLENoteFor the first sample, an example of a correct height sequence with a maximum of 2:(0, 0, 1, 2, 1, 1, 0, 1).In the second sample the inequality betweenh7andh8does not hold, thus the information is inconsistent.",
    "source": "CF",
    "vjudge": false
}