{
    "uid": "549-F",
    "url": "https://codeforces.com/contest/549/problem/F",
    "tags": [
        "data structures",
        " divide and conquer"
    ],
    "title": "549-F",
    "statement": "F. Yura and Developerstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYura has a team ofkdevelopers and a list ofntasks numbered from1ton. Yura is going to choose some tasks to be done this week. Due to strange Looksery habits the numbers of chosen tasks should be a segment of consecutive integers containingno less than 2 numbers, i. e. a sequence of forml,l+ 1, ...,rfor some1 ≤l<r≤n.Every taskihas an integer numberaiassociated with it denoting how many man-hours are required to complete thei-th task. Developers are not self-confident at all, and they are actually afraid of difficult tasks. Knowing that, Yura decided to pick up a hardest task (the one that takes the biggest number of man-hours to be completed, among several hardest tasks with same difficulty level he chooses arbitrary one) and complete it on his own. So, if tasks with numbers[l,r]are chosen then the developers are left withr-ltasks to be done by themselves.Every developer can spend any integer amount of hours over any task, but when they are done with the whole assignment there should be exactlyaiman-hours spent over thei-th task.The last, but not the least problem with developers is that one gets angry if he works more than another developer. A set of tasks[l,r]is consideredgoodif it is possible to find such a distribution of work that allows to complete all the tasks and to have every developer working for the same amount of time (amount of work performed by Yura doesn't matter for other workers as well as for him).For example, let's suppose that Yura have chosen tasks with following difficulties:a= [1, 2, 3, 4], and he has three developers in his disposal. He takes the hardest fourth task to finish by himself, and the developers are left with tasks with difficulties[1, 2, 3]. If the first one spends an hour on the first task and an hour on the third one, the second developer spends two hours on the second task and the third developer spends two hours on the third task, then they are done, since every developer worked exactly for two hours and every task has been worked over for the required amount of time. As another example, if the first task required two hours instead of one to be completed then it would be impossible to assign the tasks in a way described above.Besides work, Yura is fond of problem solving. He wonders how many pairs(l,r)(1 ≤l<r≤n) exists such that a segment[l,r]isgood? Yura has already solved this problem, but he has no time to write the code. Please, help Yura and implement the solution for this problem.InputThe first line of input contains two positive integers:nandk(1 ≤n≤ 300 000, 1 ≤k≤ 1 000 000), the number of tasks in the list and the number of developers in Yura's disposal.The second line containsnintegersai(1 ≤ai≤ 109).OutputOutput a single integer — the number of pairs(l,r)satisfying the conditions from the statement.ExamplesInput4 31 2 3 4Output3Input4 24 4 7 4Output6NoteIn the first sample there are three good segments:[1;3]— the hardest task requires3man-hours, so there are tasks left that require1and2man-hours. A solution is to make first developer work on the first task for an hour, while second and third developers work on the second task. Each developer works exactly one hour.[1;4]— the hardest task requires4man-hours, so there are tasks left that require1,2and3man-hours. If the first developer spends an hour on the first task and an hour on the third one, the second developer spends two hours on the second task and the third developer spends two hours on the third task, then they are done, since every developer worked exactly for two hours.[3;4]— the hardest task requires4man-hours, so there is only one task left that requires3man-hours. A solution is to make each developer work for an hour.",
    "source": "CF",
    "vjudge": false
}