{
    "uid": "549-G",
    "url": "https://codeforces.com/contest/549/problem/G",
    "tags": [
        "constructive algorithms",
        " greedy",
        " sortings"
    ],
    "title": "549-G",
    "statement": "G. Happy Linetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputDo you like summer? Residents of Berland do. They especially love eating ice cream in the hot summer. So this summer day a large queue ofnBerland residents lined up in front of the ice cream stall. We know that each of them has a certain amount of berland dollars with them. The residents of Berland are nice people, so each person agrees to swap places with the person right behind him for just 1 dollar. More formally, if personastands just behind personb, then personacan pay personb1 dollar, thenaandbget swapped. Of course, if personahas zero dollars, he can not swap places with personb.Residents of Berland are strange people. In particular, they get upset when there is someone with astrictly smallersum of money in the line in front of them.Can you help the residents of Berland form such order in the line so that they were allhappy? Ahappyresident is the one who stands first in the line or the one in front of who another resident stands withnot lessnumber of dollars. Note that the people of Berland are people of honor and they agree to swap places only in the manner described above.InputThe first line contains integern(1 ≤n≤ 200 000) — the number of residents who stand in the line.The second line containsnspace-separated integersai(0 ≤ai≤ 109), whereaiis the number of Berland dollars of a man standing on thei-th position in the line. The positions are numbered starting from theendof the line.OutputIf it is impossible to make all the residents happy, print\":(\"without the quotes. Otherwise, print in the single linenspace-separated integers, thei-th of them must be equal to the number of money of the person on positioniin the new line. If there are multiple answers, print any of them.ExamplesInput211 8Output9 10Input510 9 7 10 6Output:(Input312 3 3Output4 4 10NoteIn the first sample two residents should swap places, after that the first resident has 10 dollars and he is at the head of the line and the second resident will have 9 coins and he will be at the end of the line.In the second sample it is impossible to achieve the desired result.In the third sample the first person can swap with the second one, then they will have the following numbers of dollars:4 11 3, then the second person (in the new line) swaps with the third one, and the resulting numbers of dollars will equal to:4 4 10. In this line everybody will be happy.",
    "source": "CF",
    "vjudge": false
}