{
    "uid": "553-E",
    "url": "https://codeforces.com/contest/553/problem/E",
    "tags": [
        "dp",
        " fft",
        " graphs",
        " math",
        " probabilities"
    ],
    "title": "553-E",
    "statement": "E. Kyoya and Traintime limit per test8 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputKyoya Ootori wants to take the train to get to school. There arentrain stations andmone-way train lines going between various stations. Kyoya is currently at train station1, and the school is at stationn. To take a train, he must pay for a ticket, and the train also takes a certain amount of time. However, the trains are not perfect and take random amounts of time to arrive at their destination. If Kyoya arrives at school strictly afterttime units, he will have to pay a fine ofx.Each train line is described by a ticket price, and a probability distribution on the time the train takes. More formally, train lineihas ticket costci, and a probability distributionpi,kwhich denotes the probability that this train will takektime units for all1 ≤k≤t. Amounts of time that each of the trains used by Kyouya takes are mutually independent random values (moreover, if Kyoya travels along the same train more than once, it is possible for the train to take different amounts of time and those amounts are also independent one from another).Kyoya wants to get to school by spending the least amount of money in expectation (for the ticket price plus possible fine for being late). Of course, Kyoya has an optimal plan for how to get to school, and every time he arrives at a train station, he may recalculate his plan based on how much time he has remaining. What is the expected cost that Kyoya will pay to get to school if he moves optimally?InputThe first line of input contains four integersn,m,t,x(2  ≤n≤ 50,1 ≤m≤ 100,1 ≤t≤ 20 000,0 ≤x≤ 106).The next2mlines contain the description of the trains.The2i-th line will have3integersai,bi,ci, representing a one way train from stationaitobiwith ticket costci(1 ≤ai,bi≤n,ai≠bi,0 ≤ci≤ 106). There will always be at least one path from any station to the school.The(2i+ 1)-th line will containtintegers,pi, 1,pi, 2, ...,pi,twherepi,k/ 100000is the probability that this train will takekunits of time to traverse (0 ≤pi,k≤ 100 000for1 ≤k≤t,).It is guaranteed that there is no more than one train between each pair of platforms in each of the directions.OutputPrint a single real number that is equal to an optimal expected cost of getting to school. The answer will be considered correct if its relative or absolute error doesn't exceed10- 6.ExamplesInput4 4 5 11 2 050000 0 50000 0 02 3 010000 0 0 0 900003 4 0100000 0 0 0 02 4 00 0 0 50000 50000Output0.7000000000Input4 4 5 11 2 10050000 0 50000 0 02 3 10010000 0 0 0 900003 4 100100000 0 0 0 02 4 1000 0 0 50000 50000Output200.7500000000NoteThe optimal strategy in the first case is as follows:First, travel along first train line. With probability1 / 2Kyoya will take1time unit. Otherwise, Kyoya will take3time units.If the train takes1time unit, travel along the 4th train line. Kyoya will make it to school in time with probability1 / 2. Otherwise, if the train takes 3 time units, travel along the 2nd train line. Kyoya will make it to school in time with probability1 / 10.Since the cost of all train lines are zero, we can just look at the probability that Kyoya will incur the penalty. The probability that Kyoya will have to pay the penalty is1 / 2 × 1 / 2 + 1 / 2 × 9 / 10 = 7 / 10. We can show that no other strategy is strictly better.The optimal strategy in the second case is to travel along1 → 2 → 4no matter what. Kyoya will incur the penalty with probability3 / 4, and the cost of the trains is200, thus the expected cost is200.75.",
    "source": "CF",
    "vjudge": false
}