{
    "uid": "555-A",
    "url": "https://codeforces.com/contest/555/problem/A",
    "tags": [
        "implementation"
    ],
    "title": "555-A",
    "statement": "A. Case of Matryoshkastime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAndrewid the Android is a galaxy-famous detective. He is now investigating the case of vandalism at the exhibition of contemporary art.The main exhibit is a construction ofnmatryoshka dolls that can be nested one into another. The matryoshka dolls are numbered from1ton. A matryoshka with a smaller number can be nested in a matryoshka with a higher number, two matryoshkas can not be directly nested in the same doll, but there may be chain nestings, for example,1 → 2 → 4 → 5.In one second, you can perform one of the two following operations:Having a matryoshkaathat isn't nested in any other matryoshka and a matryoshkab, such thatbdoesn't contain any other matryoshka and is not nested in any other matryoshka, you may putainb;Having a matryoshkaadirectly contained in matryoshkab, such thatbis not nested in any other matryoshka, you may getaout ofb.According to the modern aesthetic norms the matryoshka dolls on display were assembled in a specific configuration, i.e. as several separate chains of nested matryoshkas, but the criminal, following the mysterious plan, took out all the dolls and assembled them into a single large chain (1 → 2 → ... →n). In order to continue the investigation Andrewid needs to know in what minimum time it is possible to perform this action.InputThe first line contains integersn(1 ≤n≤ 105) andk(1 ≤k≤ 105) — the number of matryoshkas and matryoshka chains in the initial configuration.The nextklines contain the descriptions of the chains: thei-th line first contains numbermi(1 ≤mi≤n), and thenminumbersai1,ai2, ...,aimi— the numbers of matryoshkas in the chain (matryoshkaai1is nested into matryoshkaai2, that is nested into matryoshkaai3, and so on till the matryoshkaaimithat isn't nested into any other matryoshka).It is guaranteed thatm1+m2+ ... +mk=n, the numbers of matryoshkas in all the chains are distinct, in each chain the numbers of matryoshkas follow in the ascending order.OutputIn the single line print the minimum number of seconds needed to assemble one large chain from the initial configuration.ExamplesInput3 22 1 21 3Output1Input7 33 1 3 72 2 52 4 6Output10NoteIn the first sample test there are two chains:1 → 2and3. In one second you can nest the first chain into the second one and get1 → 2 → 3.In the second sample test you need to disassemble all the three chains into individual matryoshkas in 2 + 1 + 1 = 4 seconds and then assemble one big chain in 6 seconds.",
    "source": "CF",
    "vjudge": false
}