{
    "uid": "557-E",
    "url": "https://codeforces.com/contest/557/problem/E",
    "tags": [
        "data structures",
        " dp",
        " graphs",
        " string suffix structures",
        " strings",
        " trees"
    ],
    "title": "557-E",
    "statement": "E. Ann and Half-Palindrometime limit per test1.5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputTomorrow Ann takes the hardest exam of programming where she should get an excellent mark.On the last theoretical class the teacher introduced the notion of ahalf-palindrome.Stringtis ahalf-palindrome, if for all the odd positionsi() the following condition is held:ti=t|t| -i+ 1, where|t|is the length of stringtif positions are indexed from1. For example, strings \"abaa\", \"a\", \"bb\", \"abbbaa\" are half-palindromes and strings \"ab\", \"bba\" and \"aaabaa\" are not.Ann knows that on the exam she will get strings, consisting only of lettersaandb, and numberk. To get an excellent mark she has to find thek-th in the lexicographical order string among all substrings ofsthat are half-palyndromes. Note that each substring in this order is considered as many times as many times it occurs ins.The teachers guarantees that the given numberkdoesn't exceed the number of substrings of the given string that are half-palindromes.Can you cope with this problem?InputThe first line of the input contains strings(1 ≤ |s| ≤ 5000), consisting only of characters 'a' and 'b', where|s|is the length of strings.The second line contains a positive integerk—  the lexicographical number of the requested string among all the half-palindrome substrings of the given strings. The strings are numbered starting from one.It is guaranteed that numberkdoesn't exceed the number of substrings of the given string that are half-palindromes.OutputPrint a substring of the given string that is thek-th in the lexicographical order of all substrings of the given string that are half-palindromes.ExamplesInputabbabaab7OutputabaaInputaaaaa10OutputaaaInputbbaabb13OutputbbaabbNoteBy definition, stringa=a1a2...anis lexicographically less than stringb=b1b2...bm, if eitherais a prefix ofband doesn't coincide withb, or there exists suchi, thata1=b1,a2=b2, ...ai- 1=bi- 1,ai<bi.In the first sample half-palindrome substrings are the following strings —a,a,a,a,aa,aba,abaa,abba,abbabaa,b,b,b,b,baab,bab,bb,bbab,bbabaab(the list is given in the lexicographical order).",
    "source": "CF",
    "vjudge": false
}