{
    "uid": "56-C",
    "url": "https://codeforces.com/contest/56/problem/C",
    "tags": [
        "data structures",
        " expression parsing",
        " implementation"
    ],
    "title": "56-C",
    "statement": "C. Corporation Mailtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Beroil corporation structure is hierarchical, that is it can be represented as a tree. Let's examine the presentation of this structure as follows:employee::=name.|name:employee1,employee2,...,employeek.name::= name of an employeeThat is, the description of each employee consists of his name, a colon (:), the descriptions of all his subordinates separated by commas, and, finally, a dot. If an employee has no subordinates, then the colon is not present in his description.For example, lineMIKE:MAX.,ARTEM:MIKE..,DMITRY:DMITRY.,DMITRY...is the correct way of recording the structure of a corporation where the directorMIKEhas subordinatesMAX,ARTEMandDMITRY.ARTEMhas a subordinate whose name isMIKE, just as the name of his boss and two subordinates ofDMITRYare calledDMITRY, just like himself.In the Beroil corporation every employee can only correspond with his subordinates, at that the subordinates are not necessarily direct. Let's call an uncomfortable situation the situation when a person whose name isswrites a letter to another person whose name is alsos. In the example given above are two such pairs: a pair involvingMIKE, and two pairs forDMITRY(a pair for each of his subordinates).Your task is by the given structure of the corporation to find the number of uncomfortable pairs in it.InputThe first and single line contains the corporation structure which is a string of length from 1 to 1000 characters. It is guaranteed that the description is correct. Every name is a string consisting of capital Latin letters from 1 to 10 symbols in length.OutputPrint a single number — the number of uncomfortable situations in the company.ExamplesInputMIKE:MAX.,ARTEM:MIKE..,DMITRY:DMITRY.,DMITRY...Output3InputA:A..Output1InputA:C:C:C:C.....Output6",
    "source": "CF",
    "vjudge": false
}