{
    "uid": "566-C",
    "url": "https://codeforces.com/contest/566/problem/C",
    "tags": [
        "dfs and similar",
        " divide and conquer",
        " trees"
    ],
    "title": "566-C",
    "statement": "C. Logistical Questionstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSome country consists ofncities, connected by a railroad network. The transport communication of the country is so advanced that the network consists of a minimum required number of(n- 1)bidirectional roads (in the other words, the graph of roads is a tree). Thei-th road that directly connects citiesaiandbi, has the length oflikilometers.The transport network is served by a state transporting company FRR (Fabulous Rail Roads). In order to simplify the price policy, it offers a single ride fare on the train. In order to follow the route of lengthtkilometers, you need to payburles. Note that it is forbidden to split a long route into short segments and pay them separately (a special railroad police, or RRP, controls that the law doesn't get violated).A Large Software Company decided to organize a programming tournament. Having conducted several online rounds, the company employees determined a list of finalists and sent it to the logistical department to find a place where to conduct finals. The Large Software Company can easily organize the tournament finals in any of thencities of the country, so the the main factor in choosing the city for the last stage of the tournament is the total cost of buying tickets for all the finalists. We know that thei-th city of the country haswicup finalists living there.Help the company employees find the city such that the total cost of travel of all the participants to it is minimum.InputThe first line of the input contains numbern(1 ≤n≤ 200 000) — the number of cities in the country.The next line containsnintegersw1,w2, ...,wn(0 ≤wi≤ 108) — the number of finalists living in each city of the country.Next(n- 1)lines contain the descriptions of the railroad, thei-th line contains three integers,ai,bi,li(1 ≤ai,bi≤n,ai≠bi,1 ≤li≤ 1000).OutputPrint two numbers — an integerfthat is the number of the optimal city to conduct the competition, and the real numberc, equal to the minimum total cost of transporting all the finalists to the competition. Your answer will be considered correct if two conditions are fulfilled at the same time:The absolute or relative error of the printed numbercin comparison with the cost of setting up a final in cityfdoesn't exceed10- 6;Absolute or relative error of the printed numbercin comparison to the answer of the jury doesn't exceed10- 6.If there are multiple answers, you are allowed to print any of them.ExamplesInput53 1 2 6 51 2 32 3 14 3 95 3 1Output3 192.0Input25 51 2 2Output1 14.142135623730951000NoteIn the sample test an optimal variant of choosing a city to conduct the finals of the competition is3. At such choice the cost of conducting isburles.In the second sample test, whatever city you would choose, you will need to pay for the transport for five participants, so you will need to payburles for each one of them.",
    "source": "CF",
    "vjudge": false
}