{
    "uid": "567-D",
    "url": "https://codeforces.com/contest/567/problem/D",
    "tags": [
        "binary search",
        " data structures",
        " greedy",
        " sortings"
    ],
    "title": "567-D",
    "statement": "D. One-Dimensional Battle Shipstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob love playing one-dimensional battle ships. They play on the field in the form of a line consisting ofnsquare cells (that is, on a1 ×ntable).At the beginning of the game Alice putskships on the field without telling their positions to Bob. Each ship looks as a1 ×arectangle (that is, it occupies a sequence ofaconsecutive squares of the field). The ships cannot intersect and even touch each other.After that Bob makes a sequence of \"shots\". He names cells of the field and Alice either says that the cell is empty (\"miss\"), or that the cell belongs to some ship (\"hit\").But here's the problem! Alice like to cheat. May be that is why she responds to each Bob's move with a \"miss\".Help Bob catch Alice cheating — find Bob's first move, such that after it you can be sure that Alice cheated.InputThe first line of the input contains three integers:n,kanda(1 ≤n,k,a≤ 2·105) — the size of the field, the number of the ships and the size of each ship. It is guaranteed that then,kandaare such that you can putkships of sizeaon the field, so that no two ships intersect or touch each other.The second line contains integerm(1 ≤m≤n) — the number of Bob's moves.The third line containsmdistinct integersx1,x2, ...,xm, wherexiis the number of the cell where Bob made thei-th shot. The cells are numbered from left to right from1ton.OutputPrint a single integer — the number of such Bob's first move, after which you can be sure that Alice lied. Bob's moves are numbered from1tomin the order the were made. If the sought move doesn't exist, then print \"-1\".ExamplesInput11 3 354 8 6 1 11Output3Input5 1 321 5Output-1Input5 1 313Output1",
    "source": "CF",
    "vjudge": false
}