{
    "uid": "568-B",
    "url": "https://codeforces.com/contest/568/problem/B",
    "tags": [
        "combinatorics",
        " dp",
        " math"
    ],
    "title": "568-B",
    "statement": "B. Symmetric and Transitivetime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Johnny has recently learned about set theory. Now he is studying binary relations. You've probably heard the term \"equivalence relation\". These relations are very important in many areas of mathematics. For example, the equality of the two numbers is an equivalence relation.A setρof pairs(a,b)of elements of some setAis called a binary relation on setA. For two elementsaandbof the setAwe say that they are in relationρ, if pair, in this case we use a notation.Binary relation isequivalence relation, if:It is reflexive (for anyait is true that);It is symmetric (for anya,bit is true that if, then);It is transitive (ifand, than).Little Johnny is not completely a fool and he noticed that the first condition is not necessary! Here is his \"proof\":Take any two elements,aandb. If, then(according to property (2)), which means(according to property (3)).It's very simple, isn't it? However, you noticed that Johnny's \"proof\" is wrong, and decided to show him a lot of examples that prove him wrong.Here's your task: count the number of binary relations over a set of sizensuch that they are symmetric, transitive, but not an equivalence relations (i.e. they are not reflexive).Since their number may be very large (not0, according to Little Johnny), print the remainder of integer division of this number by109+ 7.InputA single line contains a single integern(1 ≤n≤ 4000).OutputIn a single line print the answer to the problem modulo109+ 7.ExamplesInput1Output1Input2Output3Input3Output10NoteIfn= 1there is only one such relation — an empty one, i.e.. In other words, for a single elementxof setAthe following is hold:.Ifn= 2there are three such relations. Let's assume that setAconsists of two elements,xandy. Then the valid relations are,ρ = {(x,x)},ρ = {(y,y)}. It is easy to see that the three listed binary relations are symmetric and transitive relations, but they are not equivalence relations.",
    "source": "CF",
    "vjudge": false
}