{
    "uid": "568-D",
    "url": "https://codeforces.com/contest/568/problem/D",
    "tags": [
        "brute force",
        " geometry",
        " math"
    ],
    "title": "568-D",
    "statement": "D. Sign Poststime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOne Khanate had a lot of roads and very little wood. Riding along the roads was inconvenient, because the roads did not have road signs indicating the direction to important cities.The Han decided that it's time to fix the issue, and ordered to put signs on every road. The Minister of Transport has to do that, but he has onlyksigns. Help the minister to solve his problem, otherwise the poor guy can lose not only his position, but also his head.More formally, every road in the Khanate is a line on theOxyplane, given by an equation of the formAx+By+C= 0(AandBare not equal to 0 at the same time). You are required to determine whether you can put signs in at mostkpoints so that each road had at least one sign installed.InputThe input starts with two positive integersn,k(1 ≤n≤ 105, 1 ≤k≤ 5)Nextnlines contain three integers each,Ai,Bi,Ci, the coefficients of the equation that determines the road (|Ai|, |Bi|, |Ci| ≤ 105,Ai2+Bi2≠ 0).It is guaranteed that no two roads coincide.OutputIf there is no solution, print\"NO\"in the single line (without the quotes).Otherwise, print in the first line\"YES\"(without the quotes).In the second line print a single numberm(m≤k) — the number of used signs. In the nextmlines print the descriptions of their locations.Description of a location of one sign is two integersv,u. Ifuandvare two distinct integers between1andn, we assume that sign is at the point of intersection of roads numbervandu. Ifu=  - 1, andvis an integer between1andn, then the sign is on the road numbervin the point not lying on any other road. In any other case the description of a sign will be assumed invalid and your answer will be considered incorrect. In case ifv=u, or ifvanduare the numbers of two non-intersecting roads, your answer will also be considered incorrect.The roads are numbered starting from1in the order in which they follow in the input.ExamplesInput3 11 0 00 -1 07 -93 0OutputYES11 2Input3 11 0 00 1 01 1 3OutputNOInput2 33 4 55 6 7OutputYES21 -12 -1NoteNote that you do not have to minimizem, but it shouldn't be more thank.In the first test all three roads intersect at point (0,0).In the second test all three roads form a triangle and there is no way to place one sign so that it would stand on all three roads at once.",
    "source": "CF",
    "vjudge": false
}