{
    "uid": "581-E",
    "url": "https://codeforces.com/contest/581/problem/E",
    "tags": [
        "dp",
        " greedy"
    ],
    "title": "581-E",
    "statement": "E. Kojiro and Furraritime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMotorist Kojiro spent10years saving up for his favorite car brand, Furrari. Finally Kojiro's dream came true! Kojiro now wants to get to his girlfriend Johanna to show off his car to her.Kojiro wants to get to his girlfriend, so he will go to her along a coordinate line. For simplicity, we can assume that Kojiro is at the pointfof a coordinate line, and Johanna is at pointe. Some points of the coordinate line have gas stations. Every gas station fills with only one type of fuel:Regular-92,Premium-95orSuper-98. Thus, each gas station is characterized by a pair of integerstiandxi— the number of the gas type and its position.One liter of fuel is enough to drive for exactly1km (this value does not depend on the type of fuel). Fuels of three types differ only in quality, according to the research, that affects the lifetime of the vehicle motor. A Furrari tank holds exactlysliters of fuel (regardless of the type of fuel). At the moment of departure from pointfKojiro's tank is completely filled with fuelSuper-98. At each gas station Kojiro can fill the tank with any amount of fuel, but of course, at no point in time, the amount of fuel in the tank can be more thansliters. Note that the tankcansimultaneously have different types of fuel. The car can moves both left and right.To extend the lifetime of the engine Kojiro seeks primarily to minimize the amount of fuel of typeRegular-92. If there are several strategies to go fromftoe, using the minimum amount of fuel of typeRegular-92, it is necessary to travel so as to minimize the amount of used fuel of typePremium-95.Write a program that can for thempossible positions of the startfiminimize firstly, the amount of used fuel of typeRegular-92and secondly, the amount of used fuel of typePremium-95.InputThe first line of the input contains four positive integerse,s,n,m(1 ≤e,s≤ 109, 1 ≤n,m≤ 2·105) — the coordinate of the point where Johanna is, the capacity of a Furrari tank, the number of gas stations and the number of starting points.Nextnlines contain two integers eachti,xi(1 ≤ti≤ 3,  - 109≤xi≤ 109), representing the type of thei-th gas station (1representsRegular-92,2—Premium-95and3—Super-98) and the position on a coordinate line of thei-th gas station. Gas stations don't necessarily follow in order from left to right.The last line containsmintegersfi(- 109≤fi<e). Start positions don't necessarily follow in order from left to right.No point of the coordinate line contains more than one gas station. It is possible that some of pointsfior pointecoincide with a gas station.OutputPrint exactlymlines. Thei-th of them should contain two integers — the minimum amount of gas of typeRegular-92and typePremium-95, if Kojiro starts at pointfi. First you need to minimize the first value. If there are multiple ways to do it, you need to also minimize the second value.If there is no way to get to Johanna from pointfi, thei-th line should look like that \"-1 -1\" (two numbers minus one without the quotes).ExamplesInput8 4 1 12 40Output0 4Input9 3 2 32 31 6-1 0 1Output-1 -13 33 2Input20 9 2 41 52 10-1 0 1 2Output-1 -1-1 -1-1 -1-1 -1",
    "source": "CF",
    "vjudge": false
}