{
    "uid": "582-E",
    "url": "https://codeforces.com/contest/582/problem/E",
    "tags": [
        "bitmasks",
        " dp",
        " expression parsing"
    ],
    "title": "582-E",
    "statement": "E. Boolean Functiontime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn this problem we consider Boolean functions of four variablesA,B,C,D. VariablesA,B,CandDare logical and can take values 0 or 1. We will define a function using the following grammar:<expression> ::= <variable> | (<expression>) <operator> (<expression>)<variable> ::= 'A' | 'B' | 'C' | 'D' | 'a' | 'b' | 'c' | 'd'<operator> ::= '&' | '|'Here large lettersA,B,C,Drepresent variables, and small letters represent their negations. For example, ifA= 1, then character'A'corresponds to value 1, and value character'a'corresponds to value 0. Here character '&' corresponds to the operation of logical AND, character '|' corresponds to the operation of logical OR.You are given expressions, defining functionf, where some operations and variables are missing. Also you know the values of the functionf(A,B,C,D)for somendistinct sets of variable values. Count the number of ways to restore the elements that are missing in the expression so that the resulting expression corresponded to the given information about functionfin the given variable sets. As the value of the result can be rather large, print its remainder modulo109+ 7.InputThe first line contains expressions(1 ≤ |s| ≤ 500), where some characters of the operators and/or variables are replaced by character '?'.The second line contains numbern(0 ≤n≤ 24) — the number of integers sets for which we know the value of functionf(A,B,C,D). Nextnlines contain the descriptions of the sets: thei-th of them contains five integersai,bi,ci,di,ei(0 ≤ai,bi,ci,di,ei≤ 1), separated by spaces and meaning thatf(ai,bi,ci,di) =ei.It is guaranteed that all the tuples (ai,bi,ci,di) are distinct.OutputIn a single line print the answer to the problem.ExamplesInput?21 0 1 0 10 1 1 0 1Output2Input(A)?(?)11 1 0 0 0Output4Input((?)&(?))|((?)&(?))0Output4096Inputb11 0 1 1 1Output1NoteIn the first sample the two valid expressions are 'C' and 'd'.In the second sample the expressions look as follows: '(A)&(a)', '(A)&(b)', '(A)&(C)', '(A)&(D)'.",
    "source": "CF",
    "vjudge": false
}