{
    "uid": "593-C",
    "url": "https://codeforces.com/contest/593/problem/C",
    "tags": [
        "constructive algorithms",
        " math"
    ],
    "title": "593-C",
    "statement": "C. Beautiful Functiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEvery day Ruslan tried to count sheep to fall asleep, but this didn't help. Now he has found a more interesting thing to do. First, he thinks of some set of circles on a plane, and then tries to choose a beautiful set of points, such that there is at least one point from the set inside or on the border of each of the imagined circles.Yesterday Ruslan tried to solve this problem for the case when the set of points is considered beautiful if it is given as(xt=f(t),yt=g(t)), where argumentttakes all integer values from0to50. Moreover,f(t)andg(t)should becorrectfunctions.Assume thatw(t)andh(t)are some correct functions, andcis an integer ranging from0to50. The functions(t)is correct if it's obtained by one of the following rules:s(t) =abs(w(t)), whereabs(x)means taking the absolute value of a numberx, i.e.|x|;s(t) = (w(t) +h(t));s(t) = (w(t) -h(t));s(t) = (w(t) *h(t)), where*means multiplication, i.e.(w(t)·h(t));s(t) =c;s(t) =t;Yesterday Ruslan thought on and on, but he could not cope with the task. Now he asks you to write a program that computes the appropriatef(t)andg(t)for any set of at most50circles.In each of the functionsf(t)andg(t)you are allowed to use no more than50multiplications. The length of any function should not exceed100·ncharacters. The functionshould not contain spaces.Ruslan can't keep big numbers in his memory, so you should choosef(t)andg(t), such that for all integertfrom0to50value off(t)andg(t)and all the intermediate calculations won't exceed109by their absolute value.InputThe first line of the input contains numbern(1 ≤n≤ 50) — the number of circles Ruslan thinks of. Next follownlines, each of them containing three integersxi,yiandri(0 ≤xi,yi≤ 50,2 ≤ri≤ 50) — the coordinates of the center and the raduis of thei-th circle.OutputIn the first line print a correct functionf(t). In the second line print a correct functiong(t). The set of the points(xt=f(t),yt=g(t))(0 ≤t≤ 50) must satisfy the condition, that there is at least one point inside or on the border of each of the circles, Ruslan thinks of at the beginning.ExamplesInput30 10 410 0 420 10 4Outputtabs((t-10))NoteCorrect functions:10(1+2)((t-3)+(t*4))abs((t-10))(abs((((23-t)*(t*t))+((45+12)*(t*t))))*((5*t)+((12*t)-13)))abs((t-(abs((t*31))+14))))Incorrect functions:3+5+7(not enough brackets, it should be ((3+5)+7) or (3+(5+7)))abs(t-3)(not enough brackets, it should beabs((t-3))2+(2-3(one bracket too many)1(t+5) (no arithmetic operation between 1 and the bracket)5000*5000(the number exceeds the maximum)The picture shows one of the possible solutions",
    "source": "CF",
    "vjudge": false
}