{
    "uid": "601-A",
    "url": "https://codeforces.com/contest/601/problem/A",
    "tags": [
        "graphs",
        " shortest paths"
    ],
    "title": "601-A",
    "statement": "A. The Two Routestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn Absurdistan, there arentowns (numbered1throughn) andmbidirectional railways. There is also an absurdly simple road network — for each pair of different townsxandy, there is a bidirectional road between townsxandyif and only ifthere is no railway between them. Travelling to a different town using one railway or one road always takes exactly one hour.A train and a bus leave town1at the same time. They both have the same destination, townn, and don't make any stops on the way (but they can wait in townn). The train can move only along railways and the bus can move only along roads.You've been asked to plan out routes for the vehicles; each route can use any road/railway multiple times. One of the most important aspects to consider is safety — in order to avoid accidents at railway crossings, the train and the bus must not arrive at the same town (except townn) simultaneously.Under these constraints, what is the minimum number of hours needed for both vehicles to reach townn(the maximum of arrival times of the bus and the train)? Note, that bus and train are not required to arrive to the townnat the same moment of time, but are allowed to do so.InputThe first line of the input contains two integersnandm(2 ≤n≤ 400,0 ≤m≤n(n- 1) / 2) — the number of towns and the number of railways respectively.Each of the nextmlines contains two integersuandv, denoting a railway between townsuandv(1 ≤u,v≤n,u≠v).You may assume that there is at most one railway connecting any two towns.OutputOutput one integer — the smallest possible time of the later vehicle's arrival in townn. If it's impossible for at least one of the vehicles to reach townn, output- 1.ExamplesInput4 21 33 4Output2Input4 61 21 31 42 32 43 4Output-1Input5 54 23 54 55 11 2Output3NoteIn the first sample, the train can take the routeand the bus can take the route. Note that they can arrive at town4at the same time.In the second sample, Absurdistan is ruled by railwaymen. There are no roads, so there's no way for the bus to reach town4.",
    "source": "CF",
    "vjudge": false
}