{
    "uid": "601-C",
    "url": "https://codeforces.com/contest/601/problem/C",
    "tags": [
        "dp",
        " math",
        " probabilities"
    ],
    "title": "601-C",
    "statement": "C. Kleofáš and the n-thlontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputKleofáš is participating in ann-thlon - a tournament consisting ofndifferent competitions inndifferent disciplines (numbered1throughn). There aremparticipants in then-thlon and each of them participates in all competitions.In each of thesencompetitions, the participants are givenranksfrom1tomin such a way that no two participants are given the same rank - in other words, the ranks in each competition form a permutation of numbers from1tom. Thescoreof a participant in a competition is equal to his/her rank in it.Theoverall scoreof each participant is computed as the sum of that participant's scores in all competitions.Theoverall rankof each participant is equal to1 +k, wherekis the number of participants withstrictly smalleroverall score.Then-thlon is over now, but the results haven't been published yet. Kleofáš still remembers his ranks in each particular competition; however, he doesn't remember anything about how well the other participants did. Therefore, Kleofáš would like to know his expected overall rank.All competitors are equally good at each discipline, so all rankings (permutations of ranks of everyone except Kleofáš) in each competition are equiprobable.InputThe first line of the input contains two space-separated integersn(1 ≤n≤ 100) andm(1 ≤m≤ 1000) — the number of competitions and the number of participants respectively.Then,nlines follow. Thei-th of them contains one integerxi(1 ≤xi≤m) — the rank of Kleofáš in thei-th competition.OutputOutput a single real number – the expected overall rank of Kleofáš. Your answer will be considered correct if its relative or absolute error doesn't exceed10- 9.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput4 102121Output1.0000000000000000Input5 512345Output2.7500000000000000Input3 6242Output1.6799999999999999NoteIn the first sample, Kleofáš has overall score6. Nobody else can have overall score less than6(but it's possible for one other person to have overall score6as well), so his overall rank must be1.",
    "source": "CF",
    "vjudge": false
}