{
    "uid": "605-C",
    "url": "https://codeforces.com/contest/605/problem/C",
    "tags": [
        "geometry"
    ],
    "title": "605-C",
    "statement": "C. Freelancer's Dreamstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMikhail the Freelancer dreams of two things: to become a cool programmer and to buy a flat in Moscow. To become a cool programmer, he needs at leastpexperience points, and a desired flat in Moscow costsqdollars. Mikhail is determined to follow his dreams and registered at a freelance site.He has suggestions to work onndistinct projects. Mikhail has already evaluated that the participation in thei-th project will increase his experience byaiper day and bringbidollars per day. As freelance work implies flexible working hours, Mikhail is free to stop working on one project at any time and start working on another project. Doing so, he receives the respective share of experience and money. Mikhail is only trying to become a cool programmer, so he is able to work only on one project at any moment of time.Find the real value, equal to the minimum number of days Mikhail needs to make his dream come true.For example, suppose Mikhail is suggested to work on three projects anda1= 6,b1= 2,a2= 1,b2= 3,a3= 2,b3= 6. Also,p= 20andq= 20. In order to achieve his aims Mikhail has to work for2.5days on both first and third projects. Indeed,a1·2.5 +a2·0 +a3·2.5 = 6·2.5 + 1·0 + 2·2.5 = 20andb1·2.5 +b2·0 +b3·2.5 = 2·2.5 + 3·0 + 6·2.5 = 20.InputThe first line of the input contains three integersn,pandq(1 ≤n≤ 100 000, 1 ≤p,q≤ 1 000 000) — the number of projects and the required number of experience and money.Each of the nextnlines contains two integersaiandbi(1 ≤ai,bi≤ 1 000 000) — the daily increase in experience and daily income for working on thei-th project.OutputPrint a real value — the minimum number of days Mikhail needs to get the required amount of experience and money. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput3 20 206 21 32 6Output5.000000000000000Input4 1 12 33 22 33 2Output0.400000000000000NoteFirst sample corresponds to the example in the problem statement.",
    "source": "CF",
    "vjudge": false
}