{
    "uid": "609-F",
    "url": "https://codeforces.com/contest/609/problem/F",
    "tags": [
        "data structures",
        " greedy"
    ],
    "title": "609-F",
    "statement": "F. Frogs and mosquitoestime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere arenfrogs sitting on the coordinate axisOx. For each frog two valuesxi,tiare known — the position and the initial length of the tongue of thei-th frog (it is guaranteed that all positionsxiare different).mmosquitoes one by one are landing to the coordinate axis. For each mosquito two values are knownpj— the coordinate of the position where thej-th mosquito lands andbj— the size of thej-th mosquito. Frogs and mosquitoes are represented as points on the coordinate axis.The frog can eat mosquito if mosquito is in the same position with the frog or to the right, and the distance between them is not greater than the length of the tongue of the frog.If at some moment several frogs can eat a mosquito the leftmost frog will eat it (with minimalxi). After eating a mosquito the length of the tongue of a frog increases with the value of the size of eaten mosquito. It's possible that after it the frog will be able to eat some other mosquitoes (the frog should eat them in this case).For each frog print two values — the number of eaten mosquitoes and the length of the tongue after landing all mosquitoes and after eating all possible mosquitoes by frogs.Each mosquito is landing to the coordinate axis only after frogs eat all possible mosquitoes landed before. Mosquitoes are given in order of their landing to the coordinate axis.InputFirst line contains two integersn,m(1 ≤n,m≤ 2·105) — the number of frogs and mosquitoes.Each of the nextnlines contains two integersxi,ti(0 ≤xi,ti≤ 109) — the position and the initial length of the tongue of thei-th frog. It is guaranteed that allxiare different.Nextmlines contain two integers eachpj,bj(0 ≤pj,bj≤ 109) — the position and the size of thej-th mosquito.OutputPrintnlines. Thei-th line should contain two integer valuesci,li— the number of mosquitoes eaten by thei-th frog and the length of the tongue of thei-th frog.ExamplesInput4 610 215 06 10 1110 101 16 015 1014 10012 2Output3 1141 101 11 2Input1 210 220 212 1Output1 3",
    "source": "CF",
    "vjudge": false
}