{
    "uid": "61-C",
    "url": "https://codeforces.com/contest/61/problem/C",
    "tags": [
        "math"
    ],
    "title": "61-C",
    "statement": "C. Capture Valeriantime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIt's now260AD. Shapur, being extremely smart, became the King of Persia. He is now called Shapur, His majesty King of kings of Iran and Aniran.Recently the Romans declared war on Persia. They dreamed to occupy Armenia. In the recent war, the Romans were badly defeated. Now their senior army general, Philip is captured by Shapur and Shapur is now going to capture Valerian, the Roman emperor.Being defeated, the cowardly Valerian hid in a room at the top of one of his castles. To capture him, Shapur has to open many doors. Fortunately Valerian was too scared to make impenetrable locks for the doors.Each door has4parts. The first part is an integer numbera. The second part is either an integer numberbor some really odd sign which looks likeR. The third one is an integercand the fourth part is empty! As if it was laid for writing something. Being extremely gifted, after opening the first few doors, Shapur found out the secret behind the locks.cis an integer written in basea, to open the door we should write it in baseb. The only bad news is that thisRis some sort of special numbering system that is used only in Roman empire, so opening the doors is not just a piece of cake!Here's an explanation of this really weird number system that even doesn't have zero:Roman numerals are based on seven symbols: a stroke (identified with the letterI) for a unit, a chevron (identified with the letterV) for a five, a cross-stroke (identified with the letterX) for a ten, aC(identified as an abbreviation of Centum) for a hundred, etc.:I=1V=5X=10L=50C=100D=500M=1000Symbols are iterated to produce multiples of the decimal (1,10,100,1, 000) values, withV,L,Dsubstituted for a multiple of five, and the iteration continuing:I1,II2,III3,V5,VI6,VII7, etc., and the same for other bases:X10,XX20,XXX30,L50,LXXX80;CC200,DCC700, etc. At the fourth and ninth iteration, a subtractive principle must be employed, with the base placed before the higher base:IV4,IX9,XL40,XC90,CD400,CM900.Also in bases greater than10we useAfor10,Bfor11, etc.Help Shapur capture Valerian and bring peace back to Persia, especially Armenia.InputThe first line contains two integersaandb(2 ≤a,b≤ 25). Onlybmay be replaced by anRwhich indicates Roman numbering system.The next line contains a single non-negative integercin baseawhich may contain leading zeros but its length doesn't exceed103.It is guaranteed that if we have Roman numerals included the number would be less than or equal to300010and it won't be0. In any other case the number won't be greater than101510.OutputWrite a single line that contains integercin baseb. You must omit leading zeros.ExamplesInput10 21Output1Input16 R5OutputVInput5 R4OutputIVInput2 21111001Output1111001Input12 13AOutputANoteYou can find more information about roman numerals here: http://en.wikipedia.org/wiki/Roman_numerals",
    "source": "CF",
    "vjudge": false
}