{
    "uid": "610-C",
    "url": "https://codeforces.com/contest/610/problem/C",
    "tags": [
        "constructive algorithms"
    ],
    "title": "610-C",
    "statement": "C. Harmony Analysistime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe semester is already ending, so Danil made an effort and decided to visit a lesson on harmony analysis to know how does the professor look like, at least. Danil was very bored on this lesson until the teacher gave the group a simple task: find4vectors in4-dimensional space, such that every coordinate of every vector is1or- 1and any two vectors are orthogonal. Just as a reminder, two vectors inn-dimensional space are considered to be orthogonal if and only if their scalar product is equal to zero, that is:.Danil quickly managed to come up with the solution for this problem and the teacher noticed that the problem can be solved in a more general case for2kvectors in2k-dimensinoal space. When Danil came home, he quickly came up with the solution for this problem. Can you cope with it?InputThe only line of the input contains a single integerk(0 ≤k≤ 9).OutputPrint2klines consisting of2kcharacters each. Thej-th character of thei-th line must be equal to '*' if thej-th coordinate of thei-th vector is equal to- 1, and must be equal to '+' if it's equal to+ 1. It's guaranteed that the answer always exists.If there are many correct answers, print any.ExamplesInput2Output++**+*+*+++++**+NoteConsider all scalar products in example:Vectors1and2:( + 1)·( + 1) + ( + 1)·( - 1) + ( - 1)·( + 1) + ( - 1)·( - 1) = 0Vectors1and3:( + 1)·( + 1) + ( + 1)·( + 1) + ( - 1)·( + 1) + ( - 1)·( + 1) = 0Vectors1and4:( + 1)·( + 1) + ( + 1)·( - 1) + ( - 1)·( - 1) + ( - 1)·( + 1) = 0Vectors2and3:( + 1)·( + 1) + ( - 1)·( + 1) + ( + 1)·( + 1) + ( - 1)·( + 1) = 0Vectors2and4:( + 1)·( + 1) + ( - 1)·( - 1) + ( + 1)·( - 1) + ( - 1)·( + 1) = 0Vectors3and4:( + 1)·( + 1) + ( + 1)·( - 1) + ( + 1)·( - 1) + ( + 1)·( + 1) = 0",
    "source": "CF",
    "vjudge": false
}