{
    "uid": "611-C",
    "url": "https://codeforces.com/contest/611/problem/C",
    "tags": [
        "dp",
        " implementation"
    ],
    "title": "611-C",
    "statement": "C. New Year and Dominotime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThey say \"years are like dominoes, tumbling one after the other\". But would a year fit into a grid? I don't think so.Limak is a little polar bear who loves to play. He has recently got a rectangular grid withhrows andwcolumns. Each cell is a square, either empty (denoted by '.') or forbidden (denoted by '#'). Rows are numbered1throughhfrom top to bottom. Columns are numbered1throughwfrom left to right.Also, Limak has a single domino. He wants to put it somewhere in a grid. A domino will occupy exactly two adjacent cells, located either in one row or in one column. Both adjacent cells must be empty and must be inside a grid.Limak needs more fun and thus he is going to consider some queries. In each query he chooses some rectangle and wonders, how many way are there to put a single domino inside of the chosen rectangle?InputThe first line of the input contains two integershandw(1 ≤h,w≤ 500) – the number of rows and the number of columns, respectively.The nexthlines describe a grid. Each line contains a string of the lengthw. Each character is either '.' or '#' — denoting an empty or forbidden cell, respectively.The next line contains a single integerq(1 ≤q≤ 100 000) — the number of queries.Each of the nextqlines contains four integersr1i,c1i,r2i,c2i(1 ≤r1i≤r2i≤h, 1 ≤c1i≤c2i≤w) — thei-th query. Numbersr1iandc1idenote the row and the column (respectively) of the upper left cell of the rectangle. Numbersr2iandc2idenote the row and the column (respectively) of the bottom right cell of the rectangle.OutputPrintqintegers,i-th should be equal to the number of ways to put a single domino inside thei-th rectangle.ExamplesInput5 8....#..#.#......##.#....##..#.##........41 1 2 34 1 4 11 2 4 52 5 5 8Output401015Input7 39........................................###..###..#..###.....###..###..#..###....#..#.#..#..#.........#..#.#..#..#....###..#.#..#..###.....###..#.#..#..###..#....#.#..#....#.....#....#.#..#..#.#..###..###..#..###.....###..###..#..###........................................61 1 3 202 10 6 302 10 7 302 2 7 71 7 7 71 8 7 8Output53891202302NoteA red frame below corresponds to the first query of the first sample. A domino can be placed in 4 possible ways.",
    "source": "CF",
    "vjudge": false
}