{
    "uid": "623-A",
    "url": "https://codeforces.com/contest/623/problem/A",
    "tags": [
        "constructive algorithms",
        " graphs"
    ],
    "title": "623-A",
    "statement": "A. Graph and Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOne day student Vasya was sitting on a lecture and mentioned a strings1s2...sn, consisting of letters \"a\", \"b\" and \"c\" that was written on his desk. As the lecture was boring, Vasya decided to complete the picture by composing a graphGwith the following properties:Ghas exactlynvertices, numbered from1ton.For all pairs of verticesiandj, wherei≠j, there is an edge connecting themif and only ifcharacterssiandsjare either equal or neighbouring in the alphabet. That is, letters in pairs \"a\"-\"b\" and \"b\"-\"c\" are neighbouring, while letters \"a\"-\"c\" are not.Vasya painted the resulting graph near the string and then erased the string. Next day Vasya's friend Petya came to a lecture and found some graph at his desk. He had heard of Vasya's adventure and now he wants to find out whether it could be the original graphG, painted by Vasya. In order to verify this, Petya needs to know whether there exists a strings, such that if Vasya used thisshe would produce the given graphG.InputThe first line of the input contains two integersnandm— the number of vertices and edges in the graph found by Petya, respectively.Each of the nextmlines contains two integersuiandvi(1 ≤ui,vi≤n,ui≠vi)— the edges of the graphG. It is guaranteed, that there are no multiple edges, that is any pair of vertexes appear in this list no more than once.OutputIn the first line print \"Yes\" (without the quotes), if the stringsPetya is interested in really exists and \"No\" (without the quotes) otherwise.If the stringsexists, then print it on the second line of the output. The length ofsmust be exactlyn, it must consist of only letters \"a\", \"b\" and \"c\" only, and the graph built using this string must coincide withG. If there are multiple possible answers, you may print any of them.ExamplesInput2 11 2OutputYesaaInput4 31 21 31 4OutputNoNoteIn the first sample you are given a graph made of two vertices with an edge between them. So, these vertices can correspond to both the same and adjacent letters. Any of the following strings\"aa\",\"ab\",\"ba\",\"bb\",\"bc\",\"cb\",\"cc\"meets the graph's conditions.In the second sample the first vertex is connected to all three other vertices, but these three vertices are not connected with each other. That means that they must correspond to distinct letters that are not adjacent, but that is impossible as there are only two such letters: a and c.",
    "source": "CF",
    "vjudge": false
}