{
    "uid": "626-F",
    "url": "https://codeforces.com/contest/626/problem/F",
    "tags": [
        "dp"
    ],
    "title": "626-F",
    "statement": "F. Group Projectstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arenstudents in a class working on group projects. The students will divide into groups (some students may be in groups alone), work on their independent pieces, and then discuss the results together. It takes thei-th studentaiminutes to finish his/her independent piece.If students work at different paces, it can be frustrating for the faster students and stressful for the slower ones. In particular, theimbalanceof a group is defined as the maximumaiin the group minus the minimumaiin the group. Note that a group containing a single student has an imbalance of0. How many ways are there for the students to divide into groups so that the total imbalance of all groups is at mostk?Two divisions are considered distinct if there exists a pair of students who work in the same group in one division but different groups in the other.InputThe first line contains two space-separated integersnandk(1 ≤n≤ 200,0 ≤k≤ 1000) — the number of students and the maximum total imbalance allowed, respectively.The second line containsnspace-separated integersai(1 ≤ai≤ 500) — the time it takes thei-th student to complete his/her independent piece of work.OutputPrint a single integer, the number of ways the students can form groups. As the answer may be large, print its value modulo109+ 7.ExamplesInput3 22 4 5Output3Input4 37 8 9 10Output13Input4 05 10 20 21Output1NoteIn the first sample, we have three options:The first and second students form a group, and the third student forms a group. Total imbalance is2 + 0 = 2.The first student forms a group, and the second and third students form a group. Total imbalance is0 + 1 = 1.All three students form their own groups. Total imbalance is0.In the third sample, the total imbalance must be0, so each student must work individually.",
    "source": "CF",
    "vjudge": false
}