{
    "uid": "626-D",
    "url": "https://codeforces.com/contest/626/problem/D",
    "tags": [
        "brute force",
        " combinatorics",
        " dp",
        " probabilities"
    ],
    "title": "626-D",
    "statement": "D. Jerry's Protesttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAndrew and Jerry are playing a game with Harry as the scorekeeper. The game consists of three rounds. In each round, Andrew and Jerry draw randomly without replacement from a jar containingnballs, each labeled with a distinct positive integer. Without looking, they hand their balls to Harry, who awards the point to the player with the larger number andreturns the ballsto the jar. The winner of the game is the one who wins at least two of the three rounds.Andrew wins rounds 1 and 2 while Jerry wins round 3, so Andrew wins the game. However, Jerry is unhappy with this system, claiming that he will often lose the match despite having the higher overall total. What is the probability that the sum of the three balls Jerry drew is strictly higher than the sum of the three balls Andrew drew?InputThe first line of input contains a single integern(2 ≤n≤ 2000) — the number of balls in the jar.The second line containsnintegersai(1 ≤ai≤ 5000) — the number written on theith ball. It is guaranteed that no two balls have the same number.OutputPrint a single real value — the probability that Jerry has a higher total, given that Andrew wins the first two rounds and Jerry wins the third. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput21 2Output0.0000000000Input31 2 10Output0.0740740741NoteIn the first case, there are only two balls. In the first two rounds, Andrew must have drawn the2and Jerry must have drawn the1, and vice versa in the final round. Thus, Andrew's sum is5and Jerry's sum is4, so Jerry never has a higher total.In the second case, each game could've had three outcomes —10 - 2,10 - 1, or2 - 1. Jerry has a higher total if and only if Andrew won2 - 1in both of the first two rounds, and Jerry drew the10in the last round. This has probability.",
    "source": "CF",
    "vjudge": false
}