{
    "uid": "628-F",
    "url": "https://codeforces.com/contest/628/problem/F",
    "tags": [
        "flows",
        " graphs"
    ],
    "title": "628-F",
    "statement": "F. Bear and Fair Settime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLimak is a grizzly bear. He is big and dreadful. You were chilling in the forest when you suddenly met him. It's very unfortunate for you. He will eat all your cookies unless you can demonstrate your mathematical skills. To test you, Limak is going to give you a puzzle to solve.It's a well-known fact that Limak, as every bear, owns a set of numbers. You know some information about the set:The elements of the set are distinct positive integers.The number of elements in the set isn. The numbernis divisible by5.All elements are between1andb, inclusive: bears don't know numbers greater thanb.For eachrin{0, 1, 2, 3, 4}, the set contains exactlyelements that give remainderrwhen divided by5. (That is, there areelements divisible by5,elements of the form5k+ 1,elements of the form5k+ 2, and so on.)Limak smiles mysteriously and gives youqhints about his set. Thei-th hint is the following sentence: \"If you only look at elements that are between1andupToi, inclusive, you will find exactlyquantityisuch elements in my set.\"In a moment Limak will tell you the actual puzzle, but something doesn't seem right... That smile was very strange. You start to think about a possible reason. Maybe Limak cheated you? Or is he a fair grizzly bear?Givenn,b,qand hints, check whether Limak can be fair, i.e. there exists at least one set satisfying the given conditions. If it's possible then print ''fair\". Otherwise, print ''unfair\".InputThe first line contains three integersn,bandq(5 ≤n≤b≤ 104,1 ≤q≤ 104,ndivisible by5) — the size of the set, the upper limit for numbers in the set and the number of hints.The nextqlines describe the hints. Thei-th of them contains two integersupToiandquantityi(1 ≤upToi≤b,0 ≤quantityi≤n).OutputPrint ''fair\" if there exists at least one set that has all the required properties and matches all the given hints. Otherwise, print ''unfair\".ExamplesInput10 20 110 10OutputfairInput10 20 315 105 010 5OutputfairInput10 20 215 320 10OutputunfairNoteIn the first example there is only one set satisfying all conditions: {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}.In the second example also there is only one set satisfying all conditions: {6, 7, 8, 9, 10, 11, 12, 13, 14, 15}.Easy to see that there is no set satisfying all conditions from the third example. So Limak lied to you :-(",
    "source": "CF",
    "vjudge": false
}