{
    "uid": "629-C",
    "url": "https://codeforces.com/contest/629/problem/C",
    "tags": [
        "dp",
        " strings"
    ],
    "title": "629-C",
    "statement": "C. Famil Door and Bracketstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAs Famil Door’s birthday is coming, some of his friends (like Gabi) decided to buy a present for him. His friends are going to buy a string consisted of round brackets since Famil Door loves string of brackets of lengthnmore than any other strings!The sequence of round brackets is calledvalidif and only if:the total number of opening brackets is equal to the total number of closing brackets;for any prefix of the sequence, the number of opening brackets is greater or equal than the number of closing brackets.Gabi bought a stringsof lengthm(m≤n) and want to complete it to obtain a valid sequence of brackets of lengthn. He is going to pick some stringspandqconsisting of round brackets and merge them in a stringp+s+q, that is add the stringpat the beginning of the stringsand stringqat the end of the strings.Now he wonders, how manypairsof stringspandqexists, such that the stringp+s+qis a valid sequence of round brackets. As this number may be pretty large, he wants to calculate it modulo109+ 7.InputFirst line containsnandm(1 ≤m≤n≤ 100 000,n-m≤ 2000) — the desired length of the string and the length of the string bought by Gabi, respectively.The second line contains stringsof lengthmconsisting of characters '(' and ')' only.OutputPrint the number of pairs of stringpandqsuch thatp+s+qis a valid sequence of round brackets modulo109+ 7.ExamplesInput4 1(Output4Input4 4(())Output1Input4 3(((Output0NoteIn the first sample there are four different valid pairs:p=\"(\",q=\"))\"p=\"()\",q=\")\"p=\"\",q=\"())\"p=\"\",q=\")()\"In the second sample the only way to obtain a desired string is choose emptypandq.In the third sample there is no way to get a valid sequence of brackets.",
    "source": "CF",
    "vjudge": false
}