{
    "uid": "639-A",
    "url": "https://codeforces.com/contest/639/problem/A",
    "tags": [
        "implementation"
    ],
    "title": "639-A",
    "statement": "A. Bear and Displayed Friendstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLimak is a little polar bear. He loves connecting with other bears via social networks. He hasnfriends and his relation with thei-th of them is described by a unique integerti. The bigger this value is, the better the friendship is. No two friends have the same valueti.Spring is starting and the Winter sleep is over for bears. Limak has just woken up and logged in. All his friends still sleep and thus none of them is online. Some (maybe all) of them will appear online in the next hours, one at a time.The system displays friends who are online. On the screen there is space to display at mostkfriends. If there are more thankfriends online then the system displays onlykbest of them — those with biggestti.Your task is to handle queries of two types:\"1 id\" — Friendidbecomes online. It's guaranteed that he wasn't online before.\"2 id\" — Check whether friendidis displayed by the system. Print \"YES\" or \"NO\" in a separate line.Are you able to help Limak and answer all queries of the second type?InputThe first line contains three integersn,kandq(1 ≤n,q≤ 150 000, 1 ≤k≤min(6,n)) — the number of friends, the maximum number of displayed online friends and the number of queries, respectively.The second line containsnintegerst1,t2, ...,tn(1 ≤ti≤ 109) wheretidescribes how good is Limak's relation with thei-th friend.Thei-th of the followingqlines contains two integerstypeiandidi(1 ≤typei≤ 2, 1 ≤idi≤n) — thei-th query. Iftypei= 1then a friendidibecomes online. Iftypei= 2then you should check whether a friendidiis displayed.It's guaranteed that no two queries of the first type will have the sameidibecuase one friend can't become online twice. Also, it's guaranteed that at least one query will be of the second type (typei= 2) so the output won't be empty.OutputFor each query of the second type print one line with the answer — \"YES\" (without quotes) if the given friend is displayed and \"NO\" (without quotes) otherwise.ExamplesInput4 2 8300 950 500 2001 32 42 31 11 22 12 22 3OutputNOYESNOYESYESInput6 3 950 20 51 17 99 241 31 41 51 22 42 21 12 42 3OutputNOYESNOYESNoteIn the first sample, Limak has4friends who all sleep initially. At first, the system displays nobody because nobody is online. There are the following8queries:\"1 3\" — Friend3becomes online.\"2 4\" — We should check if friend4is displayed. He isn't even online and thus we print \"NO\".\"2 3\" — We should check if friend3is displayed. Right now he is the only friend online and the system displays him. We should print \"YES\".\"1 1\" — Friend1becomes online. The system now displays both friend1and friend3.\"1 2\" — Friend2becomes online. There are3friends online now but we were givenk= 2so only two friends can be displayed. Limak has worse relation with friend1than with other two online friends (t1<t2,t3) so friend1won't be displayed\"2 1\" — Print \"NO\".\"2 2\" — Print \"YES\".\"2 3\" — Print \"YES\".",
    "source": "CF",
    "vjudge": false
}