{
    "uid": "639-D",
    "url": "https://codeforces.com/contest/639/problem/D",
    "tags": [
        "data structures",
        " greedy",
        " sortings",
        " two pointers"
    ],
    "title": "639-D",
    "statement": "D. Bear and Contributiontime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputCodeforces is a wonderful platform and one its feature shows how much someone contributes to the community. Every registered user hascontribution— an integer number, not necessarily positive. There arenregistered users and thei-th of them has contributionti.Limak is a little polar bear and he's new into competitive programming. He doesn't even have an account in Codeforces but he is able to upvote existing blogs and comments. We assume that every registered user has infinitely many blogs and comments.Limak can spendbminutes to read one blog and upvote it. Author's contribution will be increased by5.Limak can spendcminutes to read one comment and upvote it. Author's contribution will be increased by1.Note that it's possible that Limak reads blogs faster than comments.Limak likes ties. He thinks it would be awesome to see a tie between at leastkregistered users. To make it happen he is going to spend some time on reading and upvoting. After that, there should exist an integer valuexthat at leastkregistered users have contribution exactlyx.How much time does Limak need to achieve his goal?InputThe first line contains four integersn,k,bandc(2 ≤k≤n≤ 200 000, 1 ≤b,c≤ 1000) — the number of registered users, the required minimum number of users with the same contribution, time needed to read and upvote a blog, and time needed to read and upvote a comment, respectively.The second line containsnintegerst1,t2, ...,tn(|ti| ≤ 109) wheretidenotes contribution of thei-th registered user.OutputPrint the minimum number of minutes Limak will spend to get a tie between at leastkregistered users.ExamplesInput4 3 100 3012 2 6 1Output220Input4 3 30 10012 2 6 1Output190Input6 2 987 789-8 42 -4 -65 -8 -8Output0NoteIn the first sample, there are4registered users and Limak wants a tie between at least3of them. Limak should behave as follows.He spends100minutes to read one blog of the4-th user and increase his contribution from1to6.Then he spends4·30 = 120minutes to read four comments of the2-nd user and increase his contribution from2to6(four times it was increaded by1).In the given scenario, Limak spends100 + 4·30 = 220minutes and after that each of users2, 3, 4has contribution6.In the second sample, Limak needs30minutes to read a blog and100minutes to read a comment. This time he can get3users with contribution equal to12by spending100 + 3·30 = 190minutes:Spend2·30 = 60minutes to read two blogs of the1-st user to increase his contribution from2to12.Spend30 + 100minutes to read one blog and one comment of the3-rd user. His contribution will change from6to6 + 5 + 1 = 12.",
    "source": "CF",
    "vjudge": false
}