{
    "uid": "641-D",
    "url": "https://codeforces.com/contest/641/problem/D",
    "tags": [
        "dp",
        " implementation",
        " math",
        " probabilities"
    ],
    "title": "641-D",
    "statement": "D. Little Artem and Random Variabletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Artyom decided to study probability theory. He found a book with a lot of nice exercises and now wants you to help him with one of them.Consider two dices. When thrown each dice shows some integer from1toninclusive. For each dice the probability of each outcome is given (of course, their sum is1), and different dices may have different probability distributions.We throw both dices simultaneously and then calculate valuesmax(a,b)andmin(a,b), whereais equal to the outcome of the first dice, whilebis equal to the outcome of the second dice. You don't know the probability distributions for particular values on each dice, but you know the probability distributions formax(a,b)andmin(a,b). That is, for eachxfrom1tonyou know the probability thatmax(a,b)would be equal toxand the probability thatmin(a,b)would be equal tox. Find any valid probability distribution for values on the dices. It's guaranteed that the input data is consistent, that is, at least one solution exists.InputFirst line contains the integern(1 ≤n≤ 100 000) — the number of different values for both dices.Second line contains an array consisting ofnreal values with up to 8 digits after the decimal point  — probability distribution formax(a,b), thei-th of these values equals to the probability thatmax(a,b) =i. It's guaranteed that the sum of these values for one dice is1. The third line contains the description of the distributionmin(a,b)in the same format.OutputOutput two descriptions of the probability distribution foraon the first line and forbon the second line.The answer will be considered correct if each value of max(a,b) and min(a,b) probability distribution values does not differ by more than10- 6from ones given in input. Also, probabilities should be non-negative and their sums should differ from1by no more than10- 6.ExamplesInput20.25 0.750.75 0.25Output0.5 0.50.5 0.5Input30.125 0.25 0.6250.625 0.25 0.125Output0.25 0.25 0.50.5 0.25 0.25",
    "source": "CF",
    "vjudge": false
}