{
    "uid": "643-E",
    "url": "https://codeforces.com/contest/643/problem/E",
    "tags": [
        "dp",
        " math",
        " probabilities",
        " trees"
    ],
    "title": "643-E",
    "statement": "E. Bear and Destroying Subtreestime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputLimak is a little grizzly bear. He will once attack Deerland but now he can only destroy trees in role-playing games. Limak starts with a tree with one vertex. The only vertex has index1and is a root of the tree.Sometimes, a game chooses a subtree and allows Limak to attack it. When a subtree is attacked then each of its edges is destroyed with probability, independently of other edges. Then, Limak gets the penalty — an integer equal to the height of the subtree after the attack. The height is defined as the maximum number of edges on the path between the root of the subtree and any vertex in the subtree.You must handle queries of two types.1 vdenotes a query of the first type. A new vertex appears and its parent isv. A new vertex has the next available index (so, new vertices will be numbered2, 3, ...).2 vdenotes a query of the second type. For a moment let's assume that the game allows Limak to attack a subtree rooted inv. Then, what would be the expected value of the penalty Limak gets after the attack?In a query of the second type, Limak doesn't actually attack the subtree and thus the query doesn't affect next queries.InputThe first line of the input contains one integerq(1 ≤q≤ 500 000) — the number of queries.Then,qlines follow. Thei-th of them contains two integerstypeiandvi(1 ≤typei≤ 2). Iftypei= 1thenvidenotes a parent of a new vertex, while iftypei= 2then you should print the answer for a subtree rooted invi.It's guaranteed that there will be at least1query of the second type, that is, the output won't be empty.It's guaranteed that just before thei-th query a vertexvialready exists.OutputFor each query of the second type print one real number —the expected value of the penalty if Limak attacks the given subtree. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct if.ExamplesInput71 11 12 11 21 32 22 1Output0.75000000000.50000000001.1875000000Input82 11 11 21 31 42 11 42 1Output0.00000000000.93750000000.9687500000NoteBelow, you can see the drawing for the first sample. Red circles denote queries of the second type.",
    "source": "CF",
    "vjudge": false
}