{
    "uid": "643-F",
    "url": "https://codeforces.com/contest/643/problem/F",
    "tags": [
        "dp",
        " math",
        " meet-in-the-middle"
    ],
    "title": "643-F",
    "statement": "F. Bears and Juicetime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arenbears in the inn andpplaces to sleep. Bears will party together for some number of nights (and days).Bears love drinking juice. They don't like wine but they can't distinguish it from juice by taste or smell.A bear doesn't sleep unless he drinks wine. A bear must go to sleep a few hours after drinking a wine. He will wake up many days after the party is over.Radewoosh is the owner of the inn. He wants to put some number of barrels in front of bears. One barrel will contain wine and all other ones will contain juice. Radewoosh will challenge bears to find a barrel with wine.Each night, the following happens in this exact order:Each bear must choose a (maybe empty) set of barrels. The same barrel may be chosen by many bears.Each bear drinks a glass from each barrel he chose.All bears who drink wine go to sleep (exactly those bears who chose a barrel with wine). They will wake up many days after the party is over. If there are not enough places to sleep then bears lose immediately.At the end, if it's sure where wine is and there is at least one awake bear then bears win (unless they have lost before because of the number of places to sleep).Radewoosh wants to allow bears to win. He considersqscenarios. In thei-th scenario the party will last forinights. Then, letRidenote the maximum number of barrels for which bears surely win if they behave optimally. Let's define. Your task is to find, wheredenotes the exclusive or (also denoted as XOR).Note that the same barrel may be chosen by many bears and all of them will go to sleep at once.InputThe only line of the input contains three integersn,pandq(1 ≤n≤ 109,1 ≤p≤ 130,1 ≤q≤ 2 000 000) — the number of bears, the number of places to sleep and the number of scenarios, respectively.OutputPrint one integer, equal to.ExamplesInput5 1 3Output32Input1 100 4Output4Input3 2 1Output7Input100 100 100Output381863924NoteIn the first sample, there are5bears and only1place to sleep. We haveR1= 6,R2= 11,R3= 16so the answer is. Let's analyze the optimal strategy for scenario with2days. There areR2= 11barrels and10of them contain juice.In the first night, thei-th bear chooses a barrelionly.If one of the first5barrels contains wine then one bear goes to sleep. Then, bears win because they know where wine is and there is at least one awake bear.But let's say none of the first5barrels contains wine. In the second night, thei-th bear chooses a barrel5 +i.If one of barrels6 – 10contains wine then one bear goes to sleep. And again, bears win in such a situation.If nobody went to sleep then wine is in a barrel11.In the second sample, there is only one bear. He should choose an empty set of barrels in each night. Otherwise, he would maybe get wine and bears would lose (because there must be at least one awake bear). So, for any number of days we haveRi= 1. The answer is.",
    "source": "CF",
    "vjudge": false
}