{
    "uid": "645-F",
    "url": "https://codeforces.com/contest/645/problem/F",
    "tags": [
        "combinatorics",
        " math",
        " number theory"
    ],
    "title": "645-F",
    "statement": "F. Cowslip Collectionstime limit per test8 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputIn an attempt to make peace with the Mischievious Mess Makers, Bessie and Farmer John are planning to plant some flower gardens to complement the lush, grassy fields of Bovinia. As any good horticulturist knows, each garden they plant must have the exact same arrangement of flowers. Initially, Farmer John hasndifferent species of flowers he can plant, withaiflowers of thei-th species.On each of the nextqdays, Farmer John will receive a batch of flowers of a new species. On dayj, he will receivecjflowers of the same species, but of a different species from those Farmer John already has.Farmer John, knowing the right balance between extravagance and minimalism, wants exactlykspecies of flowers to be used. Furthermore, to reduce waste, each flower of thekspecies Farmer John chooses must be planted in some garden. And each of the gardens must be identical; that is to say that each of thekchosen species should have an equal number of flowers in each garden. As Farmer John is a proponent of national equality, he would like to create the greatest number of gardens possible.After receiving flowers on each of theseqdays, Farmer John would like to know the sum, over all possible choices ofkspecies, of the maximum number of gardens he could create. Since this could be a large number, you should output your result modulo109+ 7.InputThe first line of the input contains three integersn,kandq(1 ≤k≤n≤ 100 000,1 ≤q≤ 100 000).Thei-th (1 ≤i≤n) of the nextnlines of the input contains an integerai(1 ≤ai≤ 1 000 000), the number of flowers of speciesiFarmer John has initially.Thej-th (1 ≤j≤q) of the nextqlines of the input contains an integercj(1 ≤cj≤ 1 000 000), the number of flowers of a new species Farmer John receives on dayj.OutputAfter each of theqdays, output the sum of the maximum possible number of gardens, where the sum is taken over all possible choices ofkspecies, modulo109+ 7.ExamplesInput3 3 246986Output516Input4 1 2654321Output2021NoteIn the first sample case, after the first day Farmer John has(4, 6, 9, 8)of each type of flower, andk= 3.Choosing(4, 6, 8)lets him make2gardens, each with(2, 3, 4)of each flower, respectively. Choosing(4, 6, 9),(4, 9, 8)and(6, 9, 8)each only let him make one garden, since there is no number of gardens that each species can be evenly split into. So the sum over all choices ofk= 3flowers is2 + 1 + 1 + 1 = 5.After the second day, Farmer John has(4, 6, 9, 8, 6)of each flower. The sum over all choices is1 + 2 + 2 + 1 + 1 + 2 + 2 + 3 + 1 + 1 = 16.In the second sample case,k= 1. Withxflowers Farmer John can makexgardens. So the answers to the queries are6 + 5 + 4 + 3 + 2 = 20and6 + 5 + 4 + 3 + 2 + 1 = 21.",
    "source": "CF",
    "vjudge": false
}