{
    "uid": "645-G",
    "url": "https://codeforces.com/contest/645/problem/G",
    "tags": [
        "binary search",
        " geometry"
    ],
    "title": "645-G",
    "statement": "G. Armistice Area Apportionmenttime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter a drawn-out mooclear arms race, Farmer John and the Mischievous Mess Makers have finally agreed to establish peace. They plan to divide the territory of Bovinia with a line passing through at least two of thenoutposts scattered throughout the land. These outposts, remnants of the conflict, are located at the points(x1,y1), (x2,y2), ..., (xn,yn).In order to find the optimal dividing line, Farmer John and Elsie have plotted a map of Bovinia on the coordinate plane. Farmer John's farm and the Mischievous Mess Makers' base are located at the pointsP= (a, 0)andQ= ( -a, 0), respectively. Because they seek a lasting peace, Farmer John and Elsie would like to minimize the maximum difference between the distances from any point on the line toPandQ.Formally, define thedifferenceof a linerelative to two pointsPandQas the smallest real numberdso that for all pointsXon line,|PX-QX| ≤d. (It is guaranteed thatdexists and is unique.) They wish to find the linepassing through two distinct outposts(xi,yi)and(xj,yj)such that the difference ofrelative toPandQis minimized.InputThe first line of the input contains two integersnanda(2 ≤n≤ 100 000,1 ≤a≤ 10 000) — the number of outposts and the coordinates of the farm and the base, respectively.The followingnlines describe the locations of the outposts as pairs of integers(xi,yi)(|xi|, |yi| ≤ 10 000). These points are distinct from each other as well as fromPandQ.OutputPrint a single real number—the difference of the optimal dividing line. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput2 51 02 1Output7.2111025509Input3 60 12 50 -3Output0.0000000000NoteIn the first sample case, the only possible lineisy=x- 1. It can be shown that the pointXwhich maximizes|PX-QX|is(13, 12), with, which is.In the second sample case, if we pick the points(0, 1)and(0,  - 3), we getasx= 0. BecausePX=QXon this line, the minimum possible difference is0.",
    "source": "CF",
    "vjudge": false
}