{
    "uid": "648-D",
    "url": "https://codeforces.com/contest/648/problem/D",
    "tags": [
        "data structures",
        " greedy",
        " sortings"
    ],
    "title": "648-D",
    "statement": "D. Собачки и мискиограничение по времени на тест2 секундыограничение по памяти на тест256 мегабайтвводстандартный вводвыводстандартный выводНа координатной прямой сидитnсобачек,i-я собачка находится в точкеxi. Кроме того, на прямой естьmмисок с едой, для каждой известна её координата на прямойujи времяtj, через которое еда в миске остынет и станет невкусной. Это значит, что если собачка прибежит к миске в момент времени, строго большийtj, то еда уже остынет, и собачка кушать её не станет.Считая, что каждая собачка бежит со скоростью1, найдите максимальное количество собачек, которые смогут покушать. Считайте, что собачки побегут к тем мискам, на которые вы им укажете. Из одной миски не могут кушать две или более собачки.Собачки могут обгонять друг друга, то есть, если одна из них остановится покушать, другая может пройти мимо неё, чтобы попасть к другой миске.Входные данныеВ первой строке находится пара целых чиселnиm(1 ≤n,m≤ 200 000) — количество собачек и мисок соответственно.Во второй строке находятсяnцелых чиселxi(- 109≤xi≤ 109) — координатаi-й собачки.В следующихmстроках находятся пары целых чиселujиtj(- 109≤uj≤ 109,1 ≤tj≤ 109) — координатаj-й миски и время, когда остынет еда в ней, соответственно.Гарантируется, что никакие две собачки не находятся в одной точке. Никакие две миски также не могут находиться в одной точке.Выходные данныеВыведите одно целое числоa— максимальное количество собачек, которые смогут покушать.ПримерыВходные данные5 4-2 0 4 8 13-1 14 36 311 2Выходные данные4Входные данные3 3-1 3 71 14 17 1Выходные данные2Входные данные4 420 1 10 301 12 522 240 10Выходные данные3ПримечаниеВ первом примере первая собачка побежит направо к первой миске, третья собачка сразу начнёт есть из второй миски, четвёртая собачка побежит влево к третьей миске, а пятая собачка побежит влево к четвёртой миске.",
    "source": "CF",
    "vjudge": false
}