{
    "uid": "649-B",
    "url": "https://codeforces.com/contest/649/problem/B",
    "tags": [
        "constructive algorithms"
    ],
    "title": "649-B",
    "statement": "B. Этажиограничение по времени на тест2 секундыограничение по памяти на тест256 мегабайтвводстандартный вводвыводстандартный выводЕстьn-подъездный дом, в каждом подъезде поmэтажей, и на каждом этаже каждого подъезда ровноkквартир. Таким образом, в доме всегоn·m·kквартир. Они пронумерованы естественным образом от1доn·m·k, то есть первая квартира на первом этаже в первом подъезде имеет номер1, первая квартира на втором этаже первого подъезда имеет номерk+ 1и так далее. Особенность этого дома состоит в том, что он круглый. То есть если обходить его по часовой стрелке, то после подъезда номер1следует подъезд номер2, затем подъезд номер3и так далее до подъезда номерn. После подъезда номерnснова идёт подъезд номер1.Эдвард живёт в квартире номерa, а Наташа — в квартире номерb. Переход на1этаж вверх или вниз по лестнице занимает5секунд, переход от двери подъезда к двери соседнего подъезда —15секунд, а переход в пределах одного этажа одного подъезда происходит мгновенно. Также в каждом подъезде дома есть лифт. Он устроен следующим образом: он всегда приезжает ровно через10секунд после вызова, а чтобы переместить пассажира на один этаж вверх или вниз, лифт тратит ровно1секунду. Посадка и высадка происходят мгновенно.Помогите Эдварду найти минимальное время, за которое он сможет добраться до квартиры Наташи. Считайте, что Эдвард может выйти из подъезда только с первого этажа соответствующего подъезда (это происходит мгновенно). Если Эдвард стоит перед дверью какого-то подъезда, он может зайти в него и сразу окажется на первом этаже этого подъезда (это также происходит мгновенно). Эдвард может выбирать, в каком направлении идти вокруг дома.Входные данныеВ первой строке входных данных следуют три числаn,m,k(1 ≤n,m,k≤ 1000) — количество подъездов в доме, количество этажей в каждом подъезде и количество квартир на каждом этаже каждого подъезда соответственно.Во второй строке входных данных записаны два числаaиb(1 ≤a,b≤n·m·k) — номера квартир, в которых живут Эдвард и Наташа, соответственно. Гарантируется, что эти номера различны.Выходные данныеВыведите единственное целое число — минимальное время (в секундах), за которое Эдвард сможет добраться от своей квартиры до квартиры Наташи.ПримерыВходные данные4 10 5200 6Выходные данные39Входные данные3 1 57 2Выходные данные15ПримечаниеВ первом тестовом примере Эдвард находится в4подъезде на10этаже, а Наташа находится в1подъезде на2этаже. Поэтому Эдварду выгодно сначала спуститься на лифте на первый этаж (на это он потратит19секунд, из которых10— на ожидание и9— на поездку на лифте), затем обойти дом против часовой стрелки до подъезда номер1(на это он потратит15секунд), и наконец подняться по лестнице на этаж номер2(на это он потратит5секунд). Таким образом, ответ равен19 + 15 + 5 = 39.Во втором тестовом примере Эдвард живёт в подъезде2на этаже1, а Наташа находится в подъезде1на этаже1. Поэтому Эдварду выгодно просто обойти дом по часовой стрелке до подъезда1, на это он потратит15секунд.",
    "source": "CF",
    "vjudge": false
}