{
    "uid": "65-C",
    "url": "https://codeforces.com/contest/65/problem/C",
    "tags": [
        "binary search",
        " geometry"
    ],
    "title": "65-C",
    "statement": "C. Harry Potter and the Golden Snitchtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBrothers Fred and George Weasley once got into the sporting goods store and opened a box of Quidditch balls. After long and painful experiments they found out that the Golden Snitch is not enchanted at all. It is simply a programmed device. It always moves along the same trajectory, which is a polyline with vertices at the points(x0,y0,z0),(x1,y1,z1), ...,(xn,yn,zn). At the beginning of the game the snitch is positioned at the point(x0,y0,z0), and then moves along the polyline at the constant speedvs. The twins have not yet found out how the snitch behaves then. Nevertheless, they hope that the retrieved information will help Harry Potter and his team in the upcoming match against Slytherin. Harry Potter learned that at the beginning the game he will be at the point(Px,Py,Pz)and his super fast Nimbus 2011 broom allows him to move at the constant speedvpin any direction or remain idle.vpis not less than the speed of the snitchvs. Harry Potter, of course, wants to catch the snitch as soon as possible. Or, if catching the snitch while it is moving along the polyline is impossible, he wants to hurry the Weasley brothers with their experiments. Harry Potter catches the snitch at the time when they are at the same point. Help Harry.InputThe first line contains a single integern(1 ≤n≤ 10000). The followingn+ 1lines contain the coordinatesxi,yi,zi, separated by single spaces. The coordinates of any two consecutive points do not coincide. The next line contains the velocitiesvpandvs, the last line containsPx,Py,Pz, separated by single spaces. All the numbers in the input are integers, their absolute value does not exceed104. The speeds are strictly positive. It is guaranteed thatvs≤vp.OutputIf Harry Potter can catch the snitch while it is moving along the polyline (including the end(xn,yn,zn)), print \"YES\" in the first line (without the quotes). Print in the second linet, which is the earliest moment of time, when Harry will be able to catch the snitch. On the third line print three numbersX,Y,Z, the coordinates of the point at which this happens. The absolute or relative error in the answer should not exceed10- 6. If Harry is not able to catch the snitch during its moving along the described polyline, print \"NO\".ExamplesInput40 0 00 10 010 10 010 0 00 0 01 15 5 25OutputYES25.500000000010.0000000000 4.5000000000 0.0000000000Input40 0 00 10 010 10 010 0 00 0 01 15 5 50OutputNOInput11 2 34 5 620 101 2 3OutputYES0.00000000001.0000000000 2.0000000000 3.0000000000",
    "source": "CF",
    "vjudge": false
}