{
    "uid": "658-A",
    "url": "https://codeforces.com/contest/658/problem/A",
    "tags": [
        "implementation"
    ],
    "title": "658-A",
    "statement": "A. Bear and Reverse Radewooshtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLimak and Radewoosh are going to compete against each other in the upcoming algorithmic contest. They are equally skilled but they won't solve problems in the same order.There will benproblems. Thei-th problem has initial scorepiand it takes exactlytiminutes to solve it. Problems are sorted by difficulty — it's guaranteed thatpi<pi+ 1andti<ti+ 1.A constantcis given too, representing the speed of loosing points. Then, submitting thei-th problem at timex(xminutes after the start of the contest) givesmax(0,pi-c·x)points.Limak is going to solve problems in order1, 2, ...,n(sorted increasingly bypi). Radewoosh is going to solve them in ordern,n- 1, ..., 1(sorted decreasingly bypi). Your task is to predict the outcome — print the name of the winner (person who gets more points at the end) or a word \"Tie\" in case of a tie.You may assume that the duration of the competition is greater or equal than the sum of allti. That means both Limak and Radewoosh will accept allnproblems.InputThe first line contains two integersnandc(1 ≤n≤ 50, 1 ≤c≤ 1000) — the number of problems and the constant representing the speed of loosing points.The second line containsnintegersp1,p2, ...,pn(1 ≤pi≤ 1000,pi<pi+ 1) — initial scores.The third line containsnintegerst1,t2, ...,tn(1 ≤ti≤ 1000,ti<ti+ 1) wheretidenotes the number of minutes one needs to solve thei-th problem.OutputPrint \"Limak\" (without quotes) if Limak will get more points in total. Print \"Radewoosh\" (without quotes) if Radewoosh will get more points in total. Print \"Tie\" (without quotes) if Limak and Radewoosh will get the same total number of points.ExamplesInput3 250 85 25010 15 25OutputLimakInput3 650 85 25010 15 25OutputRadewooshInput8 110 20 30 40 50 60 70 808 10 58 63 71 72 75 76OutputTieNoteIn the first sample, there are3problems. Limak solves them as follows:Limak spends10minutes on the1-st problem and he gets50 -c·10 = 50 - 2·10 = 30points.Limak spends15minutes on the2-nd problem so he submits it10 + 15 = 25minutes after the start of the contest. For the2-nd problem he gets85 - 2·25 = 35points.He spends25minutes on the3-rd problem so he submits it10 + 15 + 25 = 50minutes after the start. For this problem he gets250 - 2·50 = 150points.So, Limak got30 + 35 + 150 = 215points.Radewoosh solves problem in the reversed order:Radewoosh solves3-rd problem after25minutes so he gets250 - 2·25 = 200points.He spends15minutes on the2-nd problem so he submits it25 + 15 = 40minutes after the start. He gets85 - 2·40 = 5points for this problem.He spends10minutes on the1-st problem so he submits it25 + 15 + 10 = 50minutes after the start. He getsmax(0, 50 - 2·50) =max(0,  - 50) = 0points.Radewoosh got200 + 5 + 0 = 205points in total. Limak has215points so Limak wins.In the second sample, Limak will get0points for each problem and Radewoosh will first solve the hardest problem and he will get250 - 6·25 = 100points for that. Radewoosh will get0points for other two problems but he is the winner anyway.In the third sample, Limak will get2points for the1-st problem and2points for the2-nd problem. Radewoosh will get4points for the8-th problem. They won't get points for other problems and thus there is a tie because2 + 2 = 4.",
    "source": "CF",
    "vjudge": false
}