{
    "uid": "659-E",
    "url": "https://codeforces.com/contest/659/problem/E",
    "tags": [
        "data structures",
        " dfs and similar",
        " dsu",
        " graphs",
        " greedy"
    ],
    "title": "659-E",
    "statement": "E. New Reformtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputBerland hasncities connected bymbidirectional roads. No road connects a city to itself, and each pair of cities is connected by no more than one road. It isnot guaranteedthat you can get from any city to any other one, using only the existing roads.The President of Berland decided to make changes to the road system and instructed the Ministry of Transport to make this reform. Now, each road should be unidirectional (only lead from one city to another).In order not to cause great resentment among residents, the reform needs to be conducted so that there can be as few separate cities as possible. A city is consideredseparate, if no road leads into it, while it is allowed to have roads leading from this city.Help the Ministry of Transport to find the minimum possible number of separate cities after the reform.InputThe first line of the input contains two positive integers,nandm— the number of the cities and the number of roads in Berland (2 ≤n≤ 100 000,1 ≤m≤ 100 000).Nextmlines contain the descriptions of the roads: thei-th road is determined by two distinct integersxi,yi(1 ≤xi,yi≤n,xi≠yi), wherexiandyiare the numbers of the cities connected by thei-th road.It is guaranteed that there is no more than one road between each pair of cities, but it is not guaranteed that from any city you can get to any other one, using only roads.OutputPrint a single integer — the minimum number of separated cities after the reform.ExamplesInput4 32 11 34 3Output1Input5 52 11 32 32 54 3Output0Input6 51 22 34 54 65 6Output1NoteIn the first sample the following road orientation is allowed:,,.The second sample:,,,,.The third sample:,,,,.",
    "source": "CF",
    "vjudge": false
}