{
    "uid": "670-C",
    "url": "https://codeforces.com/contest/670/problem/C",
    "tags": [
        "implementation",
        " sortings"
    ],
    "title": "670-C",
    "statement": "C. Cinematime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMoscow is hosting a major international conference, which is attended bynscientists from different countries. Each of the scientists knows exactly one language. For convenience, we enumerate all languages of the world with integers from1to109.In the evening after the conference, allnscientists decided to go to the cinema. There aremmovies in the cinema they came to. Each of the movies is characterized by twodistinctnumbers — the index of audio language and the index of subtitles language. The scientist, who came to the movie, will bevery pleasedif he knows the audio language of the movie, will bealmost satisfiedif he knows the language of subtitles and will benot satisfiedif he does not know neither one nor the other (note that the audio language and the subtitles language for each movie are always different).Scientists decided to go together to the same movie. You have to help them choose the movie, such that the number of very pleased scientists is maximum possible. If there are several such movies, select among them one that will maximize the number of almost satisfied scientists.InputThe first line of the input contains a positive integern(1 ≤n≤ 200 000) — the number of scientists.The second line containsnpositive integersa1,a2, ...,an(1 ≤ai≤ 109), whereaiis the index of a language, which thei-th scientist knows.The third line contains a positive integerm(1 ≤m≤ 200 000) — the number of movies in the cinema.The fourth line containsmpositive integersb1,b2, ...,bm(1 ≤bj≤ 109), wherebjis the index of the audio language of thej-th movie.The fifth line containsmpositive integersc1,c2, ...,cm(1 ≤cj≤ 109), wherecjis the index of subtitles language of thej-th movie.It is guaranteed that audio languages and subtitles language are different for each movie, that isbj≠cj.OutputPrint the single integer — the index of a movie to which scientists should go. After viewing this movie the number of very pleased scientists should be maximum possible. If in the cinema there are several such movies, you need to choose among them one, after viewing which there will be the maximum possible number of almost satisfied scientists.If there are several possible answers print any of them.ExamplesInput32 3 223 22 3Output2Input66 3 1 1 3 751 2 3 4 52 3 4 5 1Output1NoteIn the first sample, scientists must go to the movie with the index2, as in such case the1-th and the3-rd scientists will be very pleased and the2-nd scientist will be almost satisfied.In the second test case scientists can go either to the movie with the index1or the index3. After viewing any of these movies exactlytwoscientists will be very pleased and all the others will be not satisfied.",
    "source": "CF",
    "vjudge": false
}