{
    "uid": "671-E",
    "url": "https://codeforces.com/contest/671/problem/E",
    "tags": [
        "data structures",
        " greedy"
    ],
    "title": "671-E",
    "statement": "E. Organizing a Racetime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputKekoland is a country withnbeautiful cities numbered from left to right and connected byn- 1roads. Thei-th road connects citiesiandi+ 1and length of this road iswikilometers.When you drive in Kekoland, each time you arrive in cityiby car you immediately receivegiliters of gas. There is no other way to get gas in Kekoland.You were hired by the Kekoland president Keko to organize the most beautiful race Kekoland has ever seen. Let race be between citieslandr(l≤r). Race will consist of two stages. On the first stage cars will go from citylto cityr. After completing first stage, next day second stage will be held, now racers will go fromrtolwith their cars. Of course, as it is a race, racers drive directly from start city to finish city. It means that at the first stage they will go only right, and at the second stage they go only left. Beauty of the race betweenlandris equal tor-l+ 1since racers will seer-l+ 1beautiful cities of Kekoland. Cars have infinite tank so racers will take all the gas given to them.At the beginning ofeach stageracers start the race with empty tank (0liters of gasoline). They will immediately take their gasoline in start cities (lfor the first stage andrfor the second stage) right after the race starts.It may not be possible to organize a race betweenlandrif cars will run out of gas before they reach finish.You havekpresents. Each time you give a present to cityiits valuegiincreases by1. You may distribute presents among cities in any way (also give many presents to one city, each time increasinggiby1). What is the most beautiful race you can organize?Each car consumes1liter of gas per one kilometer.InputThe first line of the input contains two integersnandk(2 ≤n≤ 100 000,0 ≤k≤ 109) — the number of cities in Kekoland and the number of presents you have, respectively.Next line containsn- 1integers. Thei-th of them iswi(1 ≤wi≤ 109) — the length of the road between cityiandi+ 1.Next line containsnintegers. Thei-th of them isgi(0 ≤gi≤ 109) — the amount of gas you receive every time you enter cityi.OutputPrint a single line — the beauty of the most beautiful race you can organize.ExamplesInput4 42 2 21 1 1 1Output4Input8 52 2 2 3 7 3 11 3 1 5 4 0 2 5Output7NoteIn first sample if you give one present to each city then it will be possible to make a race between city1and city4.In second sample you should add1tog5and4tog6, then it will be possible to make a race between cities2and8.",
    "source": "CF",
    "vjudge": false
}