{
    "uid": "676-E",
    "url": "https://codeforces.com/contest/676/problem/E",
    "tags": [
        "math"
    ],
    "title": "676-E",
    "statement": "E. The Last Fight Between Human and AItime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard output100 years have passed since the last victory of the man versus computer in Go. Technologies made a huge step forward and robots conquered the Earth! It's time for the final fight between human and robot that will decide the faith of the planet.The following game was chosen for the fights: initially there is a polynomialP(x) =anxn+an- 1xn- 1+ ... +a1x+a0,with yet undefined coefficients and the integerk. Players alternate their turns. At each turn, a player pick some indexj, such that coefficientajthat stay nearxjis not determined yet and sets it toanyvalue (integer or real, positive or negative,0is also allowed). Computer moves first. The human will be declared the winner if and only if the resulting polynomial will be divisible byQ(x) =x-k.PolynomialP(x)is said to be divisible by polynomialQ(x)if there exists a representationP(x) =B(x)Q(x), whereB(x)is also some polynomial.Some moves have been made already and now you wonder, is it true that human can guarantee the victory if he plays optimally?InputThe first line of the input contains two integersnandk(1 ≤n≤ 100 000, |k| ≤ 10 000) — the size of the polynomial and the integerk.Thei-th of the followingn+ 1lines contain character '?' if the coefficient nearxi- 1is yet undefined or the integer valueai, if the coefficient is already known (- 10 000 ≤ai≤ 10 000). Each of integersai(and evenan) may be equal to0.Please note, that it's not guaranteed that you are given the position of the game where it's computer's turn to move.OutputPrint \"Yes\" (without quotes) if the human has winning strategy, or \"No\" (without quotes) otherwise.ExamplesInput1 2-1?OutputYesInput2 100-1000001OutputYesInput4 5?1?1?OutputNoNoteIn the first sample, computer seta0to- 1on the first move, so if human can set coefficienta1to0.5and win.In the second sample, all coefficients are already set and the resulting polynomial is divisible byx- 100, so the human has won.",
    "source": "CF",
    "vjudge": false
}