{
    "uid": "677-B",
    "url": "https://codeforces.com/contest/677/problem/B",
    "tags": [
        "implementation",
        " math"
    ],
    "title": "677-B",
    "statement": "B. Vanya and Food Processortime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVanya smashes potato in a vertical food processor. At each moment of time the height of the potato in the processor doesn't exceedhand the processor smasheskcentimeters of potato each second. If there are less thankcentimeters remaining, than during this second processor smashes all the remaining potato.Vanya hasnpieces of potato, the height of thei-th piece is equal toai. He puts them in the food processor one by one starting from the piece number1and finishing with piece numbern. Formally, each second the following happens:If there is at least one piece of potato remaining, Vanya puts them in the processor one by one, until there is not enough space for the next piece.Processor smasheskcentimeters of potato (or just everything that is inside).Provided the information about the parameter of the food processor and the size of each potato in a row, compute how long will it take for all the potato to become smashed.InputThe first line of the input contains integersn,handk(1 ≤n≤ 100 000, 1 ≤k≤h≤ 109) — the number of pieces of potato, the height of the food processor and the amount of potato being smashed each second, respectively.The second line containsnintegersai(1 ≤ai≤h) — the heights of the pieces.OutputPrint a single integer — the number of seconds required to smash all the potatoes following the process described in the problem statement.ExamplesInput5 6 35 4 3 2 1Output5Input5 6 35 5 5 5 5Output10Input5 6 31 2 1 1 1Output2NoteConsider the first sample.First Vanya puts the piece of potato of height5into processor. At the end of the second there is only amount of height2remaining inside.Now Vanya puts the piece of potato of height4. At the end of the second there is amount of height3remaining.Vanya puts the piece of height3inside and again there are only3centimeters remaining at the end of this second.Vanya finally puts the pieces of height2and1inside. At the end of the second the height of potato in the processor is equal to3.During this second processor finally smashes all the remaining potato and the process finishes.In the second sample, Vanya puts the piece of height5inside and waits for2seconds while it is completely smashed. Then he repeats the same process for4other pieces. The total time is equal to2·5 = 10seconds.In the third sample, Vanya simply puts all the potato inside the processor and waits2seconds.",
    "source": "CF",
    "vjudge": false
}