{
    "uid": "680-B",
    "url": "https://codeforces.com/contest/680/problem/B",
    "tags": [
        "constructive algorithms",
        " implementation"
    ],
    "title": "680-B",
    "statement": "B. Bear and Finding Criminalstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arencities in Bearland, numbered1throughn. Cities are arranged in one long row. The distance between citiesiandjis equal to|i-j|.Limak is a police officer. He lives in a citya. His job is to catch criminals. It's hard because he doesn't know in which cities criminals are. Though, he knows that there isat most onecriminal in each city.Limak is going to use a BCD (Bear Criminal Detector). The BCD will tell Limak how many criminals there are for every distance from a citya. After that, Limak can catch a criminal in each city for which heis surethat there must be a criminal.You know in which cities criminals are. Count the number of criminals Limak will catch, after he uses the BCD.InputThe first line of the input contains two integersnanda(1 ≤a≤n≤ 100) — the number of cities and the index of city where Limak lives.The second line containsnintegerst1,t2, ...,tn(0 ≤ti≤ 1). There areticriminals in thei-th city.OutputPrint the number of criminals Limak will catch.ExamplesInput6 31 1 1 0 1 0Output3Input5 20 0 0 1 0Output1NoteIn the first sample, there are six cities and Limak lives in the third one (blue arrow below). Criminals are in cities marked red.Using the BCD gives Limak the following information:There is one criminal at distance0from the third city — Limak is sure that this criminal is exactly in the third city.There is one criminal at distance1from the third city — Limak doesn't know if a criminal is in the second or fourth city.There are two criminals at distance2from the third city — Limak is sure that there is one criminal in the first city and one in the fifth city.There are zero criminals for every greater distance.So, Limak will catch criminals in cities1,3and5, that is3criminals in total.In the second sample (drawing below), the BCD gives Limak the information that there is one criminal at distance2from Limak's city. There is only one city at distance2so Limak is sure where a criminal is.",
    "source": "CF",
    "vjudge": false
}