{
    "uid": "681-D",
    "url": "https://codeforces.com/contest/681/problem/D",
    "tags": [
        "constructive algorithms",
        " dfs and similar",
        " graphs",
        " trees"
    ],
    "title": "681-D",
    "statement": "D. Gifts by the Listtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSasha lives in a big happy family. At the Man's Day all the men of the family gather to celebrate it following their own traditions. There arenmen in Sasha's family, so let's number them with integers from1ton.Each man has at most one father but may have arbitrary number of sons.Man numberAis considered to be theancestorof the man numberBif at least one of the following conditions is satisfied:A=B;the man numberAis the father of the man numberB;there is a man numberC, such that the man numberAis his ancestor and the man numberCis the father of the man numberB.Of course, if the man numberAis an ancestor of the man numberBandA≠B, then the man numberBis not an ancestor of the man numberA.The tradition of the Sasha's family is to give gifts at the Man's Day. Because giving gifts in a normal way is boring, each year the following happens.A list of candidates is prepared, containing some (possibly all) of thenmen in some order.Each of thenmen decides to give a gift.In order to choose a person to give a gift to, manAlooks through the list and picks the first manBin the list, such thatBis an ancestor ofAand gives him a gift. Note that according to definition it may happen that a person gives a gift to himself.If there is no ancestor of a person in the list, he becomes sad and leaves the celebration without giving a gift to anyone.This year you have decided to help in organizing celebration and asked each of thenmen, who do they want to give presents to (this person is chosen only among ancestors). Are you able to make a list of candidates, such that all the wishes will be satisfied if they give gifts according to the process described above?InputIn the first line of the input two integersnandm(0 ≤m<n≤ 100 000) are given — the number of the men in the Sasha's family and the number of family relations in it respectively.The nextmlines describe family relations: the(i+ 1)thline consists of pair of integerspiandqi(1 ≤pi,qi≤n,pi≠qi) meaning that the man numberedpiis the father of the man numberedqi. It is guaranteed that every pair of numbers appears at most once, that among every pair of two different men at least one of them is not an ancestor of another and that every man has at most one father.The next line containsnintegersa1,a2, ...,an(1 ≤ai≤n),ithof which means that the man numberediwants to give a gift to the man numberedai. It is guaranteed that for every1 ≤i≤nthe man numberedaiis an ancestor of the man numberedi.OutputPrint an integerk(1 ≤k≤n)— the number of the men in the list of candidates, in the first line.Print thenkpairwise different positive integers not exceedingn— the numbers of the men in the list in an order satisfying every of the men's wishes, one per line.If there are more than one appropriate lists, print any of them. If there is no appropriate list print- 1in the only line.ExamplesInput3 21 22 31 2 1Output-1Input4 21 23 41 2 3 3Output3213NoteThe first sample explanation:if there would be no1in the list then the first and the third man's wishes would not be satisfied(a1=a3= 1);if there would be no2in the list then the second man wish would not be satisfied(a2= 2);if1would stay before2in the answer then the second man would have to give his gift to the first man, but he wants to give it to himself(a2= 2).if, at the other hand, the man numbered2would stay before the man numbered1, then the third man would have to give his gift to the second man, but not to the first(a3= 1).",
    "source": "CF",
    "vjudge": false
}