{
    "uid": "685-C",
    "url": "https://codeforces.com/contest/685/problem/C",
    "tags": [
        "binary search",
        " math"
    ],
    "title": "685-C",
    "statement": "C. Optimal Pointtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhen the river brought Gerda to the house of the Old Lady who Knew Magic, this lady decided to make Gerda her daughter. She wants Gerda to forget about Kay, so she puts all the roses from the garden underground.Mole, who lives in this garden, now can watch the roses without going up to the surface. Typical mole is blind, but this mole was granted as special vision by the Old Lady. He can watch any underground objects on any distance, even through the obstacles and other objects. However, the quality of the picture depends on the Manhattan distance to object being observed.Mole wants to find anoptimalpoint to watch roses, that is such point withinteger coordinatesthat the maximum Manhattan distance to the rose is minimum possible.As usual, he asks you to help.Manhattan distancebetween points(x1,y1,z1)and(x2,y2,z2)is defined as|x1-x2| + |y1-y2| + |z1-z2|.InputThe first line of the input contains an integertt(1 ≤t≤ 100 000) — the number of test cases. Then follow exactlytblocks, each containing the description of exactly one test.The first line of each block contains an integerni(1 ≤ni≤ 100 000) — the number of roses in the test. Then follownilines, containing three integers each — the coordinates of the corresponding rose. Note that two or more roses may share the same position.It's guaranteed that the sum of allnidoesn't exceed100 000and all coordinates are not greater than1018by their absolute value.OutputFor each ofttest cases print three integers — the coordinates of the optimal point to watch roses. If there are many optimal answers, print any of them.The coordinates of the optimal point may coincide with the coordinates of any rose.ExamplesInput150 0 40 0 -40 4 04 0 01 1 1Output0 0 0Input213 5 923 5 93 5 9Output3 5 93 5 9NoteIn the first sample, the maximum Manhattan distance from the point to the rose is equal to4.In the second sample, the maximum possible distance is0. Note that the positions of the roses may coincide with each other and with the position of the optimal point.",
    "source": "CF",
    "vjudge": false
}