{
    "uid": "69-D",
    "url": "https://codeforces.com/contest/69/problem/D",
    "tags": [
        "dp",
        " games"
    ],
    "title": "69-D",
    "statement": "D. Dottime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAnton and Dasha like to play different games during breaks on checkered paper. By the 11th grade they managed to play all the games of this type and asked Vova the programmer to come up with a new game. Vova suggested to them to play a game under the code name \"dot\" with the following rules:On the checkered paper a coordinate system is drawn. A dot is initially put in the position(x,y).A move is shifting a dot to one of the pre-selected vectors. Also each player can once per game symmetrically reflect a dot relatively to the liney=x.Anton and Dasha take turns. Anton goes first.The player after whose move the distance from the dot to the coordinates' origin exceedsd, loses.Help them to determine the winner.InputThe first line of the input file contains 4 integersx,y,n,d(- 200 ≤x,y≤ 200, 1 ≤d≤ 200, 1 ≤n≤ 20) — the initial coordinates of the dot, the distancedand the number of vectors. It is guaranteed that the initial dot is at the distance less thandfrom the origin of the coordinates. The followingnlines each contain two non-negative numbersxiandyi(0 ≤xi,yi≤ 200) — the coordinates of the i-th vector. It is guaranteed that all the vectors are nonzero and different.OutputYou should print \"Anton\", if the winner is Anton in case of both players play the game optimally, and \"Dasha\" otherwise.ExamplesInput0 0 2 31 11 2OutputAntonInput0 0 2 41 11 2OutputDashaNoteIn the first test, Anton goes to the vector (1;2), and Dasha loses. In the second test Dasha with her first move shifts the dot so that its coordinates are (2;3), and Anton loses, as he has the only possible move — to reflect relatively to the liney=x. Dasha will respond to it with the same move and return the dot in position (2;3).",
    "source": "CF",
    "vjudge": false
}