{
    "uid": "696-C",
    "url": "https://codeforces.com/contest/696/problem/C",
    "tags": [
        "combinatorics",
        " dp",
        " implementation",
        " math",
        " matrices"
    ],
    "title": "696-C",
    "statement": "C. PLEASEtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAs we all know Barney's job is \"PLEASE\" and he has not much to do at work. That's why he started playing \"cups and key\". In this game there are three identical cups arranged in a line from left to right. Initially key to Barney's heart is under the middle cup.Then at one turn Barney swaps the cup in the middle with any of other two cups randomly (he choses each with equal probability), so the chosen cup becomes the middle one. Game lastsnturns and Barneyindependently chosesa cup to swap with the middle one within each turn, and the key always remains in the cup it was at the start.Aftern-th turn Barney asks a girl to guess which cup contains the key. The girl points to the middle one but Barney was distracted while making turns and doesn't know if the key is under the middle cup. That's why he asked you to tell him the probability that girl guessed right.Numbernof game turns can be extremely large, that's why Barney did not give it to you. Instead he gave you an arraya1,a2, ...,aksuch thatin other words,nis multiplication of all elements of the given array.Because of precision difficulties, Barney asked you to tell him the answer as an irreducible fraction. In other words you need to find it as a fractionp/qsuch that, whereis the greatest common divisor. Sincepandqcan be extremely large, you only need to find the remainders of dividing each of them by109+ 7.Please note that we wantofpandqto be1,notof their remaindersafter dividing by109+ 7.InputThe first line of input contains a single integerk(1 ≤k≤ 105) — the number of elements in array Barney gave you.The second line containskintegersa1,a2, ...,ak(1 ≤ai≤ 1018) — the elements of the array.OutputIn the only line of output print a single stringx/ywherexis the remainder of dividingpby109+ 7andyis the remainder of dividingqby109+ 7.ExamplesInput12Output1/2Input31 1 1Output0/1",
    "source": "CF",
    "vjudge": false
}