{
    "uid": "696-A",
    "url": "https://codeforces.com/contest/696/problem/A",
    "tags": [
        "brute force",
        " data structures",
        " implementation",
        " trees"
    ],
    "title": "696-A",
    "statement": "A. Lorenzo Von Matterhorntime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputBarney lives in NYC. NYC has infinite number of intersections numbered with positive integers starting from 1. There exists a bidirectional road between intersectionsiand2iand another road betweeniand2i+ 1for every positive integeri. You can clearly see that there exists a unique shortest path between any two intersections.Initially anyone can pass any road for free. But since SlapsGiving is ahead of us, there willqconsecutive events happen soon. There are two types of events:1. Government makes a new rule. A rule can be denoted by integersv,uandw. As the result of this action, the passing fee of all roads on the shortest path fromutovincreases bywdollars.2. Barney starts moving from some intersectionvand goes to intersectionuwhere there's a girl he wants to cuddle (using his fake name Lorenzo Von Matterhorn). He always uses the shortest path (visiting minimum number of intersections or roads) between two intersections.Government needs your calculations. For each time Barney goes to cuddle a girl, you need to tell the government how much money he should pay (sum of passing fee of all roads he passes).InputThe first line of input contains a single integerq(1 ≤q≤ 1 000).The nextqlines contain the information about the events in chronological order. Each event is described in form1vuwif it's an event when government makes a new rule about increasing the passing fee of all roads on the shortest path fromutovbywdollars, or in form2vuif it's an event when Barnie goes to cuddle from the intersectionvto the intersectionu.1 ≤v,u≤ 1018,v≠u, 1 ≤w≤ 109states for every description line.OutputFor each event of second type print the sum of passing fee of all roads Barney passes in this event, in one line. Print the answers in chronological order of corresponding events.ExampleInput71 3 4 301 4 1 21 3 6 82 4 31 6 1 402 3 72 2 4Output94032NoteIn the example testcase:Here are the intersections used:Intersections on the path are3,1,2and4.Intersections on the path are4,2and1.Intersections on the path are only3and6.Intersections on the path are4,2,1and3. Passing fee of roads on the path are32,32and30in order. So answer equals to32 + 32 + 30 = 94.Intersections on the path are6,3and1.Intersections on the path are3and7. Passing fee of the road between them is0.Intersections on the path are2and4. Passing fee of the road between them is32(increased by30in the first event and by2in the second).",
    "source": "CF",
    "vjudge": false
}