{
    "uid": "703-C",
    "url": "https://codeforces.com/contest/703/problem/C",
    "tags": [
        "geometry",
        " implementation"
    ],
    "title": "703-C",
    "statement": "C. Chris and Roadtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAnd while Mishka is enjoying her trip...Chris is a little brown bear. No one knows, where and when he met Mishka, but for a long time they are together (excluding her current trip). However, best friends are important too. John is Chris' best friend.Once walking with his friend, John gave Chris the following problem:At the infinite horizontal road of widthw, bounded by linesy= 0andy=w, there is a bus moving, presented as a convex polygon ofnvertices. The bus moves continuously with a constant speed ofvin a straightOxline in direction of decreasingxcoordinates, thus in timeonlyxcoordinatesof its points are changing. Formally, after timeteach ofxcoordinates of its points will be decreased byvt.There is a pedestrian in the point(0, 0), who can move only by a vertical pedestrian crossing, presented as a segment connecting points(0, 0)and(0,w)with any speed not exceedingu. Thus the pedestrian can move only in a straight lineOyin any direction with any speed not exceedinguand not leaving the road borders. The pedestrian can instantly change his speed, thus, for example, he can stop instantly.Please look at the sample note picture for better understanding.We consider the pedestrian ishit by the bus, if at any moment the point he is located in liesstrictly insidethe bus polygon (this means that if the point lies on the polygon vertex or on its edge, the pedestrian is not hit by the bus).You are given the bus position at the moment0. Please help Chris determine minimum amount of time the pedestrian needs to cross the road and reach the point(0,w)and not to be hit by the bus.InputThe first line of the input contains four integersn,w,v,u(3 ≤n≤ 10 000,1 ≤w≤ 109,1 ≤v,u≤ 1000) — the number of the bus polygon vertices, road width, bus speed and pedestrian speed respectively.The nextnlines describes polygon vertices in counter-clockwise order.i-th of them contains pair of integersxiandyi(- 109≤xi≤ 109,0 ≤yi≤w) — coordinates ofi-th polygon point. It is guaranteed that the polygon is non-degenerate.OutputPrint the single realt— the time the pedestrian needs to croos the road and not to be hit by the bus. The answer is considered correct if its relative or absolute error doesn't exceed10- 6.ExampleInput5 5 1 21 23 14 33 41 4Output5.0000000000NoteFollowing image describes initial position in the first sample case:",
    "source": "CF",
    "vjudge": false
}