{
    "uid": "705-B",
    "url": "https://codeforces.com/contest/705/problem/B",
    "tags": [
        "games",
        " math"
    ],
    "title": "705-B",
    "statement": "B. Spider Mantime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPeter Parker wants to play a game with Dr. Octopus. The game is about cycles.Cycleis a sequence of vertices, such that first one is connected with the second, second is connected with third and so on, while the last one is connected with the first one again. Cycle may consist of a single isolated vertex.Initially there arekcycles,i-th of them consisting of exactlyvivertices. Players play alternatively. Peter goes first. On each turn a player must choose a cycle with at least2vertices (for example,xvertices) among all available cycles and replace it by two cycles withpandx-pvertices where1 ≤p<xis chosen by the player. The player who cannot make a move loses the game (and his life!).Peter wants to test some configurations of initial cycle sets before he actually plays with Dr. Octopus. Initially he has an empty set. In thei-th test he adds a cycle withaivertices to the set (this is actually a multiset because it can contain two or more identical cycles). After each test, Peter wants to know that if the players begin the game with the current set of cycles, who wins?Peter is pretty good at math, but now he asks you to help.InputThe first line of the input contains a single integern(1 ≤n≤ 100 000) — the number of tests Peter is about to make.The second line containsnspace separated integersa1,a2, ...,an(1 ≤ai≤ 109),i-th of them stands for the number of vertices in the cycle added before thei-th test.OutputPrint the result of all tests in order they are performed. Print1if the player who moves first wins or2otherwise.ExamplesInput31 2 3Output211Input51 1 5 1 1Output22222NoteIn the first sample test:In Peter's first test, there's only one cycle with1vertex. First player cannot make a move and loses.In his second test, there's one cycle with1vertex and one with2. No one can make a move on the cycle with1vertex. First player can replace the second cycle with two cycles of1vertex and second player can't make any move and loses.In his third test, cycles have1,2and3vertices. Like last test, no one can make a move on the first cycle. First player can replace the third cycle with one cycle with size1and one with size2. Now cycles have1,1,2,2vertices. Second player's only move is to replace a cycle of size2with2cycles of size1. And cycles are1,1,1,1,2. First player replaces the last cycle with2cycles with size1and wins.In the second sample test:Having cycles of size1is like not having them (because no one can make a move on them).In Peter's third test: There a cycle of size5(others don't matter). First player has two options: replace it with cycles of sizes1and4or2and3.If he replaces it with cycles of sizes1and4: Only second cycle matters. Second player will replace it with2cycles of sizes2. First player's only option to replace one of them with two cycles of size1. Second player does the same thing with the other cycle. First player can't make any move and loses.If he replaces it with cycles of sizes2and3: Second player will replace the cycle of size3with two of sizes1and2. Now only cycles with more than one vertex are two cycles of size2. As shown in previous case, with2cycles of size2second player wins.So, either way first player loses.",
    "source": "CF",
    "vjudge": false
}