{
    "uid": "707-B",
    "url": "https://codeforces.com/contest/707/problem/B",
    "tags": [
        "graphs"
    ],
    "title": "707-B",
    "statement": "B. Bakerytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMasha wants to open her own bakery and bake muffins in one of thencities numbered from1ton. There arembidirectional roads, each of whose connects some pair of cities.To bake muffins in her bakery, Masha needs to establish flour supply from some storage. There are onlykstorages, located in different cities numbereda1,a2, ...,ak.Unforunately the law of the country Masha lives in prohibits opening bakery in any of the cities which has storage located in it. She can open it only in one of anothern-kcities, and, of course, flour delivery should be paid — for every kilometer of path between storage and bakery Masha should pay1ruble.Formally, Masha will payxroubles, if she will open the bakery in some cityb(ai≠bfor every1 ≤i≤k) and choose a storage in some citys(s=ajfor some1 ≤j≤k) andbandsare connected by some path of roads of summary lengthx(if there are more than one path, Masha is able to choose which of them should be used).Masha is very thrifty and rational. She is interested in a city, where she can open her bakery (and choose one ofkstorages and one of the paths between city with bakery and city with storage) and pay minimum possible amount of rubles for flour delivery. Please help Masha find this amount.InputThe first line of the input contains three integersn,mandk(1 ≤n,m≤ 105,0 ≤k≤n) — the number of cities in country Masha lives in, the number of roads between them and the number of flour storages respectively.Thenmlines follow. Each of them contains three integersu,vandl(1 ≤u,v≤n,1 ≤l≤ 109,u≠v) meaning that there is a road between citiesuandvof length oflkilometers .Ifk> 0, then the last line of the input containskdistinct integersa1,a2, ...,ak(1 ≤ai≤n) — the number of cities having flour storage located in. Ifk= 0then this lineis not presented in the input.OutputPrint the minimum possible amount of rubles Masha should pay for flour delivery in the only line.If the bakery can not be opened (while satisfying conditions) in any of thencities, print- 1in the only line.ExamplesInput5 4 21 2 51 2 32 3 41 4 101 5Output3Input3 1 11 2 33Output-1NoteImage illustrates the first sample case. Cities with storage located in and the road representing the answer are darkened.",
    "source": "CF",
    "vjudge": false
}