{
    "uid": "708-E",
    "url": "https://codeforces.com/contest/708/problem/E",
    "tags": [
        "dp",
        " math"
    ],
    "title": "708-E",
    "statement": "E. Student's Camptime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlex studied well and won the trip to student camp Alushta, located on the seashore.Unfortunately, it's the period of the strong winds now and there is a chance the camp will be destroyed! Camp building can be represented as the rectangle ofn+ 2concrete blocks height andmblocks width.Every day there is a breeze blowing from the sea. Each block, except for the blocks of the upper and lower levers, such that there is no block to the left of it is destroyed with the probability. Similarly, each night the breeze blows in the direction to the sea. Thus, each block (again, except for the blocks of the upper and lower levers) such that there is no block to the right of it is destroyed with the same probabilityp. Note, that blocks of the upper and lower level areindestructible, so there are onlyn·mblocks that can be destroyed.The period of the strong winds will last forkdays andknights. If during this period the building will split in at least two connected components, it will collapse and Alex will have to find another place to spend summer.Find the probability that Alex won't have to look for other opportunities and will be able to spend the summer in this camp.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 1500) that define the size of the destructible part of building.The second line of the input contains two integersaandb(1 ≤a≤b≤ 109) that define the probabilityp. It's guaranteed that integersaandbare coprime.The third line contains a single integerk(0 ≤k≤ 100 000) — the number of days and nights strong wind will blow for.OutputConsider the answer as an irreducible fraction is equal to. Print one integer equal to. It's guaranteed that within the given constraints.ExamplesInput2 21 21Output937500007Input5 13 101Output95964640Input3 31 105Output927188454NoteIn the first sample, each of the four blocks is destroyed with the probability. There are7scenarios that result in building not collapsing, and the probability we are looking for is equal to, so you should print",
    "source": "CF",
    "vjudge": false
}