{
    "uid": "71-E",
    "url": "https://codeforces.com/contest/71/problem/E",
    "tags": [
        "bitmasks",
        " dp"
    ],
    "title": "71-E",
    "statement": "E. Nuclear Fusiontime limit per test1.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere is the following puzzle popular among nuclear physicists.A reactor contains a set ofnatoms of some chemical elements. We shall understand the phrase \"atomic number\" as the number of this atom's element in the periodic table of the chemical elements.You are allowed to take any two different atoms and fuse a new one from them. That results in a new atom, whose number is equal to the sum of the numbers of original atoms. The fusion operation can be performed several times.The aim is getting a new pregiven set ofkatoms.The puzzle's difficulty is that it is only allowed to fuse two atoms into one, it is not allowed to split an atom into several atoms. You are suggested to try to solve the puzzle.InputThe first line contains two integersnandk(1 ≤k≤n≤ 17). The second line contains space-separated symbols of elements ofnatoms, which are available from the start. The third line contains space-separated symbols of elements ofkatoms which need to be the result of the fusion. The symbols of the elements coincide with the symbols from the periodic table of the chemical elements. The atomic numbers do not exceed100(elements possessing larger numbers are highly unstable). Some atoms can have identical numbers (that is, there can be several atoms of the same element). The sum of numbers of initial atoms is equal to the sum of numbers of the atoms that need to be synthesized.OutputIf it is impossible to synthesize the required atoms, print \"NO\" without the quotes. Otherwise, print on the first line «YES», and on the nextklines print the way of synthesizing each ofkatoms as equations. Each equation has the following form: \"x1+x2+...+xt->yi\", wherexjis the symbol of the element of some atom from the original set, andyiis the symbol of the element of some atom from the resulting set. Each atom from the input data should occur in the output data exactly one time. The order of summands in the equations, as well as the output order does not matter. If there are several solutions, print any of them. For a better understanding of the output format, see the samples.ExamplesInput10 3Mn Co Li Mg C P F Zn Sc KSn Pt YOutputYESMn+C+K->SnCo+Zn+Sc->PtLi+Mg+P+F->YInput2 1H HHeOutputYESH+H->HeInput2 2Bk FmCf EsOutputNONoteThe reactions from the first example possess the following form (the atomic number is written below and to the left of the element):To find a periodic table of the chemical elements, you may use your favorite search engine.The pretest set contains each of the first100elements of the periodic table at least once. You can use that information to check for misprints.",
    "source": "CF",
    "vjudge": false
}