{
    "uid": "715-E",
    "url": "https://codeforces.com/contest/715/problem/E",
    "tags": [
        "combinatorics",
        " fft",
        " graphs",
        " math"
    ],
    "title": "715-E",
    "statement": "E. Complete the Permutationstime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputZS the Coder is given two permutationspandqof{1, 2, ...,n}, but some of their elements are replaced with0. Thedistancebetween two permutationspandqis defined as the minimum number of moves required to turnpintoq. A move consists of swapping exactly2elements ofp.ZS the Coder wants to determine the number of ways to replace the zeros with positive integers from the set{1, 2, ...,n}such thatpandqare permutations of{1, 2, ...,n}and the distance betweenpandqis exactlyk.ZS the Coder wants to find the answer for all0 ≤k≤n- 1. Can you help him?InputThe first line of the input contains a single integern(1 ≤n≤ 250) — the number of elements in the permutations.The second line containsnintegers,p1,p2, ...,pn(0 ≤pi≤n) — the permutationp. It is guaranteed that there is at least one way to replace zeros such thatpis a permutation of{1, 2, ...,n}.The third line containsnintegers,q1,q2, ...,qn(0 ≤qi≤n) — the permutationq. It is guaranteed that there is at least one way to replace zeros such thatqis a permutation of{1, 2, ...,n}.OutputPrintnintegers,i-th of them should denote the answer fork=i- 1. Since the answer may be quite large, and ZS the Coder loves weird primes, print them modulo998244353 = 223·7·17 + 1, which is a prime.ExamplesInput31 0 00 2 0Output1 2 1Input41 0 0 30 0 0 4Output0 2 6 4Input61 3 2 5 4 66 4 5 1 0 0Output0 0 0 0 1 1Input41 2 3 42 3 4 1Output0 0 0 1NoteIn the first sample case, there is the only way to replace zeros so that it takes0swaps to convertpintoq, namelyp= (1, 2, 3),q= (1, 2, 3).There are two ways to replace zeros so that it takes1swap to turnpintoq. One of these ways isp= (1, 2, 3),q= (3, 2, 1), then swapping1and3fromptransform it intoq. The other way isp= (1, 3, 2),q= (1, 2, 3). Swapping2and3works in this case.Finally, there is one way to replace zeros so that it takes2swaps to turnpintoq, namelyp= (1, 3, 2),q= (3, 2, 1). Then, we can transformpintoqlike following:.",
    "source": "CF",
    "vjudge": false
}