{
    "uid": "715-C",
    "url": "https://codeforces.com/contest/715/problem/C",
    "tags": [
        "dfs and similar",
        " divide and conquer",
        " dsu",
        " trees"
    ],
    "title": "715-C",
    "statement": "C. Digit Treetime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputZS the Coder has a large tree. It can be represented as an undirected connected graph ofnvertices numbered from0ton- 1andn- 1edges between them. There is a singlenonzerodigit written on each edge.One day, ZS the Coder was bored and decided to investigate some properties of the tree. He chose a positive integerM, which iscoprimeto10, i.e..ZS consider anordered pairof distinct vertices(u,v)interestingwhen if he would follow the shortest path from vertexuto vertexvand write down all the digits he encounters on his path in the same order, he will get a decimal representaion of an integer divisible byM.Formally, ZS consider an ordered pair of distinct vertices(u,v)interesting if the following states true:Leta1=u,a2, ...,ak=vbe the sequence of vertices on the shortest path fromutovin the order of encountering them;Letdi(1 ≤i<k) be the digit written on the edge between verticesaiandai+ 1;The integeris divisible byM.Help ZS the Coder find the number of interesting pairs!InputThe first line of the input contains two integers,nandM(2 ≤n≤ 100 000,1 ≤M≤ 109,) — the number of vertices and the number ZS has chosen respectively.The nextn- 1lines contain three integers each.i-th of them containsui,viandwi, denoting an edge between verticesuiandviwith digitwiwritten on it (0 ≤ui,vi<n,  1 ≤wi≤ 9).OutputPrint a single integer — the number of interesting (by ZS the Coder's consideration) pairs.ExamplesInput6 70 1 24 2 42 0 13 0 92 5 7Output7Input5 111 2 32 0 33 0 34 3 3Output8NoteIn the first sample case, the interesting pairs are(0, 4), (1, 2), (1, 5), (3, 2), (2, 5), (5, 2), (3, 5). The numbers that are formed by these pairs are14, 21, 217, 91, 7, 7, 917respectively, which are all multiples of7. Note that(2, 5)and(5, 2)are considered different.In the second sample case, the interesting pairs are(4, 0), (0, 4), (3, 2), (2, 3), (0, 1), (1, 0), (4, 1), (1, 4), and6of these pairs give the number33while2of them give the number3333, which are all multiples of11.",
    "source": "CF",
    "vjudge": false
}