{
    "uid": "719-A",
    "url": "https://codeforces.com/contest/719/problem/A",
    "tags": [
        "implementation"
    ],
    "title": "719-A",
    "statement": "A. Vitya in the Countrysidetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputEvery summer Vitya comes to visit his grandmother in the countryside. This summer, he got a huge wart. Every grandma knows that one should treat warts when the moon goes down. Thus, Vitya has to catch the moment when the moon is down.Moon cycle lasts 30 days. The size of the visible part of the moon (in Vitya's units) for each day is0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,14,13,12,11,10,9,8,7,6,5,4,3,2,1, and then cycle repeats, thus after the second1again goes0.As there is no internet in the countryside, Vitya has been watching the moon fornconsecutive days and for each of these days he wrote down the size of the visible part of the moon. Help him find out whether the moon will be up or down next day, or this cannot be determined by the data he has.InputThe first line of the input contains a single integern(1 ≤n≤ 92) — the number of consecutive days Vitya was watching the size of the visible part of the moon.The second line containsnintegersai(0 ≤ai≤ 15) — Vitya's records.It's guaranteed that the input data is consistent.OutputIf Vitya can be sure that the size of visible part of the moon on dayn+ 1will be less than the size of the visible part on dayn, then print \"DOWN\" at the only line of the output. If he might be sure that the size of the visible part will increase, then print \"UP\". If it's impossible to determine what exactly will happen with the moon, print-1.ExamplesInput53 4 5 6 7OutputUPInput712 13 14 15 14 13 12OutputDOWNInput18Output-1NoteIn the first sample, the size of the moon on the next day will be equal to8, thus the answer is \"UP\".In the second sample, the size of the moon on the next day will be11, thus the answer is \"DOWN\".In the third sample, there is no way to determine whether the size of the moon on the next day will be7or9, thus the answer is-1.",
    "source": "CF",
    "vjudge": false
}