{
    "uid": "725-F",
    "url": "https://codeforces.com/contest/725/problem/F",
    "tags": [
        "games",
        " greedy"
    ],
    "title": "725-F",
    "statement": "F. Family Photostime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bonnie are sisters, but they don't like each other very much. So when some old family photos were found in the attic, they started to argue about who should receive which photos. In the end, they decided that they would take turns picking photos. Alice goes first.There arenstacks of photos. Each stack containsexactly twophotos. In each turn, a player may take only a photo from the top of one of the stacks.Each photo is described by two non-negative integersaandb, indicating that it is worthaunits of happiness to Alice andbunits of happiness to Bonnie. Values ofaandbmight differ for different photos.It's allowed to pass instead of taking a photo. The game ends when all photos are taken or both players pass consecutively.The players don't act to maximize their own happiness. Instead, each player acts to maximize the amount by which her happiness exceeds her sister's. Assuming both players play optimal, find the difference between Alice's and Bonnie's happiness. That is, if there's a perfectly-played game such that Alice hasxhappiness and Bonnie hasyhappiness at the end, you should printx-y.InputThe first line of input contains a single integern(1 ≤n≤ 100 000) — the number of two-photo stacks. Then follownlines, each describing one of the stacks. A stack is described by four space-separated non-negative integersa1,b1,a2andb2, each not exceeding109.a1andb1describe the top photo in the stack, whilea2andb2describe the bottom photo in the stack.OutputOutput a single integer: the difference between Alice's and Bonnie's happiness if both play optimally.ExamplesInput212 3 4 71 15 9 1Output1Input25 4 8 84 12 14 0Output4Input10 10 0 10Output-10",
    "source": "CF",
    "vjudge": false
}