{
    "uid": "727-C",
    "url": "https://codeforces.com/contest/727/problem/C",
    "tags": [
        "constructive algorithms",
        " interactive",
        " math"
    ],
    "title": "727-C",
    "statement": "C. Guess the Arraytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is an interactive problem. You should useflushoperation after each printed line. For example, in C++ you should usefflush(stdout), in Java you should useSystem.out.flush(), and in Pascal —flush(output).In this problem you should guess an arrayawhich is unknown for you. The only information you have initially is the lengthnof the arraya.The only allowed action is to ask the sum of two elements by their indices. Formally, you can print two indicesiandj(the indices should bedistinct). Then your program should read the response: the single integer equals toai+aj.It is easy to prove that it is always possible to guess the array using at mostnrequests.Write a program that will guess the arrayaby making at mostnrequests.InteractionIn each test your program should guess a single array.The input starts with a line containing integern(3 ≤n≤ 5000) — the length of the array. Your program should read it at first.After that your program should print to the standard output the requests about the sum of two elements or inform that the array is guessed.In case your program is making a request to ask the sum of two elements, it should print line in the format \"? i j\" (iandjare distinct integers between1andn), whereiandjare indices in the arraya.In case your program informs that the array is guessed, it should print line in the format \"!a1a2...an\" (it is guaranteed that allaiare positive integers not exceeding105), whereaiis thei-th element of the arraya.The response on a request is a single integer equal toai+aj, printed on a separate line.Your program can do at mostnrequests. Note that the final line «!a1a2...an» is not counted as a request.Do not forget aboutflushoperation after each printed line.After you program prints the guessed array, it should terminate normally.ExampleInput5979116Output? 1 5? 2 3? 4 1? 5 2? 3 4! 4 6 1 5 5NoteThe format of a test to make a hack is:The first line contains an integer numbern(3 ≤n≤ 5000) — the length of the array.The second line containsnnumbersa1,a2, ...,an(1 ≤ai≤ 105) — the elements of the array to guess.",
    "source": "CF",
    "vjudge": false
}