{
    "uid": "730-G",
    "url": "https://codeforces.com/contest/730/problem/G",
    "tags": [
        "implementation"
    ],
    "title": "730-G",
    "statement": "G. Car Repair Shoptime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputPolycarp starts his own business. Tomorrow will be the first working day of his car repair shop. For now the car repair shop is very small and only one car can be repaired at a given time.Polycarp is good at marketing, so he has already collectednrequests from clients. The requests are numbered from1tonin order they came.Thei-th request is characterized by two values:si— the day when a client wants to start the repair of his car,di— duration (in days) to repair the car. The days are enumerated from 1, the first day is tomorrow, the second day is the day after tomorrow and so on.Polycarp is making schedule by processing requests in the order from the first to then-th request. He schedules thei-th request as follows:If the car repair shop is idle fordidays starting fromsi(si,si+ 1, ...,si+di- 1), then these days are used to repair a car of thei-th client.Otherwise, Polycarp finds the first dayx(from 1 and further) that there aredisubsequent days when no repair is scheduled starting fromx. In other words he chooses the smallest positivexthat all daysx,x+ 1, ...,x+di- 1are not scheduled for repair of any car. So, the car of thei-th client will be repaired in the range[x,x+di- 1]. It is possible that the dayxwhen repair is scheduled to start will be less thansi.Givennrequests, you are asked to help Polycarp schedule all of them according to the rules above.InputThe first line contains integern(1 ≤n≤ 200) — the number of requests from clients.The followingnlines contain requests, one request per line. Thei-th request is given as the pair of integerssi,di(1 ≤si≤ 109,1 ≤di≤ 5·106), wheresiis the preferred time to start repairing thei-th car,diis the number of days to repair thei-th car.The requests should be processed in the order they are given in the input.OutputPrintnlines. Thei-th line should contain two integers — the start day to repair thei-th car and the finish day to repair thei-th car.ExamplesInput39 27 32 4Output9 101 34 7Input41000000000 10000001000000000 1000000100000000 10000001000000000 1000000Output1000000000 10009999991 1000000100000000 1009999991000001 2000000",
    "source": "CF",
    "vjudge": false
}