{
    "uid": "734-C",
    "url": "https://codeforces.com/contest/734/problem/C",
    "tags": [
        "binary search",
        " dp",
        " greedy",
        " two pointers"
    ],
    "title": "734-C",
    "statement": "C. Anton and Making Potionstime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAnton is playing a very interesting computer game, but now he is stuck at one of the levels. To pass to the next level he has to preparenpotions.Anton has a special kettle, that can prepare one potions inxseconds. Also, he knows spells of two types that can faster the process of preparing potions.Spells of this type speed up the preparation time of one potion. There aremspells of this type, thei-th of them costsbimanapoints and changes the preparation time of each potion toaiinstead ofx.Spells of this type immediately prepare some number of potions. There areksuch spells, thei-th of them costsdimanapoints and instantly createcipotions.Anton can useno more than onespell of the first type andno more than onespell of the second type, and the total number of manapoints spent should not exceeds. Consider that all spells are used instantly and right before Anton starts to prepare potions.Anton wants to get to the next level as fast as possible, so he is interested in the minimum number of time he needs to spent in order to prepare at leastnpotions.InputThe first line of the input contains three integersn,m,k(1 ≤n≤ 2·109, 1 ≤m,k≤ 2·105) — the number of potions, Anton has to make, the number of spells of the first type and the number of spells of the second type.The second line of the input contains two integersxands(2 ≤x≤ 2·109, 1 ≤s≤ 2·109) — the initial number of seconds required to prepare one potion and the number of manapoints Anton can use.The third line containsmintegersai(1 ≤ai<x) — the number of seconds it will take to prepare one potion if thei-th spell of the first type is used.The fourth line containsmintegersbi(1 ≤bi≤ 2·109) — the number of manapoints to use thei-th spell of the first type.There arekintegersci(1 ≤ci≤n) in the fifth line — the number of potions that will be immediately created if thei-th spell of the second type is used. It's guaranteed thatciarenot decreasing, i.e.ci≤cjifi<j.The sixth line containskintegersdi(1 ≤di≤ 2·109) — the number of manapoints required to use thei-th spell of the second type. It's guaranteed thatdiarenot decreasing, i.e.di≤djifi<j.OutputPrint one integer — the minimum time one has to spent in order to preparenpotions.ExamplesInput20 3 210 992 4 320 10 404 1510 80Output20Input20 3 210 992 4 3200 100 4004 15100 800Output200NoteIn the first sample, the optimum answer is to use the second spell of the first type that costs10manapoints. Thus, the preparation time of each potion changes to4seconds. Also, Anton should use the second spell of the second type to instantly prepare15potions spending80manapoints. The total number of manapoints used is10 + 80 = 90, and the preparation time is4·5 = 20seconds (15potions were prepared instantly, and the remaining5will take4seconds each).In the second sample, Anton can't use any of the spells, so he just prepares20potions, spending10seconds on each of them and the answer is20·10 = 200.",
    "source": "CF",
    "vjudge": false
}