{
    "uid": "739-C",
    "url": "https://codeforces.com/contest/739/problem/C",
    "tags": [
        "data structures"
    ],
    "title": "739-C",
    "statement": "C. Alyona and towerstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlyona has builtntowers by putting small cubes some on the top of others. Each cube has size1 × 1 × 1. A tower is a non-zero amount of cubes standing on the top of each other. The towers are next to each other, forming a row.Sometimes Alyona chooses some segment towers, and put on the top of each tower several cubes. Formally, Alyouna chooses some segment of towers fromlitoriand addsdicubes on the top of them.Let the sequencea1,a2, ...,anbe the heights of the towers from left to right. Let's call as a segment of towersal,al+ 1, ...,ara hill if the following condition holds: there is integerk(l≤k≤r) such thatal<al+ 1<al+ 2< ... <ak>ak+ 1>ak+ 2> ... >ar.After each addition ofdicubes on the top of the towers fromlitori, Alyona wants to know the maximum width among all hills. The width of a hill is the number of towers in it.InputThe first line contain single integern(1 ≤n≤ 3·105) — the number of towers.The second line containnintegersa1,a2, ...,an(1 ≤ai≤ 109) — the number of cubes in each tower.The third line contain single integerm(1 ≤m≤ 3·105) — the number of additions.The nextmlines contain3integers each. Thei-th of these lines contains integersli,rianddi(1 ≤l≤r≤n,1 ≤di≤ 109), that mean that Alyona putsdicubes on the tio of each of the towers fromlitori.OutputPrintmlines. Ini-th line print the maximum width of the hills after thei-th addition.ExampleInput55 5 5 5 531 3 22 2 14 4 1Output245NoteThe first sample is as follows:After addition of2cubes on the top of each towers from the first to the third, the number of cubes in the towers become equal to[7, 7, 7, 5, 5]. The hill with maximum width is[7, 5], thus the maximum width is2.After addition of1cube on the second tower, the number of cubes in the towers become equal to[7, 8, 7, 5, 5]. The hill with maximum width is now[7, 8, 7, 5], thus the maximum width is4.After addition of1cube on the fourth tower, the number of cubes in the towers become equal to[7, 8, 7, 6, 5]. The hill with maximum width is now[7, 8, 7, 6, 5], thus the maximum width is5.",
    "source": "CF",
    "vjudge": false
}