{
    "uid": "741-A",
    "url": "https://codeforces.com/contest/741/problem/A",
    "tags": [
        "dfs and similar",
        " math"
    ],
    "title": "741-A",
    "statement": "A. Arpa's loud Owf and Mehrdad's evil plantime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAs you have noticed, there are lovely girls in Arpa’s land.People in Arpa's land are numbered from1ton. Everyone has exactly one crush,i-th person's crush is person with the numbercrushi.Someday Arpa shoutedOwfloudly from the top of the palace and a funny game started in Arpa's land. The rules are as follows.The game consists of rounds. Assume personxwants to start a round, he callscrushxand says: \"Oww...wwf\" (the letterwis repeatedttimes) and cuts off the phone immediately. Ift> 1thencrushxcallscrushcrushxand says: \"Oww...wwf\" (the letterwis repeatedt- 1times) and cuts off the phone immediately. The round continues until some person receives an \"Owf\" (t= 1). This person is called theJoon-Joonof the round. There can't be two rounds at the same time.Mehrdad has an evil plan to make the game more funny, he wants to find smallestt(t≥ 1) such that for each personx, ifxstarts some round andybecomes the Joon-Joon of the round, then by starting fromy,xwould become the Joon-Joon of the round. Find suchtfor Mehrdad if it's possible.Some strange fact in Arpa's land is that someone can be himself's crush (i.e.crushi=i).InputThe first line of input contains integern(1 ≤n≤ 100) — the number of people in Arpa's land.The second line containsnintegers,i-th of them iscrushi(1 ≤crushi≤n) — the number ofi-th person's crush.OutputIf there is notsatisfying the condition, print-1. Otherwise print such smallestt.ExamplesInput42 3 1 4Output3Input44 4 4 4Output-1Input42 1 4 3Output1NoteIn the first sample supposet= 3.If the first person starts some round:The first person calls the second person and says \"Owwwf\", then the second person calls the third person and says \"Owwf\", then the third person calls the first person and says \"Owf\", so the first person becomes Joon-Joon of the round. So the condition is satisfied ifxis1.The process is similar for the second and the third person.If the fourth person starts some round:The fourth person calls himself and says \"Owwwf\", then he calls himself again and says \"Owwf\", then he calls himself for another time and says \"Owf\", so the fourth person becomes Joon-Joon of the round. So the condition is satisfied whenxis4.In the last example if the first person starts a round, then the second person becomes the Joon-Joon, and vice versa.",
    "source": "CF",
    "vjudge": false
}