{
    "uid": "744-A",
    "url": "https://codeforces.com/contest/744/problem/A",
    "tags": [
        "dfs and similar",
        " graphs"
    ],
    "title": "744-A",
    "statement": "A. Hongcow Builds A Nationtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputHongcow is ruler of the world. As ruler of the world, he wants to make it easier for people to travel by road within their own countries.The world can be modeled as an undirected graph withnnodes andmedges.kof the nodes are home to the governments of thekcountries that make up the world.There is at most one edge connecting any two nodes and no edge connects a node to itself. Furthermore, for any two nodes corresponding to governments,there is no path between those two nodes. Any graph that satisfies all of these conditions isstable.Hongcow wants to add as many edges as possible to the graph while keeping it stable. Determine the maximum number of edges Hongcow can add.InputThe first line of input will contain three integersn,mandk(1 ≤n≤ 1 000,0 ≤m≤ 100 000,1 ≤k≤n) — the number of vertices and edges in the graph, and the number of vertices that are homes of the government.The next line of input will containkintegersc1,c2, ...,ck(1 ≤ci≤n). These integers will be pairwise distinct and denote the nodes that are home to the governments in this world.The followingmlines of input will contain two integersuiandvi(1 ≤ui,vi≤n). This denotes an undirected edge between nodesuiandvi.It is guaranteed that the graph described by the input is stable.OutputOutput a single integer, the maximum number of edges Hongcow can add to the graph while keeping it stable.ExamplesInput4 1 21 31 2Output2Input3 3 121 21 32 3Output0NoteFor the first sample test, the graph looks like this:Vertices1and3are special. The optimal solution is to connect vertex4to vertices1and2. This adds a total of2edges. We cannot add any more edges, since vertices1and3cannot have any path between them.For the second sample test, the graph looks like this:We cannot add any more edges to this graph. Note that we are not allowed to add self-loops, and the graph must be simple.",
    "source": "CF",
    "vjudge": false
}