{
    "uid": "746-F",
    "url": "https://codeforces.com/contest/746/problem/F",
    "tags": [
        "data structures",
        " greedy",
        " two pointers"
    ],
    "title": "746-F",
    "statement": "F. Music in Cartime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSasha reaches the work by car. It takes exactlykminutes. On his way he listens to music. All songs in his playlist go one by one, after listening to thei-th song Sasha gets a pleasure which equalsai. Thei-th song lasts fortiminutes.Before the beginning of his way Sasha turns on some songxand then he listens to the songs one by one: at first, the songx, then the song(x+ 1), then the song number(x+ 2), and so on. He listens to songs until he reaches the work or until he listens to the last song in his playlist.Sasha can listen to each song to the end orpartly.In the second case he listens to the song for integer number of minutes, at least half of the song's length. Formally, if the length of the song equalsdminutes, Sasha listens to it for no less thanminutes, then he immediately switches it to the next song (if there is such). For example, if the length of the song which Sasha wants topartlylisten to, equals5minutes, then he should listen to it for at least3minutes, if the length of the song equals8minutes, then he should listen to it for at least4minutes.It takes no time to switch a song.Sasha wants to listenpartlyno more thanwsongs. If the last listened song plays for less than half of its length, then Sasha doesn't get pleasure from it and that song is not included to the list ofpartlylistened songs. It is not allowed to skip songs. A pleasure from a song does not depend on the listening mode, for thei-th song this value equalsai.Help Sasha to choose suchxand no more thanwsongs forpartiallistening to get the maximum pleasure. Write a program to find the maximum pleasure Sasha can get from the listening to the songs on his way to the work.InputThe first line contains three integersn,wandk(1 ≤w≤n≤ 2·105,1 ≤k≤ 2·109) — the number of songs in the playlist, the number of songs Sasha can listen topartlyand time in minutes which Sasha needs to reach work.The second line containsnpositive integersa1,a2, ...,an(1 ≤ai≤ 104), whereaiequals the pleasure Sasha gets after listening to thei-th song.The third line containsnpositive integerst1,t2, ...,tn(2 ≤ti≤ 104), wheretiequals the length of thei-th song in minutes.OutputPrint the maximum pleasure Sasha can get after listening to the songs on the way to work.ExamplesInput7 2 113 4 3 5 1 4 67 7 3 6 5 3 9Output12Input8 4 205 6 4 3 7 5 4 110 12 5 12 14 8 5 8Output19Input1 1 569Output6Input1 1 347Output0NoteIn the first example Sasha needs to start listening from the song number2. He should listen to itpartly(for4minutes), then listen to the song number3to the end (for3minutes) and thenpartlylisten to the song number4(for3minutes). After listening to these songs Sasha will get pleasure which equals4 + 3 + 5 = 12. Sasha will not have time to listen to the song number5because he will spend4 + 3 + 3 = 10minutes listening to songs number2,3and4and only1minute is left after that.",
    "source": "CF",
    "vjudge": false
}