{
    "uid": "746-B",
    "url": "https://codeforces.com/contest/746/problem/B",
    "tags": [
        "implementation",
        " strings"
    ],
    "title": "746-B",
    "statement": "B. Decodingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp is mad about coding, that is why he writes Sveta encoded messages. He calls themedian letterin a word the letter which is in the middle of the word. If the word's length is even, the median letter is the left of the two middle letters. In the following examples, the median letter is highlighted:contest,info. If the word consists of single letter, then according to above definition this letter is the median letter.Polycarp encodes each word in the following way: he writes down the median letter of the word, then deletes it and repeats the process until there are no letters left. For example, he encodes the wordvolgaaslogva.You are given an encodingsof some word, your task is to decode it.InputThe first line contains a positive integern(1 ≤n≤ 2000) — the length of the encoded word.The second line contains the stringsof lengthnconsisting of lowercase English letters — the encoding.OutputPrint the word that Polycarp encoded.ExamplesInput5logvaOutputvolgaInput2noOutputnoInput4abbaOutputbabaNoteIn the first example Polycarp encoded the wordvolga. At first, he wrote down the letterlfrom the position3, after that his word looked likevoga. After that Polycarp wrote down the letterofrom the position2, his word becamevga. Then Polycarp wrote down the lettergwhich was at the second position, the word becameva. Then he wrote down the letterv, then the lettera. Thus, the encoding looked likelogva.In the second example Polycarp encoded the wordno. He wrote down the lettern, the word becameo, and he wrote down the lettero. Thus, in this example, the word and its encoding are the same.In the third example Polycarp encoded the wordbaba. At first, he wrote down the lettera, which was at the position2, after that the word looked likebba. Then he wrote down the letterb, which was at the position2, his word looked likeba. After that he wrote down the letterb, which was at the position1, the word looked likea, and he wrote down that lettera. Thus, the encoding isabba.",
    "source": "CF",
    "vjudge": false
}