{
    "uid": "749-D",
    "url": "https://codeforces.com/contest/749/problem/D",
    "tags": [
        "binary search",
        " data structures"
    ],
    "title": "749-D",
    "statement": "D. Leaving Auctiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arenpeople taking part in auction today. The rules of auction are classical. There werenbids made, though it's not guaranteed they were from different people. It might happen that some people made no bids at all.Each bid is define by two integers(ai,bi), whereaiis the index of the person, who made this bid andbiis its size. Bids are given in chronological order, meaningbi<bi+ 1for alli<n. Moreover, participant never makes two bids in a row (no one updates his own bid), i.e.ai≠ai+ 1for alli<n.Now you are curious with the following question: who (and which bid) will win the auction if some participants were absent? Consider that if someone was absent, all his bids are just removed and no new bids are added.Note, that if during this imaginary exclusion of some participants it happens that some of the remaining participants makes a bid twice (or more times) in a row, only first of these bids is counted. For better understanding take a look at the samples.You have several questions in your mind, compute the answer for each of them.InputThe first line of the input contains an integern(1 ≤n≤ 200 000) — the number of participants and bids.Each of the followingnlines contains two integersaiandbi(1 ≤ai≤n, 1 ≤bi≤ 109,bi<bi+ 1) — the number of participant who made thei-th bid and the size of this bid.Next line contains an integerq(1 ≤q≤ 200 000) — the number of question you have in mind.Each of nextqlines contains an integerk(1 ≤k≤n), followed bykintegerslj(1 ≤lj≤n) — the number of people who are not coming in this question and their indices. It is guarenteed thatljvalues are different for a single question.It's guaranteed that the sum ofkover all question won't exceed200 000.OutputFor each question print two integer — the index of the winner and the size of the winning bid. If there is no winner (there are no remaining bids at all), print two zeroes.ExamplesInput61 102 1003 10001 100002 1000003 100000031 32 2 32 1 2Output2 1000001 103 1000Input31 102 1001 100022 1 22 2 3Output0 01 10NoteConsider the first sample:In the first question participant number3is absent so the sequence of bids looks as follows:1102100110 0002100 000Participant number2wins with the bid100 000.In the second question participants2and3are absent, so the sequence of bids looks:110110 000The winner is, of course, participant number1but the winning bid is10instead of10 000as no one will ever increase his own bid (in this problem).In the third question participants1and2are absent and the sequence is:31 00031 000 000The winner is participant3with the bid1 000.",
    "source": "CF",
    "vjudge": false
}