{
    "uid": "750-H",
    "url": "https://codeforces.com/contest/750/problem/H",
    "tags": [
        "dfs and similar",
        " dsu",
        " graphs",
        " interactive"
    ],
    "title": "750-H",
    "statement": "H. New Year and Snowy Gridtime limit per test9 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPay attention to the output section below, where you will see the information about flushing the output.Bearland is a grid withhrows andwcolumns. Rows are numbered1throughhfrom top to bottom. Columns are numbered1throughwfrom left to right. Every cell is either allowed (denoted by '.' in the input) or permanently blocked (denoted by '#').Bearland is a cold land, where heavy snow often makes travelling harder. Every day a few allowed cells aretemporarilyblocked by snow. Note, that this block works only on this particular day and next day any of these cells might be allowed again (unless there is another temporarily block).It's possible to move directly between two cells only if they share a side and none of them is permanently or temporarily blocked.Limak is a little polar bear who lives in Bearland. His house is at the top left cell, while his school is at the bottom right cell. Every day Limak should first go from his house to the school and then return back to his house. Since he gets bored easily, he doesn't want tovisit the same cell twiceon one day, except for the cell with his house, where he starts and ends. If Limak can reach a school and return home avoiding revisiting cells, he calls a dayinteresting.There areqdays you must process, one after another. For each of these days you should check if it's interesting and print \"YES\" or \"NO\" on a separate line. In order to be able to read the description of the next day you should print the answer for the previous one and flush the output.It's guaranteed that a day with no cells temporarily blocked by snow would be interesting. It's also guaranteed that cells with Limak's house and school are never blocked (neither permanently or temporarily).InputThe first line of the input contains three integersh,wandq(2 ≤h,w≤ 1000,1 ≤q≤ 10 000) — the height and the width of the grid, and the number of days, respectively.Nexthlines describe which cells are allowed and which permanently blocked. Thei-th line contains a string of lengthw, describing thei-th row. Every character is either '.' (denoting an allowed cell) or '#' (denoting a permanently blocked cell). It's guaranteed that a day with no cells temporarily blocked by snow would be interesting.Then, the description ofqdays is given. The description of thei-th day starts with a line containing a single integerki(1 ≤ki≤ 10) — the number of cells that are temporarily blocked by snow on that day. Each of nextkilines contains two integersri,jandci,j(1 ≤ri,j≤h,1 ≤ci,j≤w), representing a cell at the intersection of the rowri,jand the columnci,j. The givenkicells are distinct and none of them is permanently blocked. Also, none of them contains Limak's house or school.OutputFor each ofqdays print \"YES\" if that day is interesting, and otherwise print \"NO\", both without the quotes. After printing an answer, you have to both print the end-of-line character andflushthe output. Then you can proceed to the next day. You can getIdleness Limit Exceededif you don't print anything or if you forget to flush the output.To flush you can use (just after printing aYES/NOand end-of-line):fflush(stdout)in C++;System.out.flush()in Java;stdout.flush()in Python;flush(output)in Pascal;See the documentation for other languages.ExamplesInput3 5 4...........#...11 411 522 43 121 53 3OutputNOYESYESNOInput9 31 5...............................................................###.###.#.###...###.###.#.###....#.#.#.#.#.......#.#.#.#...#..###.#.#.#.###...###.#.#.#...#..#...#.#.#.#.#...#...#.#.#...#..###.###.#.###...###.###.#...#...............................................................56 52 111 148 152 1452 141 148 166 52 1132 21 48 30103 13 115 167 214 163 57 313 97 253 27103 13 97 253 277 214 173 57 314 163 11OutputNOYESYESYESNONoteIn the first sample, there are4days. Drawings below show how Limak could go to school and return to his home in the second and the third day (on the left and on the right respectively). A permanently blocked cell is painted red, while cells temporarily blocked by snow are painted orange. Black and green arrows should Limak's way to the school and back to the house respectively.For the second sample, below you can see how the grid looks like on each day, where '#' denotes a cell that is blocked, either temporarily or permanently.",
    "source": "CF",
    "vjudge": false
}