{
    "uid": "753-B",
    "url": "https://codeforces.com/contest/753/problem/B",
    "tags": [
        "brute force",
        " constructive algorithms",
        " implementation"
    ],
    "title": "753-B",
    "statement": "B. Interactive Bulls and Cows (Easy)time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThis problem is a little bit unusual. Here you are to implement an interaction with a testing system. That means that you can make queries and get responses in the online mode. Please be sure to use the stream flushing operation after each query's output in order not to leave part of your output in some buffer. For example, in C++ you've got to use thefflush(stdout)function, in Java — callSystem.out.flush(), and in Pascal —flush(output).Bulls and Cows (also known as Cows and Bulls or Pigs and Bulls or Bulls and Cleots) is an old code-breaking paper and pencil game for two players, predating the similar commercially marketed board game Mastermind.On a sheet of paper, the first player thinks a secret string. This string consists only of digits and has the length4. The digits in the stringmustbe all different, no two or more equal digits are allowed.Then the second player tries to guess his opponent's string. For every guess the first player gives the number of matches. If the matching digits are on their right positions, they are \"bulls\", if on different positions, they are \"cows\". Thus a response is a pair of numbers — the number of \"bulls\" and the number of \"cows\". A try can contain equal digits.More formally, let's the secret string issand the second player are trying to guess it with a stringx. The number of \"bulls\" is a number of such positionsi(1 ≤i≤ 4) wheres[i] =x[i]. The number of \"cows\" is a number of such digitscthatscontainscin the positioni(i.e.s[i] =c),xcontainsc, butx[i] ≠c.For example, the secret string is \"0427\", the opponent's try is \"0724\", then the answer is2bulls and2cows (the bulls are \"0\" and \"2\", the cows are \"4\" and \"7\"). If the secret string is \"0123\", the opponent's try is \"0330\", then the answer is1bull and1cow.In this problem you are to guess the stringsthat the system has chosen. You only know that the chosen string consists of4distinct digits.You can make queries to the testing system, each query is the output of a single4-digit string. The answer to the query is the number of bulls and number of cows. If the system's response equals \"4 0\", that means the interaction with your problem is over and the program must terminate. That is possible for two reasons — the program either guessed the numberxor made an invalid action (for example, printed letters instead of digits).Your program is allowed to do at most50queries.You can hack solutions of other participants providing a 4-digit string containing distinct digits — the secret string.InputTo read answers to the queries, the program must use the standard input.The program will receive pairs of non-negative integers in the input, one pair per line. The first number in a pair is a number of bulls and the second one is a number of cows of the stringsand the stringxiprinted by your program. If the system response equals \"4 0\", then your solution should terminate.The testing system will let your program read thei-th pair of integers from the input only after your program displays the corresponding system query in the output: prints valuexiin a single line and executes operationflush.OutputThe program must use the standard output to print queries.Your program must output requests —4-digit stringsx1,x2, ..., one per line. After the output of each line the program must executeflushoperation. The program should read the answer to the query from the standard input.Your program is allowed to do at most50queries.ExamplesInput0 12 01 10 42 14 0Output800001793159321001120123NoteThe secret stringsin the example is \"0123\".",
    "source": "CF",
    "vjudge": false
}