{
    "uid": "755-C",
    "url": "https://codeforces.com/contest/755/problem/C",
    "tags": [
        "dfs and similar",
        " dsu",
        " graphs",
        " interactive",
        " trees"
    ],
    "title": "755-C",
    "statement": "C. PolandBall and Foresttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolandBall lives in a forest with his family. There are some trees in the forest. Trees are undirected acyclic graphs withkvertices andk- 1edges, wherekis some integer. Note that one vertexisa valid tree.There is exactly one relative living in each vertex of each tree, they have unique ids from1ton. For each Balliwe know the id of its most distant relative living on the same tree. If there are several such vertices, we only know the value of the one with smallest id among those.How many trees are there in the forest?InputThe first line contains single integern(1 ≤n≤ 104) — the number of Balls living in the forest.The second line contains a sequencep1,p2, ...,pnof lengthn, where (1 ≤pi≤n) holds andpidenotes the most distant from Ballirelative living on the same tree. If there are several most distant relatives living on the same tree,piis the id of one with the smallest id.It's guaranteed that the sequencepcorresponds to some valid forest.Hacking: To hack someone, you should provide acorrect forestas a test. The sequencepwill be calculated according to the forest and given to the solution you try to hack as input. Use the following format:In the first line, output the integern(1 ≤n≤ 104) — the number of Balls and the integerm(0 ≤m<n) — the total number of edges in the forest. Thenmlines should follow. Thei-th of them should contain two integersaiandbiand represent an edge between vertices in which relativesaiandbilive. For example, the first sample is written as follows:5 31 23 44 5OutputYou should output the number of trees in the forest where PolandBall lives.InteractionFrom the technical side, this problem is interactive. However, it should not affect you (except hacking) since there is no interaction.ExamplesInput52 1 5 3 3Output2Input11Output1NoteIn the first sample testcase, possible forest is:1-2 3-4-5.There are2trees overall.In the second sample testcase, the only possible graph is one vertex and no edges. Therefore, there is only one tree.",
    "source": "CF",
    "vjudge": false
}