{
    "uid": "755-E",
    "url": "https://codeforces.com/contest/755/problem/E",
    "tags": [
        "constructive algorithms",
        " graphs",
        " shortest paths"
    ],
    "title": "755-E",
    "statement": "E. PolandBall and White-Red graphtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolandBall has an undirected simple graph consisting ofnvertices. Unfortunately, it has no edges. The graph is very sad because of that. PolandBall wanted to make it happier, adding some red edges. Then, he will add white edges in every remaining place. Therefore, the final graph will be a clique in two colors: white and red.Colorfulness of the graph is a valuemin(dr,dw), wheredris the diameter of the red subgraph anddwis the diameter of white subgraph. The diameter of a graph is a largest valuedsuch that shortest path between some pair of vertices in it is equal tod. If the graph is not connected, we consider its diameter to be-1.PolandBall wants the final graph to be as neat as possible. He wants the final colorfulness to be equal tok. Can you help him and find any graph which satisfies PolandBall's requests?InputThe only one input line contains two integersnandk(2 ≤n≤ 1000,1 ≤k≤ 1000), representing graph's size and sought colorfulness.OutputIf it's impossible to find a suitable graph, print-1.Otherwise, you can output any graph which fulfills PolandBall's requirements. First, outputm— the number of red edges in your graph. Then, you should outputmlines, each containing two integersaiandbi, (1 ≤ai,bi≤n,ai≠bi) which means that there is an undirected red edge between verticesaiandbi. Every red edge should be printed exactly once, you can print the edges and the vertices of every edge in arbitrary order.Remember that PolandBall's graph should remain simple, so no loops or multiple edges are allowed.ExamplesInput4 1Output-1Input5 2Output41 22 33 44 5NoteIn the first sample case, no graph can fulfill PolandBall's requirements.In the second sample case, red graph is a path from1to5. Its diameter is4. However, white graph has diameter2, because it consists of edges1-3,1-4,1-5,2-4,2-5,3-5.",
    "source": "CF",
    "vjudge": false
}