{
    "uid": "756-C",
    "url": "https://codeforces.com/contest/756/problem/C",
    "tags": [
        "data structures"
    ],
    "title": "756-C",
    "statement": "C. Nikita and stacktime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputNikita has a stack. A stack in this problem is a data structure that supports two operations. Operationpush(x)puts an integerxon the top of the stack, and operationpop()deletes the top integer from the stack, i. e. the last added. If the stack is empty, then the operationpop()does nothing.Nikita mademoperations with the stack but forgot them. Now Nikita wants to remember them. He remembers them one by one, on thei-th step he remembers an operation he madepi-th. In other words, he remembers the operations in order of some permutationp1,p2, ...,pm. After each step Nikita wants to know what is the integer on the top of the stack after performing the operations he have already remembered, in the corresponding order. Help him!InputThe first line contains the integerm(1 ≤m≤ 105) — the number of operations Nikita made.The nextmlines contain the operations Nikita remembers. Thei-th line starts with two integerspiandti(1 ≤pi≤m,ti= 0orti= 1) — the index of operation he remembers on the stepi, and the type of the operation.tiequals0, if the operation ispop(), and1, is the operation ispush(x). If the operation ispush(x), the line also contains the integerxi(1 ≤xi≤ 106) — the integer added to the stack.It is guaranteed that each integer from1tomis present exactly once among integerspi.OutputPrintmintegers. The integerishould equal the number on the top of the stack after performing all the operations Nikita remembered on the steps from1toi. If the stack is empty after performing all these operations, print-1.ExamplesInput22 1 21 0Output22Input31 1 22 1 33 0Output232Input55 04 03 1 12 1 11 1 2Output-1-1-1-12NoteIn the first example, after Nikita remembers the operation on the first step, the operationpush(2)is the only operation, so the answer is2. After he remembers the operationpop()which was done beforepush(2), answer stays the same.In the second example, the operations arepush(2),push(3)andpop(). Nikita remembers them in the order they were performed.In the third example Nikita remembers the operations in the reversed order.",
    "source": "CF",
    "vjudge": false
}