{
    "uid": "761-D",
    "url": "https://codeforces.com/contest/761/problem/D",
    "tags": [
        "binary search",
        " brute force",
        " constructive algorithms",
        " greedy",
        " sortings"
    ],
    "title": "761-D",
    "statement": "D. Dasha and Very Difficult Problemtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDasha logged into the system and began to solve problems. One of them is as follows:Given two sequencesaandbof lengthneach you need to write a sequencecof lengthn, thei-th element of which is calculated as follows:ci=bi-ai.About sequencesaandbwe know that their elements are in the range fromltor. More formally, elements satisfy the following conditions:l≤ai≤randl≤bi≤r. About sequencecwe know that all its elements are distinct.Dasha wrote a solution to that problem quickly, but checking her work on the standard test was not so easy. Due to an error in the test system only the sequenceaand thecompressed sequenceof the sequencecwere known from that test.Let's give the definition to acompressed sequence. Acompressed sequenceof sequencecof lengthnis a sequencepof lengthn, so thatpiequals to the number of integers which are less than or equal tociin the sequencec. For example, for the sequencec= [250, 200, 300, 100, 50]the compressed sequence will bep= [4, 3, 5, 2, 1]. Pay attention that incall integers are distinct. Consequently, thecompressed sequencecontains all integers from1toninclusively.Help Dasha to find any sequencebfor which the calculatedcompressed sequenceof sequencecis correct.InputThe first line contains three integersn,l,r(1 ≤n≤ 105, 1 ≤l≤r≤ 109)— the length of the sequence and boundaries of the segment where the elements of sequencesaandbare.The next line containsnintegersa1,a2,  ...,an(l≤ai≤r)— the elements of the sequencea.The next line containsndistinct integersp1,p2,  ...,pn(1 ≤pi≤n)— thecompressed sequenceof the sequencec.OutputIf there is no the suitable sequenceb, then in the only line print \"-1\".Otherwise, in the only line printnintegers — the elements of any suitable sequenceb.ExamplesInput5 1 51 1 1 1 13 1 5 4 2Output3 1 5 4 2Input4 2 93 4 8 93 2 1 4Output2 2 2 9Input6 1 51 1 1 1 1 12 3 5 4 1 6Output-1NoteSequencebwhich was found in the second sample is suitable, because calculated sequencec= [2 - 3, 2 - 4, 2 - 8, 9 - 9] = [ - 1,  - 2,  - 6, 0](note thatci=bi-ai) has compressed sequence equals top= [3, 2, 1, 4].",
    "source": "CF",
    "vjudge": false
}