{
    "uid": "766-C",
    "url": "https://codeforces.com/contest/766/problem/C",
    "tags": [
        "brute force",
        " dp",
        " greedy",
        " strings"
    ],
    "title": "766-C",
    "statement": "C. Mahmoud and a Messagetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMahmoud wrote a messagesof lengthn. He wants to send it as a birthday present to his friend Moaz who likes strings. He wrote it on a magical paper but he was surprised because some characters disappeared while writing the string. That's because this magical paper doesn't allow character numberiin the English alphabet to be written on it in a string of length more thanai. For example, ifa1= 2he can't write character 'a' on this paper in a string of length3or more. String \"aa\" is allowed while string \"aaa\" is not.Mahmoud decided to split the message into some non-empty substrings so that he can write every substring on an independent magical paper and fulfill the condition. The sum of their lengths should benand they shouldn't overlap. For example, ifa1= 2and he wants to send string \"aaa\", he can split it into \"a\" and \"aa\" and use2magical papers, or into \"a\", \"a\" and \"a\" and use3magical papers. He can't split it into \"aa\" and \"aa\" because the sum of their lengths is greater thann. He can split the message into single string if it fulfills the conditions.A substring of stringsis a string that consists of some consecutive characters from strings, strings \"ab\", \"abc\" and \"b\" are substrings of string \"abc\", while strings \"acb\" and \"ac\" are not. Any string is a substring of itself.While Mahmoud was thinking of how to split the message, Ehab told him that there are many ways to split it. After that Mahmoud asked you three questions:How many ways are there to split the string into substrings such that every substring fulfills the condition of the magical paper, the sum of their lengths isnand they don't overlap? Compute the answer modulo109+ 7.What is the maximum length of a substring that can appear in some valid splitting?What is the minimum number of substrings the message can be spit in?Two ways are considered different, if the sets of split positions differ. For example, splitting \"aa|a\" and \"a|aa\" are considered different splittings of message \"aaa\".InputThe first line contains an integern(1 ≤n≤ 103) denoting the length of the message.The second line contains the messagesof lengthnthat consists of lowercase English letters.The third line contains26integersa1,a2, ...,a26(1 ≤ax≤ 103) — the maximum lengths of substring each letter can appear in.OutputPrint three lines.In the first line print the number of ways to split the message into substrings and fulfill the conditions mentioned in the problem modulo109+  7.In the second line print the length of the longest substring over all the ways.In the third line print the minimum number of substrings over all the ways.ExamplesInput3aab2 3 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1Output322Input10abcdeabcde5 5 5 5 4 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1Output40143NoteIn the first example the three ways to split the message are:a|a|baa|ba|abThe longest substrings are \"aa\" and \"ab\" of length2.The minimum number of substrings is2in \"a|ab\" or \"aa|b\".Notice that \"aab\" is not a possible splitting because the letter 'a' appears in a substring of length3, whilea1= 2.",
    "source": "CF",
    "vjudge": false
}