{
    "uid": "77-A",
    "url": "https://codeforces.com/contest/77/problem/A",
    "tags": [
        "brute force",
        " implementation"
    ],
    "title": "77-A",
    "statement": "A. Heroestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe year of 2012 is coming...According to an ancient choradrican legend in this very year, in 2012, Diablo and his brothers Mephisto and Baal will escape from hell, and innumerable hordes of demons will enslave the human world. But seven brave heroes have already gathered on the top of a mountain Arreat to protect us mere mortals from the effect of this terrible evil.The seven great heroes are: amazonAnka, barbarianChapay, sorceressCleo, druidTroll, necromancerDracul, paladinSnowyand a professional hit girlHexadecimal. Heroes already know how much experience will be given for each of the three megabosses:afor Mephisto,bfor Diablo andcfor Baal.Here's the problem: heroes are as much as seven and megabosses are only three! Then our heroes decided to split into three teams, where each team will go to destroy their own megaboss. Each team member will receive aof experience, rounded down, wherexwill be the amount of experience for the killed megaboss andy— the number of people in the team.Heroes do not want to hurt each other's feelings, so they want to split into teams so that the difference between the hero who received the maximum number of experience and the hero who received the minimum number of experience were minimal. Since there can be several divisions into teams, then you need to find the one in whichthe total amount of liking in teamswere maximum.It is known that some heroes like others. But if heroplikes heroq, this does not mean that the heroqlikes herop. No hero likes himself.The total amount of liking in teams is the amount of ordered pairs(p,q), such that heroespandqare in the same group, and heroplikes heroq(but it is not important if heroqlikes herop). In case of heroespandqlikes each other and they are in the same group, this pair should be counted twice, as(p,q)and(q,p).A team can consist even of a single hero, but it is important that every megaboss was destroyed. All heroes must be involved in the campaign against evil. None of the heroes can be in more than one team.It is guaranteed that every hero is able to destroy any megaboss alone.InputThe first line contains a single non-negative integern(0 ≤n≤ 42) — amount of liking between the heroes. Nextnlines describe liking in the form \"p likes q\", meaning that the heroplikes the heroq(p≠q). Every liking is described in the input exactly once, no hero likes himself.In the last line are given three integersa,bandc(1 ≤a,b,c≤ 2·109), separated by spaces: the experience for Mephisto, the experience for Diablo and experience for Baal.In all the pretests, except for examples from the statement, the following condition is satisfied:a=b=c.OutputPrint two integers — the minimal difference in the experience between two heroes who will receive the maximum and minimum number of experience points, and the maximal total amount of liking in teams (the number of friendships between heroes that end up in one team).When calculating the second answer, the team division should satisfy the difference-minimizing contraint. I.e. primary you should minimize the difference in the experience and secondary you should maximize the total amount of liking.ExamplesInput3Troll likes DraculDracul likes AnkaSnowy likes Hexadecimal210 200 180Output30 3Input2Anka likes ChapayChapay likes Anka10000 50 50Output1950 2NoteA note to first example:it the first team should beDracul,TrollandAnka, in the second oneHexadecimalandSnowy, and in the thirdCleoиChapay.",
    "source": "CF",
    "vjudge": false
}