{
    "uid": "774-F",
    "url": "https://codeforces.com/contest/774/problem/F",
    "tags": [
        "*special",
        " binary search",
        " number theory"
    ],
    "title": "774-F",
    "statement": "F. Pens And Days Of Weektime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputStepan hasnpens. Every day he uses them, and on thei-th day he uses the pen numberi. On the(n+ 1)-th day again he uses the pen number1, on the(n+ 2)-th — he uses the pen number2and so on.On every working day (from Monday to Saturday, inclusive) Stepan spends exactly1milliliter of ink of the pen he uses that day. On Sunday Stepan has a day of rest, he does not stend the ink of the pen he uses that day.Stepan knows the current volume of ink in each of his pens. Now it's theMonday morningand Stepan is going to use the pennumber1today. Your task is to determine which pen will run out of ink before all the rest (that is, there will be no ink left in it), if Stepan will use the pens according to the conditions described above.InputThe first line contains the integern(1 ≤n≤ 50 000) — the number of pens Stepan has.The second line contains the sequence of integersa1,a2, ...,an(1 ≤ai≤ 109), whereaiis equal to the number of milliliters of ink which the pen numbericurrently has.OutputPrint the index of the pen which will run out of ink before all (it means that there will be no ink left in it), if Stepan will use pens according to the conditions described above.Pens are numbered in the order they are given in input data. The numeration begins from one.Note that the answer is always unambiguous, since several pens can not end at the same time.ExamplesInput33 3 3Output2Input55 4 5 4 4Output5NoteIn the first test Stepan uses ink of pens as follows:on the day number1(Monday) Stepan will use the pen number1, after that there will be2milliliters of ink in it;on the day number2(Tuesday) Stepan will use the pen number2, after that there will be2milliliters of ink in it;on the day number3(Wednesday) Stepan will use the pen number3, after that there will be2milliliters of ink in it;on the day number4(Thursday) Stepan will use the pen number1, after that there will be1milliliters of ink in it;on the day number5(Friday) Stepan will use the pen number2, after that there will be1milliliters of ink in it;on the day number6(Saturday) Stepan will use the pen number3, after that there will be1milliliters of ink in it;on the day number7(Sunday) Stepan will use the pen number1, but it is a day of rest so he will not waste ink of this pen in it;on the day number8(Monday) Stepan will use the pen number2, after that this pen will run out of ink.So, the first pen which will not have ink is the pen number2.",
    "source": "CF",
    "vjudge": false
}