{
    "uid": "785-D",
    "url": "https://codeforces.com/contest/785/problem/D",
    "tags": [
        "combinatorics",
        " dp",
        " math",
        " number theory"
    ],
    "title": "785-D",
    "statement": "D. Anton and School - 2time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAs you probably know, Anton goes to school. One of the school subjects that Anton studies is Bracketology. On the Bracketology lessons students usually learn different sequences that consist of round brackets (characters \"(\" and \")\" (without quotes)).On the last lesson Anton learned about the regular simple bracket sequences (RSBS). A bracket sequencesof lengthnis an RSBS if the following conditions are met:It is not empty (that isn≠ 0).The length of the sequence is even.Firstcharactes of the sequence are equal to \"(\".Lastcharactes of the sequence are equal to \")\".For example, the sequence \"((()))\" is an RSBS but the sequences \"((())\" and \"(()())\" are not RSBS.Elena Ivanovna, Anton's teacher, gave him the following task as a homework. Given a bracket sequences. Find the number of its distinct subsequences such that they are RSBS. Note that a subsequence ofsis a string that can be obtained fromsby deleting some of its elements. Two subsequences are considered distinct if distinct sets of positions are deleted.Because the answer can be very big and Anton's teacher doesn't like big numbers, she asks Anton to find the answer modulo109+ 7.Anton thought of this task for a very long time, but he still doesn't know how to solve it. Help Anton to solve this task and write a program that finds the answer for it!InputThe only line of the input contains a strings— the bracket sequence given in Anton's homework. The string consists only of characters \"(\" and \")\" (without quotes). It's guaranteed that the string is not empty and its length doesn't exceed200 000.OutputOutput one number — the answer for the task modulo109+ 7.ExamplesInput)(()()Output6Input()()()Output7Input)))Output0NoteIn the first sample the following subsequences are possible:If we delete characters at the positions1and5(numbering starts with one), we will get the subsequence \"(())\".If we delete characters at the positions1,2,3and4, we will get the subsequence \"()\".If we delete characters at the positions1,2,4and5, we will get the subsequence \"()\".If we delete characters at the positions1,2,5and6, we will get the subsequence \"()\".If we delete characters at the positions1,3,4and5, we will get the subsequence \"()\".If we delete characters at the positions1,3,5and6, we will get the subsequence \"()\".The rest of the subsequnces are not RSBS. So we got6distinct subsequences that are RSBS, so the answer is6.",
    "source": "CF",
    "vjudge": false
}