{
    "uid": "79-C",
    "url": "https://codeforces.com/contest/79/problem/C",
    "tags": [
        "data structures",
        " dp",
        " greedy",
        " hashing",
        " strings",
        " two pointers"
    ],
    "title": "79-C",
    "statement": "C. Beavertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAfter Fox Ciel got off a bus, she found that the bus she was on was a wrong bus and she lost her way in a strange town. However, she fortunately met her friend Beaver Taro and asked which way to go to her castle. Taro's response to her was a strings, and she tried to remember the stringscorrectly.However, Ciel feelsnstringsb1,b2, ... ,bnare really boring, and unfortunately she dislikes to remember a string that contains a boring substring. To make the thing worse, what she can remember is only the contiguous substring ofs.Determine the longest contiguous substring ofsthat does not contain any boring string, so that she can remember the longest part of Taro's response.InputIn the first line there is a strings. The length ofswill be between1and105, inclusive.In the second line there is a single integern(1 ≤n≤ 10).  Nextnlines, there is a stringbi(1 ≤i≤n). Each length ofbiwill be between1and10, inclusive.Each character of the given strings will be either a English alphabet (both lowercase and uppercase) or a underscore ('_') or a digit. Assume that these strings are case-sensitive.OutputOutput in the first line two space-separated integerslenandpos: the length of the longest contiguous substring ofsthat does not contain anybi, and the first position of the substring (0-indexed). The positionposmust be between0and|s| -leninclusive, where|s|is the length of strings.If there are several solutions, output any.ExamplesInputGo_straight_along_this_street5strlongtreebigintegerellipseOutput12 4InputIhaveNoIdea9IhaveNoIdOutput0 0Inputunagioisii2ioiunagiOutput5 5NoteIn the first sample, the solution istraight_alon.In the second sample, the solution is an empty string, so the output can be «0 0», «0 1», «0 2», and so on.In the third sample, the solution is eithernagiooroisii.",
    "source": "CF",
    "vjudge": false
}