{
    "uid": "793-C",
    "url": "https://codeforces.com/contest/793/problem/C",
    "tags": [
        "geometry",
        " implementation",
        " math",
        " sortings"
    ],
    "title": "793-C",
    "statement": "C. Mice problemtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIgor the analyst fell asleep on the work and had a strange dream. In the dream his desk was crowded with computer mice, so he bought a mousetrap to catch them.The desk can be considered as an infinite plane, then the mousetrap is a rectangle which sides are parallel to the axes, and which opposite sides are located in points(x1,y1)and(x2,y2).Igor wants to catch all mice. Igor has analysed their behavior and discovered that each mouse is moving along a straight line with constant speed, the speed of thei-th mouse is equal to(vix,viy), that means that thexcoordinate of the mouse increases byvixunits per second, while theycoordinates increases byviyunits. The mousetrap is open initially so that the mice are able to move freely on the desk. Igor can close the mousetrap at any moment catching all the mice that arestrictlyinside the mousetrap.Igor works a lot, so he is busy in the dream as well, and he asks you to write a program that by given mousetrap's coordinates, the initial coordinates of the mice and their speeds determines the earliest time moment in which he is able to catch all the mice. Please note that Igor can close the mousetrap only once.InputThe first line contains single integern(1 ≤n≤ 100 000) — the number of computer mice on the desk.The second line contains four integersx1,y1,x2andy2(0 ≤x1≤x2≤ 100 000), (0 ≤y1≤y2≤ 100 000) — the coordinates of the opposite corners of the mousetrap.The nextnlines contain the information about mice.Thei-th of these lines contains four integersrix,riy,vixandviy, (0 ≤rix,riy≤ 100 000,- 100 000 ≤vix,viy≤ 100 000), where(rix,riy)is the initial position of the mouse, and(vix,viy)is its speed.OutputIn the only line print minimum possible non-negative numbertsuch that if Igor closes the mousetrap attseconds from the beginning, then all the mice arestrictlyinside the mousetrap. If there is no sucht, print-1.Your answer is considered correct if its absolute or relative error doesn't exceed10- 6.Formally, let your answer bea, and the jury's answer beb. Your answer is considered correct if.ExamplesInput47 7 9 83 5 7 57 5 2 43 3 7 86 6 3 2Output0.57142857142857139685Input47 7 9 80 3 -5 45 0 5 49 9 -1 -610 5 -7 -10Output-1NoteHere is a picture of the first samplePoints A, B, C, D - start mice positions, segments are their paths.Then, at first time when all mice will be in rectangle it will be looks like this:Here is a picture of the second samplePoints A, D, B will never enter rectangle.",
    "source": "CF",
    "vjudge": false
}