{
    "uid": "793-F",
    "url": "https://codeforces.com/contest/793/problem/F",
    "tags": [
        "data structures",
        " divide and conquer",
        " dp"
    ],
    "title": "793-F",
    "statement": "F. Julia the snailtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputAfter hard work Igor decided to have some rest.He decided to have a snail. He bought an aquarium with a slippery tree trunk in the center, and put a snail named Julia into the aquarium.Igor noticed that sometimes Julia wants to climb onto the trunk, but can't do it because the trunk is too slippery. To help the snail Igor put some ropes on the tree, fixing the lower end of thei-th rope on the trunk on the heightliabove the ground, and the higher end on the heightriabove the ground.For some reason no two ropes share the same position of the higher end, i.e. allriare distinct. Now Julia can move down at any place of the trunk, and also move up from the lower end of some rope to its higher end. Igor is proud of his work, and sometimes think about possible movements of the snail. Namely, he is interested in the following questions: «Suppose the snail is on the trunk at heightxnow. What is the highest position on the trunk the snail can get on if it would never be lower thanxor higher thany?» Please note that Julia can't move from a rope to the trunk before it reaches the higher end of the rope, and Igor is interested in the highest positionon the tree trunk.Igor is interested in many questions, and not always can answer them. Help him, write a program that answers these questions.InputThe first line contains single integern(1  ≤n≤  100000) — the height of the trunk.The second line contains single integerm(1  ≤m≤  100000) — the number of ropes.The nextmlines contain information about the ropes.Thei-th of these lines contains two integersliandri(1  ≤li≤ri≤n) — the heights on which the lower and the higher ends of thei-th rope are fixed, respectively. It is guaranteed that allriare distinct.The next line contains single integerq(1  ≤q≤  100000) — the number of questions.The nextqlines contain information about the questions.Each of these lines contain two integersxandy(1  ≤x≤y≤n), wherexis the height where Julia starts (and the height Julia can't get lower than), andyis the height Julia can't get higher than.OutputFor each question print the maximum reachable for Julia height.ExamplesInput841 23 42 56 751 21 41 62 76 8Output22557Input10103 71 41 65 51 13 97 81 23 37 10102 41 73 43 52 82 55 53 57 73 10Output27332253710NoteThe picture of the first sample is on the left, the picture of the second sample is on the right. Ropes' colors are just for clarity, they don't mean anything.",
    "source": "CF",
    "vjudge": false
}