{
    "uid": "796-E",
    "url": "https://codeforces.com/contest/796/problem/E",
    "tags": [
        "binary search",
        " dp"
    ],
    "title": "796-E",
    "statement": "E. Exam Cheatingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputZane and Zane's crush have just decided to date! However, the girl is having a problem with her Physics final exam, and needs your help.There arenquestions, numbered from1ton. Questionicomes before questioni+ 1(1 ≤i<n). Each of the questions cannot be guessed on, due to the huge penalty for wrong answers. The girl luckily sits in the middle of two geniuses, so she is going to cheat.However, the geniuses have limitations. Each of them may or may not know the answers to some questions. Anyway, it is safe to assume that the answers on their answer sheets are absolutely correct.To make sure she will not get caught by the proctor, the girl will glanceat mostptimes, each time looking atno more thankconsecutive questions on one of the two geniuses' answer sheet. When the girl looks at some question on an answer sheet, she copies the answer to that question if it is on that answer sheet, or does nothing otherwise.Help the girl find the maximum number of questions she can get correct.InputThe first line contains three integersn,p, andk(1 ≤n,p≤ 1, 000,1 ≤k≤min(n, 50)) — the number of questions, the maximum number of times the girl can glance, and the maximum number of consecutive questions that can be looked at in one time glancing, respectively.The second line starts with one integerr(0 ≤r≤n), denoting the number of questions the first genius has answered on his answer sheet. Then followrintegersa1,a2, ...,ar(1 ≤ai≤n) — the answered questions, given in a strictly-increasing order (that is,ai<ai+ 1).The third line starts with one integers(0 ≤s≤n), denoting the number of questions the second genius has answered on his answer sheet. Then followsintegersb1,b2, ...,bs(1 ≤bi≤n) — the answered questions, given in a strictly-increasing order (that is,bi<bi+ 1).OutputPrint one integer — the maximum number of questions the girl can answer correctly.ExamplesInput6 2 33 1 3 64 1 2 5 6Output4Input8 3 34 1 3 5 65 2 4 6 7 8Output7NoteLet(x,l,r)denote the action of looking at all questionsisuch thatl≤i≤ron the answer sheet of thex-th genius.In the first sample, the girl could get4questions correct by performing sequence of actions(1, 1, 3)and(2, 5, 6).In the second sample, the girl could perform sequence of actions(1, 3, 5),(2, 2, 4), and(2, 6, 8)to get7questions correct.",
    "source": "CF",
    "vjudge": false
}