{
    "uid": "796-A",
    "url": "https://codeforces.com/contest/796/problem/A",
    "tags": [
        "brute force",
        " implementation"
    ],
    "title": "796-A",
    "statement": "A. Buying A Housetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputZane the wizard had never loved anyone before, until he fell in love with a girl, whose name remains unknown to us.The girl lives in housemof a village. There arenhouses in that village, lining in a straight line from left to right: house1, house2, ..., housen. The village is also well-structured: houseiand housei+ 1(1 ≤i<n) are exactly10meters away. In this village, some houses are occupied, and some are not. Indeed, unoccupied houses can be purchased.You will be givennintegersa1,a2, ...,anthat denote the availability and the prices of the houses. If houseiis occupied, and therefore cannot be bought, thenaiequals0. Otherwise, houseican be bought, andairepresents the money required to buy it, in dollars.As Zane has onlykdollars to spare, it becomes a challenge for him to choose the house to purchase, so that he could live as near as possible to his crush. Help Zane determine the minimum distance from his crush's house to some house he can afford, to help him succeed in his love.InputThe first line contains three integersn,m, andk(2 ≤n≤ 100,1 ≤m≤n,1 ≤k≤ 100) — the number of houses in the village, the house where the girl lives, and the amount of money Zane has (in dollars), respectively.The second line containsnintegersa1,a2, ...,an(0 ≤ai≤ 100) — denoting the availability and the prices of the houses.It is guaranteed thatam= 0and that it is possible to purchase some house with no more thankdollars.OutputPrint one integer — the minimum distance, in meters, from the house where the girl Zane likes lives to the house Zane can buy.ExamplesInput5 1 200 27 32 21 19Output40Input7 3 5062 0 0 0 99 33 22Output30Input10 5 1001 0 1 0 0 0 0 0 1 1Output20NoteIn the first sample, withk= 20dollars, Zane can buy only house5. The distance from housem= 1to house5is10 + 10 + 10 + 10 = 40meters.In the second sample, Zane can buy houses6and7. It is better to buy house6than house7, since housem= 3and house6are only30meters away, while housem= 3and house7are40meters away.",
    "source": "CF",
    "vjudge": false
}