{
    "uid": "809-E",
    "url": "https://codeforces.com/contest/809/problem/E",
    "tags": [
        "divide and conquer",
        " math",
        " number theory",
        " trees"
    ],
    "title": "809-E",
    "statement": "E. Surprise me!time limit per test8 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTired of boring dates, Leha and Noora decided to play a game.Leha found a tree withnvertices numbered from1ton. We remind you that tree is an undirected graph without cycles. Each vertexvof a tree has a numberavwritten on it. Quite by accident it turned out that all values written on vertices are distinct and are natural numbers between1andn.The game goes in the following way. Noora chooses some vertexuof a tree uniformly at random and passes a move to Leha. Leha, in his turn, chooses (also uniformly at random) some vertexvfrom remaining vertices of a tree(v≠u). As you could guess there aren(n- 1)variants of choosing vertices by players. After that players calculate the value of a functionf(u,v) = φ(au·av)·d(u,v)of the chosen vertices whereφ(x)is Euler's totient function andd(x,y)is the shortest distance between verticesxandyin a tree.Soon the game became boring for Noora, so Leha decided to defuse the situation and calculate expected value of functionfover all variants of choosing verticesuandv, hoping of at least somehow surprise the girl.Leha asks for your help in calculating this expected value. Let this value be representable in the form of an irreducible fraction. To further surprise Noora, he wants to name her the value.Help Leha!InputThe first line of input contains one integer numbern(2 ≤n≤ 2·105)— number of vertices in a tree.The second line containsndifferent numbersa1,a2, ...,an(1 ≤ai≤n)separated by spaces, denoting the values written on a tree vertices.Each of the nextn- 1lines contains two integer numbersxandy(1 ≤x,y≤n), describing the next edge of a tree. It is guaranteed that this set of edges describes a tree.OutputIn a single line print a number equal toP·Q- 1modulo109+ 7.ExamplesInput31 2 31 22 3Output333333338Input55 4 3 1 23 51 24 32 5Output8NoteEuler's totient functionφ(n)is the number of suchithat1 ≤i≤n,andgcd(i,n) = 1, wheregcd(x,y)is the greatest common divisor of numbersxandy.There are6variants of choosing vertices by Leha and Noora in the first testcase:u= 1,v= 2,f(1, 2) = φ(a1·a2)·d(1, 2) = φ(1·2)·1 = φ(2) = 1u= 2,v= 1,f(2, 1) =f(1, 2) = 1u= 1,v= 3,f(1, 3) = φ(a1·a3)·d(1, 3) = φ(1·3)·2 = 2φ(3) = 4u= 3,v= 1,f(3, 1) =f(1, 3) = 4u= 2,v= 3,f(2, 3) = φ(a2·a3)·d(2, 3) = φ(2·3)·1 = φ(6) = 2u= 3,v= 2,f(3, 2) =f(2, 3) = 2Expected value equals to. The value Leha wants to name Noora is7·3- 1= 7·333333336 = 333333338.In the second testcase expected value equals to, so Leha will have to surprise Hoora by number8·1- 1= 8.",
    "source": "CF",
    "vjudge": false
}