{
    "uid": "809-A",
    "url": "https://codeforces.com/contest/809/problem/A",
    "tags": [
        "implementation",
        " math",
        " sortings"
    ],
    "title": "809-A",
    "statement": "A. Do you want a date?time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLeha decided to move to a quiet town Vičkopolis, because he was tired by living in Bankopolis. Upon arrival he immediately began to expand his network of hacked computers. During the week Leha managed to get access toncomputers throughout the town. Incidentally all the computers, which were hacked by Leha, lie on the same straight line, due to the reason that there is the only one straight street in Vičkopolis.Let's denote the coordinate system on this street. Besides let's number all the hacked computers with integers from1ton. So thei-th hacked computer is located at the pointxi. Moreover the coordinates of all computers are distinct.Leha is determined to have a little rest after a hard week. Therefore he is going to invite his friend Noora to a restaurant. However the girl agrees to go on a date with the only one condition: Leha have to solve a simple task.Leha should calculate a sum ofF(a)for alla, whereais a non-empty subset of the set, that consists of all hacked computers. Formally, let's denoteAthe set of all integers from1ton. Noora asks the hacker to find value of the expression. HereF(a)is calculated as the maximum among the distances between all pairs of computers from the seta. Formally,. Since the required sum can be quite large Noora asks to find it modulo109+ 7.Though, Leha is too tired. Consequently he is not able to solve this task. Help the hacker to attend a date.InputThe first line contains one integern(1 ≤n≤ 3·105)denoting the number of hacked computers.The second line containsnintegersx1,x2, ...,xn(1 ≤xi≤ 109)denoting the coordinates of hacked computers. It is guaranteed that allxiare distinct.OutputPrint a single integer — the required sum modulo109+ 7.ExamplesInput24 7Output3Input34 3 1Output9NoteThere are three non-empty subsets in the first sample test:,and. The first and the second subset increase the sum by0and the third subset increases the sum by7 - 4 = 3. In total the answer is0 + 0 + 3 = 3.There are seven non-empty subsets in the second sample test. Among them only the following subsets increase the answer:,,,. In total the sum is(4 - 3) + (4 - 1) + (3 - 1) + (4 - 1) = 9.",
    "source": "CF",
    "vjudge": false
}