{
    "uid": "814-C",
    "url": "https://codeforces.com/contest/814/problem/C",
    "tags": [
        "brute force",
        " dp",
        " strings",
        " two pointers"
    ],
    "title": "814-C",
    "statement": "C. An impassioned circulation of affectiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputNadeko's birthday is approaching! As she decorated the room for the party, a long garland of Dianthus-shaped paper pieces was placed on a prominent part of the wall. Brother Koyomi will like it!Still unsatisfied with the garland, Nadeko decided to polish it again. The garland hasnpieces numbered from1tonfrom left to right, and thei-th piece has a coloursi, denoted by a lowercase English letter. Nadeko will repaintat mostmof the pieces to give each of them an arbitrary new colour (still denoted by a lowercase English letter). After this work, she finds out all subsegments of the garland containing pieces of only colourc— Brother Koyomi's favourite one, and takes the length of the longest among them to be theKoyomityof the garland.For instance, let's say the garland is represented by \"kooomo\", and Brother Koyomi's favourite colour is \"o\". Among all subsegments containing pieces of \"o\" only, \"ooo\" is the longest, with a length of3. Thus theKoyomityof this garland equals3.But problem arises as Nadeko is unsure about Brother Koyomi's favourite colour, and has swaying ideas on the amount of work to do. She hasqplans on this, each of which can be expressed as a pair of an integermiand a lowercase letterci, meanings of which are explained above. You are to find out the maximumKoyomityachievable after repainting the garland according to each plan.InputThe first line of input contains a positive integern(1 ≤n≤ 1 500) — the length of the garland.The second line containsnlowercase English letterss1s2...snas a string — the initial colours of paper pieces on the garland.The third line contains a positive integerq(1 ≤q≤ 200 000) — the number of plans Nadeko has.The nextqlines describe one plan each: thei-th among them contains an integermi(1 ≤mi≤n) — the maximum amount of pieces to repaint, followed by a space, then by a lowercase English letterci— Koyomi's possible favourite colour.OutputOutputqlines: for each work plan, output one line containing an integer — the largestKoyomityachievable after repainting the garland according to it.ExamplesInput6koyomi31 o4 o4 mOutput365Input15yamatonadeshiko101 a2 a3 a4 a5 a1 b2 b3 b4 b5 bOutput3457812345Input10aaaaaaaaaa210 b10 zOutput1010NoteIn the first sample, there are three plans:In the first plan, at most1piece can be repainted. Repainting the \"y\" piece to become \"o\" results in \"kooomi\", whoseKoyomityof3is the best achievable;In the second plan, at most4pieces can be repainted, and \"oooooo\" results in aKoyomityof6;In the third plan, at most4pieces can be repainted, and \"mmmmmi\" and \"kmmmmm\" both result in aKoyomityof5.",
    "source": "CF",
    "vjudge": false
}