{
    "uid": "819-D",
    "url": "https://codeforces.com/contest/819/problem/D",
    "tags": [
        "number theory"
    ],
    "title": "819-D",
    "statement": "D. Mister B and Astronomerstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter studying the beacons Mister B decided to visit alien's planet, because he learned that they live in a system of flickering star Moon. Moreover, Mister B learned that the star shines once in exactlyTseconds. The problem is that the star is yet to be discovered by scientists.There arenastronomers numerated from1tontrying to detect the star. They try to detect the star by sending requests to record the sky for1second.The astronomers send requestsin cycle: thei-th astronomer sends a request exactlyaisecond after the(i- 1)-th (i.e. if the previous request was sent at momentt, then the next request is sent at momentt+ai); the1-st astronomer sends requestsa1seconds later than then-th. The first astronomer sends his first request at moment0.Mister B doesn't know the first moment the star is going to shine, but it's obvious that all moments at which the star will shine are determined by the time of its shine moment in the interval[0,T). Moreover, this interval can be split intoTparts of1second length each of form[t,t+ 1), wheret= 0, 1, 2, ..., (T- 1).Mister B wants to know how lucky each astronomer can be in discovering the star first.For each astronomer compute how many segments of form[t,t+ 1)(t= 0, 1, 2, ..., (T- 1)) there are in the interval[0,T)so that this astronomer is the first to discover the star if the first shine of the star happens in this time interval.InputThe first line contains two integersTandn(1 ≤T≤ 109,2 ≤n≤ 2·105).The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 109).OutputPrintnintegers: for each astronomer print the number of time segments describer earlier.ExamplesInput4 22 3Output3 1Input5 41 1 1 1Output2 1 1 1NoteIn the first sample test the first astronomer will send requests at momentst1= 0, 5, 10, ..., the second — at momentst2= 3, 8, 13, .... That's why interval[0, 1)the first astronomer will discover first at momentt1= 0,[1, 2)— the first astronomer at momentt1= 5,[2, 3)— the first astronomer at momentt1= 10, and[3, 4)— the second astronomer at momentt2= 3.In the second sample test interval[0, 1)— the first astronomer will discover first,[1, 2)— the second astronomer,[2, 3)— the third astronomer,[3, 4)— the fourth astronomer,[4, 5)— the first astronomer.",
    "source": "CF",
    "vjudge": false
}