{
    "uid": "821-D",
    "url": "https://codeforces.com/contest/821/problem/D",
    "tags": [
        "dfs and similar",
        " graphs",
        " shortest paths"
    ],
    "title": "821-D",
    "statement": "D. Okabe and Citytime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOkabe likes to be able to walk through his city on a path lit by street lamps. That way, he doesn't get beaten up by schoolchildren.Okabe's city is represented by a 2D grid of cells. Rows are numbered from1tonfrom top to bottom, and columns are numbered1tomfrom left to right. Exactlykcells in the city are lit by a street lamp. It's guaranteed that the top-left cell is lit.Okabe starts his walk from the top-left cell, and wants to reach the bottom-right cell. Of course, Okabe will only walk on lit cells, and he can only move to adjacent cells in the up, down, left, and right directions. However, Okabe can also temporarily light all the cells in any single row or column at a time if he pays1coin, allowing him to walk through some cells not lit initially.Note that Okabe can only light a single row or column at a time, and has to pay a coin every time he lights a new row or column. To change the row or column that is temporarily lit, he must stand at a cell that is lit initially. Also, once he removes his temporary light from a row or column, all cells in that row/column not initially lit are now not lit.Help Okabe find the minimum number of coins he needs to pay to complete his walk!InputThe first line of input contains three space-separated integersn,m, andk(2 ≤n,m,k≤ 104).Each of the nextklines contains two space-separated integersriandci(1 ≤ri≤n,1 ≤ci≤m) — the row and the column of thei-th lit cell.It is guaranteed that allklit cells are distinct. It is guaranteed that the top-left cell is lit.OutputPrint the minimum number of coins Okabe needs to pay to complete his walk, or-1if it's not possible.ExamplesInput4 4 51 12 12 33 34 3Output2Input5 5 41 12 13 13 2Output-1Input2 2 41 11 22 12 2Output0Input5 5 41 12 23 34 4Output3NoteIn the first sample test, Okabe can take the path, paying only when moving to(2, 3)and(4, 4).In the fourth sample, Okabe can take the path, paying when moving to(1, 2),(3, 4), and(5, 4).",
    "source": "CF",
    "vjudge": false
}