{
    "uid": "83-E",
    "url": "https://codeforces.com/contest/83/problem/E",
    "tags": [
        "bitmasks",
        " dp"
    ],
    "title": "83-E",
    "statement": "E. Two Subsequencestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOn an IT lesson Valera studied data compression. The teacher told about a new method, which we shall now describe to you.Let{a1,a2, ...,an}be the given sequence of lines needed to be compressed. Here and below we shall assume that all lines areof the same lengthand consist only of the digits0and1. Let's define the compression function:f(empty sequence) =empty stringf(s) =s.f(s1,s2) =the smallest in length string, which has one of the prefixes equal tos1and one of the suffixes equal tos2. For example,f(001, 011) = 0011,f(111, 011) = 111011.f(a1,a2, ...,an) =f(f(a1,a2,an- 1),an). For example,f(000, 000, 111) =f(f(000, 000), 111) =f(000, 111) = 000111.Valera faces a real challenge: he should divide the given sequence{a1,a2, ...,an}into two subsequences{b1,b2, ...,bk}and{c1,c2, ...,cm},m+k=n, so that the value ofS= |f(b1,b2, ...,bk)| + |f(c1,c2, ...,cm)|took the minimum possible value. Here|p|denotes the length of the stringp.Note that it is not allowed to change the relative order of lines in the subsequences. It is allowed to make one of the subsequences empty. Each string from the initial sequence should belong to exactly one subsequence. Elements of subsequencesbandcdon't have to be consecutive in the original sequencea, i. e. elements ofbandccan alternate ina(see samples 2 and 3).Help Valera to find the minimum possible value ofS.InputThe first line of input data contains an integern— the number of strings (1 ≤n≤ 2·105). Then onnlines follow elements of the sequence — strings whose lengths are from1to20characters, consisting only of digits0and1. Thei+ 1-th input line contains thei-th element of the sequence. Elements of the sequence are separated only by a newline. It is guaranteed that all lines have the same length.OutputPrint a single number — the minimum possible value ofS.ExamplesInput3011001Output4Input4000111110001Output8Input51010101010111110100010010Output17NoteDetailed answers to the tests:The best option is to make one of the subsequences empty, and the second one equal to the whole given sequence.|f(01, 10, 01)| = |f(f(01, 10), 01)| = |f(010, 01)| = |0101| = 4.The best option is:b= {000, 001},c= {111, 110}.S= |f(000, 001)| + |f(111, 110)| = |0001| + |1110| = 8.The best option is:b= {10101, 01010, 01000},c= {11111, 10010}.S= |10101000| + |111110010| = 17.",
    "source": "CF",
    "vjudge": false
}