{
    "uid": "832-C",
    "url": "https://codeforces.com/contest/832/problem/C",
    "tags": [
        "binary search",
        " implementation",
        " math"
    ],
    "title": "832-C",
    "statement": "C. Strange Radiationtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputnpeople are standing on a coordinate axis in points with positive integer coordinates strictly less than106. For each person we know in which direction (left or right) he is facing, and his maximum speed.You can put a bomb in some point with non-negative integer coordinate, and blow it up. At this moment all people will start running with their maximum speed in the direction they are facing. Also, two strange rays will start propagating from the bomb with speeds: one to the right, and one to the left. Of course, the speedsis strictly greater than people's maximum speed.The rays are strange because if at any moment the position and the direction of movement of some ray and some person coincide, then the speed of the person immediately increases by the speed of the ray.You need to place the bomb is such a point that the minimum time moment in which there is a person that has run through point0, and there is a person that has run through point106, is as small as possible. In other words, find the minimum time momenttsuch that there is a point you can place the bomb to so that at time momenttsome person has run through0, and some person has run through point106.InputThe first line contains two integersnands(2 ≤n≤ 105,2 ≤s≤ 106) — the number of people and the rays' speed.The nextnlines contain the description of people. Thei-th of these lines contains three integersxi,viandti(0 <xi< 106,1 ≤vi<s,1 ≤ti≤ 2) — the coordinate of thei-th person on the line, his maximum speed and the direction he will run to (1is to the left, i.e. in the direction of coordinate decrease,2is to the right, i.e. in the direction of coordinate increase), respectively.It is guaranteed that the points0and106will be reached independently of the bomb's position.OutputPrint the minimum time needed for both points0and106to be reached.Your answer is considered correct if its absolute or relative error doesn't exceed10- 6. Namely, if your answer isa, and the jury's answer isb, then your answer is accepted, if.ExamplesInput2 999400000 1 2500000 1 1Output500000.000000000000000000000000000000Input2 1000400000 500 1600000 500 2Output400.000000000000000000000000000000NoteIn the first example, it is optimal to place the bomb at a point with a coordinate of400000. Then at time0, the speed of the first person becomes1000and he reaches the point106at the time600. The bomb will not affect on the second person, and he will reach the0point at the time500000.In the second example, it is optimal to place the bomb at the point500000. The rays will catch up with both people at the time200. At this time moment, the first is at the point with a coordinate of300000, and the second is at the point with a coordinate of700000. Their speed will become1500and at the time400they will simultaneously run through points0and106.",
    "source": "CF",
    "vjudge": false
}