{
    "uid": "847-C",
    "url": "https://codeforces.com/contest/847/problem/C",
    "tags": [
        "constructive algorithms"
    ],
    "title": "847-C",
    "statement": "C. Sum of Nestingstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecall that the bracket sequence is considered regular if it is possible to insert symbols '+' and '1' into it so that the result is a correct arithmetic expression. For example, a sequence \"(()())\" is regular, because we can get correct arithmetic expression insering symbols '+' and '1': \"((1+1)+(1+1))\". Also the following sequences are regular: \"()()()\", \"(())\" and \"()\". The following sequences are not regular bracket sequences: \")(\", \"(()\" and \"())(()\".In this problem you are given two integersnandk. Your task is to construct a regular bracket sequence consisting of round brackets with length2·nwith total sum of nesting of all opening brackets equals to exactlyk. The nesting of a single opening bracket equals to the number of pairs of brackets in which current opening bracket is embedded.For example, in the sequence \"()(())\" the nesting of first opening bracket equals to0, the nesting of the second opening bracket equals to0and the nesting of the third opening bracket equal to1. So the total sum of nestings equals to1.InputThe first line contains two integersnandk(1 ≤n≤ 3·105,0 ≤k≤ 1018) — the number of opening brackets and needed total nesting.OutputPrint the required regular bracket sequence consisting of round brackets.If there is no solution print \"Impossible\" (without quotes).ExamplesInput3 1Output()(())Input4 6Output(((())))Input2 5OutputImpossibleNoteThe first example is examined in the statement.In the second example the answer is \"(((())))\". The nesting of the first opening bracket is0, the nesting of the second is1, the nesting of the third is2, the nesting of fourth is3. So the total sum of nestings equals to0 + 1 + 2 + 3 = 6.In the third it is impossible to construct a regular bracket sequence, because the maximum possible total sum of nestings for two opening brackets equals to1. This total sum of nestings is obtained for the sequence \"(())\".",
    "source": "CF",
    "vjudge": false
}