{
    "uid": "85-D",
    "url": "https://codeforces.com/contest/85/problem/D",
    "tags": [
        "binary search",
        " brute force",
        " data structures",
        " implementation"
    ],
    "title": "85-D",
    "statement": "D. Sum of Medianstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn one well-known algorithm of finding thek-th order statistics we should divide all elements into groups of five consecutive elements and find the median of each five. A median is called the middle element of a sorted array (it's the third largest element for a group of five). To increase the algorithm's performance speed on a modern video card, you should be able to find a sum of medians in each five of the array.Asum of mediansof a sortedk-element setS= {a1,a2, ...,ak}, wherea1<a2<a3< ... <ak, will be understood by asTheoperator stands for taking the remainder, that isstands for the remainder of dividingxbyy.To organize exercise testing quickly calculatingthe sum of mediansfor a changing set was needed.InputThe first line contains numbern(1 ≤n≤ 105), the number of operations performed.Then each ofnlines contains the description of one of the three operations:addx— add the elementxto the set;delx— delete the elementxfrom the set;sum— find thesum of mediansof the set.For anyaddxoperation it is true that the elementxis not included in the set directly before the operation.For anydelxoperation it is true that the elementxis included in the set directly before the operation.All the numbers in the input are positive integers, not exceeding109.OutputFor each operationsumprint on the single linethe sum of mediansof the current set. If the set is empty, print 0.Please, do not use the%lldspecificator to read or write 64-bit integers in C++. It is preferred to use thecin,coutstreams (also you may use the%I64dspecificator).ExamplesInput6add 4add 5add 1add 2add 3sumOutput3Input14add 1add 7add 2add 5sumadd 6add 8add 9add 3add 4add 10sumdel 1sumOutput51113",
    "source": "CF",
    "vjudge": false
}