{
    "uid": "850-E",
    "url": "https://codeforces.com/contest/850/problem/E",
    "tags": [
        "bitmasks",
        " brute force",
        " divide and conquer",
        " fft",
        " math"
    ],
    "title": "850-E",
    "statement": "E. Random Electionstime limit per test2 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputThe presidential election is coming in Bearland next year! Everybody is so excited about this!So far, there are three candidates, Alice, Bob, and Charlie.There arencitizens in Bearland. The election result will determine the life of all citizens of Bearland for many years. Because of this great responsibility, each ofncitizens will choose one of six orders of preference between Alice, Bob and Charlie uniformly at random, independently from other voters.The government of Bearland has devised a function to help determine the outcome of the election given the voters preferences. More specifically, the function is(takesnboolean numbers and returns a boolean number). The function also obeys the following property:f(1 -x1, 1 -x2, ..., 1 -xn) = 1 -f(x1,x2, ...,xn).Three rounds will be run between each pair of candidates: Alice and Bob, Bob and Charlie, Charlie and Alice. In each round,xiwill be equal to1, ifi-th citizen prefers the first candidate to second in this round, and0otherwise. After this,y=f(x1,x2, ...,xn)will be calculated. Ify= 1, the first candidate will be declared as winner in this round. Ify= 0, the second will be the winner, respectively.Define the probability that there is a candidate who won two rounds asp.p·6nis always an integer. Print the value of this integer modulo109+ 7 = 1 000 000 007.InputThe first line contains one integern(1 ≤n≤ 20).The next line contains a string of length2nof zeros and ones, representing functionf. Letbk(x)thek-th bit in binary representation ofx,i-th (0-based) digit of this string shows the return value off(b1(i),b2(i), ...,bn(i)).It is guaranteed thatf(1 -x1, 1 -x2, ..., 1 -xn) = 1 -f(x1,x2, ...,xn)for any values ofx1,x2,ldots,xn.OutputOutput one integer — answer to the problem.ExamplesInput301010101Output216Input301101001Output168NoteIn first sample, result is always fully determined by the first voter. In other words,f(x1,x2,x3) =x1. Thus, any no matter what happens, there will be a candidate who won two rounds (more specifically, the candidate who is at the top of voter 1's preference list), sop= 1, and we print1·63= 216.",
    "source": "CF",
    "vjudge": false
}