{
    "uid": "856-F",
    "url": "https://codeforces.com/contest/856/problem/F",
    "tags": [
        "greedy"
    ],
    "title": "856-F",
    "statement": "F. To Play or not to Playtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya and Petya are playing an online game. As most online games, it has hero progress system that allows players to gain experience that make their heroes stronger. Of course, Vasya would like to get as many experience points as possible. After careful study of experience points allocation, he found out that if he plays the game alone, he gets one experience point each second. However, if two players are playing together, and their current experience values differ by at mostCpoints, they can boost their progress, and each of them gets 2 experience points each second.Since Vasya and Petya are middle school students, their parents don't allow them to play all the day around. Each of the friends has his own schedule: Vasya can only play during intervals[a1;b1], [a2;b2], ..., [an;bn], and Petya can only play during intervals[c1;d1], [c2;d2], ..., [cm;dm]. All time periods are given in seconds from the current moment. Vasya is good in math, so he has noticed that sometimes it can be profitable not to play alone, because experience difference could become too big, and progress would not be boosted even when played together.Now they would like to create such schedule of playing that Vasya's final experience was greatest possible. The current players experience is the same. Petya is not so concerned about his experience, so he is ready to cooperate and play when needed to maximize Vasya's experience.InputThe first line of input data contains integersn,mandC— the number of intervals when Vasya can play, the number of intervals when Petya can play, and the maximal difference in experience level when playing together still gives a progress boost (1 ≤n,m≤ 2·105,0 ≤C≤ 1018).The followingnlines contain two integers each:ai,bi— intervals when Vasya can play (0 ≤ai<bi≤ 1018,bi<ai+ 1).The followingmlines contain two integers each:ci,di— intervals when Petya can play (0 ≤ci<di≤ 1018,di<ci+ 1).OutputOutput one integer — the maximal experience that Vasya can have in the end, if both players try to maximize this value.ExamplesInput2 1 51 710 2010 20Output25Input1 2 50 10020 6085 90Output125",
    "source": "CF",
    "vjudge": false
}