{
    "uid": "856-E",
    "url": "https://codeforces.com/contest/856/problem/E",
    "tags": [],
    "title": "856-E",
    "statement": "E. Satellitestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputReal Cosmic Communications is the largest telecommunication company on a far far away planet, located at the very edge of the universe. RCC launches communication satellites.The planet is at the very edge of the universe, so its form is half of a circle. Its radius isr, the ends of its diameter are pointsAandB. The lineABis the edge of the universe, so one of the half-planes contains nothing, neither the planet, nor RCC satellites, nor anything else. Let us introduce coordinates in the following way: the origin is at the center ofABsegment,OXaxis coincides with lineAB, the planet is completely iny> 0half-plane.The satellite can be in any point of the universe, except the planet points. Satellites are never located beyond the edge of the universe, nor on the edge itself — that is, they have coordinatey> 0. Satellite antennas are directed in such way that they cover the angle with the vertex in the satellite, and edges directed to pointsAandB. Let us call this area the satellitecoverage area.The picture below shows coordinate system and coverage area of a satellite.When RCC was founded there were no satellites around the planet. Since then there have been several events of one of the following types:1 x y— launch the new satellite and put it to the point(x,y). Satellites never move and stay at the point they were launched. Let us assign the numberito thei-th satellite in order of launching, starting from one.2 i— remove satellite numberi.3 i j— make an attempt to create a communication channel between satellitesiandj. To create a communication channel a repeater is required. It must not be located inside the planet, but can be located at its half-circle border, or above it. Repeater must be in coverage area of both satellitesiandj. To avoid signal interference, it must not be located in coverage area of any other satellite. Of course, the repeater must be within the universe, it must have a coordinatey> 0.For each attempt to create a communication channel you must find out whether it is possible.Sample test has the following satellites locations:InputThe first line of input data contains integersrandn— radius of the planet and the number of events (1 ≤r≤ 109,1 ≤n≤ 5·105).Each of the followingnlines describe events in the specified format.Satellite coordinates are integer, the satisfy the following constraints|x| ≤ 109,0 <y≤ 109. No two satellites that simultaneously exist can occupy the same point. Distance from each satellite to the center of the planet is strictly greater thanr.It is guaranteed that events of types2and3only refer to satellites that exist at the moment. For all events of type3the inequalityi≠jis satisfied.OutputFor each event of type3print «YES» on a separate line, if it is possible to create a communication channel, or «NO» if it is impossible.ExampleInput5 81 -5 81 -4 81 -3 81 2 73 1 32 23 1 33 3 4OutputNOYESYES",
    "source": "CF",
    "vjudge": false
}