{
    "uid": "878-D",
    "url": "https://codeforces.com/contest/878/problem/D",
    "tags": [
        "bitmasks"
    ],
    "title": "878-D",
    "statement": "D. Magic Breedingtime limit per test4 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputNikita and Sasha play a computer game where you have to breed some magical creatures. Initially, they havekcreatures numbered from1tok. Creatures havendifferent characteristics.Sasha has a spell that allows to create a new creature from two given creatures. Each of its characteristics will be equal to the maximum of the corresponding characteristics of used creatures. Nikita has a similar spell, but in his spell, each characteristic of the new creature is equal to the minimum of the corresponding characteristics of used creatures. A new creature gets the smallest unused number.They use their spells and are interested in some characteristics of their new creatures. Help them find out these characteristics.InputThe first line contains integersn,kandq(1 ≤n≤ 105,1 ≤k≤ 12,1 ≤q≤ 105) — number of characteristics, creatures and queries.Nextklines describe original creatures. The lineicontainsnnumbersai1,ai2, ...,ain(1 ≤aij≤ 109) — characteristics of thei-th creature.Each of the nextqlines contains a query. Thei-th of these lines contains numbersti,xiandyi(1 ≤ti≤ 3). They denote a query:ti= 1means that Sasha used his spell to the creaturesxiandyi.ti= 2means that Nikita used his spell to the creaturesxiandyi.ti= 3means that they want to know theyi-th characteristic of thexi-th creature. In this case1 ≤yi≤n.It's guaranteed that all creatures' numbers are valid, that means that they are created before any of the queries involving them.OutputFor each query withti= 3output the corresponding characteristic.ExamplesInput2 2 41 22 11 1 22 1 23 3 13 4 2Output21Input5 3 81 2 3 4 55 1 2 3 44 5 1 2 31 1 21 2 32 4 53 6 13 6 23 6 33 6 43 6 5Output52234NoteIn the first sample, Sasha makes a creature with number3and characteristics(2, 2). Nikita makes a creature with number4and characteristics(1, 1). After that they find out the first characteristic for the creature3and the second characteristic for the creature4.",
    "source": "CF",
    "vjudge": false
}