{
    "uid": "887-D",
    "url": "https://codeforces.com/contest/887/problem/D",
    "tags": [
        "data structures",
        " two pointers"
    ],
    "title": "887-D",
    "statement": "D. Ratings and Reality Showstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are two main kinds of events in the life of top-model: fashion shows and photo shoots. Participating in any of these events affects the rating of appropriate top-model. After each photo shoot model's rating increases byaand after each fashion show decreases byb(designers do too many experiments nowadays). Moreover, sometimes top-models participates in talk shows. After participating in talk show model becomes more popular and increasing of her rating after photo shoots becomecand decreasing of her rating after fashion show becomesd.Izabella wants to participate in a talk show, but she wants to do it in such a way that her rating will never become negative. Help her to find a suitable moment for participating in the talk show.Let's assume that model's career begins in moment 0. At that moment Izabella's rating was equal tostart. If talk show happens in momenttif will affect all events in model's life in interval of time[t..t+len)(includingtand not includingt+len), wherelenis duration of influence.Izabella wants to participate in a talk show, but she wants to do it in such a way that her rating will not become become negative before talk show or during period of influence of talk show. Help her to find a suitable moment for participating in the talk show.InputIn first line there are 7 positive integersn,a,b,c,d,start,len(1 ≤n≤ 3·105,0 ≤start≤ 109,1 ≤a,b,c,d,len≤ 109), wherenis a number of fashion shows and photo shoots,a,b,canddare rating changes described above,startis an initial rating of model andlenis a duration of influence of talk show.In nextnlines descriptions of events are given. Each of those lines contains two integerstiandqi(1 ≤ti≤ 109,0 ≤q≤ 1) — moment, in which event happens and type of this event. Type 0 corresponds to the fashion show and type 1 — to photo shoot.Events are given in order of increasingti, alltiare different.OutputPrint one non-negative integert— the moment of time in which talk show should happen to make Izabella's rating non-negative before talk show and during period of influence of talk show. If there are multiple answers print smallest of them. If there are no such moments, print- 1.ExamplesInput5 1 1 1 4 0 51 12 13 14 05 0Output6Input1 1 2 1 2 1 21 0Output-1",
    "source": "CF",
    "vjudge": false
}