{
    "uid": "89-A",
    "url": "https://codeforces.com/contest/89/problem/A",
    "tags": [
        "greedy"
    ],
    "title": "89-A",
    "statement": "A. Robberytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIt is nighttime and Joe the Elusive got into the country's main bank's safe. The safe hasncells positioned in a row, each of them contains some amount of diamonds. Let's make the problem more comfortable to work with and mark the cells with positive numbers from1tonfrom the left to the right.Unfortunately, Joe didn't switch the last security system off. On the plus side, he knows the way it works.Every minute the security system calculates the total amount of diamonds for each two adjacent cells (for the cells between whose numbers difference equals1). As a result of this check we get ann- 1sums. If at least one of the sums differs from the corresponding sum received during the previous check, then the security system is triggered.Joe can move the diamonds from one cell to another between the security system's checks. He manages to move them no more thanmtimes between two checks. One of the three following operations is regarded as moving a diamond: moving a diamond from any cell to any other one, moving a diamond from any cell to Joe's pocket, moving a diamond from Joe's pocket to any cell. Initially Joe's pocket is empty, and it can carry an unlimited amount of diamonds. It is considered that before all Joe's actions the system performs at least one check.In the morning the bank employees will come, which is why Joe has to leave the bank before that moment. Joe has onlykminutes left before morning, and on each of thesekminutes he can perform no more thanmoperations. All that remains in Joe's pocket, is considered his loot.Calculate the largest amount of diamonds Joe can carry with him. Don't forget that the security system shouldn't be triggered (even after Joe leaves the bank) and Joe should leave before morning.InputThe first line contains integersn,mandk(1 ≤n≤ 104,1 ≤m,k≤ 109). The next line containsnnumbers. Thei-th number is equal to the amount of diamonds in thei-th cell — it is an integer from0to105.OutputPrint a single number — the maximum number of diamonds Joe can steal.ExamplesInput2 3 12 3Output0Input3 2 24 1 3Output2NoteIn the second sample Joe can act like this:The diamonds' initial positions are413.During the first period of time Joe moves a diamond from the1-th cell to the2-th one and a diamond from the3-th cell to his pocket.By the end of the first period the diamonds' positions are322. The check finds no difference and the security system doesn't go off.During the second period Joe moves a diamond from the3-rd cell to the2-nd one and puts a diamond from the1-st cell to his pocket.By the end of the second period the diamonds' positions are231. The check finds no difference again and the security system doesn't go off.Now Joe leaves with2diamonds in his pocket.",
    "source": "CF",
    "vjudge": false
}