{
    "uid": "894-E",
    "url": "https://codeforces.com/contest/894/problem/E",
    "tags": [
        "dp",
        " graphs"
    ],
    "title": "894-E",
    "statement": "E. Ralph and Mushroomstime limit per test2.5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputRalph is going to collect mushrooms in the Mushroom Forest.There aremdirected paths connectingntrees in the Mushroom Forest. On each path grow some mushrooms. When Ralph passes a path, he collects all the mushrooms on the path. The Mushroom Forest has a magical fertile ground where mushrooms grow at a fantastic speed. New mushrooms regrow as soon as Ralph finishes mushroom collection on a path. More specifically, after Ralph passes a path thei-th time, there regrowimushrooms less than there was before this pass. That is, if there is initiallyxmushrooms on a path, then Ralph will collectxmushrooms for the first time,x- 1mushrooms the second time,x- 1 - 2mushrooms the third time, and so on. However, the number of mushrooms can never be less than0.For example, let there be9mushrooms on a path initially. The number of mushrooms that can be collected from the path is9,8,6and3when Ralph passes by from first to fourth time. From the fifth time and later Ralph can't collect any mushrooms from the path (but still can pass it).Ralph decided to start from the trees. How many mushrooms can he collect using only described paths?InputThe first line contains two integersnandm(1 ≤n≤ 106,0 ≤m≤ 106), representing the number of trees and the number of directed paths in the Mushroom Forest, respectively.Each of the followingmlines contains three integersx,yandw(1 ≤x,y≤n,0 ≤w≤ 108), denoting a path that leads from treexto treeywithwmushrooms initially. There can be paths that lead from a tree to itself, and multiple paths between the same pair of trees.The last line contains a single integers(1 ≤s≤n) — the starting position of Ralph.OutputPrint an integer denoting the maximum number of the mushrooms Ralph can collect during his route.ExamplesInput2 21 2 42 1 41Output16Input3 31 2 42 3 31 3 81Output8NoteIn the first sample Ralph can pass three times on the circle and collect4 + 4 + 3 + 3 + 1 + 1 = 16mushrooms. After that there will be no mushrooms for Ralph to collect.In the second sample, Ralph can go to tree3and collect8mushrooms on the path from tree1to tree3.",
    "source": "CF",
    "vjudge": false
}