{
    "uid": "894-C",
    "url": "https://codeforces.com/contest/894/problem/C",
    "tags": [
        "constructive algorithms",
        " math"
    ],
    "title": "894-C",
    "statement": "C. Marco and GCD Sequencetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn a dream Marco met an elderly man with a pair of black glasses. The man told him the key to immortality and then disappeared with the wind of time.When he woke up, he only remembered that the key was a sequence of positive integers of some lengthn, but forgot the exact sequence. Let the elements of the sequence bea1,a2, ...,an. He remembered that he calculatedgcd(ai,ai+ 1, ...,aj)for every1 ≤i≤j≤nand put it into a setS.gcdhere means thegreatest common divisor.Note that even if a number is put into the setStwice or more, it only appears once in the set.Now Marco gives you the setSand asks you to help him figure out the initial sequence. If there are many solutions, print any of them. It is also possible that there are no sequences that produce the setS, in this case print-1.InputThe first line contains a single integerm(1 ≤m≤ 1000) — the size of the setS.The second line containsmintegerss1,s2, ...,sm(1 ≤si≤ 106) — the elements of the setS. It's guaranteed that the elements of the set are given in strictly increasing order, that meanss1<s2< ... <sm.OutputIf there is no solution, print a single line containing-1.Otherwise, in the first line print a single integerndenoting the length of the sequence,nshould not exceed4000.In the second line printnintegersa1,a2, ...,an(1 ≤ai≤ 106) — the sequence.We can show that if a solution exists, then there is a solution withnnot exceeding4000andainot exceeding106.If there are multiple solutions, print any of them.ExamplesInput42 4 6 12Output34 6 12Input22 3Output-1NoteIn the first example2 =gcd(4, 6), the other elements from the set appear in the sequence, and we can show that there are no values different from2,4,6and12amonggcd(ai,ai+ 1, ...,aj)for every1 ≤i≤j≤n.",
    "source": "CF",
    "vjudge": false
}