{
    "uid": "896-B",
    "url": "https://codeforces.com/contest/896/problem/B",
    "tags": [
        "binary search",
        " constructive algorithms",
        " games",
        " greedy",
        " interactive"
    ],
    "title": "896-B",
    "statement": "B. Ithea Plays With Chthollytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is an interactive problem. Refer to the Interaction section below for better understanding.Ithea and Chtholly want to play a game in order to determine who can use the kitchen tonight.Initially, Ithea putsnclear sheets of paper in a line. They are numbered from1tonfrom left to right.This game will go on formrounds. In each round, Ithea will give Chtholly an integer between1andc, and Chtholly needs to choose one of the sheets to write down this number (if there is already a number before, she will erase the original one and replace it with the new one).Chtholly wins if, at any time, all the sheets are filled with a number and thennumbers are in non-decreasing order looking from left to right from sheet1to sheetn, and if aftermrounds she still doesn't win, she loses the game.Chtholly really wants to win the game as she wants to cook something for Willem. But she doesn't know how to win the game. So Chtholly finds you, and your task is to write a program to receive numbers that Ithea gives Chtholly and help her make the decision on which sheet of paper write this number.InputThe first line contains 3 integersn,mandc(,meansrounded up) — the number of sheets, the number of rounds and the largest possible number Ithea can give to Chtholly respectively. The remaining parts of input are given throughout the interaction process.InteractionIn each round, your program needs to read one line containing a single integerpi(1 ≤pi≤c), indicating the number given to Chtholly.Your program should then output a line containing an integer between1andn, indicating the number of sheet to write down this number in.After outputting each line, don't forget to flush the output.For example:fflush(stdout)in C/C++;System.out.flush()in Java;sys.stdout.flush()in Python;flush(output)in Pascal;See the documentation for other languages.If Chtholly wins at the end of a round, no more input will become available and your program should terminate normally.It can be shown that under the constraints, it's always possible for Chtholly to win the game.ExampleInput2 4 4213Output122NoteIn the example, Chtholly initially knew there were2sheets,4rounds and each number was between1and4. She then received a2and decided to write it in the1st sheet. Then she received a1and wrote it in the2nd sheet. At last, she received a3and replaced1with3in the2nd sheet. At this time all the sheets were filled with a number and they were non-decreasing, so she won the game.Note that it is required that your program terminate immediately after Chtholly wins and do not read numbers from the input for the remaining rounds. If not, undefined behaviour may arise and it won't be sure whether your program will be accepted or rejected. Also because of this, please be careful when hacking others' codes.In the sample, Chtholly won the game after the3rd round, so it is required that your program doesn't read the number of the remaining4th round.The input format for hacking:The first line contains 3 integersn,mandc;The followingmlines each contains an integer between1andc, indicating the number given to Chtholly in each round.",
    "source": "CF",
    "vjudge": false
}