{
    "uid": "910-C",
    "url": "https://codeforces.com/contest/910/problem/C",
    "tags": [
        "constructive algorithms",
        " greedy",
        " math"
    ],
    "title": "910-C",
    "statement": "C. Minimum Sumtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPetya hasnpositive integersa1,a2, ...,an.His friend Vasya decided to joke and replaced all digits in Petya's numbers with a letters. He used the lowercase letters of the Latin alphabet from 'a' to 'j' and replaced all digits0with one letter, all digits1with another letter and so on. For any two different digits Vasya used distinct letters from 'a' to 'j'.Your task is to restore Petya's numbers. The restored numbers should bepositive integerswithout leading zeros. Since there can be multiple ways to do it, determine theminimumpossible sum of all Petya's numbers after the restoration. It is guaranteed that before Vasya's joke all Petya's numbers did not have leading zeros.InputThe first line contains a single integern(1 ≤n≤ 1 000) — the number of Petya's numbers.Each of the following lines contains non-empty stringsiconsisting of lowercase Latin letters from 'a' to 'j' — the Petya's numbers after Vasya's joke. The length of each string does not exceed six characters.OutputDetermine theminimumsum of all Petya's numbers after the restoration. The restored numbers should bepositive integerswithout leading zeros. It is guaranteed that the correct restore (without leading zeros) exists for all given tests.ExamplesInput3abdeajOutput47Input5abcdefghijbdefaccbdgOutput136542Input3aajjaaOutput44NoteIn the first example, you need to replace the letter 'a' with the digit1, the letter 'b' with the digit0, the letter 'd' with the digit2, the letter 'e' with the digit3, and the letter 'j' with the digit4. So after the restoration numbers will look like[10, 23, 14]. The sum of them is equal to47, which is the minimum possible sum of the numbers after the correct restoration.In the second example the numbers after the restoration can look like:[120468, 3579, 2468, 10024, 3].In the second example the numbers after the restoration can look like:[11, 22, 11].",
    "source": "CF",
    "vjudge": false
}