{
    "uid": "911-C",
    "url": "https://codeforces.com/contest/911/problem/C",
    "tags": [
        "brute force",
        " constructive algorithms"
    ],
    "title": "911-C",
    "statement": "C. Three Garlandstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMishka is decorating the Christmas tree. He has got three garlands, and all of them will be put on the tree. After that Mishka will switch these garlands on.When a garland is switched on, it periodically changes its state — sometimes it is lit, sometimes not. Formally, ifi-th garland is switched on duringx-th second, then it is lit only during secondsx,x+ki,x+ 2ki,x+ 3kiand so on.Mishka wants to switch on the garlands in such a way that during each second after switching the garlands on there would be at least one lit garland. Formally, Mishka wants to choose three integersx1,x2andx3(not necessarily distinct) so that he will switch on the first garland duringx1-th second, the second one — duringx2-th second, and the third one — duringx3-th second, respectively, and during each second starting frommax(x1,x2,x3)at least one garland will be lit.Help Mishka by telling him if it is possible to do this!InputThe first line contains three integersk1,k2andk3(1 ≤ki≤ 1500) — time intervals of the garlands.OutputIf Mishka can choose moments of time to switch on the garlands in such a way that each second after switching the garlands on at least one garland will be lit, printYES.Otherwise, printNO.ExamplesInput2 2 3OutputYESInput4 2 3OutputNONoteIn the first example Mishka can choosex1= 1,x2= 2,x3= 1. The first garland will be lit during seconds1, 3, 5, 7, ..., the second —2, 4, 6, 8, ..., which already cover all the seconds after the2-nd one. It doesn't even matter whatx3is chosen. Our choice will lead third to be lit during seconds1, 4, 7, 10, ..., though.In the second example there is no way to choose such moments of time, there always be some seconds when no garland is lit.",
    "source": "CF",
    "vjudge": false
}