{
    "uid": "929-C",
    "url": "https://codeforces.com/contest/929/problem/C",
    "tags": [
        "*special",
        " combinatorics",
        " math"
    ],
    "title": "929-C",
    "statement": "C. Красивая командаограничение по времени на тест1 секундаограничение по памяти на тест256 мегабайтвводстандартный вводвыводстандартный выводЗавтра у хоккейной команды, которой руководит Евгений, важный матч. Евгению нужно выбрать шесть игроков, которые выйдут на лед в стартовом составе: один вратарь, два защитника и три нападающих.Так как это стартовый состав, Евгения больше волнует, насколько красива будет команда на льду, чем способности игроков. А именно, Евгений хочет выбрать такой стартовый состав, чтобы номера любых двух игроков из стартового состава отличались не более, чем в два раза. Например, игроки с номерами13,14,10,18,15и20устроят Евгения, а если, например, на лед выйдут игроки с номерами8и17, то это не устроит Евгения.Про каждого из игроков вам известно, на какой позиции он играет (вратарь, защитник или нападающий), а также его номер. В хоккее номера игроков не обязательно идут подряд. Посчитайте число различных стартовых составов из одного вратаря, двух защитников и трех нападающих, которые может выбрать Евгений, чтобы выполнялось его условие красоты.Входные данныеПервая строка содержит три целых числаg,dиf(1 ≤g≤ 1 000,1 ≤d≤ 1 000,1 ≤f≤ 1 000) — число вратарей, защитников и нападающих в команде Евгения.Вторая строка содержитgцелых чисел, каждое в пределах от1до100 000— номера вратарей.Третья строка содержитdцелых чисел, каждое в пределах от1до100 000— номера защитников.Четвертая строка содержитfцелых чисел, каждое в пределах от1до100 000— номера нападающих.Гарантируется, что общее количество игроков не превосходит1 000, т. е.g+d+f≤ 1 000. Всеg+d+fномеров игроков различны.Выходные данныеВыведите одно целое число — количество возможных стартовых составов.ПримерыВходные данные1 2 31510 1920 11 13Выходные данные1Входные данные2 3 416 4020 12 1913 21 11 10Выходные данные6ПримечаниеВ первом примере всего один вариант для выбора состава, который удовлетворяет описанным условиям, поэтому ответ1.Во втором примере подходят следующие игровые сочетания (в порядке вратарь-защитник-защитник-нападающий-нападающий-нападающий):16 20 12 13 21 1116 20 12 13 11 1016 20 19 13 21 1116 20 19 13 11 1016 12 19 13 21 1116 12 19 13 11 10Таким образом, ответ на этот пример —6.",
    "source": "CF",
    "vjudge": false
}