{
    "uid": "930-A",
    "url": "https://codeforces.com/contest/930/problem/A",
    "tags": [
        "dfs and similar",
        " graphs",
        " trees"
    ],
    "title": "930-A",
    "statement": "A. Peculiar apple-treetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn Arcady's garden there grows a peculiar apple-tree that fruits one time per year. Its peculiarity can be explained in following way: there areninflorescences, numbered from1ton. Inflorescence number1is situated near base of tree and any other inflorescence with numberi(i> 1) is situated at the top of branch, which bottom ispi-th inflorescence andpi<i.Once tree starts fruiting, there appears exactly one apple in each inflorescence. The same moment as apples appear, they start to roll down along branches to the very base of tree. Each second all apples, except ones in first inflorescence simultaneously roll down one branch closer to tree base, e.g. apple ina-th inflorescence gets topa-th inflorescence. Apples that end up in first inflorescence are gathered by Arcady in exactly the same moment. Second peculiarity of this tree is that once two apples are in same inflorescence theyannihilate. This happens with each pair of apples, e.g. if there are5apples in same inflorescence in same time, only one will not be annihilated and if there are8apples, all apples will be annihilated. Thus, there can be no more than one apple in each inflorescence in each moment of time.Help Arcady with counting number of apples he will be able to collect from first inflorescence during one harvest.InputFirst line of input contains single integer numbern(2 ≤n≤ 100 000)  — number of inflorescences.Second line of input contains sequence ofn- 1integer numbersp2,p3, ...,pn(1 ≤pi<i), wherepiis number of inflorescence into which the apple fromi-th inflorescence rolls down.OutputSingle line of output should contain one integer number: amount of apples that Arcady will be able to collect from first inflorescence during one harvest.ExamplesInput31 1Output1Input51 2 2 2Output3Input181 1 1 4 4 3 2 2 2 10 8 9 9 9 10 10 4Output4NoteIn first example Arcady will be able to collect only one apple, initially situated in1st inflorescence. In next second apples from2nd and3rd inflorescences will roll down and annihilate, and Arcady won't be able to collect them.In the second example Arcady will be able to collect 3 apples. First one is one initially situated in first inflorescence. In a second apple from2nd inflorescence will roll down to1st (Arcady will collect it) and apples from3rd,4th,5th inflorescences will roll down to2nd. Two of them will annihilate and one not annihilated will roll down from2-nd inflorescence to1st one in the next second and Arcady will collect it.",
    "source": "CF",
    "vjudge": false
}