{
    "uid": "939-F",
    "url": "https://codeforces.com/contest/939/problem/F",
    "tags": [
        "data structures",
        " dp"
    ],
    "title": "939-F",
    "statement": "F. Cutlettime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputArkady wants to have a dinner. He has just returned from a shop where he has bought a semifinished cutlet. He only needs to fry it. The cutlet should be fried for2nseconds, in particular, it should be fried fornseconds on one side andnseconds on the other side. Arkady has already got a frying pan and turn on fire, but understood that maybe he won't be able to flip the cutlet exactly afternseconds after the beginning of cooking.Arkady is too busy with sorting sticker packs in his favorite messenger and can flip the cutlet only in some periods of time. Namely, there arekperiods of time in which he can do it, thei-th of them is an interval of time fromliseconds after he starts cooking tillriseconds, inclusive. Arkady decided that it's not required to flip the cutlet exactly in the middle of cooking, instead, he will flip it several times in such a way that the cutlet will be fried exactlynseconds on one side andnseconds on the other side in total.Help Arkady and find out if it's possible for him to cook the cutlet, if he is able to flip the cutlet only in given periods of time; and if yes, find the minimum number of flips he needs to cook the cutlet.InputThe first line contains two integersnandk(1 ≤n≤ 100 000,1 ≤k≤ 100) — the number of seconds the cutlet should be cooked on each side and number of periods of time in which Arkady can flip it.The nextklines contain descriptions of these intervals. Each line contains two integersliandri(0 ≤li≤ri≤ 2·n), meaning that Arkady can flip the cutlet in any moment starting fromliseconds after the beginning of cooking and finishing atriseconds after beginning of cooking. In particular, ifli=rithen Arkady can flip the cutlet only in the momentli=ri. It's guaranteed thatli>ri- 1for all2 ≤i≤k.OutputOutput \"Hungry\" if Arkady won't be able to fry the cutlet for exactlynseconds on one side and exactlynseconds on the other side.Otherwise, output \"Full\" in the first line, and the minimum number of times he should flip the cutlet in the second line.ExamplesInput10 23 511 13OutputFull2Input10 33 59 1011 13OutputFull1Input20 13 19OutputHungryNoteIn the first example Arkady should flip the cutlet in time moment3seconds after he starts cooking and in time moment13seconds after he starts cooking.In the second example, Arkady can flip the cutlet at10seconds after he starts cooking.",
    "source": "CF",
    "vjudge": false
}