{
    "uid": "949-D",
    "url": "https://codeforces.com/contest/949/problem/D",
    "tags": [
        "binary search",
        " brute force",
        " greedy",
        " sortings"
    ],
    "title": "949-D",
    "statement": "D. Curfewtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputInstructors of Some Informatics School make students go to bed.The house containsnrooms, in each room exactlybstudents were supposed to sleep. However, at the time of curfew it happened that many students are not located in their assigned rooms. The rooms are arranged in a row and numbered from1ton. Initially, ini-th room there areaistudents. All students are currently somewhere in the house, thereforea1+a2+ ... +an=nb. Also2instructors live in this house.The process of curfew enforcement is the following. One instructor starts near room1and moves toward roomn, while the second instructor starts near roomnand moves toward room1. After processing current room, each instructor moves on to the next one. Both instructors enter rooms and move simultaneously, ifnis odd, then only the first instructor processes the middle room. When all rooms are processed, the process ends.When an instructor processes a room, she counts the number of students in the room, then turns off the light, and locks the room. Also, if the number of students inside the processed room is not equal tob, the instructor writes down the number of this room into her notebook (and turns off the light, and locks the room). Instructors are in a hurry (to prepare the study plan for the next day), so they don't care about who is in the room, but only about the number of students.While instructors are inside the rooms, students can run between rooms that are not locked and not being processed. A student can run by at mostdrooms, that is she can move to a room with number that differs my at mostd. Also, after (or instead of) running each student can hide under a bed in a room she is in. In this case the instructor will not count her during the processing. In each room any number of students can hide simultaneously.Formally, here is what's happening:A curfew is announced, at this point in roomithere areaistudents.Each student can run to another room but not further thandrooms away from her initial room, or stay in place. After that each student can optionally hide under a bed.Instructors enter room1and roomn, they count students there and lock the room (after it no one can enter or leave this room).Each student from rooms with numbers from2ton- 1can run to another room but not further thandrooms away from hercurrentroom, or stay in place. Each student can optionally hide under a bed.Instructors move from room1to room2and from roomnto roomn- 1.This process continues until all rooms are processed.Letx1denote the number of rooms in which the first instructor counted the number of non-hidden students different fromb, andx2be the same number for the second instructor. Students know that the principal will only listen to one complaint, therefore they want to minimize the maximum of numbersxi. Help them find this value if they use the optimal strategy.InputThe first line contains three integersn,dandb(2 ≤n≤ 100 000,1 ≤d≤n- 1,1 ≤b≤ 10 000), number of rooms in the house, running distance of a student, official number of students in a room.The second line containsnintegersa1,a2, ...,an(0 ≤ai≤ 109),i-th of which stands for the number of students in thei-th room before curfew announcement.It is guaranteed thata1+a2+ ... +an=nb.OutputOutput one integer, the minimal possible value of the maximum ofxi.ExamplesInput5 1 11 0 0 0 4Output1Input6 1 23 8 0 1 0 0Output2NoteIn the first sample the first three rooms are processed by the first instructor, and the last two are processed by the second instructor. One of the optimal strategies is the following: firstly three students run from room5to room4, on the next stage two of them run to room3, and one of those two hides under a bed. This way, the first instructor writes down room2, and the second writes down nothing.In the second sample one of the optimal strategies is the following: firstly all students in room1hide, all students from room2run to room3. On the next stage one student runs from room3to room4, and5students hide. This way, the first instructor writes down rooms1and2, the second instructor writes down rooms5and6.",
    "source": "CF",
    "vjudge": false
}