{
    "uid": "950-B",
    "url": "https://codeforces.com/contest/950/problem/B",
    "tags": [
        "greedy",
        " implementation"
    ],
    "title": "950-B",
    "statement": "B. Intercepted Messagetime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputHacker Zhorik wants to decipher two secret messages he intercepted yesterday. Yeah message is a sequence of encrypted blocks, each of them consists of several bytes of information.Zhorik knows that each of the messages is an archive containing one or more files. Zhorik knows how each of these archives was transferred through the network: if an archive consists ofkfiles of sizesl1,l2, ...,lkbytes, then thei-th file is split to one or more blocksbi, 1,bi, 2, ...,bi,mi(here the total length of the blocksbi, 1+bi, 2+ ... +bi,miis equal to the length of the fileli), and after that all blocks are transferred through the network, maintaining the order of files in the archive.Zhorik thinks that the two messages contain the same archive, because their total lengths are equal. However, each file can be split in blocks in different ways in the two messages.You are given the lengths of blocks in each of the two messages. Help Zhorik to determine what is the maximum number of files could be in the archive, if the Zhorik's assumption is correct.InputThe first line contains two integersn,m(1 ≤n,m≤ 105) — the number of blocks in the first and in the second messages.The second line containsnintegersx1,x2, ...,xn(1 ≤xi≤ 106) — the length of the blocks that form the first message.The third line containsmintegersy1,y2, ...,ym(1 ≤yi≤ 106) — the length of the blocks that form the second message.It is guaranteed thatx1+ ... +xn=y1+ ... +ym.Also, it is guaranteed thatx1+ ... +xn≤ 106.OutputPrint the maximum number of files the intercepted array could consist of.ExamplesInput7 62 5 3 1 11 4 47 8 2 4 1 8Output3Input3 31 10 1001 100 10Output2Input1 441 1 1 1Output1NoteIn the first example the maximum number of files in the archive is 3. For example, it is possible that in the archive are three files of sizes2 + 5 = 7,15 = 3 + 1 + 11 = 8 + 2 + 4 + 1and4 + 4 = 8.In the second example it is possible that the archive contains two files of sizes1and110 = 10 + 100 = 100 + 10. Note that the order of files is kept while transferring archives through the network, so we can't say that there are three files of sizes1,10and100.In the third example the only possibility is that the archive contains a single file of size4.",
    "source": "CF",
    "vjudge": false
}