{
    "uid": "97-A",
    "url": "https://codeforces.com/contest/97/problem/A",
    "tags": [
        "brute force",
        " implementation"
    ],
    "title": "97-A",
    "statement": "A. Dominotime limit per test0.5 secondmemory limit per test256 megabytesinputstdinoutputstdoutLittle Gennady was presented with a set of domino for his birthday. The set consists of28different dominoes of size2 × 1. Both halves of each domino contain one digit from0to6.0-0 0-1 0-2 0-3 0-4 0-5 0-61-1 1-2 1-3 1-4 1-5 1-62-2 2-3 2-4 2-5 2-63-3 3-4 3-5 3-64-4 4-5 4-65-5 5-66-6The figure that consists of28dominoes is calledmagic, if it can be fully covered with14non-intersecting squares of size2 × 2so that each square contained four equal numbers. Every time Gennady assembles a magic figure, some magic properties of the set appear — he wins the next contest. Gennady noticed that he can't assemble a figure that has already been assembled, otherwise someone else wins the contest.Gennady chose a checked field of sizen×mand put there rectangular chips of sizes1 × 2and2 × 1. Each chip fully occupies exactly two neighboring squares of the field. Those chips do not overlap but they can touch each other. Overall the field has exactly28chips, equal to the number of dominoes in the set. Now Gennady wants to replace each chip with a domino so that a magic figure appeared as a result. Different chips should be replaced by different dominoes. Determine in what number of contests Gennady can win over at the given position of the chips. You are also required to find one of the possible ways of replacing chips with dominoes to win the next Codeforces round.InputThe first line contains two positive integersnandm(1 ≤n,m≤ 30). Each of the followingnlines containsmcharacters, which is the position of chips on the field. The dots stand for empty spaces, Latin letters from \"a\" to \"z\" and \"A\", \"B\" stand for the positions of the chips. There are exactly 28 chips on the field. The squares covered by the same chip are marked by the same letter, different chips are marked by different letters. It is guaranteed that the field's description is correct.It is also guaranteed that at least one solution exists.OutputPrint on the first line the number of ways to replace chips with dominoes to get a magic figure. That is the total number of contests that can be won using this arrangement of the chips. Nextnlines containingmcharacters each, should contain a field from dots and numbers from0to6— any of the possible solutions. All dominoes should be different.ExamplesInput8 8.aabbcc..defghi.kdefghijklmnopqj.lmnopq..rstuvw.xrstuvwyxzzAABByOutput10080.001122..001122.3344005533440055.225566..225566.6611334466113344",
    "source": "CF",
    "vjudge": false
}