{"uid": "1-B", "url": "https://codeforces.com/contest/1/problem/B", "tags": ["implementation", " math"], "title": "1-B", "statement": "B. Spreadsheetstime limit per test10 secondsmemory limit per test64 megabytesinputstdinoutputstdoutIn the popular spreadsheets systems (for example, in Excel) the following numeration of columns is used. The first column has number A, the second — number B, etc. till column 26 that is marked by Z. Then there are two-letter numbers: column 27 has number AA, 28 — AB, column 52 is marked by AZ. After ZZ there follow three-letter numbers, etc.The rows are marked by integer numbers starting with 1. The cell name is the concatenation of the column and the row numbers. For example, BC23 is the name for the cell that is in column 55, row 23.Sometimes another numeration system is used: RXCY, where X and Y are integer numbers, showing the column and the row numbers respectfully. For instance, R23C55 is the cell from the previous example.Your task is to write a program that reads the given sequence of cell coordinates and produce each item written according to the rules of another numeration system.InputThe first line of the input contains integer numbern(1 ≤n≤ 105), the number of coordinates in the test. Then there follownlines, each of them contains coordinates. All the coordinates are correct, there are no cells with the column and/or the row numbers larger than106.OutputWritenlines, each line should contain a cell coordinates in the other numeration system.ExamplesInput2R23C55BC23OutputBC23R23C55", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cef59b2c", "template_md5": "35d339e4", "result": "You are given a list of cell coordinates in the format \"BC23\" (column letter, row number).  Convert each coordinate to the format \"R<row>C<column>\" where the column is represented by a letter (A=1, B=2, ..., Z=26, AA=27, AB=28, etc.) and the row is represented by a number. \n\nFor example:\n\n* BC23 should be converted to R23C55 \n\n\n\nYou will be given a number of coordinates as input and should output the converted coordinates."}, {"prompt_md5": "ef6fc1b8", "template_md5": "465699a0", "result": "You are given a list of cell coordinates in one format (e.g., BC23). Convert each coordinate to a different format (e.g., R23C55)."}]}