{"uid": "1-C", "url": "https://codeforces.com/contest/1/problem/C", "tags": ["geometry", " math"], "title": "1-C", "statement": "C. Ancient Berland Circustime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutNowadays all circuses in Berland have a round arena with diameter 13 meters, but in the past things were different.In Ancient Berland arenas in circuses were shaped as a regular (equiangular) polygon, the size and the number of angles could vary from one circus to another. In each corner of the arena there was a special pillar, and the rope strung between the pillars marked the arena edges.Recently the scientists from Berland have discovered the remains of the ancient circus arena. They found only three pillars, the others were destroyed by the time.You are given the coordinates of these three pillars. Find out what is the smallest area that the arena could have.InputThe input file consists of three lines, each of them contains a pair of numbers –– coordinates of the pillar. Any coordinate doesn't exceed 1000 by absolute value, and is given with at most six digits after decimal point.OutputOutput the smallest possible area of the ancient arena. This number should be accurate to at least 6 digits after the decimal point. It's guaranteed that the number of angles in the optimal polygon is not larger than 100.ExamplesInput0.000000 0.0000001.000000 1.0000000.000000 1.000000Output1.00000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "13ac926b", "template_md5": "35d339e4", "result": "You are given the coordinates of three pillars. These pillars are the only remaining pillars from a circular arena.  Find the smallest possible area the arena could have had. \n\nAssume the arena was a regular polygon (all sides and angles equal). \n\n\nLet the coordinates of the pillars be $(x_1, y_1)$, $(x_2, y_2)$, and $(x_3, y_3)$."}, {"prompt_md5": "8354e8f4", "template_md5": "465699a0", "result": "You are given the locations of three points. Find the smallest possible area that a polygon could have with those three points as its corners."}]}