{"uid": "10-A", "url": "https://codeforces.com/contest/10/problem/A", "tags": ["implementation"], "title": "10-A", "statement": "A. Power Consumption Calculationtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutTom is interested in power consumption of his favourite laptop. His laptop has three modes. In normal mode laptop consumesP1watt per minute.T1minutes after Tom moved the mouse or touched the keyboard for the last time, a screensaver starts and power consumption changes toP2watt per minute. Finally, afterT2minutes from the start of the screensaver, laptop switches to the \"sleep\" mode and consumesP3watt per minute. If Tom moves the mouse or touches the keyboard when the laptop is in the second or in the third mode, it switches to the first (normal) mode. Tom's work with the laptop can be divided intontime periods[l1,r1], [l2,r2], ..., [ln,rn]. During each interval Tom continuously moves the mouse and presses buttons on the keyboard. Between the periods Tom stays away from the laptop. Find out the total amount of power consumed by the laptop during the period[l1,rn].InputThe first line contains 6 integer numbersn,P1,P2,P3,T1,T2(1 ≤n≤ 100, 0 ≤P1,P2,P3≤ 100, 1 ≤T1,T2≤ 60). The followingnlines contain description of Tom's work. Eachi-th of these lines contains two space-separated integersliandri(0 ≤li<ri≤ 1440,ri<li+ 1fori<n), which stand for the start and the end of thei-th period of work.OutputOutput the answer to the problem.ExamplesInput1 3 2 1 5 100 10Output30Input2 8 4 2 5 1020 3050 100Output570", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ba385ffb", "template_md5": "35d339e4", "result": "A laptop has three power modes:\n\n* **Normal mode:** Consumes $P_1$ watts per minute.\n* **Screensaver mode:** Consumes $P_2$ watts per minute, activated after $T_1$ minutes of inactivity.\n* **Sleep mode:** Consumes $P_3$ watts per minute, activated after $T_2$ minutes in screensaver mode.\n\nThe laptop switches back to normal mode when the user interacts with it (moves the mouse or presses a key).\n\nGiven:\n\n* $n$: the number of work periods.\n* $P_1$, $P_2$, $P_3$: power consumption in each mode.\n* $T_1$, $T_2$: time until screensaver and sleep modes activate.\n* $l_i$, $r_i$: start and end times (in minutes) of each work period.\n\nCalculate the total power consumption of the laptop during the entire time period from $l_1$ to $r_n$."}, {"prompt_md5": "b2d37bfa", "template_md5": "465699a0", "result": "A device has three power consumption modes: normal, screensaver, and sleep.  The device switches between these modes based on inactivity time.  Given a list of work periods, calculate the total power consumption over a specific time range."}]}