{"uid": "10-E", "url": "https://codeforces.com/contest/10/problem/E", "tags": ["constructive algorithms"], "title": "10-E", "statement": "E. Greedy Changetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBilly investigates the question of applying greedy algorithm to different spheres of life. At the moment he is studying the application of greedy algorithm to the problem about change. There is an amount ofncoins of different face values, and the coins of each value are not limited in number. The task is to collect the sumxwith the minimum amount of coins. Greedy algorithm with each its step takes the coin of the highest face value, not exceedingx. Obviously, if among the coins' face values exists the face value 1, any sumxcan be collected with the help of greedy algorithm. However, greedy algorithm does not always give the optimal representation of the sum, i.e. the representation with the minimum amount of coins. For example, if there are face values{1, 3, 4}and it is asked to collect the sum6, greedy algorithm will represent the sum as4 + 1 + 1, while the optimal representation is3 + 3, containing one coin less. By the given set of face values find out if there exist such a sumxthat greedy algorithm will collect in a non-optimal way. If such a sum exists, find out the smallest of these sums.InputThe first line contains an integern(1 ≤n≤ 400) — the amount of the coins' face values. The second line containsnintegersai(1 ≤ai≤ 109), describing the face values. It is guaranteed thata1>a2> ... >anandan= 1.OutputIf greedy algorithm collects any sum in an optimal way, output -1. Otherwise output the smallest sum that greedy algorithm collects in a non-optimal way.ExamplesInput525 10 5 2 1Output-1Input34 3 1Output6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b36b195c", "template_md5": "35d339e4", "result": "You are given a set of $n$ coin denominations ($a_1$, $a_2$, ..., $a_n$) where $a_1 > a_2 > ... > a_n$ and $a_n = 1$.  \n\nDetermine if there exists a sum $x$ that can be made using the greedy algorithm (always choosing the largest denomination less than or equal to the remaining sum) that requires more coins than the optimal solution. If such a sum exists, find the smallest one.\n\nIf the greedy algorithm always produces the optimal solution for all sums, output -1."}, {"prompt_md5": "9af05682", "template_md5": "465699a0", "result": "You are given a set of coin denominations.  Determine the smallest amount of money that can be made using these coins where the greedy algorithm (always taking the largest available coin) does not produce the fewest coins possible. If no such amount exists, output -1."}]}