{"uid": "100-H", "url": "https://codeforces.com/contest/100/problem/H", "tags": ["*special", " dfs and similar", " implementation"], "title": "100-H", "statement": "H. Battleshiptime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutDo you know the game Battleship? If no, look into Wikipedia article http://en.wikipedia.org/wiki/Battleship_(game). You are given the positions of ships on a10 × 10board for playing Battleship. According to the rules, the board should contain the following ships:one of size 4 (4 × 1or1 × 4rectangle),two of size 3 (3 × 1or1 × 3rectangles),three of size 2 (2 × 1or1 × 2rectangles),four of size 1 (1 × 1rectangles).The ships should not 'bend', touch each other or overlap in any way. Each ship can be oriented horizontaly or verticaly. Your task is to check whether the given set of boards meets the given conditions.InputThe first line contains numbern(1 ≤n≤ 10) — the number of boards. Each board is described by 10 lines containing 10 characters each. The symbol \"0\" stands for an empty square and the symbol \"*\" stands for a square occupied by a ship. The descriptions of boards are separated with empty lines.OutputPrintnlines YES or NO. Print the first word if the board meets the given conditions; otherwise print the second word.ExamplesInput2****0000000000000000***00***00000000000000000000**000**0000000000000**000*00000000000*00*00*00000000****0000000000000000***00***00000000000000000000**000**0000000000000**0000*0000000000*00*00*00000000OutputYESNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7a63cb0e", "template_md5": "35d339e4", "result": "You are given a set of $10 \\times 10$ grids. Each grid represents a game board for Battleship.  \n\nOn each board, you need to determine if the following ships are placed correctly:\n\n* One ship of size 4 ($4 \\times 1$ or $1 \\times 4$)\n* Two ships of size 3 ($3 \\times 1$ or $1 \\times 3$)\n* Three ships of size 2 ($2 \\times 1$ or $1 \\times 2$)\n* Four ships of size 1 ($1 \\times 1$)\n\nThe ships cannot overlap or touch each other. They can be placed horizontally or vertically.\n\nFor each grid, determine if the ships are placed correctly according to the rules. \n\n**Input:**\n\n* The first line contains the number of grids ($n$).\n* Each grid is represented by 10 lines, each containing 10 characters.\n* '0' represents an empty square.\n* '*' represents a square occupied by a ship.\n\n**Output:**\n\n* For each grid, print \"YES\" if the ships are placed correctly, and \"NO\" otherwise."}, {"prompt_md5": "ec3a8f16", "template_md5": "465699a0", "result": "You are given a set of grids. Each grid represents a game board with ships.  Determine if each grid follows the rules of Battleship:\n\n* There must be one ship of size 4, two ships of size 3, three ships of size 2, and four ships of size 1.\n* Ships cannot overlap or touch each other.\n* Ships can be placed horizontally or vertically. \n\n\nLet me know if you'd like help with the code!"}]}