{"uid": "100-D", "url": "https://codeforces.com/contest/100/problem/D", "tags": ["*special", " strings"], "title": "100-D", "statement": "D. World of Mouthtime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere are a lot of rumors in the media these days. One day Aida decided to find out how rumors are made.She askednof her friends to help her. They all formed a circle and Aida told the person to her right a piece of news which was just a simple string. Then each person told the string to the person on his/her right. But they didn't tell the string exactly as they'd heard it. Each person madeat mostone of these two types of changes:Removing one character from the end of the heard string.Adding a character to the end of the heard string.Finally when the rumor passed exactlynmoves (a complete cycle), Aida heard something quite different from what she expected from the person on her left. She thinks someone has cheated and made some changes other than those explained above. Now she wants you to write aPikepiece of code which gets the initial and final strings and tells Aida whether it's possible to get to the final string from the initial one, by the rules described above.InputThe first line contains a single integern(2 ≤n≤ 8 × 106), the number of Aida's friends. The following two lines contain anon-emptystring each — initial and final strings. The lengths of strings are at most107and they only contain English alphabet letters.OutputWrite a singleYESorNO. WriteYESonly if it's possible to get to the final string from the initial string.ExamplesInput100CodeforcesMMIODPCOutputYesInput5MMIODCFOutputNoNoteThe input is case-sensitive, while the output is not.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7b3b0bf1", "template_md5": "35d339e4", "result": "You are given two strings, the initial string and the final string.  \n\nThere are $n$ people in a circle. The initial string is passed around the circle, with each person making at most one of the following changes to the string before passing it on:\n\n* Remove one character from the end of the string.\n* Add one character to the end of the string.\n\nAfter $n$ passes (a complete circle), the final string is obtained.\n\nDetermine if it is possible to obtain the final string from the initial string using only these allowed changes."}, {"prompt_md5": "25b0edf2", "template_md5": "465699a0", "result": "Given a starting word and an ending word, determine if it's possible to transform the starting word into the ending word by repeatedly removing or adding a single letter at the end of the word."}]}