{"uid": "100-G", "url": "https://codeforces.com/contest/100/problem/G", "tags": ["*special", " data structures", " implementation"], "title": "100-G", "statement": "G. Name the albumtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutThe famous singer, Aryo, is going to publish a new album of his great work!Unfortunately these days, there are many albums, Aryo wants to choose a new name for his album, a name that has not been used or at least has not been used recently.He has a list of all used album names together with the year the albums were published. He also has a list of suitable names for his album.If he finds a suitable name which has not been used before, he'll use it. Otherwise he will use the name which was used as long ago as possible. If two such names are found (that haven't been used or were used at the same year), he uses the name that is alphabetically latest.Help him name his album.InputThe first line contains a single integern(0 ≤n≤ 105), the number of used names.The followingnlines each contain a string (the album name) and an integer (the year album was published). Album names are made of lowercase Latin letters and contain at most14letters. The year is in range[1900, 2011].The following line contains a single integerm(1 ≤m≤ 104), the number of suitable album names.The followingmlines each contain a string — a suitable name. It contains at most14lowercase Latin letters.All album names and suitable names arenon-empty.OutputWrite a single string. The name of the new album.ExamplesInput3eyesonme 2008anewdayhascome 2002oneheart 20032oneheartbienbienOutputbienbienInput2nasimevasl 2003basetareha 20062nasimevaslbasetarehaOutputnasimevasl", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5b658e0e", "template_md5": "35d339e4", "result": "You are given a list of $n$ previously used album names and their publication years. You are also given a list of $m$ potential new album names. \n\nFind the best name from the potential list to use for a new album. The best name is:\n\n1. A name that has never been used before.\n2. If no unused names exist, use the name that was last used the furthest in the past.\n3. If multiple names meet the above criteria, use the name that comes later alphabetically. \n\nOutput the chosen album name."}, {"prompt_md5": "ceefba05", "template_md5": "465699a0", "result": "Given a list of used names and their publication years, and a list of potential new names, find the best new name to use.  The best name is one that:\n\n1. Has not been used before.\n2. If multiple names haven't been used, choose the one published furthest in the past.\n3. If multiple names have the same publication year, choose the one that comes later alphabetically."}]}