{"uid": "100-E", "url": "https://codeforces.com/contest/100/problem/E", "tags": ["*special", " math"], "title": "100-E", "statement": "E. Lamps in a Linetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThere arenlamps in a line. The lamps are numbered1tonfrom left to right. There are alsonkeys. When key numberiis pressed, all lamps numberxsuch thati|xchange their state.For two integer numbersaandb, we saya|bif and only if there exists an integercsuch thata×c=b.Amirali likes to play with the keys. He randomly pressedkkeys and wants to know the final state of the lamps. Help him by writing aPikepiece of code to solve this task.InputThe first line of input contains a single integern, the number of lamps (1 ≤n≤ 105).The following line containsnwords. Thei-th word describes the initial state of lamp numberi(see samples for details).The following line contains a single integerk(1 ≤k≤ 104), the number of times a key is pressed. Then in the next line comekintegers in range[1,n]which are the numbers of the pressed keys.OutputWritenwords to output. Describe the final state of the lamps. See samples for more details.ExamplesInput2off off21 2Outputon offInput3off off on61 1 1 1 2 2Outputoff off on", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "eeb66fb3", "template_md5": "35d339e4", "result": "There are $n$ lamps in a line numbered 1 to $n$. Each lamp can be either \"on\" or \"off\".  You are given the initial state of each lamp.\n\nYou are also given $k$ numbers, each representing a key. Pressing key $i$ flips the state of all lamps whose number is a multiple of $i$.\n\nYour task is to determine the final state of each lamp after pressing the given keys. \n\n\n\n**Input:**\n\n* The first line contains an integer $n$ (the number of lamps).\n* The second line contains $n$ words, each representing the initial state of a lamp (\"on\" or \"off\").\n* The third line contains an integer $k$ (the number of keys pressed).\n* The fourth line contains $k$ integers, each representing the number of a key pressed.\n\n**Output:**\n\n* Output $n$ words, each representing the final state of a lamp (\"on\" or \"off\")."}, {"prompt_md5": "ee3a79af", "template_md5": "465699a0", "result": "You are given a line of lights, some on and some off. You are also given a list of numbers. Each number represents a switch. Pressing a switch flips the state of all lights a certain distance away from it.  You need to determine the final state of the lights after a given number of switches are pressed."}]}