{"uid": "1002-B4", "url": "https://codeforces.com/contest/1002/problem/B4", "tags": [], "title": "1002-B4", "statement": "B4. Distinguish four 2-qubit states - 2time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given 2 qubits which are guaranteed to be in one of the four orthogonal states:Your task is to perform necessary operations and measurements to figure out which state it was and to return the index of that state (0 for, 1 foretc.). The state of the qubits after the operations does not matter.You have to implement an operation which takes an array of 2 qubits as an input and returns an integer.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Primitive;open Microsoft.Quantum.Canon;operation Solve (qs : Qubit[]) : Int{body{// your code here}}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7bbba2bf", "template_md5": "35d339e4", "result": "You are given two qubits that are in one of the following four states:\n\n* $|00\\rangle$\n* $|01\\rangle$\n* $|10\\rangle$\n* $|11\\rangle$\n\nYour task is to write a program that takes these two qubits as input and outputs the index of the state the qubits are in (0 for $|00\\rangle$, 1 for $|01\\rangle$, 2 for $|10\\rangle$, and 3 for $|11\\rangle$).  The final state of the qubits after your program runs does not matter. \n\nYour program should have the following structure:\n\n```\noperation Solve (qs : Qubit[]) : Int {\n  // your code here\n}\n``` \n\n\n\nwhere `qs` is an array containing the two qubits."}, {"prompt_md5": "c853dd64", "template_md5": "465699a0", "result": "You are given a system with two parts. The system can be in one of four known states.  You need to figure out which state the system is in by performing operations on it.  You can then measure the system, but the final state doesn't matter. Your task is to write a program that takes the state of the two parts as input and outputs the index of the correct state."}]}