{"uid": "1002-A2", "url": "https://codeforces.com/contest/1002/problem/A2", "tags": [], "title": "1002-A2", "statement": "A2. Generate superposition of zero state and a basis statetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are givenNqubits (1 ≤N≤ 8) in zero state. You are also given a bitstringbitswhich describes a non-zero basis state onNqubits.Your task is to generate a state which is an equal superposition ofand the given basis state:You have to implement an operation which takes the following inputs:an array of qubitsqs,an arrays of boolean valuesbitsrepresenting the basis state. This array will have the same length as the array of qubits. The first element of this arraybits[0]will betrue.The operation doesn't have an output; its \"output\" is the state in which it leaves the qubits.An array of boolean values represents a basis state as follows: thei-th element of the array is true if thei-th qubit is in state, and false if it is in state. For example, array[true; false]describes 2-qubit state, and in this case the resulting state should be.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Primitive;open Microsoft.Quantum.Canon;operation Solve (qs : Qubit[], bits : Bool[]) : (){body{// your code here}}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "08ab5a29", "template_md5": "35d339e4", "result": "You are given $N$ qubits, all initially in the state $|0\\rangle$. You are also given a bitstring $bits$ that represents a non-zero basis state on $N$ qubits.  \n\nYour task is to create a quantum operation that takes the following inputs:\n\n* An array of qubits $qs$\n* An array of boolean values $bits$ representing the basis state. The first element of $bits$ will be `true`.\n\nThis operation should leave the qubits in a state that is an equal superposition of the initial zero state and the given basis state. \n\nThe operation does not have an explicit output; its output is the state of the qubits after the operation is performed. \n\nFor example, if $bits = [true, false]$ represents a 2-qubit basis state, the operation should leave the qubits in the state:\n\n$\\frac{1}{\\sqrt{2}} (|00\\rangle + |11\\rangle)$ \n\n\n\nYou need to implement this operation in a way that can be executed on a quantum computer."}, {"prompt_md5": "cb3e97a7", "template_md5": "465699a0", "result": "You are given a set of quantum bits (qubits) in a starting state. You are also given a specific target state. Your task is to write a program that transforms the qubits into a state that is a mix of the starting state and the target state."}]}