{"uid": "1002-C2", "url": "https://codeforces.com/contest/1002/problem/C2", "tags": [], "title": "1002-C2", "statement": "C2. Distinguish zero state and plus state without errorstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a qubit which is guaranteed to be either instate or instate.Your task is to perform necessary operations and measurements to figure out which state it was and to return 0 if it was astate, 1 if it wasstate or -1 if you can not decide, i.e., an \"inconclusive\" result. The state of the qubit after the operations does not matter.Note that these states are not orthogonal, and thus can not be distinguished perfectly. In each test your solution will be called 10000 times, and your goals are:never give 0 or 1 answer incorrectly (i.e., never return 0 if input state wasand never return 1 if input state was),give -1 answer at most 80% of the times,correctly identifystate at least 10% of the times,correctly identifystate at least 10% of the times.In each testandstates will be provided with 50% probability.You have to implement an operation which takes a qubit as an input and returns an integer.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Primitive;open Microsoft.Quantum.Canon;operation Solve (q : Qubit) : Int{body{// your code here}}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a1f31990", "template_md5": "35d339e4", "result": "You are given a qubit that is either in state $|0\\rangle$ or state $|+\\rangle$. Your task is to determine which state the qubit was in. You can perform operations on the qubit and make measurements, but you cannot perfectly distinguish between the two states.\n\nHere are the rules:\n\n* You must never incorrectly identify the state. This means:\n    * Never return 0 if the input state was $|+\\rangle$.\n    * Never return 1 if the input state was $|0\\rangle$.\n* You can return -1 (inconclusive) at most 80% of the time.\n* You must correctly identify $|0\\rangle$ at least 10% of the time.\n* You must correctly identify $|+\\rangle$ at least 10% of the time.\n\nThe input will consist of 50% $|0\\rangle$ states and 50% $|+\\rangle$ states.\n\nYou need to write a function that takes a qubit as input and returns an integer (0, 1, or -1)."}, {"prompt_md5": "e263f5f5", "template_md5": "465699a0", "result": "You are given a system that can be in one of two states. You need to figure out which state it is in by performing operations on it. You can't be 100% sure which state it is, but you need to be very accurate and make sure you don't get the states mixed up.  You also need to be able to say when you can't be sure."}]}