{"uid": "1002-C1", "url": "https://codeforces.com/contest/1002/problem/C1", "tags": [], "title": "1002-C1", "statement": "C1. Distinguish zero state and plus state with minimum errortime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a qubit which is guaranteed to be either instate or instate.Your task is to perform necessary operations and measurements to figure out which state it was and to return 0 if it was astate or 1 if it wasstate. The state of the qubit after the operations does not matter.Note that these states are not orthogonal, and thus can not be distinguished perfectly. In each test your solution will be called 1000 times, and your goal is to get a correct answer at least 80% of the times. In each testandstates will be provided with 50% probability.You have to implement an operation which takes a qubit as an input and returns an integer.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Primitive;open Microsoft.Quantum.Canon;operation Solve (q : Qubit) : Int{body{// your code here}}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3004dfab", "template_md5": "35d339e4", "result": "You are given a qubit that is either in state  $|0\\rangle$ or state $|+\\rangle$. Your task is to determine which state the qubit was in. You can perform operations on the qubit, but you cannot perfectly distinguish between the states.\n\nHere's what you need to know:\n\n* You will be given 1000 chances to guess the state of the qubit in each test.\n* The qubit will be in state $|0\\rangle$ or state $|+\\rangle$ with equal probability in each test.\n* Your goal is to be correct at least 80% of the time.\n* You need to write a function that takes a qubit as input and returns an integer (0 for $|0\\rangle$, 1 for $|+\\rangle$). \n\n\nLet me know if you'd like help understanding any of the quantum concepts involved!"}, {"prompt_md5": "e5c7f41f", "template_md5": "465699a0", "result": "You are given a system that can be in one of two states. You need to figure out which state it is in with at least 80% accuracy. You can perform operations on the system, but the results are not perfect.  Your goal is to write a program that takes the system as input and outputs a number (0 or 1) indicating the state."}]}