{"uid": "1002-E2", "url": "https://codeforces.com/contest/1002/problem/E2", "tags": [], "title": "1002-E2", "statement": "E2. Another array reconstruction algorithmtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a quantum oracle - an operation onN+ 1qubits which implements a function. You are guaranteed that the functionfimplemented by the oracle can be represented in the following form (oracle from problem D2):Here(a vector ofNintegers, each of which can be 0 or 1), andis a vector ofN1s.Your task is to reconstruct the arraywhich could produce the given oracle. Your code is allowed to call the given oracle only once.You have to implement an operation which takes the following inputs:an integerN- the number of qubits in the oracle input (1 ≤N≤ 8),an oracleUf, implemented as an operation with signature((Qubit[], Qubit) => ()), i.e., an operation which takes as input an array of qubits and an output qubit and has no output.The return of your operation is an array of integers of lengthN, each of them 0 or 1.Note that in this problem we're comparing the oracle generated by your return to the oracleUf, instead of comparing your return to the (hidden) value ofused to generateUf. This means that any kind of incorrect return results in \"Runtime Error\" verdict, as well as actual runtime errors like releasing qubits in non-zero state.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Primitive;open Microsoft.Quantum.Canon;operation Solve (N : Int, Uf : ((Qubit[], Qubit) => ())) : Int[]{body{// your code here}}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f7a4471f", "template_md5": "35d339e4", "result": "You are given a function $f$ that takes an array of $N$ integers, each of which can be 0 or 1, and produces a single output. You are also given a \"quantum oracle\" that implements this function.  \n\nThe oracle takes an array of $N$ qubits and a single output qubit as input. It performs some operations on these qubits and then outputs the result on the single output qubit.\n\nYour task is to figure out the function $f$ by only calling the oracle once. \n\nYou can assume that the function $f$ can be represented in the following form:\n\n$f(x_1, x_2, ..., x_N) =  \\text{some operation on } (x_1, x_2, ..., x_N)$\n\nwhere $x_1, x_2, ..., x_N$ are the integers in the input array.\n\nYou need to write a program that takes the following inputs:\n\n* $N$: the number of integers in the input array.\n* $Uf$: the quantum oracle that implements the function $f$.\n\nYour program should output an array of $N$ integers, each of which is either 0 or 1. This array should represent the function $f$."}, {"prompt_md5": "8df8706c", "template_md5": "465699a0", "result": "You are given a function that operates on a set of bits. You can only call this function once. Your task is to figure out the specific set of bits that the function was built from."}]}