{"uid": "1002-D3", "url": "https://codeforces.com/contest/1002/problem/D3", "tags": [], "title": "1002-D3", "statement": "D3. Oracle for majority functiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputImplement a quantum oracle on 3 qubits which implements a majority function. Majority function on 3-bit vectors is defined as follows:if vectorhas two or three 1s, and 0 if it has zero or one 1s.For an explanation on how this type of quantum oracles works, seeIntroduction to quantum oracles.You have to implement an operation which takes the following inputs:an array of 3 qubitsxin arbitrary state (input register),a qubityin arbitrary state (output qubit).The operation doesn't have an output; its \"output\" is the state in which it leaves the qubits.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Primitive;open Microsoft.Quantum.Canon;operation Solve (x : Qubit[], y : Qubit) : (){body{// your code here}}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f9f9c201", "template_md5": "35d339e4", "result": "You are given 3 qubits in an arbitrary state ($x_1$, $x_2$, $x_3$) and one qubit in an arbitrary state ($y$).  You need to write a quantum operation that takes these qubits as input and modifies their states. \n\nThe operation should implement the \"majority function\" on the 3 input qubits. The majority function works like this:\n\n* If two or three of the qubits ($x_1$, $x_2$, $x_3$) are in the state $|1\\rangle$, the output qubit ($y$) should be set to $|1\\rangle$.\n* If zero or one of the qubits ($x_1$, $x_2$, $x_3$) are in the state $|1\\rangle$, the output qubit ($y$) should be set to $|0\\rangle$.\n\nThe operation does not have any explicit output; its output is the state of the qubits after the operation is performed."}, {"prompt_md5": "85b845a9", "template_md5": "465699a0", "result": "Build a program that takes three qubits in any state and one other qubit in any state. The program should change the state of the qubits based on how many of the first three qubits are in a specific state (let's say \"1\")."}]}