{"uid": "1003-E", "url": "https://codeforces.com/contest/1003/problem/E", "tags": ["constructive algorithms", " graphs"], "title": "1003-E", "statement": "E. Tree Constructingtime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given three integers $$$n$$$, $$$d$$$ and $$$k$$$.Your task is to construct an undirected tree on $$$n$$$ vertices with diameter $$$d$$$ and degree of each vertex at most $$$k$$$, or say that it is impossible.An undirected tree is a connected undirected graph with $$$n - 1$$$ edges.Diameter of a tree is the maximum length of a simple path (a path in which each vertex appears at most once) between all pairs of vertices of this tree.Degree of a vertex is the number of edges incident to this vertex (i.e. for a vertex $$$u$$$ it is the number of edges $$$(u, v)$$$ that belong to the tree, where $$$v$$$ is any other vertex of a tree).InputThe first line of the input contains three integers $$$n$$$, $$$d$$$ and $$$k$$$ ($$$1 \\\\le n, d, k \\\\le 4 \\\\cdot 10^5$$$).OutputIf there is no tree satisfying the conditions above, print only one word \"NO\" (without quotes).Otherwise in the first line print \"YES\" (without quotes), and then print $$$n - 1$$$ lines describing edges of a tree satisfying the conditions above. Vertices of the tree must be numbered from $$$1$$$ to $$$n$$$. You can print edges and vertices connected by an edge in any order. If there are multiple answers, print any of them.1ExamplesInput6 3 3OutputYES3 14 11 25 22 6Input6 2 3OutputNOInput10 4 3OutputYES2 92 1010 33 16 108 24 35 66 7Input8 5 3OutputYES2 57 23 73 11 68 74 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0f810d12", "template_md5": "35d339e4", "result": "You are given three numbers: $n$, $d$, and $k$.  \n\nYour task is to create a connected graph with the following properties:\n\n* The graph must have $n$ nodes (vertices).\n* The longest path between any two nodes in the graph must have $d$ edges. This is called the diameter of the graph.\n* Each node in the graph must have a degree of at most $k$ (meaning it is connected to at most $k$ other nodes).\n\nIf it is impossible to create such a graph, output \"NO\". Otherwise, output \"YES\" and then list the connections (edges) between the nodes."}, {"prompt_md5": "5ec9d066", "template_md5": "465699a0", "result": "You are given a number of points and a maximum distance between any two points.  You need to connect the points with lines so that:\n\n* Every point is connected to every other point.\n* The longest line between any two points is at most the given maximum distance.\n* Each point is connected to at most a given number of other points.\n\nIf this is possible, output \"YES\" and a list of the connections. Otherwise, output \"NO\"."}]}