{"uid": "1003-A", "url": "https://codeforces.com/contest/1003/problem/A", "tags": ["implementation"], "title": "1003-A", "statement": "A. Polycarp's Pocketstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp has $$$n$$$ coins, the value of the $$$i$$$-th coin is $$$a_i$$$. Polycarp wants to distribute all the coins between his pockets, but he cannot put two coins with the same value into the same pocket.For example, if Polycarp has got six coins represented as an array $$$a = [1, 2, 4, 3, 3, 2]$$$, he can distribute the coins into two pockets as follows: $$$[1, 2, 3], [2, 3, 4]$$$.Polycarp wants to distribute all the coins with the minimum number of used pockets. Help him to do that.InputThe first line of the input contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 100$$$) — the number of coins.The second line of the input contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 100$$$) — values of coins.OutputPrint only one integer — the minimum number of pockets Polycarp needs to distribute all the coins so no two coins with the same value are put into the same pocket.ExamplesInput61 2 4 3 3 2Output2Input1100Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7922c436", "template_md5": "35d339e4", "result": "You are given $n$ coins, each with a distinct value between 1 and 100.  Determine the minimum number of pockets needed to distribute the coins so that no two coins with the same value are in the same pocket. \n\nInput:\n\n* The first line contains an integer $n$ ($1 \\le n \\le 100$) representing the number of coins.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le 100$) representing the values of the coins.\n\nOutput:\n\n* Print a single integer representing the minimum number of pockets required."}, {"prompt_md5": "73ac4f4a", "template_md5": "465699a0", "result": "You have a set of items, each with a unique value.  You need to put the items into groups, but no two items with the same value can be in the same group. Find the fewest groups needed."}]}