{"uid": "1004-B", "url": "https://codeforces.com/contest/1004/problem/B", "tags": ["constructive algorithms", " greedy", " implementation", " math"], "title": "1004-B", "statement": "B. Sonya and Exhibitiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSonya decided to organize an exhibition of flowers. Since the girl likes only roses and lilies, she decided that only these two kinds of flowers should be in this exhibition.There are $$$n$$$ flowers in a row in the exhibition. Sonya can put either a rose or a lily in the $$$i$$$-th position. Thus each of $$$n$$$ positions should contain exactly one flower: a rose or a lily.She knows that exactly $$$m$$$ people will visit this exhibition. The $$$i$$$-th visitor will visit all flowers from $$$l_i$$$ to $$$r_i$$$ inclusive. The girl knows that each segment has its ownbeautythat is equal to the product of the number of roses and the number of lilies.Sonya wants her exhibition to be liked by a lot of people. That is why she wants to put the flowers in such way that the sum ofbeautiesof all segments would be maximum possible.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1\\\\leq n, m\\\\leq 10^3$$$) — the number of flowers and visitors respectively.Each of the next $$$m$$$ lines contains two integers $$$l_i$$$ and $$$r_i$$$ ($$$1\\\\leq l_i\\\\leq r_i\\\\leq n$$$), meaning that $$$i$$$-th visitor will visit all flowers from $$$l_i$$$ to $$$r_i$$$ inclusive.OutputPrint the string of $$$n$$$ characters. The $$$i$$$-th symbol should be «0» if you want to put a rose in the $$$i$$$-th position, otherwise «1» if you want to put a lily.If there are multiple answers, print any.ExamplesInput5 31 32 42 5Output01100Input6 35 61 44 6Output110010NoteIn the first example, Sonya can put roses in the first, fourth, and fifth positions, and lilies in the second and third positions;in the segment $$$[1\\\\ldots3]$$$, there are one rose and two lilies, so thebeautyis equal to $$$1\\\\cdot 2=2$$$;in the segment $$$[2\\\\ldots4]$$$, there are one rose and two lilies, so thebeautyis equal to $$$1\\\\cdot 2=2$$$;in the segment $$$[2\\\\ldots5]$$$, there are two roses and two lilies, so thebeautyis equal to $$$2\\\\cdot 2=4$$$.The totalbeautyis equal to $$$2+2+4=8$$$.In the second example, Sonya can put roses in the third, fourth, and sixth positions, and lilies in the first, second, and fifth positions;in the segment $$$[5\\\\ldots6]$$$, there are one rose and one lily, so thebeautyis equal to $$$1\\\\cdot 1=1$$$;in the segment $$$[1\\\\ldots4]$$$, there are two roses and two lilies, so thebeautyis equal to $$$2\\\\cdot 2=4$$$;in the segment $$$[4\\\\ldots6]$$$, there are two roses and one lily, so thebeautyis equal to $$$2\\\\cdot 1=2$$$.The totalbeautyis equal to $$$1+4+2=7$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "64a3592c", "template_md5": "35d339e4", "result": "There are $n$ positions in a row. You can place either a rose (0) or a lily (1) in each position. \n\nThere are $m$ segments, each defined by a start position $l_i$ and an end position $r_i$.  The beauty of each segment is the product of the number of roses and the number of lilies in that segment.\n\nFind a way to place the roses and lilies so that the sum of the beauty of all the segments is as large as possible. \n\n\nOutput your answer as a string of $n$ characters, where each character is either '0' or '1'."}, {"prompt_md5": "3f492925", "template_md5": "465699a0", "result": "You have a line of spots. You can put either a red or a blue object in each spot.  People will visit different sections of the line.  The score for each section is the number of reds times the number of blues.  What arrangement of reds and blues maximizes the total score across all the sections?"}]}