{"uid": "1005-D", "url": "https://codeforces.com/contest/1005/problem/D", "tags": ["dp", " greedy", " number theory"], "title": "1005-D", "statement": "D. Polycarp and Div 3time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp likes numbers that are divisible by 3.He has a huge number $$$s$$$. Polycarp wants to cut from it the maximum number of numbers that are divisible by $$$3$$$. To do this, he makes an arbitrary number of vertical cuts between pairs of adjacent digits. As a result, after $$$m$$$ such cuts, there will be $$$m+1$$$ parts in total. Polycarp analyzes each of the obtained numbers and finds the number of those that are divisible by $$$3$$$.For example, if the original number is $$$s=3121$$$, then Polycarp can cut it into three parts with two cuts: $$$3|1|21$$$. As a result, he will get two numbers that are divisible by $$$3$$$.Polycarp can make an arbitrary number of vertical cuts, where each cut is made between a pair of adjacent digits. The resulting numbers cannot contain extra leading zeroes (that is, the number can begin with0if and only if this number is exactly one character '0'). For example,007,01and00099are not valid numbers, but90,0and10001are valid.What is the maximum number of numbers divisible by $$$3$$$ that Polycarp can obtain?InputThe first line of the input contains a positive integer $$$s$$$. The number of digits of the number $$$s$$$ is between $$$1$$$ and $$$2\\\\cdot10^5$$$, inclusive. The first (leftmost) digit is not equal to0.OutputPrint the maximum number of numbers divisible by $$$3$$$ that Polycarp can get by making vertical cuts in the given number $$$s$$$.ExamplesInput3121Output2Input6Output1Input1000000000000000000000000000000000Output33Input201920181Output4NoteIn the first example, an example set of optimal cuts on the number is3|1|21.In the second example, you do not need to make any cuts. The specified number6forms one number that is divisible by $$$3$$$.In the third example, cuts must be made between each pair of digits. As a result, Polycarp gets one digit1and $$$33$$$ digits0. Each of the $$$33$$$ digits0forms a number that is divisible by $$$3$$$.In the fourth example, an example set of optimal cuts is2|0|1|9|201|81. The numbers $$$0$$$, $$$9$$$, $$$201$$$ and $$$81$$$ are divisible by $$$3$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2026097a", "template_md5": "35d339e4", "result": "You are given a positive integer $s$.  You can cut this number into smaller numbers by inserting vertical lines between its digits.  For example, the number 3121 could be cut into 3|1|21.  \n\nEach resulting number must be a valid integer (no leading zeros).  \n\nFind the maximum number of these resulting numbers that are divisible by 3."}, {"prompt_md5": "bd6662c5", "template_md5": "465699a0", "result": "You are given a large number. You can cut it into smaller numbers by inserting vertical lines between the digits.  Each smaller number must be a valid number (no leading zeros).  Find the maximum number of smaller numbers you can create that are divisible by 3."}]}