{"uid": "1005-B", "url": "https://codeforces.com/contest/1005/problem/B", "tags": ["brute force", " implementation", " strings"], "title": "1005-B", "statement": "B. Delete from the Lefttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two strings $$$s$$$ and $$$t$$$. In a single move, you can choose any of two strings and delete the first (that is, the leftmost) character. After a move, the length of the string decreases by $$$1$$$. You can't choose a string if it is empty.For example:by applying a move to the string \"where\", the result is the string \"here\",by applying a move to the string \"a\", the result is an empty string \"\".You are required to make two given strings equal using the fewest number of moves. It is possible that, in the end, both strings will be equal to the empty string, and so, are equal to each other. In this case, the answer is obviously the sum of the lengths of the initial strings.Write a program that finds the minimum number of moves to make two given strings $$$s$$$ and $$$t$$$ equal.InputThe first line of the input contains $$$s$$$. In the second line of the input contains $$$t$$$. Both strings consist only of lowercase Latin letters. The number of letters in each string is between 1 and $$$2\\\\cdot10^5$$$, inclusive.OutputOutput the fewest number of moves required. It is possible that, in the end, both strings will be equal to the empty string, and so, are equal to each other. In this case, the answer is obviously the sum of the lengths of the given strings.ExamplesInputtestwestOutput2InputcodeforcesyesOutput9InputtestyesOutput7InputbabOutput1NoteIn the first example, you should apply the move once to the first string and apply the move once to the second string. As a result, both strings will be equal to \"est\".In the second example, the move should be applied to the string \"codeforces\" $$$8$$$ times. As a result, the string becomes \"codeforces\" $$$\\\\to$$$ \"es\". The move should be applied to the string \"yes\" once. The result is the same string \"yes\" $$$\\\\to$$$ \"es\".In the third example, you can make the strings equal only by completely deleting them. That is, in the end, both strings will be empty.In the fourth example, the first character of the second string should be deleted.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "175ad2b0", "template_md5": "35d339e4", "result": "You are given two strings,  $s$ and $t$. You can perform the following operation on either string: delete the first character.  \n\nFind the minimum number of operations needed to make the two strings equal.  It's possible that both strings will become empty in the process. If so, the answer is the sum of the lengths of the original strings."}, {"prompt_md5": "6d43ef85", "template_md5": "465699a0", "result": "You have two strings of letters. You can delete the first letter from either string in each turn. What is the fewest number of turns it takes to make the two strings the same?"}]}