{"uid": "1008-B", "url": "https://codeforces.com/contest/1008/problem/B", "tags": ["greedy", " sortings"], "title": "1008-B", "statement": "B. Turn the Rectanglestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ rectangles in a row. You can either turn each rectangle by $$$90$$$ degrees or leave it as it is. If you turn a rectangle, its width will be height, and its height will be width. Notice that you can turn any number of rectangles, you also can turn all or none of them.You can not change the order of the rectangles.Find out if there is a way to make the rectangles go in order of non-ascending height. In other words, after all the turns, a height of every rectangle has to be not greater than the height of the previous rectangle (if it is such).InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 10^5$$$) — the number of rectangles.Each of the next $$$n$$$ lines contains two integers $$$w_i$$$ and $$$h_i$$$ ($$$1 \\\\leq w_i, h_i \\\\leq 10^9$$$) — the width and the height of the $$$i$$$-th rectangle.OutputPrint \"YES\" (without quotes) if there is a way to make the rectangles go in order of non-ascending height, otherwise print \"NO\".You can print each letter in any case (upper or lower).ExamplesInput33 44 63 5OutputYESInput23 45 5OutputNONoteIn the first test, you can rotate the second and the third rectangles so that the heights will be[4, 4, 3].In the second test, there is no way the second rectangle will be not higher than the first one.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5ccf911b", "template_md5": "35d339e4", "result": "You are given $n$ rectangles, each with a width ($w_i$) and a height ($h_i$). You can rotate each rectangle by 90 degrees.  \n\nDetermine if it's possible to rotate some or all of the rectangles so that the heights are in non-decreasing order (the height of each rectangle is less than or equal to the height of the previous rectangle).\n\nOutput \"YES\" if this is possible, and \"NO\" otherwise."}, {"prompt_md5": "0b2a80c6", "template_md5": "465699a0", "result": "You have a row of rectangles. You can rotate each rectangle 90 degrees.  Determine if you can arrange the rectangles so that the height of each rectangle is less than or equal to the height of the rectangle before it."}]}