{"uid": "1010-D", "url": "https://codeforces.com/contest/1010/problem/D", "tags": ["dfs and similar", " graphs", " implementation", " trees"], "title": "1010-D", "statement": "D. Mars rovertime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputNatasha travels around Mars in the Mars rover. But suddenly it broke down, namely — the logical scheme inside it. The scheme is an undirected tree (connected acyclic graph) with a root in the vertex $$$1$$$, in which every leaf (excluding root) is an input, and all other vertices are logical elements, including the root, which is output. One bit is fed to each input. One bit is returned at the output.There are four types of logical elements:AND($$$2$$$ inputs),OR($$$2$$$ inputs),XOR($$$2$$$ inputs),NOT($$$1$$$ input). Logical elements take values from their direct descendants (inputs) and return the result of the function they perform. Natasha knows the logical scheme of the Mars rover, as well as the fact that only one input is broken. In order to fix the Mars rover, she needs to change the value on this input.For each input, determine what the output will be if Natasha changes this input.InputThe first line contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 10^6$$$) — the number of vertices in the graph (both inputs and elements).The $$$i$$$-th of the next $$$n$$$ lines contains a description of $$$i$$$-th vertex: the first word \"AND\", \"OR\", \"XOR\", \"NOT\" or \"IN\" (means the input of the scheme) is the vertex type. If this vertex is \"IN\", then the value of this input follows ($$$0$$$ or $$$1$$$), otherwise follow the indices of input vertices of this element: \"AND\", \"OR\", \"XOR\" have $$$2$$$ inputs, whereas \"NOT\" has $$$1$$$ input. The vertices are numbered from one.It is guaranteed that input data contains a correct logical scheme with an output produced by the vertex $$$1$$$.OutputPrint a string of characters'0'and'1'(without quotes) — answers to the problem for each input in the ascending order of their vertex indices.ExampleInput10AND 9 4IN 1IN 1XOR 6 5AND 3 7IN 0NOT 10IN 1IN 1AND 2 8Output10110NoteThe original scheme from the example (before the input is changed):Green indicates bits'1', yellow indicates bits'0'.If Natasha changes the input bit $$$2$$$ to $$$0$$$, then the output will be $$$1$$$.If Natasha changes the input bit $$$3$$$ to $$$0$$$, then the output will be $$$0$$$.If Natasha changes the input bit $$$6$$$ to $$$1$$$, then the output will be $$$1$$$.If Natasha changes the input bit $$$8$$$ to $$$0$$$, then the output will be $$$1$$$.If Natasha changes the input bit $$$9$$$ to $$$0$$$, then the output will be $$$0$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "02ad9278", "template_md5": "35d339e4", "result": "You are given a logical circuit represented as a tree. The tree has $n$ nodes, where $2 \\le n \\le 10^6$.  Each node is either:\n\n* **Input:**  Takes a single bit as input (0 or 1).\n* **AND:** Takes two bits as input and outputs 1 if both inputs are 1, otherwise 0.\n* **OR:** Takes two bits as input and outputs 1 if at least one input is 1, otherwise 0.\n* **XOR:** Takes two bits as input and outputs 1 if the inputs are different, otherwise 0.\n* **NOT:** Takes one bit as input and outputs the opposite bit.\n\nThe root of the tree is the output of the circuit.\n\nYou are given the circuit structure and know that exactly one input node has a faulty value.  \n\nFor each input node, determine the output of the circuit if you change the value of that input to the opposite bit. \n\n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "422b347b", "template_md5": "465699a0", "result": "You are given a tree-like structure where each node is either an input, an AND gate, an OR gate, an XOR gate, or a NOT gate.  The inputs can be either 0 or 1. The gates process the input values according to their logic.  You know that one input is faulty.  For each input, determine the output of the structure if you change that specific input to the opposite value."}]}