{"uid": "1013-B", "url": "https://codeforces.com/contest/1013/problem/B", "tags": ["greedy"], "title": "1013-B", "statement": "B. Andtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is an array withnelementsa1,a2, ...,anand the numberx.In one operation you can select somei(1 ≤i≤n) and replace elementaiwithai&x, where&denotes thebitwise andoperation.You want the array to have at least two equal elements after applying some operations (possibly, none). In other words, there should be at least two distinct indicesi≠jsuch thatai=aj. Determine whether it is possible to achieve and, if possible, the minimal number of operations to apply.InputThe first line contains integersnandx(2 ≤n≤ 100 000,1 ≤x≤ 100 000), number of elements in the array and the number to and with.The second line containsnintegersai(1 ≤ai≤ 100 000), the elements of the array.OutputPrint a single integer denoting the minimal number of operations to do, or-1, if it is impossible.ExamplesInput4 31 2 3 7Output1Input2 2281 1Output0Input3 71 2 3Output-1NoteIn the first example one can apply the operation to the last element of the array. That replaces 7 with 3, so we achieve the goal in one move.In the second example the array already has two equal elements.In the third example applying the operation won't change the array at all, so it is impossible to make some pair of elements equal.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0e4936dd", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers ($a_1, a_2, ..., a_n$) and an integer $x$. You can perform an operation on the array where you choose an index $i$ ($1 \\le i \\le n$) and replace the element $a_i$ with $a_i \\text{ & } x$ (bitwise AND operation).\n\nYour goal is to determine if it's possible to make at least two elements in the array equal after performing some operations (possibly none). If it's possible, find the minimum number of operations required. If it's impossible, output -1."}, {"prompt_md5": "53d4ea44", "template_md5": "465699a0", "result": "You have a list of numbers. You can change a number in the list by performing a bitwise AND operation with a given number.  Determine the fewest changes needed to make at least two numbers in the list identical, or say it's impossible."}]}