{"uid": "1019-D", "url": "https://codeforces.com/contest/1019/problem/D", "tags": ["binary search", " geometry", " sortings"], "title": "1019-D", "statement": "D. Large Triangletime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is a strange peculiarity: if you connect the cities of Rostov, Taganrog and Shakhty, peculiarly, you get a triangle«Unbelievable But True»Students from many different parts of Russia and abroad come to Summer Informatics School. You marked the hometowns of the SIS participants on a map.Now you decided to prepare an interesting infographic based on this map. The first thing you chose to do is to find three cities on this map, such that they form a triangle with area $$$S$$$.InputThe first line of input contains two integers $$$n$$$ and $$$S$$$ ($$$3 \\\\le n \\\\le 2000$$$, $$$1 \\\\le S \\\\le 2 \\\\cdot 10^{18}$$$) — the number of cities on the map and the area of the triangle to be found.The next $$$n$$$ lines contain descriptions of the cities, one per line. Each city is described by its integer coordinates $$$x_i$$$, $$$y_i$$$ ($$$-10^9 \\\\le x_i, y_i \\\\le 10^9$$$).It is guaranteed that all cities are located at distinct points. It is also guaranteed that no three cities lie on the same line.OutputIf the solution doesn't exist — print «No».Otherwise, print «Yes», followed by three pairs of coordinates $$$(x, y)$$$ — the locations of the three cities, which form the triangle of area $$$S$$$.ExamplesInput3 70 03 00 4OutputNoInput4 30 02 01 21 3OutputYes0 01 32 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "580637e6", "template_md5": "35d339e4", "result": "You are given a map with $n$ cities, each with integer coordinates $(x_i, y_i)$.  Find three cities that form a triangle with area $S$.\n\nInput:\n\n* The first line contains two integers $n$ and $S$ ($3 \\le n \\le 2000$, $1 \\le S \\le 2 \\cdot 10^{18}$).\n* The next $n$ lines each contain two integers $x_i$ and $y_i$ ($-10^9 \\le x_i, y_i \\le 10^9$) representing the coordinates of a city.\n\nOutput:\n\n* If no three cities form a triangle with area $S$, print \"No\".\n* Otherwise, print \"Yes\", followed by three pairs of coordinates $(x, y)$ representing the locations of the three cities."}, {"prompt_md5": "526f71c2", "template_md5": "465699a0", "result": "Given a list of points on a map, find three points that form a triangle with a specific area. If no such triangle exists, say \"No\". Otherwise, list the coordinates of the three points."}]}