{"uid": "1025-B", "url": "https://codeforces.com/contest/1025/problem/B", "tags": ["brute force", " greedy", " number theory"], "title": "1025-B", "statement": "B. Weakened Common Divisortime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDuring the research on properties of the greatest common divisor (GCD) of a set of numbers, Ildar, a famous mathematician, introduced a brand new concept of the weakened common divisor (WCD) of a list of pairs of integers.For a given list of pairs of integers $$$(a_1, b_1)$$$, $$$(a_2, b_2)$$$, ..., $$$(a_n, b_n)$$$ theirWCDis arbitrary integer greater than $$$1$$$, such that it divides at least one element in each pair. WCD may not exist for some lists.For example, if the list looks like $$$[(12, 15), (25, 18), (10, 24)]$$$, then their WCD can be equal to $$$2$$$, $$$3$$$, $$$5$$$ or $$$6$$$ (each of these numbers is strictly greater than $$$1$$$ and divides at least one number in each pair).You're currently pursuing your PhD degree under Ildar's mentorship, and that's why this problem was delegated to you. Your task is to calculateWCDefficiently.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 150\\\\,000$$$) — the number of pairs.Each of the next $$$n$$$ lines contains two integer values $$$a_i$$$, $$$b_i$$$ ($$$2 \\\\le a_i, b_i \\\\le 2 \\\\cdot 10^9$$$).OutputPrint a single integer — theWCDof the set of pairs.If there are multiple possible answers, output any; if there is no answer, print $$$-1$$$.ExamplesInput317 1815 2412 15Output6Input210 167 17Output-1Input590 10845 10575 40165 17533 30Output5NoteIn the first example the answer is $$$6$$$ since it divides $$$18$$$ from the first pair, $$$24$$$ from the second and $$$12$$$ from the third ones. Note that other valid answers will also be accepted.In the second example there are no integers greater than $$$1$$$ satisfying the conditions.In the third example one of the possible answers is $$$5$$$. Note that, for example, $$$15$$$ is also allowed, but it's not necessary to maximize the output.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "67f27806", "template_md5": "35d339e4", "result": "You are given a list of pairs of integers.  Find the largest integer greater than 1 that divides at least one number in each pair. If no such integer exists, print -1.\n\nInput:\n\nThe first line contains an integer  $n$ ($1 \\le n \\le 150,000$) representing the number of pairs.\n\nEach of the next $n$ lines contains two integers $a_i$ and $b_i$ ($2 \\le a_i, b_i \\le 2 \\cdot 10^9$) representing a pair.\n\nOutput:\n\nPrint a single integer representing the largest such integer. If no such integer exists, print -1."}, {"prompt_md5": "0b34c7ee", "template_md5": "465699a0", "result": "You are given a list of pairs of numbers. Find the largest number greater than 1 that divides at least one number in each pair. If no such number exists, print -1."}]}