{"uid": "1027-E", "url": "https://codeforces.com/contest/1027/problem/E", "tags": ["combinatorics", " dp", " math"], "title": "1027-E", "statement": "E. Inverse Coloringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a square board, consisting of $$$n$$$ rows and $$$n$$$ columns. Each tile in it should be colored either white or black.Let's call some coloringbeautifulif each pair of adjacent rows are either the same or different in every position. The same condition should be held for the columns as well.Let's call some coloringsuitableif it isbeautifuland there is norectangleof the single color, consisting of at least $$$k$$$ tiles.Your task is to count the number ofsuitablecolorings of the board of the given size.Since the answer can be very large, print it modulo $$$998244353$$$.InputA single line contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 500$$$, $$$1 \\\\le k \\\\le n^2$$$) — the number of rows and columns of the board and the maximum number of tiles inside the rectangle of the single color, respectively.OutputPrint a single integer — the number ofsuitablecolorings of the board of the given size modulo $$$998244353$$$.ExamplesInput1 1Output0Input2 3Output6Input49 1808Output359087121NoteBoard of size $$$1 \\\\times 1$$$ is either a single black tile or a single white tile. Both of them include a rectangle of a single color, consisting of $$$1$$$ tile.Here are thebeautifulcolorings of a board of size $$$2 \\\\times 2$$$ that don't include rectangles of a single color, consisting of at least $$$3$$$ tiles:The rest ofbeautifulcolorings of a board of size $$$2 \\\\times 2$$$ are the following:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c76eacbe", "template_md5": "465699a0", "result": "You have a square grid. You need to color each square either black or white.  The coloring is valid if:\n\n* Every two adjacent rows have the same color in every position, or different colors in every position.\n* The same rule applies to every two adjacent columns.\n\nAdditionally, there cannot be a rectangle of the same color with at least *k* squares.\n\nCount the number of valid colorings and output the result modulo 998244353."}, {"prompt_md5": "298585e9", "template_md5": "35d339e4", "result": "You are given a square board of size $n \\times n$. You need to color each tile on the board either white or black.  A coloring is considered \"beautiful\" if:\n\n* Every pair of adjacent rows have either the same color in every position or different colors in every position.\n* The same condition applies to every pair of adjacent columns.\n\nA coloring is considered \"suitable\" if it is beautiful and there is no rectangle of a single color containing at least $k$ tiles.\n\nFind the number of suitable colorings of the board and print the result modulo 998244353."}]}