{"uid": "1028-F", "url": "https://codeforces.com/contest/1028/problem/F", "tags": ["brute force"], "title": "1028-F", "statement": "F. Make Symmetricaltime limit per test6 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputConsider a set of points $$$A$$$, initially it is empty. There are three types of queries:Insert a point $$$(x_i, y_i)$$$ to $$$A$$$. It is guaranteed that this point does not belong to $$$A$$$ at this moment.Remove a point $$$(x_i, y_i)$$$ from $$$A$$$. It is guaranteed that this point belongs to $$$A$$$ at this moment.Given a point $$$(x_i, y_i)$$$, calculate the minimum number of points required to add to $$$A$$$ to make $$$A$$$ symmetrical with respect to the line containing points $$$(0, 0)$$$ and $$$(x_i, y_i)$$$. Note that these points are not actually added to $$$A$$$, i.e. these queries are independent from each other.InputThe first line contains a single integer $$$q$$$ ($$$1 \\\\le q \\\\le 2 \\\\cdot 10^5$$$) — the number of queries.Each of the following $$$q$$$ lines describes a query and contains three integers $$$t_i$$$, $$$x_i$$$ and $$$y_i$$$ ($$$ t_i \\\\in \\\\{1, 2, 3\\\\}$$$, $$$1 \\\\le x_i, y_i \\\\le 112\\\\,904$$$) — the type of the query and the coordinates of the point. Type $$$1$$$ is addition of the point, type $$$2$$$ is removal of the point, type $$$3$$$ is the query to compute the minimum number of points required to make $$$A$$$ symmetrical.It is guaranteed that there are no more than $$$10^5$$$ queries of type $$$3$$$ and no more than $$$10^5$$$ queries having type $$$1$$$ or $$$2$$$.OutputFor each query of the third type output a line with a single integer — the answer to this query.ExamplesInput121 1 61 6 11 5 51 2 33 4 41 3 23 7 72 2 32 6 13 8 82 5 53 1 1Output1022Input61 1 23 1 11 1 13 2 22 1 13 2 4Output110NoteThe first example is shown on the picture below.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "16dd2d57", "template_md5": "35d339e4", "result": "You are given a set of points. You can perform three types of operations:\n\n1. **Insert a point:** Add a new point to the set. The point must not already be in the set.\n2. **Remove a point:** Delete a point from the set. The point must be in the set.\n3. **Calculate symmetry:** Given a point $(x, y)$, find the minimum number of points you need to add to the set to make the set symmetrical with respect to the line passing through the origin $(0, 0)$ and the given point $(x, y)$.\n\n**Input:**\n\nThe first line contains an integer $q$ representing the number of operations.\n\nEach of the following $q$ lines describes an operation:\n\n*  `1 x y`: Insert the point $(x, y)$.\n*  `2 x y`: Remove the point $(x, y)$.\n*  `3 x y`: Calculate the minimum number of points needed for symmetry with respect to the line through $(0, 0)$ and $(x, y)$.\n\n**Output:**\n\nFor each query of type 3, output a single integer representing the minimum number of points needed."}, {"prompt_md5": "bfa61ae1", "template_md5": "465699a0", "result": "You are given a set of points. You can add or remove points from the set.  For a given point, find the fewest additional points needed to make the set of points symmetrical around a line passing through the origin and the given point."}]}