{"uid": "1029-F", "url": "https://codeforces.com/contest/1029/problem/F", "tags": ["binary search", " brute force", " math", " number theory"], "title": "1029-F", "statement": "F. Multicolored Markerstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is an infinite board of square tiles. Initially all tiles are white.Vova has a red marker and a blue marker. Red marker can color $$$a$$$ tiles. Blue marker can color $$$b$$$ tiles. If some tile isn't white then you can't use marker of any color on it. Each marker must be drained completely, so at the end there should be exactly $$$a$$$ red tiles and exactly $$$b$$$ blue tiles across the board.Vova wants to color such a set of tiles that:they would form arectangle, consisting of exactly $$$a+b$$$ colored tiles;all tiles of at least one color would also form arectangle.Here are some examples of correct colorings:Here are some examples of incorrect colorings:Among all correct colorings Vova wants to choose the one with the minimal perimeter. What is the minimal perimeter Vova can obtain?It is guaranteed that there exists at least one correct coloring.InputA single line contains two integers $$$a$$$ and $$$b$$$ ($$$1 \\\\le a, b \\\\le 10^{14}$$$) — the number of tiles red marker should color and the number of tiles blue marker should color, respectively.OutputPrint a single integer — the minimal perimeter of a colored rectangle Vova can obtain by coloring exactly $$$a$$$ tiles red and exactly $$$b$$$ tiles blue.It is guaranteed that there exists at least one correct coloring.ExamplesInput4 4Output12Input3 9Output14Input9 3Output14Input3 6Output12Input506 2708Output3218NoteThe first four examples correspond to the first picture of the statement.Note that for there exist multiple correct colorings for all of the examples.In the first example you can also make a rectangle with sides $$$1$$$ and $$$8$$$, though its perimeter will be $$$18$$$ which is greater than $$$8$$$.In the second example you can make the same resulting rectangle with sides $$$3$$$ and $$$4$$$, but red tiles will form the rectangle with sides $$$1$$$ and $$$3$$$ and blue tiles will form the rectangle with sides $$$3$$$ and $$$3$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "23707c6d", "template_md5": "35d339e4", "result": "You have an infinite grid of square tiles. You have two markers, one red and one blue. The red marker can color $a$ tiles, and the blue marker can color $b$ tiles.  You can only color uncolored tiles.\n\nYou want to color the tiles so that:\n\n* The colored tiles form a rectangle.\n* The rectangle has exactly $a+b$ tiles.\n* The tiles of at least one color also form a rectangle.\n\nFind the smallest possible perimeter of this rectangle. \n\nIt is guaranteed that a solution exists."}, {"prompt_md5": "976b74d0", "template_md5": "465699a0", "result": "You have two tools, one that can color a certain number of squares and another that can color a different number of squares. You need to color a rectangle using both tools so that:\n\n* The rectangle is made up of the exact number of squares colored by each tool.\n*  Squares of at least one color form a rectangle.\n\nFind the smallest possible perimeter of this rectangle."}]}