{"uid": "103-D", "url": "https://codeforces.com/contest/103/problem/D", "tags": ["brute force", " data structures", " sortings"], "title": "103-D", "statement": "D. Time to Raid Cowavanstime limit per test4 secondsmemory limit per test70 megabytesinputstdinoutputstdoutAs you know, the most intelligent beings on the Earth are, of course, cows. This conclusion was reached long ago by the Martian aliens, as well as a number of other intelligent civilizations from outer space.Sometimes cows gather intocowavans. This seems to be seasonal. But at this time the cows become passive and react poorly to external stimuli. A cowavan is a perfect target for the Martian scientific saucer, it's time for large-scale abductions, or, as the Martians say, raids. Simply put, a cowavan is a set of cows in a row.If we number all cows in the cowavan with positive integers from1ton, then we can formalize the popular model of abduction, known as the(a,b)-Cowavan Raid: first they steal a cow numbera, then numbera+b, then — numbera+ 2·b, and so on, until the number of an abducted cow exceedsn. During one raid the cows are not renumbered.The aliens would be happy to place all the cows on board of their hospitable ship, but unfortunately, the amount of cargo space is very, very limited. The researchers, knowing the mass of each cow in the cowavan, madepscenarios of the(a,b)-raid. Now they want to identify the following thing for each scenario individually: what total mass of pure beef will get on board of the ship. All the scenarios are independent, in the process of performing the calculations the cows are not being stolen.InputThe first line contains the only positive integern(1 ≤n≤ 3·105) — the number of cows in the cowavan.The second number containsnpositive integerwi, separated by spaces, where thei-th number describes the mass of thei-th cow in the cowavan (1 ≤wi≤ 109).The third line contains the only positive integerp— the number of scenarios of(a,b)-raids (1 ≤p≤ 3·105).Each following line contains integer parametersaandbof the corresponding scenario (1 ≤a,b≤n).OutputPrint for each scenario of the(a,b)-raid the total mass of cows, that can be stolen using only this scenario.Please, do not use the %lld specificator to read or write 64-bit integers in С++. It is recommended to use the cin, cout streams of the %I64d specificator.ExamplesInput31 2 321 11 2Output64Input42 3 5 731 32 32 2Output9310", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6ed98f0a", "template_md5": "35d339e4", "result": "You are given a line of $n$ cows, each with a weight $w_i$.  You are also given $p$ raid scenarios, each defined by two integers $a$ and $b$.  \n\nFor each raid scenario, you need to calculate the total weight of cows that can be abducted.  A raid works as follows:\n\n1. Start with the cow numbered $a$.\n2. Abduct the cow numbered $a + b$.\n3. Abduct the cow numbered $a + 2b$.\n4. Continue this pattern until the cow number exceeds $n$.\n\nOutput the total weight of cows abducted for each raid scenario."}, {"prompt_md5": "27f413e6", "template_md5": "465699a0", "result": "You are given a list of numbers representing the weights of items. You are also given a list of pairs of numbers. For each pair, determine the total weight of the items you can collect by taking items at specific intervals defined by the pair."}]}