{"uid": "103-C", "url": "https://codeforces.com/contest/103/problem/C", "tags": ["constructive algorithms", " greedy"], "title": "103-C", "statement": "C. Russian Roulettetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAfter all the events in Orlando we all know, Sasha and Roma decided to find out who is still the team's biggest loser. Thankfully, Masha found somewhere a revolver with a rotating cylinder ofnbullet slots able to contain exactlykbullets, now the boys have a chance to resolve the problem once and for all.Sasha selects anykout ofnslots he wishes and puts bullets there. Roma spins the cylinder so that every ofnpossible cylinder's shifts is equiprobable. Then the game starts, the players take turns, Sasha starts: he puts the gun to his head and shoots. If there was no bullet in front of the trigger, the cylinder shifts by one position and the weapon is given to Roma for make the same move. The game continues until someone is shot, the survivor is the winner.Sasha does not want to lose, so he must choose slots for bullets in such a way as to minimize the probability of its own loss. Of all the possible variant he wants to select the lexicographically minimal one, where an empty slot is lexicographically less than a charged one.More formally, the cylinder ofnbullet slots able to containkbullets can be represented as a string ofncharacters. Exactlykof them are \"X\" (charged slots) and the others are \".\" (uncharged slots).Let us describe the process of a shot. Suppose that the trigger is in front of the first character of the string (the first slot). If a shot doesn't kill anyone and the cylinder shifts, then the string shifts left. So the first character becomes the last one, the second character becomes the first one, and so on. But the trigger doesn't move. It will be in front of the first character of the resulting string.Among all the strings that give the minimal probability of loss, Sasha choose the lexicographically minimal one. According to this very string, he charges the gun. You have to help Sasha to charge the gun. For that, eachxiquery must be answered: is there a bullet in the positionsxi?InputThe first line contains three integersn,kandp(1 ≤n≤ 1018, 0 ≤k≤n, 1 ≤p≤ 1000) — the number of slots in the cylinder, the number of bullets and the number of queries. Then followplines; they are the queries. Each line contains one integerxi(1 ≤xi≤n) the number of slot to describe.Please do not use the %lld specificator to read or write 64-bit numbers in С++. It is preferred to use cin, cout streams or the %I64d specificator.OutputFor each query print \".\" if the slot should be empty and \"X\" if the slot should be charged.ExamplesInput3 1 3123Output..XInput6 3 6123456Output.X.X.XInput5 2 512345Output...XXNoteThe lexicographical comparison of is performed by the < operator in modern programming languages. Theastring is lexicographically less that thebstring, if there exists suchi(1 ≤i≤n), thatai<bi, and for anyj(1 ≤j<i)aj=bj.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b9f82675", "template_md5": "35d339e4", "result": "You are given a cylinder with $n$ slots. You need to place $k$ bullets into these slots. The bullets can be placed in any of the $n$ slots.  \n\nAfter placing the bullets, the cylinder will be spun, and the game will begin. Two players will take turns. On each turn, a player spins the cylinder and if the slot the cylinder stops on contains a bullet, the player is eliminated. If the slot is empty, the cylinder spins again.\n\nThe goal is to determine the arrangement of bullets that minimizes the probability of the first player losing.  \n\nYou will be given $p$ queries, each asking if there is a bullet in a specific slot.  For each query, output \".\" if the slot should be empty and \"X\" if it should contain a bullet. \n\n**Constraints:**\n\n* $1 \\le n \\le 10^{18}$\n* $0 \\le k \\le n$\n* $1 \\le p \\le 1000$ \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem."}, {"prompt_md5": "a7e45831", "template_md5": "465699a0", "result": "You have a cylinder with a number of slots. You need to place a certain number of bullets in these slots. The cylinder rotates, and a player shoots at a random slot. If there is no bullet, the cylinder rotates, and the other player shoots. The game continues until someone is shot.  \n\nYou need to figure out the arrangement of bullets that minimizes the chance of you losing.  You also need to choose the lexicographically smallest arrangement that achieves this.  \n\nFor each slot, you need to say whether it should have a bullet (\"X\") or be empty (\".\")"}]}