{"uid": "103-E", "url": "https://codeforces.com/contest/103/problem/E", "tags": ["flows", " graph matchings"], "title": "103-E", "statement": "E. Buying Setstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Hexadecimal virus loves playing with number sets — intersecting them, uniting them. One beautiful day she was surprised to find out that Scuzzy, her spherical pet cat, united all sets in one and ate the result! Something had to be done quickly and Hexadecimal rushed to the market.The market hasnsets of numbers on sale. The virus wants to buy the following collection of sets: the number of sets in the collection should be exactly the same as the number of numbers in the union of all bought sets. Moreover, Hexadecimal wants to buy the cheapest suitable collection of set.Yet nothing's so easy! As Mainframe is a kingdom of pure rivalry markets, we know that the union of anyksets contains no less thankdistinct numbers (for every positive integerk).Help the virus choose the suitable collection of sets. The collection can be empty.InputThe first line contains the only numbern(1 ≤n≤ 300) — the number of sets available in the market.Nextnlines describe the goods: first we are givenmi(1 ≤mi≤n) — the number of distinct numbers in thei-th set, then followminumbers — the set's elements. We know that the set's elements are distinct positive integers and they do not exceedn.The last line containsnintegers whose absolute values do not exceed106— the price of each set.OutputPrint a single number — the minimum price the virus will have to pay for such a collection ofksets that union of the collection's sets would have exactlykdistinct numbers ().ExamplesInput31 12 2 31 310 20 -3Output-3Input52 1 22 2 32 3 42 4 52 5 11 -1 1 -1 1Output0Input52 1 22 2 32 3 42 4 52 5 1-1 1 -1 1 -1Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "76da2c64", "template_md5": "465699a0", "result": "You are given a list of sets, each with a number of distinct elements and a price. You need to choose a collection of sets such that the number of distinct elements in the union of these sets is equal to the number of sets you choose. Find the cheapest possible collection."}, {"prompt_md5": "b16651c0", "template_md5": "35d339e4", "result": "There are $n$ sets of numbers for sale. Each set has a distinct number of elements, and each element is a positive integer not exceeding $n$.  The price of each set is given.\n\nYou need to find the minimum total price of a collection of $k$ sets such that the union of these $k$ sets contains exactly $k$ distinct numbers. \n\nThe collection can be empty. \n\nInput:\n\n* The first line contains the number of sets available ($n$).\n* The next $n$ lines describe each set:\n    * The first number is the number of distinct elements in the set ($m_i$).\n    * The next $m_i$ numbers are the elements of the set.\n* The last line contains the price of each set.\n\nOutput:\n\n* Print the minimum total price of the collection of sets."}]}