{"uid": "1030-A", "url": "https://codeforces.com/contest/1030/problem/A", "tags": ["implementation"], "title": "1030-A", "statement": "A. In Search of an Easy Problemtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhen preparing a tournament, Codeforces coordinators try treir best to make the first problem as easy as possible. This time the coordinator had chosen some problem and asked $$$n$$$ people about their opinions. Each person answered whether this problem is easy or hard.If at least one of these $$$n$$$ people has answered that the problem is hard, the coordinator decides to change the problem. For the given responses, check if the problem is easy enough.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 100$$$) — the number of people who were asked to give their opinions.The second line contains $$$n$$$ integers, each integer is either $$$0$$$ or $$$1$$$. If $$$i$$$-th integer is $$$0$$$, then $$$i$$$-th person thinks that the problem is easy; if it is $$$1$$$, then $$$i$$$-th person thinks that the problem is hard.OutputPrint one word: \"EASY\" if the problem is easy according to all responses, or \"HARD\" if there is at least one person who thinks the problem is hard.You may print every letter in any register: \"EASY\", \"easy\", \"EaSY\" and \"eAsY\" all will be processed correctly.ExamplesInput30 0 1OutputHARDInput10OutputEASYNoteIn the first example the third person says it's a hard problem, so it should be replaced.In the second example the problem easy for the only person, so it doesn't have to be replaced.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5aba8e49", "template_md5": "35d339e4", "result": "You are given a number $n$ representing the number of people who were asked if a problem is easy or hard. \n\nEach person's response is represented by a 0 (easy) or a 1 (hard).\n\nDetermine if the problem is considered \"easy\" enough based on the responses. \n\nIf at least one person responded with a 1 (hard), the problem is considered \"hard\". Otherwise, it is considered \"easy\". \n\nOutput \"EASY\" if the problem is easy, and \"HARD\" if it is hard."}, {"prompt_md5": "5cc48ce0", "template_md5": "465699a0", "result": "You are given a list of yes/no answers.  If at least one answer is no, output \"HARD\". Otherwise, output \"EASY\"."}]}