{"uid": "1031-A", "url": "https://codeforces.com/contest/1031/problem/A", "tags": ["implementation", " math"], "title": "1031-A", "statement": "A. Golden Platetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have a plate and you want to add some gilding to it. The plate is a rectangle that we split into $$$w\\\\times h$$$ cells. There should be $$$k$$$ gilded rings, the first one should go along the edge of the plate, the second one — $$$2$$$ cells away from the edge and so on. Each ring has a width of $$$1$$$ cell. Formally, the $$$i$$$-th of these rings should consist of all bordering cells on the inner rectangle of size $$$(w - 4(i - 1))\\\\times(h - 4(i - 1))$$$.The picture corresponds to the third example.Your task is to compute the number of cells to be gilded.InputThe only line contains three integers $$$w$$$, $$$h$$$ and $$$k$$$ ($$$3 \\\\le w, h \\\\le 100$$$, $$$1 \\\\le k \\\\le \\\\left\\\\lfloor \\\\frac{min(n, m) + 1}{4}\\\\right\\\\rfloor$$$, where $$$\\\\lfloor x \\\\rfloor$$$ denotes the number $$$x$$$ rounded down) — the number of rows, columns and the number of rings, respectively.OutputPrint a single positive integer — the number of cells to be gilded.ExamplesInput3 3 1Output8Input7 9 1Output28Input7 9 2Output40NoteThe first example is shown on the picture below.The second example is shown on the picture below.The third example is shown in the problem description.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b3c29ed6", "template_md5": "35d339e4", "result": "You have a rectangular plate with $w$ columns and $h$ rows. You want to add $k$ gilded rings to the plate. \n\n* The first ring goes along the edge of the plate.\n* The second ring is 2 cells away from the edge.\n* Each subsequent ring is 2 cells further away from the edge than the previous one.\n\nEach ring is 1 cell wide.  \n\nCalculate the total number of cells that will be gilded.\n\n**Input:**\n\n* $w$ (number of columns)\n* $h$ (number of rows)\n* $k$ (number of rings)\n\n**Output:**\n\n* The total number of gilded cells. \n\n\n**Constraints:**\n\n* $3 \\le w, h \\le 100$\n* $1 \\le k \\le \\lfloor \\frac{min(w, h) + 1}{4} \\rfloor$ \n* $\\lfloor x \\rfloor$ means the greatest integer less than or equal to $x$."}, {"prompt_md5": "1f340e91", "template_md5": "465699a0", "result": "You have a rectangular grid. You need to add rings of gold around the grid, with each ring being a certain distance from the edge.  Calculate the total number of cells that will be covered by the gold rings."}]}