{"uid": "1032-D", "url": "https://codeforces.com/contest/1032/problem/D", "tags": ["geometry", " implementation"], "title": "1032-D", "statement": "D. Barcelonian Distancetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn this problem we consider a very simplified model of Barcelona city.Barcelona can be represented as a plane with streets of kind $$$x = c$$$ and $$$y = c$$$ for every integer $$$c$$$ (that is, the rectangular grid). However, there is a detail which makes Barcelona different from Manhattan. There is an avenue called Avinguda Diagonal which can be represented as a the set of points $$$(x, y)$$$ for which $$$ax + by + c = 0$$$.One can walk along streets, including the avenue. You are given two integer points $$$A$$$ and $$$B$$$ somewhere in Barcelona. Find the minimal possible distance one needs to travel to get to $$$B$$$ from $$$A$$$.InputThe first line contains three integers $$$a$$$, $$$b$$$ and $$$c$$$ ($$$-10^9\\\\leq a, b, c\\\\leq 10^9$$$, at least one of $$$a$$$ and $$$b$$$ is not zero) representing the Diagonal Avenue.The next line contains four integers $$$x_1$$$, $$$y_1$$$, $$$x_2$$$ and $$$y_2$$$ ($$$-10^9\\\\leq x_1, y_1, x_2, y_2\\\\leq 10^9$$$) denoting the points $$$A = (x_1, y_1)$$$ and $$$B = (x_2, y_2)$$$.OutputFind the minimum possible travel distance between $$$A$$$ and $$$B$$$. Your answer is considered correct if its absolute or relative error does not exceed $$$10^{-6}$$$.Formally, let your answer be $$$a$$$, and the jury's answer be $$$b$$$. Your answer is accepted if and only if $$$\\\\frac{|a - b|}{\\\\max{(1, |b|)}} \\\\le 10^{-6}$$$.ExamplesInput1 1 -3 0 3 3 0Output4.2426406871Input3 1 -9 0 3 3 -1Output6.1622776602NoteThe first example is shown on the left picture while the second example us shown on the right picture below. The avenue is shown with blue, the origin is shown with the black dot.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "90f1c549", "template_md5": "35d339e4", "result": "You are given a grid where streets run horizontally and vertically. There is also a diagonal line called the \"avenue\" defined by the equation $ax + by + c = 0$.\n\nYou are given two points, A and B, on this grid. Find the shortest distance you can travel between these two points, using the streets and the avenue. \n\nInput:\n\n* Three integers $a$, $b$, and $c$ define the equation of the avenue.\n* Four integers $x_1$, $y_1$, $x_2$, and $y_2$ represent the coordinates of points A and B.\n\nOutput:\n\n* The shortest distance between points A and B."}, {"prompt_md5": "4e018de0", "template_md5": "465699a0", "result": "You are given two points on a grid with a diagonal line cutting through it. Find the shortest distance between the two points, allowing travel along the grid lines and the diagonal line."}]}