{"uid": "1032-G", "url": "https://codeforces.com/contest/1032/problem/G", "tags": [], "title": "1032-G", "statement": "G. Chatteringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ parrots standing in a circle. Each parrot has a certain level of respect among other parrots, namely $$$r_i$$$. When a parrot with respect level $$$x$$$ starts chattering, $$$x$$$ neighbours to the right and to the left of it start repeating the same words in 1 second. Their neighbours then start repeating as well, and so on, until all the birds begin to chatter.You are given the respect levels of all parrots. For each parrot answer a question: if this certain parrot starts chattering, how many seconds will pass until all other birds will start repeating it?InputIn the first line of input there is a single integer $$$n$$$, the number of parrots ($$$1 \\\\leq n \\\\leq 10^5$$$).In the next line of input there are $$$n$$$ integers $$$r_1$$$, ..., $$$r_n$$$, the respect levels of parrots in order they stand in the circle ($$$1 \\\\leq r_i \\\\leq n$$$).OutputPrint $$$n$$$ integers. $$$i$$$-th of them should equal the number of seconds that is needed for all parrots to start chattering if the $$$i$$$-th parrot is the first to start.ExamplesInput4 1 1 4 1Output2 2 1 2Input8 1 2 2 1 5 1 3 1Output3 3 2 2 1 2 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0c3a9869", "template_md5": "35d339e4", "result": "There are $n$ parrots in a circle. Each parrot has a respect level, $r_i$. When a parrot with respect level $x$ starts chattering, $x$ parrots to its right and $x$ parrots to its left will start repeating the same words after 1 second. These parrots then start repeating as well, and so on, until all the birds begin to chatter.\n\nGiven the respect levels of all parrots, for each parrot, determine how many seconds it will take for all other parrots to start chattering if that specific parrot starts chattering first."}, {"prompt_md5": "f41a96bc", "template_md5": "465699a0", "result": "There are $n$ people in a circle. Each person has a number that represents how many people they can influence. If a person starts talking, they influence the people next to them, and those people influence the people next to them, and so on.  \n\nYou need to figure out how many seconds it takes for everyone to start talking, given that each person starts talking individually."}]}