{"uid": "1036-B", "url": "https://codeforces.com/contest/1036/problem/B", "tags": ["math"], "title": "1036-B", "statement": "B. Diagonal Walking v.2time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMikhail walks on a Cartesian plane. He starts at the point $$$(0, 0)$$$, and in one move he can go to any of eight adjacent points. For example, if Mikhail is currently at the point $$$(0, 0)$$$, he can go to any of the following points in one move:$$$(1, 0)$$$;$$$(1, 1)$$$;$$$(0, 1)$$$;$$$(-1, 1)$$$;$$$(-1, 0)$$$;$$$(-1, -1)$$$;$$$(0, -1)$$$;$$$(1, -1)$$$.If Mikhail goes from the point $$$(x1, y1)$$$ to the point $$$(x2, y2)$$$ in one move, and $$$x1 \\\\ne x2$$$ and $$$y1 \\\\ne y2$$$, then such a move is called adiagonal move.Mikhail has $$$q$$$queries. For the $$$i$$$-th query Mikhail's target is to go to the point $$$(n_i, m_i)$$$ from the point $$$(0, 0)$$$ inexactly$$$k_i$$$ moves. Among all possible movements he want to choose one with the maximum number ofdiagonal moves. Your task is to find the maximum number ofdiagonal movesor find that it is impossible to go from the point $$$(0, 0)$$$ to the point $$$(n_i, m_i)$$$ in $$$k_i$$$ moves.Note that Mikhailcanvisit any point any number of times (even the destination point!).InputThe first line of the input contains one integer $$$q$$$ ($$$1 \\\\le q \\\\le 10^4$$$) — the number of queries.Then $$$q$$$ lines follow. The $$$i$$$-th of these $$$q$$$ lines contains three integers $$$n_i$$$, $$$m_i$$$ and $$$k_i$$$ ($$$1 \\\\le n_i, m_i, k_i \\\\le 10^{18}$$$) — $$$x$$$-coordinate of the destination point of the query, $$$y$$$-coordinate of the destination point of the query and the number of moves in the query, correspondingly.OutputPrint $$$q$$$ integers. The $$$i$$$-th integer should be equal to-1if Mikhail cannot go from the point $$$(0, 0)$$$ to the point $$$(n_i, m_i)$$$ inexactly$$$k_i$$$ moves described above. Otherwise the $$$i$$$-th integer should be equal to the the maximum number ofdiagonal movesamong all possible movements.ExampleInput32 2 34 3 710 1 9Output16-1NoteOne of the possible answers to the first test case: $$$(0, 0) \\\\to (1, 0) \\\\to (1, 1) \\\\to (2, 2)$$$.One of the possible answers to the second test case: $$$(0, 0) \\\\to (0, 1) \\\\to (1, 2) \\\\to (0, 3) \\\\to (1, 4) \\\\to (2, 3) \\\\to (3, 2) \\\\to (4, 3)$$$.In the third test case Mikhail cannot reach the point $$$(10, 1)$$$ in 9 moves.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2f58c6d0", "template_md5": "35d339e4", "result": "You are given a series of queries. Each query consists of three integers: $n$, $m$, and $k$.  \n\nFor each query, you need to determine the maximum number of diagonal moves it takes to reach the point $(n, m)$ from the origin $(0, 0)$ in exactly $k$ moves.\n\nA diagonal move is a move where both the x-coordinate and y-coordinate change.\n\nIf it is impossible to reach the point $(n, m)$ in exactly $k$ moves, output -1. \n\n\n**Input:**\n\nThe first line contains an integer $q$ (the number of queries).\n\nEach of the following $q$ lines contains three integers: $n$, $m$, and $k$.\n\n**Output:**\n\nOutput $q$ integers. The $i$-th integer is the maximum number of diagonal moves for the $i$-th query. If it is impossible to reach the point, output -1."}, {"prompt_md5": "d6698e02", "template_md5": "465699a0", "result": "You are given a series of target points and a number of moves allowed.  For each target point, determine the maximum number of diagonal moves possible to reach it within the given number of moves. If it's impossible to reach the target point in the given moves, output -1."}]}