{"uid": "1037-D", "url": "https://codeforces.com/contest/1037/problem/D", "tags": ["dfs and similar", " graphs", " shortest paths", " trees"], "title": "1037-D", "statement": "D. Valid BFS?time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTheBFSalgorithm is defined as follows.Consider an undirected graph with vertices numbered from $$$1$$$ to $$$n$$$. Initialize $$$q$$$ as a newqueuecontaining only vertex $$$1$$$, mark the vertex $$$1$$$ as used.Extract a vertex $$$v$$$ from the head of the queue $$$q$$$.Print the index of vertex $$$v$$$.Iterate in arbitrary order through all such vertices $$$u$$$ that $$$u$$$ is a neighbor of $$$v$$$ and is not marked yet as used. Mark the vertex $$$u$$$ as used and insert it into the tail of the queue $$$q$$$.If the queue is not empty, continue from step2.Otherwise finish.Since the order of choosing neighbors of each vertex can vary, it turns out that there may be multiple sequences whichBFScan print.In this problem you need to check whether a given sequence corresponds to some validBFStraversal of the given treestarting from vertex $$$1$$$. Thetreeis an undirected graph, such that there is exactly one simple path between any two vertices.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) which denotes the number of nodes in the tree.The following $$$n - 1$$$ lines describe the edges of the tree. Each of them contains two integers $$$x$$$ and $$$y$$$ ($$$1 \\\\le x, y \\\\le n$$$) — the endpoints of the corresponding edge of the tree. It is guaranteed that the given graph is a tree.The last line contains $$$n$$$ distinct integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le n$$$) — the sequence to check.OutputPrint \"Yes\" (quotes for clarity) if the sequence corresponds to some validBFStraversal of the given tree and \"No\" (quotes for clarity) otherwise.You can print each letter in any case (upper or lower).ExamplesInput41 21 32 41 2 3 4OutputYesInput41 21 32 41 2 4 3OutputNoNoteBoth sample tests have the same tree in them.In this tree, there are two validBFSorderings:$$$1, 2, 3, 4$$$,$$$1, 3, 2, 4$$$.The ordering $$$1, 2, 4, 3$$$ doesn't correspond to any validBFSorder.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ef3ef66f", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes. The tree is represented by $n-1$ edges, where each edge connects two nodes. You are also given a sequence of $n$ nodes. \n\nDetermine if the given sequence is a valid Breadth-First Search (BFS) traversal of the tree starting from node 1.\n\n**BFS Algorithm:**\n\n1. Start at node 1.\n2. Visit all unvisited neighbors of the current node.\n3. Mark the current node as visited.\n4. Repeat step 2 for each unvisited neighbor.\n\n**Input:**\n\n* The first line contains an integer $n$ ($1 \\le n \\le 2 \\cdot 10^5$), the number of nodes in the tree.\n* The next $n-1$ lines each contain two integers $x$ and $y$ ($1 \\le x, y \\le n$), representing an edge between nodes $x$ and $y$.\n* The last line contains $n$ distinct integers $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le n$), the sequence to check.\n\n**Output:**\n\nPrint \"Yes\" if the sequence is a valid BFS traversal, and \"No\" otherwise."}, {"prompt_md5": "291739b4", "template_md5": "465699a0", "result": "Given a tree and a sequence of numbers, determine if the sequence represents a valid order in which you could visit all the nodes of the tree, starting from node 1, following a specific visiting rule (like a breadth-first search)."}]}