{"uid": "1038-C", "url": "https://codeforces.com/contest/1038/problem/C", "tags": ["greedy", " sortings"], "title": "1038-C", "statement": "C. Gamblingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTwo players A and B have a list of $$$n$$$ integers each. They both want to maximize the subtraction between their score and their opponent's score.In one turn, a player can either add to his score any element from his list (assuming his list is not empty), the element is removed from the list afterward. Or remove an element from his opponent's list (assuming his opponent's list is not empty).Note, that in case there are equal elements in the list only one of them will be affected in the operations above. For example, if there are elements $$$\\\\{1, 2, 2, 3\\\\}$$$ in a list and you decided to choose $$$2$$$ for the next turn, only a single instance of $$$2$$$ will be deleted (and added to the score, if necessary).The player A starts the game and the game stops when both lists are empty. Find the difference between A's score and B's score at the end of the game, if both of the players are playing optimally.Optimal play between two players means that both players choose the best possible strategy to achieve the best possible outcome for themselves. In this problem, it means that each player, each time makes a move, which maximizes the final difference between his score and his opponent's score, knowing that the opponent is doing the same.InputThe first line of input contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le 100\\\\,000$$$) — the sizes of the list.The second line contains $$$n$$$ integers $$$a_i$$$ ($$$1 \\\\le a_i \\\\le 10^6$$$), describing the list of the player A, who starts the game.The third line contains $$$n$$$ integers $$$b_i$$$ ($$$1 \\\\le b_i \\\\le 10^6$$$), describing the list of the player B.OutputOutput the difference between A's score and B's score ($$$A-B$$$) if both of them are playing optimally.ExamplesInput21 45 1Output0Input3100 100 100100 100 100Output0Input22 15 6Output-3NoteIn the first example, the game could have gone as follows:A removes $$$5$$$ from B's list.B removes $$$4$$$ from A's list.A takes his $$$1$$$.B takes his $$$1$$$.Hence, A's score is $$$1$$$, B's score is $$$1$$$ and difference is $$$0$$$.There is also another optimal way of playing:A removes $$$5$$$ from B's list.B removes $$$4$$$ from A's list.A removes $$$1$$$ from B's list.B removes $$$1$$$ from A's list.The difference in the scores is still $$$0$$$.In the second example, irrespective of the moves the players make, they will end up with the same number of numbers added to their score, so the difference will be $$$0$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "37db60cf", "template_md5": "35d339e4", "result": "Two players have lists of integers.  They take turns adding an integer from their own list to their score, or removing an integer from their opponent's list.  The player with the largest difference between their score and their opponent's score at the end wins.  \n\nWhat is the difference in scores if both players play optimally?\n\n**Input:**\n\n* The first line contains an integer $n$ ($1 \\le n \\le 100,000$) representing the size of each list.\n* The second line contains $n$ integers $a_i$ ($1 \\le a_i \\le 10^6$) representing player 1's list.\n* The third line contains $n$ integers $b_i$ ($1 \\le b_i \\le 10^6$) representing player 2's list.\n\n**Output:**\n\n* Output the difference between player 1's score and player 2's score ($A-B$) if both players play optimally."}, {"prompt_md5": "67d0aec6", "template_md5": "465699a0", "result": "Two players have lists of numbers. They take turns adding a number from their own list to their score or taking a number from the opponent's list. The player with the biggest difference between their score and their opponent's score at the end wins. What is the winning difference if both players play perfectly?"}]}