{"uid": "1041-F", "url": "https://codeforces.com/contest/1041/problem/F", "tags": ["data structures", " divide and conquer", " dp", " math"], "title": "1041-F", "statement": "F. Ray in the tubetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a tube which is reflective inside represented as two non-coinciding, but parallel to $$$Ox$$$ lines. Each line has some special integer points — positions of sensors on sides of the tube.You are going to emit a laser ray in the tube. To do so, you have to choosetwointeger points $$$A$$$ and $$$B$$$ on the first and the second line respectively (coordinates can be negative): the point $$$A$$$ is responsible for the position of the laser, and the point $$$B$$$ — for the direction of the laser ray. The laser ray is a ray starting at $$$A$$$ and directed at $$$B$$$ which will reflect from the sides of the tube (it doesn't matter if there are any sensors at a reflection point or not). A sensor will only register the ray if the ray hits exactly at the position of the sensor.Examples of laser rays. Note that image contains two examples. The $$$3$$$ sensors (denoted by black bold points on the tube sides) will register the blue ray but only $$$2$$$ will register the red.Calculate the maximum number of sensors which can register your ray if you choose points $$$A$$$ and $$$B$$$ on the first and the second lines respectively.InputThe first line contains two integers $$$n$$$ and $$$y_1$$$ ($$$1 \\\\le n \\\\le 10^5$$$, $$$0 \\\\le y_1 \\\\le 10^9$$$) — number of sensors on the first line and its $$$y$$$ coordinate.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$0 \\\\le a_i \\\\le 10^9$$$) — $$$x$$$ coordinates of the sensors on the first line in the ascending order.The third line contains two integers $$$m$$$ and $$$y_2$$$ ($$$1 \\\\le m \\\\le 10^5$$$, $$$y_1 < y_2 \\\\le 10^9$$$) — number of sensors on the second line and its $$$y$$$ coordinate.The fourth line contains $$$m$$$ integers $$$b_1, b_2, \\\\ldots, b_m$$$ ($$$0 \\\\le b_i \\\\le 10^9$$$) — $$$x$$$ coordinates of the sensors on the second line in the ascending order.OutputPrint the only integer — the maximum number of sensors which can register the ray.ExampleInput3 11 5 61 33Output3NoteOne of the solutions illustrated on the image by pair $$$A_2$$$ and $$$B_2$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d6dbd40b", "template_md5": "35d339e4", "result": "You are given two parallel lines representing the inside of a reflective tube. Each line has a set of points representing sensors. \n\nYou need to choose two points, one on each line, to represent the starting position and direction of a laser beam. The laser beam will reflect off the sides of the tube.\n\nA sensor will register the beam only if the beam hits the exact position of the sensor.\n\nFind the maximum number of sensors that can be registered by the laser beam.\n\n**Input:**\n\n* The first line contains two integers,  $n$ and $y_1$ ($1 \\le n \\le 10^5$, $0 \\le y_1 \\le 10^9$), representing the number of sensors on the first line and its y-coordinate.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 \\le a_i \\le 10^9$), representing the x-coordinates of the sensors on the first line in ascending order.\n* The third line contains two integers, $m$ and $y_2$ ($1 \\le m \\le 10^5$, $y_1 < y_2 \\le 10^9$), representing the number of sensors on the second line and its y-coordinate.\n* The fourth line contains $m$ integers $b_1, b_2, ..., b_m$ ($0 \\le b_i \\le 10^9$), representing the x-coordinates of the sensors on the second line in ascending order.\n\n**Output:**\n\n* Print a single integer, representing the maximum number of sensors that can be registered by the laser beam."}, {"prompt_md5": "918a7398", "template_md5": "465699a0", "result": "You have two parallel lines with points on them.  You need to choose a point on each line.  A laser beam will shoot from one point to the other, bouncing off the lines.  Find the maximum number of points the laser beam can hit."}]}