{"uid": "1044-E", "url": "https://codeforces.com/contest/1044/problem/E", "tags": ["implementation"], "title": "1044-E", "statement": "E. Grid Sorttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an $$$n \\\\times m$$$ grid. Each grid cell is filled with a unique integer from $$$1$$$ to $$$nm$$$ so that each integer appears exactly once.In one operation, you can choose an arbitrary cycle of the grid and move all integers along that cycle one space over. Here, a cycle is any sequence that satisfies the following conditions:There are at least four squares.Each square appears at most once.Every pair of adjacent squares, and also the first and last squares, share an edge.For example, if we had the following grid:We can choose an arbitrary cycle like this one:To get the following grid:In this particular case, the chosen cycle can be represented as the sequence $$$[1, 2, 3, 6, 5, 8, 7, 4]$$$, the numbers are in the direction that we want to rotate them in.Find any sequence of operations to sort the grid so that the array created by concatenating the rows from the highest to the lowest is sorted (look at the first picture above).Note you do not need to minimize number of operations or sum of cycle lengths. The only constraint is that the sum of all cycles lengths must not be greater than $$$10^5$$$. We can show that an answer always exists under the given constraints. Output any valid sequence of moves that will sort the grid.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$3 \\\\leq n,m \\\\leq 20$$$) — the dimensions of the grid.Each of the next $$$n$$$ lines contains $$$m$$$ integers $$$x_{i,1}, x_{i,2}, \\\\ldots, x_{i, m}$$$ ($$$1 \\\\leq x_{i,j} \\\\leq nm$$$), denoting the values of the block in row $$$i$$$ and column $$$j$$$.It is guaranteed that all $$$x_{i,j}$$$ are distinct.OutputFirst, print a single integer $$$k$$$, the number of operations ($$$k \\\\geq 0$$$).On each of the next $$$k$$$ lines, print a cycle as follows:$$$$$$s\\\\ y_1\\\\ y_2\\\\ \\\\ldots\\\\ y_s$$$$$$Here, $$$s$$$ is the number of blocks to move ($$$s \\\\geq 4$$$). Here we have block $$$y_1$$$ moving to where block $$$y_2$$$ is, block $$$y_2$$$ moving to where block $$$y_3$$$ is, and so on with block $$$y_s$$$ moving to where block $$$y_1$$$ is.The sum of $$$s$$$ over all operations must be at most $$$10^5$$$.ExamplesInput3 34 1 27 6 38 5 9Output18 1 4 7 8 5 6 3 2Input3 51 2 3 5 1011 6 4 14 912 7 8 13 15Output34 4 14 13 84 5 10 9 44 12 7 6 11NoteThe first sample is the case in the statement. Here, we can use the cycle in reverse order to sort the grid.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f557fce8", "template_md5": "465699a0", "result": "You are given a grid of numbers. Each number appears only once. You can swap numbers in a cycle within the grid (a cycle is a closed loop of numbers that share edges). Find a sequence of these swaps to sort the grid so that the numbers in each column are in increasing order when read from top to bottom."}, {"prompt_md5": "33313362", "template_md5": "35d339e4", "result": "You are given a grid of numbers. Each cell in the grid contains a unique number from 1 to the total number of cells in the grid.  \n\nYou can perform the following operation any number of times:\n\n* Choose a cycle of at least four cells in the grid. A cycle is a sequence of cells where each cell is connected to the next cell by a shared edge (horizontally or vertically), and the last cell connects back to the first cell.\n* Move all the numbers in the cycle one position to the right.\n\nYour goal is to find a sequence of these operations that will sort the grid so that when you read the rows from top to bottom, the numbers are in ascending order.\n\n**Input:**\n\n* The first line contains two integers,  $n$ and $m$, representing the number of rows and columns in the grid.\n* The next $n$ lines each contain $m$ integers, representing the numbers in each cell of the grid.\n\n**Output:**\n\n* The first line should contain an integer $k$, representing the number of operations you will perform.\n* Each of the next $k$ lines should describe a single operation. Each line will contain a sequence of integers representing the cells in a cycle.\n\n**Constraints:**\n\n* $3 \\le n, m \\le 20$\n* The sum of the lengths of all cycles used in the operations must be at most $10^5$.\n\n\n\nLet me know if you have any other questions."}]}