{"uid": "1045-F", "url": "https://codeforces.com/contest/1045/problem/F", "tags": ["geometry", " math"], "title": "1045-F", "statement": "F. Shady Ladytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAni and Borna are playing a short game on a two-variable polynomial. It's a special kind of a polynomial: the monomials are fixed, but all of its coefficients are fill-in-the-blanks dashes, e.g. $$$$$$ \\\\_ xy + \\\\_ x^4 y^7 + \\\\_ x^8 y^3 + \\\\ldots $$$$$$Borna will fill in the blanks with positive integers. He wants the polynomial to bebounded from below, i.e. his goal is to make sure there exists a real number $$$M$$$ such that the value of the polynomial at any point is greater than $$$M$$$.Ani is mischievous, and wants the polynomial to be unbounded. Along with stealing Borna's heart, she can also steal parts of polynomials. Ani is only a petty kind of thief, though: she can only stealat most onemonomial from the polynomial before Borna fills in the blanks.If Ani and Borna play their only moves optimally, who wins?InputThe first line contains a positive integer $$$N$$$ $$$(2 \\\\leq N \\\\leq 200\\\\, 000)$$$, denoting the number of the terms in the starting special polynomial.Each of the following $$$N$$$ lines contains a description of a monomial: the $$$k$$$-th line contains two **space**-separated integers $$$a_k$$$ and $$$b_k$$$ $$$(0 \\\\leq a_k, b_k \\\\leq 10^9$$$) which mean the starting polynomial has the term $$$\\\\_ x^{a_k} y^{b_k}$$$. It is guaranteed that for $$$k \\\\neq l$$$, either $$$a_k \\\\neq a_l$$$ or $$$b_k \\\\neq b_l$$$.OutputIf Borna can always choose the coefficients such that the resulting polynomial is bounded from below, regardless of what monomial Ani steals, output \"Borna\". Else, output \"Ani\".You shouldn't output the quotation marks.ExamplesInput31 12 00 2OutputAniInput40 00 10 20 8OutputBornaNoteIn the first sample, the initial polynomial is $$$\\\\_xy+ \\\\_x^2 + \\\\_y^2$$$. If Ani steals the $$$\\\\_y^2$$$ term, Borna is left with $$$\\\\_xy+\\\\_x^2$$$. Whatever positive integers are written on the blanks, $$$y \\\\rightarrow -\\\\infty$$$ and $$$x := 1$$$ makes the whole expression go to negative infinity.In the second sample, the initial polynomial is $$$\\\\_1 + \\\\_x + \\\\_x^2 + \\\\_x^8$$$. One can check that no matter what term Ani steals, Borna can always win.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8ea72cff", "template_md5": "35d339e4", "result": "You are given a polynomial with terms of the form $x^a y^b$ where $a$ and $b$ are non-negative integers.  Some of the coefficients of these terms are missing.\n\nTwo players take turns. The first player (let's call them Player 1) can choose a missing coefficient and assign it a positive integer. The second player (Player 2) can choose one term from the polynomial and remove it.\n\nThe game ends when all the coefficients have been assigned.\n\n* **Player 1's goal:** Make the polynomial bounded from below, meaning there exists a real number $M$ such that the value of the polynomial is always greater than $M$ for any real numbers $x$ and $y$.\n\n* **Player 2's goal:** Make the polynomial unbounded, meaning there is no such real number $M$.\n\nDetermine who wins the game if both players play optimally."}, {"prompt_md5": "279a145d", "template_md5": "465699a0", "result": "You are given a set of terms.  Player 1 can choose positive numbers to fill in the blanks of these terms. Player 2 can remove one term. The goal of Player 1 is to make the resulting expression always be greater than some number. The goal of Player 2 is to make the expression not always be greater than some number.  Who wins if both players play optimally?"}]}