{"uid": "1046-C", "url": "https://codeforces.com/contest/1046/problem/C", "tags": ["greedy"], "title": "1046-C", "statement": "C. Space Formulatime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputFormula 1 officials decided to introduce new competition. Cars are replaced by space ships and number of points awarded can differ per race.Given the current ranking in the competition and points distribution for the next race, your task is to calculate the best possible ranking for a given astronaut after the next race. It's guaranteed that given astronaut will have unique number of points before the race.InputThe first line contains two integer numbers $$$N$$$ ($$$1 \\\\leq N \\\\leq 200000$$$) representing number of F1 astronauts, and current position of astronaut $$$D$$$ ($$$1 \\\\leq D \\\\leq N$$$) you want to calculate best ranking for (no other competitor will have the same number of points before the race).The second line contains $$$N$$$ integer numbers $$$S_k$$$ ($$$0 \\\\leq S_k \\\\leq 10^8$$$, $$$k=1...N$$$), separated by a single space, representing current ranking of astronauts. Points are sorted in non-increasing order.The third line contains $$$N$$$ integer numbers $$$P_k$$$ ($$$0 \\\\leq P_k \\\\leq 10^8$$$, $$$k=1...N$$$), separated by a single space, representing point awards for the next race. Points are sorted in non-increasing order, so winner of the race gets the maximum number of points.OutputOutput contains one integer number — the best possible ranking for astronaut after the race. If multiple astronauts have the same score after the race, they all share the best ranking.ExampleInput4 350 30 20 1015 10 7 3Output2NoteIf the third ranked astronaut wins the race, he will have 35 points. He cannot take the leading position, but he can overtake the second position if the second ranked astronaut finishes the race at the last position.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1788fef6", "template_md5": "35d339e4", "result": "You are given a list of $N$ astronauts and their current points.  The points are sorted in non-increasing order, meaning the first astronaut has the most points. You are also given a list of points that will be awarded in the next race, also sorted in non-increasing order.  \n\nFind the best possible ranking an astronaut with $D$ points can achieve after the next race. \n\n\n* $1 \\le N \\le 200000$\n* $1 \\le D \\le N$\n* $0 \\le S_k, P_k \\le 10^8$ \n* $S_k$ represents the current points of the $k$th astronaut.\n* $P_k$ represents the points awarded to the $k$th place finisher in the next race."}, {"prompt_md5": "5ab46919", "template_md5": "465699a0", "result": "You are given a list of current rankings and points awarded for the next competition.  Determine the best possible ranking an astronaut can achieve after the next competition."}]}