{"uid": "1046-F", "url": "https://codeforces.com/contest/1046/problem/F", "tags": ["implementation"], "title": "1046-F", "statement": "F. Splitting moneytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter finding and moving to the new planet that supports human life, discussions started on which currency should be used. After long negotiations, Bitcoin was ultimately chosen as the universal currency.These were the great news for Alice, whose grandfather got into Bitcoin mining in 2013, and accumulated a lot of them throughout the years. Unfortunately, when paying something in bitcoin everyone can see how many bitcoins you have in your public address wallet.This worried Alice, so she decided to split her bitcoins among multiple different addresses, so that every address has at most $$$x$$$ satoshi (1 bitcoin = $$$10^8$$$ satoshi). She can create new public address wallets for free and is willing to pay $$$f$$$ fee in satoshi per transaction to ensure acceptable speed of transfer. The fee is deducted from the address the transaction was sent from. Tell Alice how much total fee in satoshi she will need to pay to achieve her goal.InputFirst line contains number $$$N$$$ ($$$1 \\\\leq N \\\\leq 200\\\\,000$$$) representing total number of public addresses Alice has.Next line contains $$$N$$$ integer numbers $$$a_i$$$ ($$$1 \\\\leq a_i \\\\leq 10^9$$$) separated by a single space, representing how many satoshi Alice has in her public addresses.Last line contains two numbers $$$x$$$, $$$f$$$ ($$$1 \\\\leq f < x \\\\leq 10^9$$$) representing maximum number of satoshies Alice can have in one address, as well as fee in satoshies she is willing to pay per transaction.OutputOutput one integer number representing total fee in satoshi Alice will need to pay to achieve her goal.ExampleInput313 7 66 2Output4NoteAlice can make two transactions in a following way:0. 13 7 6 (initial state)1. 6 7 6 5 (create new address and transfer from first public address 5 satoshies)2. 6 4 6 5 1 (create new address and transfer from second address 1 satoshi)Since cost per transaction is 2 satoshies, total fee is 4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "86fae6fe", "template_md5": "35d339e4", "result": "You are given a list of $N$ integers, where each integer represents the number of satoshi (a unit of Bitcoin) in a specific wallet.  You need to split the satoshies among the wallets so that no wallet has more than $x$ satoshi.  Each time you transfer satoshies between wallets, a fee of $f$ satoshi is charged.  Find the minimum total fee required to achieve this distribution.\n\nInput:\n\n* The first line contains an integer $N$ ($1 \\leq N \\leq 200,000$) representing the number of wallets.\n* The second line contains $N$ integers $a_i$ ($1 \\leq a_i \\leq 10^9$) representing the number of satoshi in each wallet.\n* The last line contains two integers $x$ and $f$ ($1 \\leq f < x \\leq 10^9$) representing the maximum allowed satoshi per wallet and the transaction fee, respectively.\n\nOutput:\n\n* Output a single integer representing the minimum total fee required."}, {"prompt_md5": "e84852a2", "template_md5": "465699a0", "result": "You have a certain number of items, each with a specific value. You want to divide these items into groups, with each group having a maximum value limit.  Each time you move an item to a new group, it costs a fixed amount. Find the minimum total cost to divide all the items into groups that meet the value limit."}]}