{"uid": "105-B", "url": "https://codeforces.com/contest/105/problem/B", "tags": ["brute force", " probabilities"], "title": "105-B", "statement": "B. Dark Assemblytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDark Assembly is a governing body in the Netherworld. Here sit the senators who take the most important decisions for the player. For example, to expand the range of the shop or to improve certain characteristics of the character the Dark Assembly's approval is needed.The Dark Assembly consists ofnsenators. Each of them is characterized by hislevelandloyaltyto the player. The level is a positive integer which reflects a senator's strength. Loyalty is the probability of a positive decision in the voting, which is measured as a percentage with precision of up to10%.Senators make decisions by voting. Each of them makes a positive or negative decision in accordance with their loyalty. Ifstrictly morethan half of the senators take a positive decision, the player's proposal is approved.If the player's proposal is not approved after the voting, then the player may appeal against the decision of the Dark Assembly. To do that, player needs to kill all the senators that voted against (there's nothing wrong in killing senators, they will resurrect later and will treat the player even worse). The probability that a player will be able to kill a certain group of senators is equal toA/ (A+B), whereAis the sum of levels of all player's characters andBis the sum of levels of all senators in this group. If the player kills all undesired senators, then his proposal is approved.Senators are very fond of sweets. They can be bribed by giving them candies. For each received candy a senator increases his loyalty to the player by10%. It's worth to mention that loyalty cannot exceed100%. The player can take no more thanksweets to the courtroom. Candies should be given to the senatorsbeforethe start of voting.Determine the probability that the Dark Assembly approves the player's proposal if the candies are distributed among the senators in the optimal way.InputThe first line contains three integersn,kandA(1 ≤n,k≤ 8,1 ≤A≤ 9999).Thennlines follow. Thei-th of them contains two numbers —biandli— thei-th senator's level and his loyalty.The levels of all senators are integers in range from1to9999(inclusive). The loyalties of all senators are integers in range from0to100(inclusive) and all of them are divisible by10.OutputPrint one real number with precision10- 6— the maximal possible probability that the Dark Assembly approves the player's proposal for the best possible distribution of candies among the senators.ExamplesInput5 6 10011 8014 9023 7080 30153 70Output1.0000000000Input5 3 10011 8014 9023 7080 30153 70Output0.9628442962Input1 3 2020 20Output0.7500000000NoteIn the first sample the best way of candies' distribution is giving them to first three of the senators. It ensures most of votes.It the second sample player should give all three candies to the fifth senator.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "693cac41", "template_md5": "35d339e4", "result": "There are $n$ senators who vote on a proposal. Each senator has a level ($l_i$) and a loyalty ($b_i$) which is a percentage between 0% and 100%.  \n\n* A senator votes \"yes\" with a probability equal to their loyalty.\n* The proposal is approved if more than half the senators vote \"yes\".\n\nThe player can bribe senators with candies. Each candy increases a senator's loyalty by 10%, up to a maximum of 100%. The player has $k$ candies.\n\nThe player can also kill senators who vote \"no\". The probability of killing a group of senators is $\\frac{A}{A+B}$, where $A$ is the sum of the levels of the player's characters and $B$ is the sum of the levels of the senators to be killed.\n\n**Problem:**\n\nFind the maximum probability that the proposal is approved after optimally distributing the candies among the senators."}, {"prompt_md5": "65076073", "template_md5": "465699a0", "result": "You have a group of people who vote on a proposal. Each person has a level and a loyalty percentage.  A proposal passes if more than half the people vote yes.  You can increase a person's loyalty by giving them a candy, up to 100%.  \n\nFind the highest probability the proposal will pass if you distribute candies optimally."}]}