{"uid": "1051-D", "url": "https://codeforces.com/contest/1051/problem/D", "tags": ["bitmasks", " dp"], "title": "1051-D", "statement": "D. Bicoloringstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a grid, consisting of $$$2$$$ rows and $$$n$$$ columns. Each cell of this grid should be colored either black or white.Two cells are considered neighbours if they have acommon borderand share the same color. Two cells $$$A$$$ and $$$B$$$ belong to the same component if they are neighbours, or if there is a neighbour of $$$A$$$ that belongs to the same component with $$$B$$$.Let's call some bicoloringbeautifulif it has exactly $$$k$$$ components.Count the number ofbeautifulbicolorings. The number can be big enough, so print the answer modulo $$$998244353$$$.InputThe only line contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 1000$$$, $$$1 \\\\le k \\\\le 2n$$$) — the number of columns in a grid and the number of components required.OutputPrint a single integer — the number ofbeautifulbicolorings modulo $$$998244353$$$.ExamplesInput3 4Output12Input4 1Output2Input1 2Output2NoteOne of possible bicolorings in sample $$$1$$$:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2b6320a", "template_md5": "35d339e4", "result": "You are given a grid with 2 rows and $n$ columns. Each cell in the grid can be colored black or white.  \n\nTwo cells are considered neighbors if they share a side and have the same color. Two cells belong to the same component if they are neighbors, or if there is a neighbor of one cell that belongs to the same component as the other.\n\nA coloring is considered \"beautiful\" if it has exactly $k$ components.\n\nCount the number of beautiful colorings. The answer may be very large, so print it modulo 998244353."}, {"prompt_md5": "b72f0741", "template_md5": "465699a0", "result": "You have a grid of squares. You need to color each square black or white.  The coloring is considered \"beautiful\" if it has exactly *k* groups of connected squares (where connected means sharing a side and having the same color).  How many different beautiful colorings are there?"}]}