{"uid": "1059-D", "url": "https://codeforces.com/contest/1059/problem/D", "tags": ["binary search", " geometry", " ternary search"], "title": "1059-D", "statement": "D. Nature Reservetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is a forest that we model as a plane and live $$$n$$$ rare animals. Animal number $$$i$$$ has its lair in the point $$$(x_{i}, y_{i})$$$. In order to protect them, a decision to build a nature reserve has been made.The reserve must have a form of a circle containing all lairs. There is also a straight river flowing through the forest. All animals drink from this river, therefore it must have at least one common point with the reserve. On the other hand, ships constantly sail along the river, so the reserve must not have more than one common point with the river.For convenience, scientists have made a transformation of coordinates so that the river is defined by $$$y = 0$$$. Check whether it is possible to build a reserve, and if possible, find the minimum possible radius of such a reserve.InputThe first line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$) — the number of animals.Each of the next $$$n$$$ lines contains two integers $$$x_{i}$$$, $$$y_{i}$$$ ($$$-10^7 \\\\le x_{i}, y_{i} \\\\le 10^7$$$) — the coordinates of the $$$i$$$-th animal's lair. It is guaranteed that $$$y_{i} \\\\neq 0$$$. No two lairs coincide.OutputIf the reserve cannot be built, print $$$-1$$$. Otherwise print the minimum radius. Your answer will be accepted if absolute or relative error does not exceed $$$10^{-6}$$$.Formally, let your answer be $$$a$$$, and the jury's answer be $$$b$$$. Your answer is considered correct if $$$\\\\frac{|a - b|}{\\\\max{(1, |b|)}} \\\\le 10^{-6}$$$.ExamplesInput10 1Output0.5Input30 10 20 -3Output-1Input20 11 1Output0.625NoteIn the first sample it is optimal to build the reserve with the radius equal to $$$0.5$$$ and the center in $$$(0,\\\\ 0.5)$$$.In the second sample it is impossible to build a reserve.In the third sample it is optimal to build the reserve with the radius equal to $$$\\\\frac{5}{8}$$$ and the center in $$$(\\\\frac{1}{2},\\\\ \\\\frac{5}{8})$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6930613c", "template_md5": "35d339e4", "result": "You are given the coordinates of $n$ points in a 2D plane.  These points represent the lairs of rare animals.  You need to determine if it is possible to construct a circle that:\n\n* Contains all $n$ points (i.e., all lairs are inside the circle).\n* Intersects the x-axis (representing a river) at exactly one point.\n\nIf such a circle can be built, find the smallest possible radius of this circle. If it is impossible to build such a circle, output -1."}, {"prompt_md5": "03286d65", "template_md5": "465699a0", "result": "You are given a set of points representing animal lairs.  You need to find the smallest circle that encloses all the points and touches the x-axis (representing a river) at exactly one point. If such a circle cannot be found, output -1."}]}