{"uid": "1059-A", "url": "https://codeforces.com/contest/1059/problem/A", "tags": ["implementation"], "title": "1059-A", "statement": "A. Cashiertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya has recently got a job as a cashier at a local store. His day at work is $$$L$$$ minutes long. Vasya has already memorized $$$n$$$ regular customers, the $$$i$$$-th of which comes after $$$t_{i}$$$ minutes after the beginning of the day, and his service consumes $$$l_{i}$$$ minutes. It is guaranteed that no customer will arrive while Vasya is servicing another customer.Vasya is a bit lazy, so he likes taking smoke breaks for $$$a$$$ minutes each. Those breaks may go one after another, but Vasya must be present at work during all the time periods he must serve regular customers, otherwise one of them may alert his boss. What is the maximum number of breaks Vasya can take during the day?InputThe first line contains three integers $$$n$$$, $$$L$$$ and $$$a$$$ ($$$0 \\\\le n \\\\le 10^{5}$$$, $$$1 \\\\le L \\\\le 10^{9}$$$, $$$1 \\\\le a \\\\le L$$$).The $$$i$$$-th of the next $$$n$$$ lines contains two integers $$$t_{i}$$$ and $$$l_{i}$$$ ($$$0 \\\\le t_{i} \\\\le L - 1$$$, $$$1 \\\\le l_{i} \\\\le L$$$). It is guaranteed that $$$t_{i} + l_{i} \\\\le t_{i + 1}$$$ and $$$t_{n} + l_{n} \\\\le L$$$.OutputOutput one integer  — the maximum number of breaks.ExamplesInput2 11 30 11 1Output3Input0 5 2Output2Input1 3 21 2Output0NoteIn the first sample Vasya can take $$$3$$$ breaks starting after $$$2$$$, $$$5$$$ and $$$8$$$ minutes after the beginning of the day.In the second sample Vasya can take $$$2$$$ breaks starting after $$$0$$$ and $$$2$$$ minutes after the beginning of the day.In the third sample Vasya can't take any breaks.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "203ef06f", "template_md5": "35d339e4", "result": "You are given a workday length $L$ and a list of $n$ customers, each arriving at time $t_i$ and requiring $l_i$ minutes of service.  The customer service times do not overlap.  You can take breaks of length $a$ minutes.  \n\nFind the maximum number of breaks you can take during the workday without missing any customer service times."}, {"prompt_md5": "4b3b189b", "template_md5": "465699a0", "result": "You have a workday of a given length. Customers arrive at specific times and need a certain amount of service time. You can take breaks of a fixed length, but you must be available to serve customers when they arrive. Find the maximum number of breaks you can take."}]}