{"uid": "106-C", "url": "https://codeforces.com/contest/106/problem/C", "tags": ["dp"], "title": "106-C", "statement": "C. Bunstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLavrenty, a baker, is going to make several buns with stuffings and sell them.Lavrenty hasngrams of dough as well asmdifferent stuffing types. The stuffing types are numerated from 1 tom. Lavrenty knows that he hasaigrams left of thei-th stuffing. It takes exactlybigrams of stuffingiandcigrams of dough to cook a bun with thei-th stuffing. Such bun can be sold forditugriks.Also he can make bunswithout stuffings. Each of such buns requiresc0grams of dough and it can be sold ford0tugriks. So Lavrenty can cook any number of buns with different stuffings or without it unless he runs out of dough and the stuffings. Lavrenty throws away all excess material left after baking.Find the maximum number of tugriks Lavrenty can earn.InputThe first line contains4integersn,m,c0andd0(1 ≤n≤ 1000,1 ≤m≤ 10,1 ≤c0,d0≤ 100). Each of the followingmlines contains4integers. Thei-th line contains numbersai,bi,cianddi(1 ≤ai,bi,ci,di≤ 100).OutputPrint the only number — the maximum number of tugriks Lavrenty can earn.ExamplesInput10 2 2 17 3 2 10012 3 1 10Output241Input100 1 25 5015 5 20 10Output200NoteTo get the maximum number of tugriks in the first sample, you need to cook 2 buns with stuffing 1, 4 buns with stuffing 2 and a bun without any stuffing.In the second sample Lavrenty should cook 4 buns without stuffings.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4a2bf8de", "template_md5": "35d339e4", "result": "You are given $n$ grams of dough and $m$ types of stuffing. Each stuffing type $i$ has $a_i$ grams available. It takes $b_i$ grams of stuffing $i$ and $c_i$ grams of dough to make a bun with stuffing $i$, which sells for $d_i$ tugriks. You can also make buns without stuffing, which require $c_0$ grams of dough and sell for $d_0$ tugriks.\n\nFind the maximum number of tugriks you can earn by making buns with and without stuffing, given the constraints of available dough and stuffing."}, {"prompt_md5": "5b30ddc6", "template_md5": "465699a0", "result": "You have a limited amount of dough and several types of stuffing. Each type of stuffing requires a specific amount of stuffing and dough to make a product that can be sold for a certain price. You can also make products without stuffing, which require dough only and sell for a different price.  Find the maximum amount of money you can make by making products with and without stuffing, given the limited resources."}]}