{"uid": "1060-F", "url": "https://codeforces.com/contest/1060/problem/F", "tags": ["combinatorics", " dp"], "title": "1060-F", "statement": "F. Shrinking Treetime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputConsider a tree $$$T$$$ (that is, a connected graph without cycles) with $$$n$$$ vertices labelled $$$1$$$ through $$$n$$$. We start the following process with $$$T$$$: while $$$T$$$ has more than one vertex, do the following:choose a random edge of $$$T$$$ equiprobably;shrinkthe chosen edge: if the edge was connecting vertices $$$v$$$ and $$$u$$$, erase both $$$v$$$ and $$$u$$$ and create a new vertex adjacent to all vertices previously adjacent to either $$$v$$$ or $$$u$$$. The new vertex is labelled either $$$v$$$ or $$$u$$$ equiprobably.At the end of the process, $$$T$$$ consists of a single vertex labelled with one of the numbers $$$1, \\\\ldots, n$$$. For each of the numbers, what is the probability of this number becoming the label of the final vertex?InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 50$$$).The following $$$n - 1$$$ lines describe the tree edges. Each of these lines contains two integers $$$u_i, v_i$$$ — labels of vertices connected by the respective edge ($$$1 \\\\leq u_i, v_i \\\\leq n$$$, $$$u_i \\\\neq v_i$$$). It is guaranteed that the given graph is a tree.OutputPrint $$$n$$$ floating numbers — the desired probabilities for labels $$$1, \\\\ldots, n$$$ respectively. All numbers should be correct up to $$$10^{-6}$$$ relative or absolute precision.ExamplesInput41 21 31 4Output0.12500000000.29166666670.29166666670.2916666667Input71 21 32 42 53 63 7Output0.08506944440.06640625000.06640625000.19552951390.19552951390.19552951390.1955295139NoteIn the first sample, the resulting vertex has label 1 if and only if for all three edges the label 1 survives, hence the probability is $$$1/2^3 = 1/8$$$. All other labels have equal probability due to symmetry, hence each of them has probability $$$(1 - 1/8) / 3 = 7/24$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "394ab2f9", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices labeled from 1 to $n$.  \n\nThe tree undergoes the following process:\n\n1.  Randomly choose an edge in the tree.\n2.  Remove the two vertices connected by the chosen edge.\n3.  Create a new vertex and connect it to all the vertices that were previously connected to the removed vertices.\n4.  Label the new vertex with one of the original vertex labels randomly.\n\nRepeat steps 1-4 until only one vertex remains.\n\nFor each label from 1 to $n$, what is the probability that this label will be the label of the final remaining vertex? \n\n\n\nInput:\n\nThe first line contains an integer $n$ ($1 \\le n \\le 50$).\n\nThe next $n-1$ lines describe the edges of the tree. Each line contains two integers $u_i$ and $v_i$ ($1 \\le u_i, v_i \\le n$, $u_i \\neq v_i$) representing the vertices connected by the edge.\n\nOutput:\n\nPrint $n$ floating-point numbers, each representing the probability that the corresponding label will be the final vertex label. The output should be accurate to at least 6 decimal places."}, {"prompt_md5": "3de55aee", "template_md5": "465699a0", "result": "You have a tree with numbered nodes.  You repeatedly choose a random edge and merge the two nodes it connects into a single new node.  What is the probability that a specific node will be the final remaining node?"}]}