{"uid": "1060-A", "url": "https://codeforces.com/contest/1060/problem/A", "tags": ["brute force"], "title": "1060-A", "statement": "A. Phone Numberstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputLet's call a stringa phone numberif it has length 11 and fits the pattern \"8xxxxxxxxxx\", where each \"x\" is replaced by a digit.For example, \"80123456789\" and \"80000000000\" are phone numbers, while \"8012345678\" and \"79000000000\" are not.You have $$$n$$$ cards with digits, and you want to use them to make as many phone numbers as possible. Each card must be used in at most one phone number, and you don't have to use all cards. The phone numbers do not necessarily have to be distinct.InputThe first line contains an integer $$$n$$$ — the number of cards with digits that you have ($$$1 \\\\leq n \\\\leq 100$$$).The second line contains a string of $$$n$$$ digits (characters \"0\", \"1\", ..., \"9\") $$$s_1, s_2, \\\\ldots, s_n$$$. The string will not contain any other characters, such as leading or trailing spaces.OutputIf at least one phone number can be made from these cards, output the maximum number of phone numbers that can be made. Otherwise, output 0.ExamplesInput1100000000008Output1Input220011223344556677889988Output2Input1131415926535Output0NoteIn the first example, one phone number, \"8000000000\", can be made from these cards.In the second example, you can make two phone numbers from the cards, for example, \"80123456789\" and \"80123456789\".In the third example you can't make any phone number from the given cards.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a8b5be34", "template_md5": "35d339e4", "result": "You have $n$ cards, each with a digit from 0 to 9.  You want to use these cards to create as many phone numbers as possible.  \n\nA phone number must:\n\n* Be 11 digits long.\n* Start with the digit '8'.\n* Use each digit on a card only once.\n\nHow many phone numbers can you create? If you can't create any phone numbers, output 0."}, {"prompt_md5": "df3cf777", "template_md5": "465699a0", "result": "You have a set of digits.  Determine the maximum number of 11-digit phone numbers you can create using these digits, where each number must start with \"8\" and each digit can only be used once."}]}