{"uid": "1060-D", "url": "https://codeforces.com/contest/1060/problem/D", "tags": ["greedy", " math"], "title": "1060-D", "statement": "D. Social Circlestime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou invited $$$n$$$ guests to dinner! You plan to arrange one or more circles of chairs. Each chair is going to be either occupied by one guest, or be empty. You can make any number of circles.Your guests happen to be a little bit shy, so the $$$i$$$-th guest wants to have a least $$$l_i$$$ free chairs to the left of his chair, and at least $$$r_i$$$ free chairs to the right. The \"left\" and \"right\" directions are chosen assuming all guests are going to be seated towards the center of the circle. Note that when a guest is the only one in his circle, the $$$l_i$$$ chairs to his left and $$$r_i$$$ chairs to his right may overlap.What is smallest total number of chairs you have to use?InputFirst line contains one integer $$$n$$$  — number of guests, ($$$1 \\\\leqslant n \\\\leqslant 10^5$$$).Next $$$n$$$ lines contain $$$n$$$ pairs of space-separated integers $$$l_i$$$ and $$$r_i$$$ ($$$0 \\\\leqslant l_i, r_i \\\\leqslant 10^9$$$).OutputOutput a single integer — the smallest number of chairs you have to use.ExamplesInput31 11 11 1Output6Input41 22 13 55 3Output15Input15 6Output7NoteIn the second sample the only optimal answer is to use two circles: a circle with $$$5$$$ chairs accomodating guests $$$1$$$ and $$$2$$$, and another one with $$$10$$$ chairs accomodationg guests $$$3$$$ and $$$4$$$.In the third sample, you have only one circle with one person. The guest should have at least five free chairs to his left, and at least six free chairs to his right to the next person, which is in this case the guest herself. So, overall number of chairs should be at least 6+1=7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cbefd41f", "template_md5": "35d339e4", "result": "You are arranging chairs for $n$ guests. Each guest has a preference for the number of empty chairs to their left ($l_i$) and right ($r_i$).  You want to arrange the guests in one or more circles, where each chair is either occupied or empty.  \n\nFind the smallest total number of chairs needed to satisfy all the guests' preferences. \n\n**Input:**\n\n* The first line contains an integer $n$ (the number of guests).\n* The next $n$ lines each contain two integers, $l_i$ and $r_i$ (the number of empty chairs preferred to the left and right of the $i$-th guest).\n\n**Output:**\n\n* A single integer representing the minimum number of chairs required."}, {"prompt_md5": "efb2b16b", "template_md5": "465699a0", "result": "You need to seat people around circular tables. Each person needs a minimum number of empty seats on their left and right. Find the smallest number of seats needed to accommodate everyone."}]}