{"uid": "1063-B", "url": "https://codeforces.com/contest/1063/problem/B", "tags": ["graphs", " shortest paths"], "title": "1063-B", "statement": "B. Labyrinthtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are playing some computer game. One of its levels puts you in a maze consisting ofnlines, each of which containsmcells. Each cell either is free or is occupied by an obstacle. The starting cell is in the rowrand columnc. In one step you can move one square up, left, down or right, if the target cell is not occupied by an obstacle. You can't move beyond the boundaries of the labyrinth.Unfortunately, your keyboard is about to break, so you can move left no more thanxtimes and move right no more thanytimes. There are no restrictions on the number of moves up and down since the keys used to move up and down are in perfect condition.Now you would like to determine for each cell whether there exists a sequence of moves that will put you from the starting cell to this particular one. How many cells of the board have this property?InputThe first line contains two integersn,m(1 ≤n,m≤ 2000) — the number of rows and the number columns in the labyrinth respectively.The second line contains two integersr,c(1 ≤r≤n,1 ≤c≤m) — index of the row and index of the column that define the starting cell.The third line contains two integersx,y(0 ≤x,y≤ 109) — the maximum allowed number of movements to the left and to the right respectively.The nextnlines describe the labyrinth. Each of them has length ofmand consists only of symbols '.' and '*'. Thej-th character of thei-th line corresponds to the cell of labyrinth at rowiand columnj. Symbol '.' denotes the free cell, while symbol '*' denotes the cell with an obstacle.It is guaranteed, that the starting cell contains no obstacles.OutputPrint exactly one integer — the number of cells in the labyrinth, which are reachable from starting cell, including the starting cell itself.ExamplesInput4 53 21 2......***....***....Output10Input4 42 20 1......*.........Output7NoteCells, reachable in the corresponding example, are marked with '+'.First example:+++..+***.+++***+++.Second example:.++..+*..++..++.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a66a5268", "template_md5": "35d339e4", "result": "You are given a 2D grid representing a maze. The grid has $n$ rows and $m$ columns. Each cell in the grid is either empty ('.') or blocked ('*'). You start at a specific cell $(r, c)$ in the grid.\n\nYou can move up, down, left, or right one cell at a time, as long as the destination cell is empty.  You are limited to moving left a maximum of $x$ times and right a maximum of $y$ times.\n\nDetermine how many cells in the grid can be reached from the starting cell, including the starting cell itself."}, {"prompt_md5": "449adf9e", "template_md5": "465699a0", "result": "You are given a grid with some blocked cells. You start at a specific cell and can move up, down, left, or right. You can only move left a limited number of times and right a limited number of times.  Count how many cells you can reach."}]}