{"uid": "1063-F", "url": "https://codeforces.com/contest/1063/problem/F", "tags": ["data structures", " dp", " string suffix structures"], "title": "1063-F", "statement": "F. String Journeytime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputWe call a sequence of stringst1, ...,tkajourneyof lengthk, if for eachi> 1tiis a substring ofti- 1and length oftiis strictly less than length ofti- 1. For example,{ab,b}is a journey, but{ab,c}and{a,a}are not.Define ajourney on stringsas journeyt1, ...,tk, such that all its parts can be nested insidesin such a way that there exists a sequence of stringsu1, ...,uk+ 1(each of these strings can be empty) ands=u1t1u2t2...uktkuk+ 1. As an example,{ab,b}is a journey on stringabb, but not onbabbecause the journey stringstishould appear from the left to the right.Thelengthof a journey on a string is the number of strings in it. Determine the maximum possible length of a journey on the given strings.InputThe first line contains a single integern(1 ≤n≤ 500 000) — the length of strings.The second line contains the stringsitself, consisting ofnlowercase Latin letters.OutputPrint one number — the maximum possible length of string journey ons.ExamplesInput7abcdbccOutput3Input4bbcbOutput2NoteIn the first sample, the string journey of maximum length is{abcd,bc,c}.In the second sample, one of the suitable journeys is{bb,b}.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b629f934", "template_md5": "35d339e4", "result": "You are given a string of length $n$.  \n\nA \"journey\" on the string is a sequence of substrings $t_1, t_2, ..., t_k$ where:\n\n* Each $t_i$ is a substring of $t_{i-1}$\n* The length of $t_i$ is strictly less than the length of $t_{i-1}$\n\nYou need to find the longest possible journey on the given string.  \n\n**Example:**\n\nFor the string \"abbcc\", a journey of length 3 is:\n\n* $t_1 = \"abcd\"$\n* $t_2 = \"bc\"$\n* $t_3 = \"c\"$ \n\n\n\nLet me know if you'd like help with the code to solve this problem!"}, {"prompt_md5": "ba7f508b", "template_md5": "465699a0", "result": "Given a string, find the longest possible sequence of substrings where each substring is a part of the previous one and shorter than it.  The substrings must appear in order within the original string."}]}