{"uid": "1068-C", "url": "https://codeforces.com/contest/1068/problem/C", "tags": ["constructive algorithms", " graphs"], "title": "1068-C", "statement": "C. Colored Rookstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIvan is a novice painter. He has $$$n$$$ dyes of different colors. He also knows exactly $$$m$$$ pairs of colors which harmonize with each other.Ivan also enjoy playing chess. He has $$$5000$$$ rooks. He wants to take $$$k$$$ rooks, paint each of them in one of $$$n$$$ colors and then place this $$$k$$$ rooks on a chessboard of size $$$10^{9} \\\\times 10^{9}$$$.Let's call the set of rooks on the boardconnectedif from any rook we can get to any other rook in this set moving only through cells with rooks from this set. Assume that rooks can jump over other rooks, in other words a rook can go to any cell which shares vertical and to any cell which shares horizontal.Ivan wants his arrangement of rooks to have following properties:For any color there is a rook of this color on a board;For any color the set of rooks of this color is connected;For any two different colors $$$a$$$ $$$b$$$ union of set of rooks of color $$$a$$$ and set of rooks of color $$$b$$$ is connected if and only if this two colors harmonize with each other.Please help Ivan find such an arrangement.InputThe first line of input contains $$$2$$$ integers $$$n$$$, $$$m$$$ ($$$1 \\\\le n \\\\le 100$$$, $$$0 \\\\le m \\\\le min(1000, \\\\,\\\\, \\\\frac{n(n-1)}{2})$$$) — number of colors and number of pairs of colors which harmonize with each other.In next $$$m$$$ lines pairs of colors which harmonize with each other are listed. Colors are numbered from $$$1$$$ to $$$n$$$. It is guaranteed that no pair occurs twice in this list.OutputPrint $$$n$$$ blocks, $$$i$$$-th of them describes rooks of $$$i$$$-th color.In the first line of block print one number $$$a_{i}$$$ ($$$1 \\\\le a_{i} \\\\le 5000$$$) — number of rooks of color $$$i$$$. In each of next $$$a_{i}$$$ lines print two integers $$$x$$$ and $$$y$$$ ($$$1 \\\\le x, \\\\,\\\\, y \\\\le 10^{9}$$$) — coordinates of the next rook.All rooks must be on different cells.Total number of rooks must not exceed $$$5000$$$.It is guaranteed that the solution exists.ExamplesInput3 21 22 3Output23 41 441 22 22 45 415 1Input3 31 22 33 1Output11 111 211 3Input3 11 3Output11 112 213 1NoteRooks arrangements for all three examples (red is color $$$1$$$, green is color $$$2$$$ and blue is color $$$3$$$).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f700c10f", "template_md5": "35d339e4", "result": "You are given $n$ colors and $m$ pairs of colors that harmonize with each other. You also have 5000 rooks.\n\nYour task is to:\n\n1. Choose $k$ rooks (where $k$ is not specified in the problem).\n2. Paint each rook one of the $n$ colors.\n3. Place the rooks on a chessboard of size $10^9 \\times 10^9$.\n\nThe placement must satisfy these rules:\n\n* **Each color must have at least one rook on the board.**\n* **All rooks of the same color must be connected.** This means that you can move from any rook of a certain color to any other rook of that color by only moving to cells that have a rook of the same color.\n* **The union of rooks of two different colors must be connected if and only if those two colors harmonize.**\n\nOutput the arrangement of rooks, with each block representing a color. Each block should contain:\n\n* The number of rooks of that color.\n* The coordinates ($x$, $y$) of each rook.\n\nThe total number of rooks used must not exceed 5000.\n\n\n\nLet me know if you'd like me to clarify any part of the problem."}, {"prompt_md5": "0d5779c2", "template_md5": "465699a0", "result": "You are given a set of colors and a list of color pairs that harmonize.  You need to place a number of objects (rooks) on a large grid, with each object having one of the colors. The placement must follow these rules:\n\n* Each color must have at least one object.\n* Objects of the same color must be connected (able to reach each other by moving horizontally or vertically, jumping over other objects).\n* Objects of two different colors are connected only if those colors harmonize. \n\n\n\nLet me know if you'd like me to elaborate on any of these rules."}]}