{"uid": "107-C", "url": "https://codeforces.com/contest/107/problem/C", "tags": ["bitmasks", " dp"], "title": "107-C", "statement": "C. Arrangementtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn the year 2500 the annual graduation ceremony in the German University in Cairo (GUC) has run smoothly for almost 500 years so far.The most important part of the ceremony is related to the arrangement of the professors in the ceremonial hall.Traditionally GUC hasnprofessors. Each professor has his seniority level. All seniorities are different. Let's enumerate the professors from1ton, with1being the most senior professor andnbeing the most junior professor.The ceremonial hall hasnseats, one seat for each professor. Some places in this hall are meant for more senior professors than the others. More specifically,mpairs of seats are in \"senior-junior\" relation, and the tradition requires that for allmpairs of seats(ai,bi)the professor seated in \"senior\" positionaishould be more senior than the professor seated in \"junior\" positionbi.GUC is very strict about its traditions, which have been carefully observed starting from year 2001. The tradition requires that:The seating of the professors changes every year.Year 2001 ceremony was using lexicographically first arrangement of professors in the ceremonial hall.Each consecutive year lexicographically next arrangement of the professors is used.The arrangement of the professors is the list ofnintegers, where the first integer is the seniority of the professor seated in position number one, the second integer is the seniority of the professor seated in position number two, etc.Givenn, the number of professors,y, the current year andmpairs of restrictions, output the arrangement of the professors for this year.InputThe first line contains three integersn,yandm(1 ≤n≤ 16, 2001 ≤y≤ 1018, 0 ≤m≤ 100) — the number of professors, the year for which the arrangement should be computed, and the number of pairs of seats for which the seniority relation should be kept, respectively.The nextmlines contain one pair of integers each, \"aibi\", indicating that professor on theai-th seat is more senior than professor on thebi-th seat (1 ≤ai,bi≤n,ai≠bi). Some pair may be listed more than once.Please, do not use the%lldspecificator to read or write 64-bit integers in С++. It is preferred to use thecinstream (you may also use the%I64dspecificator).OutputPrint the order in which the professors should be seated in the requested year.If by this year the GUC would have ran out of arrangements, or the given \"senior-junior\" relation are contradictory, print \"The times have changed\" (without quotes).ExamplesInput3 2001 21 22 3Output1 2 3Input7 2020 61 21 32 42 53 63 7Output1 2 3 7 4 6 5Input10 3630801 0OutputThe times have changedInput3 2001 31 22 33 1OutputThe times have changedNoteIn the first example the lexicographically first order of seating is 1 2 3.In the third example the GUC will run out of arrangements after the year 3630800.In the fourth example there are no valid arrangements for the seating.The lexicographical comparison of arrangements is performed by the < operator in modern programming languages. The arrangementais lexicographically less that the arrangementb, if there exists suchi(1 ≤i≤n), thatai<bi, and for anyj(1 ≤j<i)aj=bj.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "38bf5f4a", "template_md5": "35d339e4", "result": "You are given $n$ professors, each with a unique seniority level from 1 to $n$ (1 being the most senior). There are $m$ pairs of seats $(a_i, b_i)$ where the professor in seat $a_i$ must be more senior than the professor in seat $b_i$.\n\nYou are also given a year $y$.  \n\nThe seating arrangement of the professors changes every year, following a lexicographical order. The arrangement in year 2001 was the lexicographically smallest possible arrangement.\n\nYour task is to determine the seating arrangement for the given year $y$. If there is no valid arrangement that satisfies the seniority constraints, output \"The times have changed\". \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "576024ce", "template_md5": "465699a0", "result": "You are given a number of seats and a number of people. Each person has a rank. Some pairs of seats have a rule: the person with the higher rank must sit in the \"senior\" seat.  \n\nYou need to find the seating arrangement for a specific year, where the arrangement changes each year in a lexicographical order (like alphabetical order for words). If there are no valid arrangements, output \"The times have changed\"."}]}