{"uid": "107-E", "url": "https://codeforces.com/contest/107/problem/E", "tags": ["geometry", " probabilities"], "title": "107-E", "statement": "E. Dartstime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe night after the graduation ceremony graduate students of German University in Cairo (GUC) are playing darts. As there's no real dart board available, the photographs of members of the GUC upper management are being used.So,nrectangular photos are placed on the wall. They can overlap arbitrary and even coincide. The photos are not necessarily placed horizontally or vertically, they could also be rotated before being pinned to the wall.The score of one dart throw is simply the number of photos the dart went through.Fatma has made a throw but her score was not recorded. She only remembers that she did make it into at least one photo.Assuming that the probability distribution of the throw is equal across the whole wall, what would be the expectation of Fatma's score?InputThe first line of input contains integern(1 ≤n≤ 500) — the number of photos on the wall. Then follownlines describing the photos, each containing8single-space-separated integers (coordinates of4vertices):x1,y1,x2,y2,x3,y3,x4,y4. Each photo is a rectangle with a nonzero area. The coordinates are integers, not exceeding104by absolute value. The coordinates of the rectangle are given in either clockwise or counterclockwise order.OutputPrint the expected score of the throw. The answer will be accepted if it has absolute or relative error not exceeding10- 6.ExamplesInput10 0 0 2 2 2 2 0Output1.0000000000Input1-1 0 0 1 1 0 0 -1Output1.0000000000Input40 0 0 1 3 1 3 00 0 0 3 1 3 1 03 3 2 3 2 0 3 03 3 3 2 0 2 0 3Output1.5000000000Input2-1 0 0 1 1 0 0 -10 0 1 1 2 0 1 -1Output1.1428571429", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bf76f86a", "template_md5": "35d339e4", "result": "There are $n$ rectangular photos on a wall. The photos can overlap.  A dart is thrown randomly at the wall. What is the average (expected) number of photos the dart will go through?\n\nThe input will give you the coordinates of each photo. The output should be the expected score of the dart throw."}, {"prompt_md5": "5fbdd86e", "template_md5": "465699a0", "result": "There are multiple overlapping rectangles on a wall.  A dart is thrown randomly at the wall. What is the average number of rectangles the dart will go through?"}]}