{"uid": "107-B", "url": "https://codeforces.com/contest/107/problem/B", "tags": ["combinatorics", " dp", " math", " probabilities"], "title": "107-B", "statement": "B. Basketball Teamtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAs a German University in Cairo (GUC) student and a basketball player, Herr Wafa was delighted once he heard the news. GUC is finally participating in the Annual Basketball Competition (ABC).A team is to be formed ofnplayers, all of which are GUC students. However, the team might have players belonging to different departments. There aremdepartments in GUC, numbered from1tom. Herr Wafa's department has numberh. For each departmenti, Herr Wafa knows numbersi— how many students who play basketball belong to this department.Herr Wafa was also able to guarantee a spot on the team, using his special powers. But since he hates floating-point numbers, he needs your help at finding the probability that he will have at least one teammate belonging to his department.Note that every possible team containing Herr Wafa is equally probable. Consider all the students different from each other.InputThe first line contains three integersn,mandh(1 ≤n≤ 100, 1 ≤m≤ 1000, 1 ≤h≤m) — the number of players on the team, the number of departments in GUC and Herr Wafa's department, correspondingly.The second line contains a single-space-separated list ofmintegerssi(1 ≤si≤ 100), denoting the number of students in thei-th department. Note thatshincludes Herr Wafa.OutputPrint the probability that Herr Wafa will have at least one teammate from his department. If there is not enough basketball players in GUC to participate in ABC, print -1. The answer will be accepted if it has absolute or relative error not exceeding10- 6.ExamplesInput3 2 12 1Output1Input3 2 11 1Output-1Input3 2 12 2Output0.666667NoteIn the first example all 3 players (2 from department 1 and 1 from department 2) must be chosen for the team. Both players from Wafa's departments will be chosen, so he's guaranteed to have a teammate from his department.In the second example, there are not enough players.In the third example, there are three possibilities to compose the team containing Herr Wafa. In two of them the other player from Herr Wafa's department is part of the team.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1e38c7d1", "template_md5": "35d339e4", "result": "You are given $n$ players and $m$ departments. Each department has a certain number of basketball players.  You know the number of players in each department ($s_i$).  \n\nYou also know that one player is guaranteed a spot on the team.  \n\nFind the probability that this guaranteed player will have at least one teammate from their department.\n\n**Input:**\n\n* $n$: the number of players on the team\n* $m$: the number of departments\n* $h$: the department of the guaranteed player\n* $s_1, s_2, ..., s_m$: the number of basketball players in each department\n\n**Output:**\n\n* The probability that the guaranteed player will have at least one teammate from their department. If there are not enough basketball players to form a team, output -1."}, {"prompt_md5": "bf87dc4c", "template_md5": "465699a0", "result": "You have a team of a given size. There are multiple groups of people, each group having a different number of potential team members.  You need to find the probability that at least one teammate will be from a specific group."}]}