{"uid": "107-A", "url": "https://codeforces.com/contest/107/problem/A", "tags": ["dfs and similar", " graphs"], "title": "107-A", "statement": "A. Dorm Water Supplytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe German University in Cairo (GUC) dorm houses are numbered from1ton. Underground water pipes connect these houses together. Each pipe has certain direction (water can flow only in this direction and not vice versa), and diameter (which characterizes the maximal amount of water it can handle).For each house, there is at most one pipe going into it and at most one pipe going out of it. With the new semester starting, GUC student and dorm resident, Lulu, wants to install tanks and taps at the dorms. For every house with an outgoing water pipe and without an incoming water pipe, Lulu should install a water tank at that house. For every house with an incoming water pipe and without an outgoing water pipe, Lulu should install a water tap at that house. Each tank house will convey water to all houses that have a sequence of pipes from the tank to it. Accordingly, each tap house will receive water originating from some tank house.In order to avoid pipes from bursting one week later (like what happened last semester), Lulu also has to consider the diameter of the pipes. The amount of water each tank conveys should not exceed the diameter of the pipes connecting a tank to its corresponding tap. Lulu wants to find the maximal amount of water that can be safely conveyed from each tank to its corresponding tap.InputThe first line contains two space-separated integersnandp(1 ≤n≤ 1000, 0 ≤p≤n)— the number of houses and the number of pipes correspondingly.Thenplines follow — the description ofppipes. Thei-th line contains three integersaibidi, indicating a pipe of diameterdigoing from houseaito housebi(1 ≤ai,bi≤n,ai≠bi, 1 ≤di≤ 106).It is guaranteed that for each house there is at most one pipe going into it and at most one pipe going out of it.OutputPrint integertin the first line — the number of tank-tap pairs of houses.For the nexttlines, print 3 integers per line, separated by spaces:tanki,tapi, anddiameteri, wheretanki≠tapi(1 ≤i≤t). Heretankiandtapiare indexes of tank and tap houses respectively, anddiameteriis the maximum amount of water that can be conveyed. All thetlines should be ordered (increasingly) bytanki.ExamplesInput3 21 2 102 3 20Output11 3 10Input3 31 2 202 3 103 1 5Output0Input4 21 2 603 4 50Output21 2 603 4 50", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c40cd67f", "template_md5": "35d339e4", "result": "You are given a network of houses connected by pipes. Each pipe has a direction and a diameter.  \n\n* Some houses have pipes going out but not in. These houses need a tank.\n* Some houses have pipes going in but not out. These houses need a tap.\n\nTanks supply water to houses connected by pipes. The amount of water a tank can supply to a house cannot exceed the diameter of the pipe connecting them.\n\nYour task is to:\n\n1. Determine the number of tank-tap pairs.\n2. For each pair, find the maximum amount of water that can be safely conveyed from the tank to the tap. \n\n\n\n**Input:**\n\n* The first line contains two integers,  $n$ (number of houses) and $p$ (number of pipes).\n* The next $p$ lines describe the pipes: each line contains three integers $a$, $b$, and $d$, representing a pipe from house $a$ to house $b$ with diameter $d$.\n\n**Output:**\n\n* The first line contains the number of tank-tap pairs.\n* The next lines describe each tank-tap pair: three integers separated by spaces, representing the tank house index, the tap house index, and the maximum water flow."}, {"prompt_md5": "ec17e620", "template_md5": "465699a0", "result": "You are given a list of houses connected by pipes. Each pipe has a maximum capacity.  Some houses have pipes going in, some have pipes going out, and some have both.  \n\nYou need to determine the maximum amount of water that can flow from houses with outgoing pipes to houses with incoming pipes, respecting the pipe capacities. \n\n\nOutput the number of successful connections and for each connection, list the source house, the destination house, and the maximum flow."}]}