{"uid": "1070-C", "url": "https://codeforces.com/contest/1070/problem/C", "tags": ["data structures", " greedy"], "title": "1070-C", "statement": "C. Cloud Computingtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBuber is a Berland technology company that specializes in waste of investor's money. Recently Buber decided to transfer its infrastructure to a cloud. The company decided to rent CPU cores in the cloud for $$$n$$$ consecutive days, which are numbered from $$$1$$$ to $$$n$$$. Buber requires $$$k$$$ CPU cores each day.The cloud provider offers $$$m$$$ tariff plans, the $$$i$$$-th tariff plan is characterized by the following parameters:$$$l_i$$$ and $$$r_i$$$ — the $$$i$$$-th tariff plan is available only on days from $$$l_i$$$ to $$$r_i$$$, inclusive,$$$c_i$$$ — the number of cores per day available for rent on the $$$i$$$-th tariff plan,$$$p_i$$$ — the price of renting one core per day on the $$$i$$$-th tariff plan.Buber can arbitrarily share its computing core needs between the tariff plans. Every day Buber can rent an arbitrary number of cores (from 0 to $$$c_i$$$) on each of the available plans. The number of rented cores on a tariff plan can vary arbitrarily from day to day.Find the minimum amount of money that Buber will pay for its work for $$$n$$$ days from $$$1$$$ to $$$n$$$. If on a day the total number of cores for all available tariff plans is strictly less than $$$k$$$, then this day Buber will have to work on fewer cores (and it rents all the available cores), otherwise Buber rents exactly $$$k$$$ cores this day.InputThe first line of the input contains three integers $$$n$$$, $$$k$$$ and $$$m$$$ ($$$1 \\\\le n,k \\\\le 10^6, 1 \\\\le m \\\\le 2\\\\cdot10^5$$$) — the number of days to analyze, the desired daily number of cores, the number of tariff plans.The following $$$m$$$ lines contain descriptions of tariff plans, one description per line. Each line contains four integers $$$l_i$$$, $$$r_i$$$, $$$c_i$$$, $$$p_i$$$ ($$$1 \\\\le l_i \\\\le r_i \\\\le n$$$, $$$1 \\\\le c_i, p_i \\\\le 10^6$$$), where $$$l_i$$$ and $$$r_i$$$ are starting and finishing days of the $$$i$$$-th tariff plan, $$$c_i$$$ — number of cores, $$$p_i$$$ — price of a single core for daily rent on the $$$i$$$-th tariff plan.OutputPrint a single integer number — the minimal amount of money that Buber will pay.ExamplesInput5 7 31 4 5 31 3 5 22 5 10 1Output44Input7 13 52 3 10 73 5 10 101 2 10 64 5 10 93 4 10 8Output462Input4 100 33 3 2 51 1 3 22 4 4 4Output64", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "abc670e0", "template_md5": "35d339e4", "result": "There are $n$ days.  You need to rent $k$ CPU cores each day. There are $m$ different plans available, each with the following properties:\n\n* $l_i$ and $r_i$: The plan is available from day $l_i$ to day $r_i$ inclusive.\n* $c_i$: The maximum number of cores you can rent from this plan each day.\n* $p_i$: The price per core per day for this plan.\n\nYou can rent cores from multiple plans each day.  The goal is to find the minimum total cost to rent the required cores for all $n$ days. If a plan doesn't have enough cores available on a given day to meet your needs, you must rent all the cores that plan offers. \n\n\n\nInput:\n\nThe first line contains three integers: $n$, $k$, and $m$.\n\nThe next $m$ lines each describe a plan with four integers: $l_i$, $r_i$, $c_i$, and $p_i$.\n\nOutput:\n\nPrint a single integer representing the minimum total cost."}, {"prompt_md5": "be6a5e50", "template_md5": "465699a0", "result": "You need to rent a certain number of computing units each day for a set number of days. There are multiple plans available, each with a different price per unit and a limited time period. You can choose to rent units from multiple plans each day. Find the cheapest way to rent enough units for all the days."}]}