{"uid": "1073-A", "url": "https://codeforces.com/contest/1073/problem/A", "tags": ["implementation", " strings"], "title": "1073-A", "statement": "A. Diverse Substringtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$, consisting of $$$n$$$ lowercase Latin letters.A substring of string $$$s$$$ is a continuous segment of letters from $$$s$$$. For example, \"defor\" is a substring of \"codeforces\" and \"fors\" is not.The length of the substring is the number of letters in it.Let's call some string of length $$$n$$$diverseif and only if there is no letter to appear strictly more than $$$\\\\frac n 2$$$ times. For example, strings \"abc\" and \"iltlml\" arediverseand strings \"aab\" and \"zz\" are not.Your task is to findanydiversesubstring of string $$$s$$$ or report that there is none. Note that it is not required to maximize or minimize the length of the resulting substring.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 1000$$$) — the length of string $$$s$$$.The second line is the string $$$s$$$, consisting of exactly $$$n$$$ lowercase Latin letters.OutputPrint \"NO\" if there is nodiversesubstring in the string $$$s$$$.Otherwise the first line should contain \"YES\". The second line should containanydiversesubstring of string $$$s$$$.ExamplesInput10codeforcesOutputYEScodeInput5aaaaaOutputNONoteThe first example has lots of correct answers.Please, restrain yourself from asking if some specific answer is correct for some specific test or not, these questions always lead to \"No comments\" answer.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7dd3201c", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  A substring is a continuous sequence of letters within the string.  \n\nA substring is considered \"diverse\" if no letter appears more than  $n/2$ times, where $n$ is the length of the substring.\n\nYour task is to find any diverse substring within the given string. If no diverse substring exists, output \"NO\". Otherwise, output \"YES\" followed by any diverse substring you find."}, {"prompt_md5": "3bf4e554", "template_md5": "465699a0", "result": "Given a string, find a substring where no letter appears more than half the length of the substring. If no such substring exists, say so."}]}