{"uid": "108-B", "url": "https://codeforces.com/contest/108/problem/B", "tags": ["math", " sortings"], "title": "108-B", "statement": "B. Datatypestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTattah's youngest brother, Tuftuf, is new to programming.Since his older brother is such a good programmer, his biggest dream is to outshine him. Tuftuf is a student at the German University in Cairo (GUC) where he learns to write programs in Gava.Today, Tuftuf was introduced to Gava's unsigned integer datatypes. Gava hasnunsigned integer datatypes of sizes (in bits)a1,a2, ...an. Thei-th datatype have sizeaibits, so it can represent every integer between0and2ai- 1inclusive.Tuftuf is thinking of learning a better programming language. If there exists an integerx, such thatxfits in some typei(inaibits) andx·xdoes not fit in some other typej(inajbits) whereai<aj, then Tuftuf will stop using Gava.Your task is to determine Tuftuf's destiny.InputThe first line contains integern(2 ≤n≤ 105) — the number of Gava's unsigned integer datatypes' sizes. The second line contains a single-space-separated list ofnintegers (1 ≤ai≤ 109) — sizes of datatypes in bits. Some datatypes may have equal sizes.OutputPrint \"YES\" if Tuftuf will stop using Gava, and \"NO\" otherwise.ExamplesInput364 16 32OutputNOInput44 2 1 3OutputYESNoteIn the second example,x= 7(1112)fits in3bits, butx2= 49(1100012)does not fit in4bits.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c0f9bcae", "template_md5": "35d339e4", "result": "You are given a list of unsigned integer data types, each with a specific number of bits.  \n\nDetermine if there exists an integer $x$ that:\n\n* Fits within one of the data types with a smaller number of bits.\n*  Its square ($x^2$) does not fit within any data type with a larger number of bits.\n\nIf such an integer $x$ exists, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "ecbb72bf", "template_md5": "465699a0", "result": "You are given a list of integer sizes. Determine if there exists a number that can be represented by one of the smaller sizes but its square cannot be represented by any of the larger sizes."}]}