{"uid": "1080-A", "url": "https://codeforces.com/contest/1080/problem/A", "tags": ["math"], "title": "1080-A", "statement": "A. Petya and Origamitime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPetya is having a party soon, and he has decided to invite his $$$n$$$ friends.He wants to make invitations in the form of origami. For each invitation, he needstwored sheets,fivegreen sheets, andeightblue sheets. The store sells an infinite number of notebooks of each color, but each notebook consists of onlyonecolor with $$$k$$$ sheets. That is, each notebook contains $$$k$$$ sheets of either red, green, or blue.Find the minimum number of notebooks that Petya needs to buy to invite all $$$n$$$ of his friends.InputThe first line contains two integers $$$n$$$ and $$$k$$$ ($$$1\\\\leq n, k\\\\leq 10^8$$$) — the number of Petya's friends and the number of sheets in each notebook respectively.OutputPrint one number — the minimum number of notebooks that Petya needs to buy.ExamplesInput3 5Output10Input15 6Output38NoteIn the first example, we need $$$2$$$ red notebooks, $$$3$$$ green notebooks, and $$$5$$$ blue notebooks.In the second example, we need $$$5$$$ red notebooks, $$$13$$$ green notebooks, and $$$20$$$ blue notebooks.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ec7010eb", "template_md5": "35d339e4", "result": "You need to make $n$ invitations. Each invitation requires 2 red sheets, 5 green sheets, and 8 blue sheets. Notebooks are sold with $k$ sheets of a single color. Find the minimum number of notebooks you need to buy to make all the invitations. \n\nInput:\n* Two integers $n$ and $k$ ($1 \\leq n, k \\leq 10^8$) representing the number of invitations and the number of sheets per notebook.\n\nOutput:\n* A single integer representing the minimum number of notebooks needed."}, {"prompt_md5": "696e889b", "template_md5": "465699a0", "result": "You need to figure out the fewest number of packs of paper you need to buy to make invitations. Each invitation needs 2 red sheets, 5 green sheets, and 8 blue sheets. Each pack contains a fixed number of sheets of a single color."}]}