{"uid": "1081-A", "url": "https://codeforces.com/contest/1081/problem/A", "tags": ["constructive algorithms", " math"], "title": "1081-A", "statement": "A. Definite Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputChouti was doing a competitive programming competition. However, after having all the problems accepted, he got bored and decided to invent some small games.He came up with the following game. The player has a positive integer $$$n$$$. Initially the value of $$$n$$$ equals to $$$v$$$ and the player is able to do the following operation as many times as the player want (possibly zero): choose a positive integer $$$x$$$ that $$$x<n$$$ and $$$x$$$ is not a divisor of $$$n$$$, then subtract $$$x$$$ from $$$n$$$. The goal of the player is to minimize the value of $$$n$$$ in the end.Soon, Chouti found the game trivial. Can you also beat the game?InputThe input contains only one integer in the first line: $$$v$$$ ($$$1 \\\\le v \\\\le 10^9$$$), the initial value of $$$n$$$.OutputOutput a single integer, the minimum value of $$$n$$$ the player can get.ExamplesInput8Output1Input1Output1NoteIn the first example, the player can choose $$$x=3$$$ in the first turn, then $$$n$$$ becomes $$$5$$$. He can then choose $$$x=4$$$ in the second turn to get $$$n=1$$$ as the result. There are other ways to get this minimum. However, for example, he cannot choose $$$x=2$$$ in the first turn because $$$2$$$ is a divisor of $$$8$$$.In the second example, since $$$n=1$$$ initially, the player can do nothing.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b96d4673", "template_md5": "35d339e4", "result": "You are given a positive integer $n$. You can repeatedly choose a positive integer $x$ where $x < n$ and $x$ does not divide $n$, and subtract $x$ from $n$. What is the smallest possible value you can get for $n$?"}, {"prompt_md5": "dc3e6d4c", "template_md5": "465699a0", "result": "You are given a positive integer. You can repeatedly subtract a smaller positive integer from it, as long as the smaller integer does not divide evenly into the original number. What is the smallest number you can get?"}]}