{"uid": "1082-B", "url": "https://codeforces.com/contest/1082/problem/B", "tags": ["greedy"], "title": "1082-B", "statement": "B. Vova and Trophiestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVova has won $$$n$$$ trophies in different competitions. Each trophy is either golden or silver. The trophies are arranged in a row.Thebeautyof the arrangement is the length of the longest subsegment consisting of golden trophies. Vova wants to swap two trophies (not necessarily adjacent ones) to make the arrangement as beautiful as possible — that means, to maximize the length of the longest such subsegment.Help Vova! Tell him the maximum possible beauty of the arrangement if he is allowed to do at most one swap.InputThe first line contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 10^5$$$) — the number of trophies.The second line contains $$$n$$$ characters, each of them is eitherGorS. If the $$$i$$$-th character isG, then the $$$i$$$-th trophy is a golden one, otherwise it's a silver trophy.OutputPrint the maximum possible length of a subsegment of golden trophies, if Vova is allowed to do at most one swap.ExamplesInput10 GGGSGGGSGGOutput7Input4 GGGGOutput4Input3 SSSOutput0NoteIn the first example Vova has to swap trophies with indices $$$4$$$ and $$$10$$$. Thus he will obtain the sequence \"GGGGGGGSGS\", the length of the longest subsegment of golden trophies is $$$7$$$.In the second example Vova can make no swaps at all. The length of the longest subsegment of golden trophies in the sequence is $$$4$$$.In the third example Vova cannot do anything to make the length of the longest subsegment of golden trophies in the sequence greater than $$$0$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0bf3bc85", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ characters, where each character is either 'G' (representing a golden trophy) or 'S' (representing a silver trophy).  \n\nFind the maximum length of a subsegment consisting only of 'G' characters that can be achieved by swapping at most two trophies in the sequence."}, {"prompt_md5": "3d913f2e", "template_md5": "465699a0", "result": "You are given a sequence of gold (G) and silver (S) items. You can swap any two items once.  Find the longest sequence of gold items you can create."}]}