{"uid": "1089-K", "url": "https://codeforces.com/contest/1089/problem/K", "tags": ["data structures"], "title": "1089-K", "statement": "K. King Kog's Receptiontime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputKing Kog got annoyed of the usual laxity of his knights — they can break into his hall without prior notice! Thus, the King decided to build a reception with a queue where each knight chooses in advance the time when he will come and how long the visit will take. The knights are served in the order of the recorded time, but each knight has to wait until the visits of all the knights before him are finished.Princess Keabeanie wants to see her father. However, she does not want to interrupt the knights so she joins the queue. Unfortunately, the knights change their minds very often — they can join the queue or cancel their visits. Please help the princess to understand how long she will have to wait until she sees her father if she enters the queue at the specified moments of time given the records at the reception.InputThe first line of the input contains a single integer $$$q$$$ ($$$1 \\\\leq q \\\\leq 3 \\\\cdot 10^5$$$) — the number of events. An event can be of three types:join,cancel, orquery.Join \"+ $$$t$$$ $$$d$$$\" ($$$1 \\\\leq t, d \\\\leq 10^6$$$) — a new knight joins the queue, where $$$t$$$ is the time when the knight will come and $$$d$$$ is the duration of the visit.Cancel \"- $$$i$$$\" ($$$1 \\\\leq i \\\\leq q$$$) — the knight cancels the visit, where $$$i$$$ is the number (counted starting from one) of the corresponding join event in the list of all events.Query \"? $$$t$$$\" ($$$1 \\\\leq t \\\\leq 10^6$$$) — Keabeanie asks how long she will wait if she comes at the time $$$t$$$.It is guaranteed that after each event there are no two knights with the same entrance time in the queue. Cancel events refer to the previous joins that were not cancelled yet.Keabeanie can come at the same time as some knight, but Keabeanie is very polite and she will wait for the knight to pass.OutputFor each query write a separate line with the amount of time Keabeanie will have to wait.ExampleInput19 ? 3 + 2 2 ? 3 ? 4 + 5 2 ? 5 ? 6 + 1 2 ? 2 ? 3 ? 4 ? 5 ? 6 ? 7 ? 9 - 8 ? 2 ? 3 ? 6Output0 1 0 2 1 3 2 1 2 1 0 0 2 1 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9aeafb7a", "template_md5": "35d339e4", "result": "You are given a sequence of events. Each event is one of three types:\n\n* **join + t d**: A new person joins the queue at time $t$ and their visit will take $d$ time units.\n* **cancel - i**: The person who joined at event number $i$ cancels their visit.\n* **query ? t**:  You want to know how long it will take for a person to be served if they arrive at time $t$.\n\nEvents are processed in order.  \n\n**Input:**\n\nThe first line contains an integer $q$ ($1 \\le q \\le 3 \\cdot 10^5$) representing the number of events.  The following lines describe the events.\n\n**Output:**\n\nFor each query event, print a single line with the waiting time."}, {"prompt_md5": "4b399043", "template_md5": "465699a0", "result": "You are given a list of events. Each event can be a knight joining the queue at a specific time with a visit duration, a knight canceling their visit, or a query asking how long someone will wait to be served if they arrive at a specific time.  Determine the waiting time for each query."}]}