{"uid": "109-B", "url": "https://codeforces.com/contest/109/problem/B", "tags": ["brute force", " probabilities"], "title": "109-B", "statement": "B. Lucky Probabilitytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPetya loves lucky numbers. We all know that lucky numbers are the positive integers whose decimal representations contain only the lucky digits4and7. For example, numbers47,744,4are lucky and5,17,467are not.Petya and his friend Vasya play an interesting game. Petya randomly chooses an integerpfrom the interval[pl,pr]and Vasya chooses an integervfrom the interval[vl,vr](also randomly). Both players choose their integers equiprobably. Find the probability that the interval[min(v,p),max(v,p)]contains exactlyklucky numbers.InputThe single line contains five integerspl,pr,vl,vrandk(1 ≤pl≤pr≤ 109, 1 ≤vl≤vr≤ 109, 1 ≤k≤ 1000).OutputOn the single line print the result with an absolute error of no more than10- 9.ExamplesInput1 10 1 10 2Output0.320000000000Input5 6 8 10 1Output1.000000000000NoteConsider that[a,b]denotes an interval of integers; this intervalincludesthe boundaries. That is,In first case there are32suitable pairs:(1, 7), (1, 8), (1, 9), (1, 10), (2, 7), (2, 8), (2, 9), (2, 10), (3, 7), (3, 8), (3, 9), (3, 10), (4, 7), (4, 8), (4, 9), (4, 10), (7, 1), (7, 2), (7, 3), (7, 4), (8, 1), (8, 2), (8, 3), (8, 4), (9, 1), (9, 2), (9, 3), (9, 4), (10, 1), (10, 2), (10, 3), (10, 4). Total number of possible pairs is10·10 = 100, so answer is32 / 100.In second case Petya always get number less than Vasya and the only lucky7is between this numbers, so there will be always1lucky number.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4de85ed0", "template_md5": "35d339e4", "result": "Given two ranges of integers, $[pl, pr]$ and $[vl, vr]$, find the probability that the interval containing the minimum and maximum of a randomly chosen integer from each range will contain exactly $k$ lucky numbers. \n\nA lucky number is a positive integer that contains only the digits 4 and 7."}, {"prompt_md5": "afcd806e", "template_md5": "465699a0", "result": "Two people randomly choose numbers within given ranges.  Find the probability that the interval containing the smaller of their two numbers has exactly a specific number of \"lucky\" numbers (lucky numbers are those containing only the digits 4 and 7)."}]}