{"uid": "1098-B", "url": "https://codeforces.com/contest/1098/problem/B", "tags": ["brute force", " constructive algorithms", " greedy", " math"], "title": "1098-B", "statement": "B. Nice tabletime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an $$$n \\\\times m$$$ table, consisting of characters «A», «G», «C», «T». Let's call a tablenice, if every $$$2 \\\\times 2$$$ square contains all four distinct characters. Your task is to find a nice table (also consisting of «A», «G», «C», «T»), that differs from the given table in the minimum number of characters.InputFirst line contains two positive integers $$$n$$$ and $$$m$$$ — number of rows and columns in the table you are given ($$$2 \\\\leq n, m, n \\\\times m \\\\leq 300\\\\,000$$$). Then, $$$n$$$ lines describing the table follow. Each line contains exactly $$$m$$$ characters «A», «G», «C», «T».OutputOutput $$$n$$$ lines, $$$m$$$ characters each. This table must be nice and differ from the input table in the minimum number of characters.ExamplesInput2 2 AG CTOutputAG CTInput3 5 AGCAG AGCAG AGCAGOutputTGCAT CATGC TGCATNoteIn the first sample, the table is already nice. In the second sample, you can change 9 elements to make the table nice.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "075e9032", "template_md5": "35d339e4", "result": "You are given a table of size $n \\times m$ filled with the characters 'A', 'G', 'C', and 'T'.  \n\nA table is considered \"nice\" if every 2x2 square within the table contains all four of these characters.\n\nYour task is to find a \"nice\" table that is as similar as possible to the given table.  \n\nThe output should be a new table of the same size, also filled with 'A', 'G', 'C', and 'T', that meets the \"nice\" criteria and differs from the input table by the fewest number of characters."}, {"prompt_md5": "ee38429c", "template_md5": "465699a0", "result": "You are given a grid of letters.  Change as few letters as possible to make sure every 2x2 section of the grid contains all four letters. Output the modified grid."}]}