{"uid": "1099-C", "url": "https://codeforces.com/contest/1099/problem/C", "tags": ["constructive algorithms", " implementation"], "title": "1099-C", "statement": "C. Postcardtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAndrey received a postcard from Irina. It contained only the words \"Hello, Andrey!\", and a strange string consisting of lowercase Latin letters, snowflakes and candy canes. Andrey thought that this string is an encrypted message, and decided to decrypt it.Andrey noticed that snowflakes and candy canes always stand after the letters, so he supposed that the message was encrypted as follows. Candy cane means that the letter before it can be removed, or can be left. A snowflake means that the letter before it can be removed, left, or repeated several times.For example, consider the following string:This string can encode the message «happynewyear». For this, candy canes and snowflakes should be used as follows:candy cane 1: remove the letterw,snowflake 1: repeat the letterptwice,candy cane 2: leave the lettern,snowflake 2: remove the letterw,snowflake 3: leave the lettere.Please note that the same string can encode different messages. For example, the string above can encode «hayewyar», «happpppynewwwwwyear», and other messages.Andrey knows that messages from Irina usually have a length of $$$k$$$ letters. Help him to find out if a given string can encode a message of $$$k$$$ letters, and if so, give an example of such a message.InputThe first line contains the string received in the postcard. The string consists only of lowercase Latin letters, as well as the characters «*» and «?», meaning snowflake and candy cone, respectively. These characters can only appear immediately after the letter. The length of the string does not exceed $$$200$$$.The second line contains an integer number $$$k$$$ ($$$1 \\\\leq k \\\\leq 200$$$), the required message length.OutputPrint any message of length $$$k$$$ that the given string can encode, or «Impossible» if such a message does not exist.ExamplesInputhw?ap*yn?eww*ye*ar 12OutputhappynewyearInputab?a 2OutputaaInputab?a 3OutputabaInputababb 5OutputababbInputab?a 1OutputImpossible", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "55d35b95", "template_md5": "35d339e4", "result": "You are given a string consisting of lowercase letters, candy canes (\"*\"), and snowflakes (\"?\").  A candy cane means the preceding letter can be removed or kept. A snowflake means the preceding letter can be removed, kept, or repeated multiple times.\n\nYou are also given an integer $k$.  \n\nDetermine if a message of length $k$ can be created using this string, and if so, provide an example of such a message. If no such message exists, output \"Impossible\"."}, {"prompt_md5": "5f7ad21c", "template_md5": "465699a0", "result": "Given a string with letters, stars (*) and question marks (?), determine if a message of a specific length can be created using the following rules:\n\n* A question mark means the previous letter can be removed or kept.\n* A star means the previous letter can be removed, kept, or repeated multiple times. \n\nIf a message of the given length can be created, output one example. Otherwise, output \"Impossible\"."}]}