{"uid": "11-C", "url": "https://codeforces.com/contest/11/problem/C", "tags": ["implementation"], "title": "11-C", "statement": "C. How Many Squares?time limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutYou are given a 0-1 rectangular matrix. What is the number of squares in it? A square is a solid square frame (border) with linewidth equal to 1. A square should be at least2 × 2. We are only interested in two types of squares:squares with each side parallel to a side of the matrix;squares with each side parallel to a diagonal of the matrix.For example the following matrix contains only one square of the first type:00000000111100010010001001000111100The following matrix contains only one square of the second type:00000000010000010100000100000000000Regardless of type, a square must contain at least one1and can't touch (by side or corner) any foreign1. Of course, the lengths of the sides of each square should be equal.How many squares are in the given matrix?InputThe first line contains integert(1 ≤t≤ 10000), wheretis the number of test cases in the input. Then test cases follow. Each case starts with a line containing integersnandm(2 ≤n,m≤ 250), wherenis the number of rows andmis the number of columns. The followingnlines containmcharacters each (0or1).The total number of characters in all test cases doesn't exceed106for any input file.OutputYou should output exactlytlines, with the answer to thei-th test case on thei-th line.ExamplesInput28 8000100010010100001000100100000100100010000101000110100111100001110 101111111000100000100010110010001011001010100000110110010010101010101000100100100010000010001111111000Output12Input112 11111111111111000000000110111111101101000001011010110010110101100101101000001011010000010110111111101100000000011111111111100000000000Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bc59b248", "template_md5": "35d339e4", "result": "You are given a grid of 0s and 1s.  \n\nA square in this grid is a frame of 1s with sides of equal length.  \n\n* A square must be at least 2x2.\n* A square can be oriented either horizontally or vertically (parallel to a side of the grid) or diagonally (parallel to a diagonal of the grid).\n* A square must contain at least one 1.\n* Squares cannot touch each other (by side or corner).\n\nCount the total number of squares in the grid. \n\n\n\nInput:\n\n* The first line contains the number of test cases (t).\n* Each test case starts with two numbers, n and m, representing the number of rows and columns in the grid.\n* The following n lines contain m characters each, representing the grid.\n\nOutput:\n\n* For each test case, output the number of squares found in the grid."}, {"prompt_md5": "35126ff3", "template_md5": "465699a0", "result": "You are given a grid of 0s and 1s.  Count the number of squares in the grid. A square must be at least 2x2 and must be made up entirely of 1s.  Squares can be oriented either horizontally or diagonally."}]}