{"uid": "1101-C", "url": "https://codeforces.com/contest/1101/problem/C", "tags": ["sortings"], "title": "1101-C", "statement": "C. Division and Uniontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ segments $$$[l_i, r_i]$$$ for $$$1 \\\\le i \\\\le n$$$. You should divide all segments into twonon-emptygroups in such way that there is no pair of segments from different groups which have at least one common point, or say that it's impossible to do it. Each segment should belong to exactly one group.To optimize testing process you will be given multitest.InputThe first line contains one integer $$$T$$$ ($$$1 \\\\le T \\\\le 50000$$$) — the number of queries. Each query contains description of the set of segments. Queries are independent.First line of each query contains single integer $$$n$$$ ($$$2 \\\\le n \\\\le 10^5$$$) — number of segments. It is guaranteed that $$$\\\\sum{n}$$$ over all queries does not exceed $$$10^5$$$.The next $$$n$$$ lines contains two integers $$$l_i$$$, $$$r_i$$$ per line ($$$1 \\\\le l_i \\\\le r_i \\\\le 2 \\\\cdot 10^5$$$) — the $$$i$$$-th segment.OutputFor each query print $$$n$$$ integers $$$t_1, t_2, \\\\dots, t_n$$$ ($$$t_i \\\\in \\\\{1, 2\\\\}$$$) — for each segment (in the same order as in the input) $$$t_i$$$ equals $$$1$$$ if the $$$i$$$-th segment will belongs to the first group and $$$2$$$ otherwise.If there are multiple answers, you can print any of them. If there is no answer, print $$$-1$$$.ExampleInput3 2 5 5 2 3 3 3 5 2 3 2 3 3 3 3 4 4 5 5Output2 1  -1 1 1 2NoteIn the first query the first and the second segments should be in different groups, but exact numbers don't matter.In the second query the third segment intersects with the first and the second segments, so they should be in the same group, but then the other group becomes empty, so answer is $$$-1$$$.In the third query we can distribute segments in any way that makes groups non-empty, so any answer of $$$6$$$ possible is correct.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8eece13b", "template_md5": "35d339e4", "result": "You are given a set of $n$ segments, where each segment is defined by its start and end points ($l_i$, $r_i$).  You need to divide these segments into two groups.  \n\nThe rules are:\n\n* Each segment must belong to exactly one group.\n* No two segments from different groups can overlap (share any common points).\n\nIf it's possible to divide the segments according to these rules, output a list of numbers, one for each segment.  The number 1 indicates the segment belongs to the first group, and 2 indicates it belongs to the second group.\n\nIf it's impossible to divide the segments without overlap, output -1. \n\n\nYou will be given multiple sets of segments to process."}, {"prompt_md5": "14fddfe6", "template_md5": "465699a0", "result": "You are given a set of intervals.  You need to divide the intervals into two groups so that no interval in one group overlaps with any interval in the other group.  If this is impossible, output -1. Otherwise, output a designation for each interval (1 or 2) indicating which group it belongs to."}]}