{"uid": "1102-A", "url": "https://codeforces.com/contest/1102/problem/A", "tags": ["math"], "title": "1102-A", "statement": "A. Integer Sequence Dividingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an integer sequence $$$1, 2, \\\\dots, n$$$. You have to divide it into two sets $$$A$$$ and $$$B$$$ in such a way that each element belongs toexactly oneset and $$$|sum(A) - sum(B)|$$$ is minimum possible.The value $$$|x|$$$ is the absolute value of $$$x$$$ and $$$sum(S)$$$ is the sum of elements of the set $$$S$$$.InputThe first line of the input contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^9$$$).OutputPrint one integer — the minimum possible value of $$$|sum(A) - sum(B)|$$$ if you divide the initial sequence $$$1, 2, \\\\dots, n$$$ into two sets $$$A$$$ and $$$B$$$.ExamplesInput3Output0Input5Output1Input6Output1NoteSome (not all) possible answers to examples:In the first example you can divide the initial sequence into sets $$$A = \\\\{1, 2\\\\}$$$ and $$$B = \\\\{3\\\\}$$$ so the answer is $$$0$$$.In the second example you can divide the initial sequence into sets $$$A = \\\\{1, 3, 4\\\\}$$$ and $$$B = \\\\{2, 5\\\\}$$$ so the answer is $$$1$$$.In the third example you can divide the initial sequence into sets $$$A = \\\\{1, 4, 5\\\\}$$$ and $$$B = \\\\{2, 3, 6\\\\}$$$ so the answer is $$$1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7906c553", "template_md5": "465699a0", "result": "You have a list of numbers from 1 to n.  Divide the list into two groups.  Find the smallest possible difference between the sum of the numbers in the two groups."}, {"prompt_md5": "6fb60ed0", "template_md5": "35d339e4", "result": "You are given a sequence of integers from 1 to $n$. You need to divide this sequence into two sets, A and B. Each integer must belong to exactly one set.  Find the smallest possible difference between the sum of the integers in set A and the sum of the integers in set B. \n\n\nLet me know if you'd like help with solving this problem!"}]}