{"uid": "1103-A", "url": "https://codeforces.com/contest/1103/problem/A", "tags": ["constructive algorithms", " implementation"], "title": "1103-A", "statement": "A. Grid gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a 4x4 grid. You play a game — there is a sequence of tiles, each of them is either 2x1 or 1x2. Your task is to consequently place all tiles from the given sequence in the grid. When tile is placed, each cell which is located in fully occupied row or column is deleted (cells are deleted at the same time independently). You can place tile in the grid at any position, the only condition is that tiles (and tile parts) should not overlap. Your goal is to proceed all given figures and avoid crossing at any time.InputThe only line contains a string $$$s$$$ consisting of zeroes and ones ($$$1 \\\\le |s| \\\\le 1000$$$). Zero describes vertical tile, one describes horizontal tile.OutputOutput $$$|s|$$$ lines — for each tile you should output two positive integers $$$r,c$$$, not exceeding $$$4$$$, representing numbers of smallest row and column intersecting with it.If there exist multiple solutions, print any of them.ExampleInput010Output1 1 1 2 1 4NoteFollowing image illustrates the example after placing all three tiles:Then the first row is deleted:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c1e1d90e", "template_md5": "35d339e4", "result": "You are given a 4x4 grid. You have a sequence of tiles, where '0' represents a vertical tile (2x1) and '1' represents a horizontal tile (1x2).  \n\nYour task is to place all the tiles in the grid one by one.  \n\n* Tiles cannot overlap.\n* When a tile is placed, any entire row or column that is completely covered by the tile is deleted.\n\nYour goal is to place all the tiles without any of them crossing over each other.\n\nFor each tile, output the row number ($r$) and column number ($c$) where the tile is placed.  If there are multiple solutions, any one will work."}, {"prompt_md5": "67199a83", "template_md5": "465699a0", "result": "You have a 4x4 grid and a sequence of rectangular tiles (some are 2x1, some are 1x2).  You must place the tiles on the grid one by one, without overlapping.  After each tile is placed, any full rows or columns are removed.  Your goal is to place all the tiles without ever having them cross.  For each tile, tell me the row and column where it is placed."}]}