{"uid": "1103-D", "url": "https://codeforces.com/contest/1103/problem/D", "tags": ["bitmasks", " dp"], "title": "1103-D", "statement": "D. Professional layertime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputCardbluff is popular sport game in Telegram. Each Cardbluff player has ever dreamed about entrance in the professional layer. There are $$$n$$$ judges now in the layer and you are trying to pass the entrance exam. You have a number $$$k$$$ — your skill in Cardbluff.Each judge has a number $$$a_i$$$ — an indicator of uncertainty about your entrance to the professional layer and a number $$$e_i$$$ — an experience playing Cardbluff. To pass the exam you need to convince all judges by playing with them. You can play onlyonegame with each judge. As a result of a particular game, you can divide the uncertainty of $$$i$$$-th judge by any natural divisor of $$$a_i$$$ which is at most $$$k$$$. If GCD of all indicators is equal to $$$1$$$, you will enter to the professional layer and become a judge.Also, you want to minimize the total amount of spent time. So, if you play with $$$x$$$ judges with total experience $$$y$$$ you will spend $$$x \\\\cdot y$$$ seconds.Print minimal time to enter to the professional layer or $$$-1$$$ if it's impossible.InputThere are two numbers in the first line $$$n$$$ and $$$k$$$ ($$$1 \\\\leq n \\\\leq 10^6$$$, $$$1 \\\\leq k \\\\leq 10^{12}$$$) — the number of judges and your skill in Cardbluff.The second line contains $$$n$$$ integers, where $$$i$$$-th number $$$a_i$$$ ($$$1 \\\\leq a_i \\\\leq 10^{12}$$$) — the uncertainty of $$$i$$$-th judgeThe third line contains $$$n$$$ integers in the same format ($$$1 \\\\leq e_i \\\\leq 10^9$$$), $$$e_i$$$ — the experience of $$$i$$$-th judge.OutputPrint the single integer — minimal number of seconds to pass exam, or $$$-1$$$ if it's impossibleExamplesInput3 6 30 30 30 100 4 5Output18Input1 1000000 1 100Output0Input3 5 7 7 7 1 1 1Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "daaa2b79", "template_md5": "35d339e4", "result": "There are $n$ judges. To become a judge, you need to convince all of them by playing a game with each.  \n\n* Each judge has an uncertainty value $a_i$ and an experience value $e_i$.\n* You can play a game with a judge and reduce their uncertainty by any divisor of $a_i$ that is less than or equal to your skill level $k$.\n* If the greatest common divisor (GCD) of all the judges' uncertainties becomes 1 after playing games, you pass the exam.\n* You want to minimize the total time spent playing games. The time spent playing with $x$ judges with a total experience of $y$ is $x \\cdot y$ seconds.\n\nPrint the minimum time required to pass the exam, or -1 if it's impossible."}, {"prompt_md5": "03173076", "template_md5": "465699a0", "result": "You need to convince a group of people. Each person has a level of uncertainty about you and a level of experience. You can reduce a person's uncertainty by a factor that divides evenly into their uncertainty level, and you can only reduce it by a factor less than or equal to your own skill level. If you can reduce everyone's uncertainty to 1, you succeed. You want to do this in the least amount of time possible, where the time spent with a person is equal to their experience level multiplied by the number of people you interact with.  Is it possible to succeed, and if so, what is the minimum time?"}]}