{"uid": "1108-C", "url": "https://codeforces.com/contest/1108/problem/C", "tags": ["brute force", " greedy", " math"], "title": "1108-C", "statement": "C. Nice Garlandtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have a garland consisting of $$$n$$$ lamps. Each lamp is colored red, green or blue. The color of the $$$i$$$-th lamp is $$$s_i$$$ ('R', 'G' and 'B' — colors of lamps in the garland).You have to recolor some lamps in this garland (recoloring a lamp means changing its initial color to another) in such a way that the obtained garland isnice.A garland is calledniceif any two lamps of the same color have distance divisible by three between them. I.e. if the obtained garland is $$$t$$$, then for each $$$i, j$$$ such that $$$t_i = t_j$$$ should be satisfied $$$|i-j|~ mod~ 3 = 0$$$. The value $$$|x|$$$ means absolute value of $$$x$$$, the operation $$$x~ mod~ y$$$ means remainder of $$$x$$$ when divided by $$$y$$$.For example, the following garlands arenice: \"RGBRGBRG\", \"GB\", \"R\", \"GRBGRBG\", \"BRGBRGB\". The following garlands are notnice: \"RR\", \"RGBG\".Among all ways to recolor the initial garland to make itniceyou have to choose one with theminimumnumber of recolored lamps. If there are multiple optimal solutions, printanyof them.InputThe first line of the input contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the number of lamps.The second line of the input contains the string $$$s$$$ consisting of $$$n$$$ characters 'R', 'G' and 'B' — colors of lamps in the garland.OutputIn the first line of the output print one integer $$$r$$$ — theminimumnumber of recolors needed to obtain anicegarland from the given one.In the second line of the output print one string $$$t$$$ of length $$$n$$$ — anicegarland obtained from the initial one withminimumnumber of recolors. If there are multiple optimal solutions, printanyof them.ExamplesInput3 BRBOutput1 GRBInput7 RGBGRBBOutput3 RGBRGBR", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "41dde5d9", "template_md5": "35d339e4", "result": "You are given a string of characters representing a garland of lamps, where each character is 'R', 'G', or 'B' representing red, green, or blue.  \n\nYou need to recolor some of the lamps to make the garland \"nice\". A garland is nice if any two lamps of the same color are at least three positions apart.\n\nFind the minimum number of lamps you need to recolor to make the garland nice, and output that number followed by the resulting nice garland. If there are multiple solutions, output any one."}, {"prompt_md5": "a0ced523", "template_md5": "465699a0", "result": "You have a string of colored lights (R, G, or B).  You need to change some lights to a different color so that no two lights of the same color are next to each other or three lights apart. Find the fewest changes needed and show one possible solution."}]}