{"uid": "111-E", "url": "https://codeforces.com/contest/111/problem/E", "tags": [], "title": "111-E", "statement": "E. Petya and Rectangletime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya loves playing with rectangles. Mom bought Petya a rectangle divided into cellsn×min size (containingnrows,mcolumns). Petya marked two different cells of the rectangle and now he is solving the following task:Let's define asimple pathbetween those two cells as a sequence of distinct cellsa1,a2, ...,ak, wherea1andakare the two marked cells. Besides,aiandai+ 1are side-neighboring cells of the path (1 ≤i<k). Let's denote the path length as numberk(the sequence length).Petya's task is to find the longest simple path's length and to print the path. Help him.InputThe first line contains space-separated integersnandm(4 ≤n,m≤ 1000) — the number of rows and the number of columns in the rectangle, correspondingly. The second line contains space-separated integersx1andy1— the coordinates of the first marked cell. The third line contains space-separated integersx2y2— the coordinates of the second marked cell (1 <x1,x2<n, 1 <y1,y2<m,x1≠x2,y1≠y2).The coordinates of a marked cell are a pair of integersxy, wherexrepresents the row's number andyrepresents the column's number. The rows are numbered from top to bottom with consecutive integers from1ton. The columns are numbered from the left to the right by consecutive integers from1tom.It is guaranteed that the marked cells are not positioned in one row or column.OutputIn the first line print the length of the found path —k. In the next lines printkpairs of integers, one per line — coordinates of the cells that constitute the found path in the order, in which they follow in the path (the path must go from cell(x1,y1)to cell(x2,y2)). If there are several solutions, print any of them.ExamplesInput4 42 23 3Output152 21 21 12 13 14 14 24 34 43 42 41 41 32 33 3NoteThe statement test is described in the picture:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2a6731ba", "template_md5": "35d339e4", "result": "You are given a rectangle with $n$ rows and $m$ columns. Two distinct cells in the rectangle are marked.  \n\nFind the longest path between these two cells, where a path is a sequence of distinct cells where each cell is directly next to the previous cell (horizontally or vertically).\n\nOutput the length of the longest path and the coordinates of the cells that make up the path."}, {"prompt_md5": "84ffb57c", "template_md5": "465699a0", "result": "You are given a grid of cells. Two cells are marked. Find the longest path between the two marked cells, where each step can only move to an adjacent cell (up, down, left, or right). Print the length of the path and the sequence of cells that make up the path."}]}