{"uid": "1110-H", "url": "https://codeforces.com/contest/1110/problem/H", "tags": ["dp", " strings"], "title": "1110-H", "statement": "H. Modest Substringstime limit per test5 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputYou are given two integers $$$l$$$ and $$$r$$$.Let's call an integer $$$x$$$modest, if $$$l \\\\le x \\\\le r$$$.Find a string of length $$$n$$$, consisting of digits, which has the largest possible number of substrings, which make a modest integer. Substring having leading zeros are not counted. If there are many answers, find lexicographically smallest one.If some number occurs multiple times as a substring, then in the counting of the number of modest substrings it is counted multiple times as well.InputThe first line contains one integer $$$l$$$ ($$$1 \\\\le l \\\\le 10^{800}$$$).The second line contains one integer $$$r$$$ ($$$l \\\\le r \\\\le 10^{800}$$$).The third line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 2\\\\,000$$$).OutputIn the first line, print the maximum possible number of modest substrings.In the second line, print a string of length $$$n$$$ having exactly that number of modest substrings.If there are multiple such strings, print the lexicographically smallest of them.ExamplesInput1 10 3Output3 101Input1 11 3Output5 111Input12345 12346 6Output1 012345NoteIn the first example, string «101» has modest substrings «1», «10», «1».In the second example, string «111» has modest substrings «1» ($$$3$$$ times) and «11» ($$$2$$$ times).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e7d7db3", "template_md5": "35d339e4", "result": "You are given two integers $l$ and $r$.  A substring of a string is considered \"modest\" if the integer formed by the substring is between $l$ and $r$ inclusive.\n\nFind the longest possible string of length $n$ that has the most modest substrings. If there are multiple strings with the same maximum number of modest substrings, output the lexicographically smallest one. \n\n**Input:**\n\n* Line 1: Integer $l$ ($1 \\le l \\le 10^{800}$)\n* Line 2: Integer $r$ ($l \\le r \\le 10^{800}$)\n* Line 3: Integer $n$ ($1 \\le n \\le 2000$)\n\n**Output:**\n\n* Line 1: The maximum number of modest substrings possible.\n* Line 2: A string of length $n$ with that maximum number of modest substrings."}, {"prompt_md5": "72e3e3c0", "template_md5": "465699a0", "result": "You are given a range of numbers (l to r). Find the longest string of digits that has the most substrings within that range. If there are multiple strings that work, choose the shortest one alphabetically."}]}