{"uid": "1111-A", "url": "https://codeforces.com/contest/1111/problem/A", "tags": ["implementation", " strings"], "title": "1111-A", "statement": "A. Superhero Transformationtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWe all know that a superhero can transform to certain other superheroes. But not all Superheroes can transform to any other superhero. A superhero with name $$$s$$$ can transform to another superhero with name $$$t$$$ if $$$s$$$ can be made equal to $$$t$$$ by changing any vowel in $$$s$$$ to any other vowel and any consonant in $$$s$$$ to any other consonant. Multiple changes can be made.In this problem, we consider the letters 'a', 'e', 'i', 'o' and 'u' to be vowels and all the other letters to be consonants.Given the names of two superheroes, determine if the superhero with name $$$s$$$ can be transformed to the Superhero with name $$$t$$$.InputThe first line contains the string $$$s$$$ having length between $$$1$$$ and $$$1000$$$, inclusive.The second line contains the string $$$t$$$ having length between $$$1$$$ and $$$1000$$$, inclusive.Both strings $$$s$$$ and $$$t$$$ are guaranteed to be different and consist of lowercase English letters only.OutputOutput \"Yes\" (without quotes) if the superhero with name $$$s$$$ can be transformed to the superhero with name $$$t$$$ and \"No\" (without quotes) otherwise.You can print each letter in any case (upper or lower).ExamplesInputa uOutputYesInputabc ukmOutputYesInputakm uaOutputNoNoteIn the first sample, since both 'a' and 'u' are vowels, it is possible to convert string $$$s$$$ to $$$t$$$.In the third sample, 'k' is a consonant, whereas 'a' is a vowel, so it is not possible to convert string $$$s$$$ to $$$t$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bc6fd115", "template_md5": "465699a0", "result": "Given two strings, determine if you can change vowels to other vowels and consonants to other consonants in the first string to make it equal to the second string."}, {"prompt_md5": "65aac193", "template_md5": "35d339e4", "result": "Given two strings,  $s$ and $t$, determine if you can transform string $s$ into string $t$ by changing any vowel to any other vowel and any consonant to any other consonant.  You can make multiple changes.\n\nVowels are: a, e, i, o, u. \n\nOutput \"Yes\" if it's possible to transform $s$ into $t$, and \"No\" otherwise."}]}