{"uid": "1111-D", "url": "https://codeforces.com/contest/1111/problem/D", "tags": ["combinatorics", " dp", " math"], "title": "1111-D", "statement": "D. Destroy the Colonytime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere is a colony of villains with several holes aligned in a row, where each hole contains exactly one villain.Each colony arrangement can be expressed as a string ofevenlength, where the $$$i$$$-th character of the string represents the type of villain in the $$$i$$$-th hole.Iron Man can destroy a colony only if the colony arrangement is such that all villains of a certain type either live in the first half of the colony or in the second half of the colony.His assistant Jarvis has a special power. It can swap villains of any two holes, i.e. swap any two characters in the string; he can do this operation any number of times.Now Iron Man asks Jarvis $$$q$$$ questions. In each question, he gives Jarvis two numbers $$$x$$$ and $$$y$$$. Jarvis has to tell Iron Man the number of distinct colony arrangements he can create from the original one using his powers such that all villains having the same type as those originally living in $$$x$$$-th hole or $$$y$$$-th hole live in the same half and the Iron Man can destroy that colony arrangement.Two colony arrangements are considered to be different if there exists a hole such that different types of villains are present in that hole in the arrangements.InputThe first line contains a string $$$s$$$ ($$$2 \\\\le |s| \\\\le 10^{5}$$$), representing the initial colony arrangement. String $$$s$$$ can have both lowercase and uppercase English letters and its length iseven.The second line contains a single integer $$$q$$$ ($$$1 \\\\le q \\\\le 10^{5}$$$) — the number of questions.The $$$i$$$-th of the next $$$q$$$ lines contains two integers $$$x_i$$$ and $$$y_i$$$ ($$$1 \\\\le x_i, y_i \\\\le |s|$$$, $$$x_i \\\\ne y_i$$$) — the two numbers given to the Jarvis for the $$$i$$$-th question.OutputFor each question output the number of arrangements possible modulo $$$10^9+7$$$.ExamplesInputabba 2 1 4 1 2Output2 0InputAAaa 2 1 2 1 3Output2 0Inputabcd 1 1 3Output8NoteConsider the first example. For the first question, the possible arrangements are \"aabb\" and \"bbaa\", and for the second question, index $$$1$$$ contains 'a' and index $$$2$$$ contains 'b' and there is no valid arrangement in which all 'a' and 'b' are in the same half.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "adb7e083", "template_md5": "35d339e4", "result": "You are given a string of even length representing a colony of villains. Each character in the string represents a type of villain. \n\nA colony can be destroyed if all villains of a certain type are either in the first half or the second half of the colony.\n\nYou can swap any two villains in the colony.\n\nYou are asked multiple questions. Each question gives you two indices. You need to find the number of ways to swap the villains so that:\n\n* All villains of the type at the first index and the type at the second index are in the same half of the colony.\n\nOutput the number of possible arrangements modulo $10^9+7$."}, {"prompt_md5": "e9a4b5a2", "template_md5": "465699a0", "result": "You are given a string representing a line of objects.  Each object has a type. You can swap any two objects.  You need to count how many ways you can rearrange the objects so that all objects of a given type are either all on the left side or all on the right side.  You are asked to do this for several pairs of objects."}]}