{"uid": "1111-C", "url": "https://codeforces.com/contest/1111/problem/C", "tags": ["binary search", " brute force", " divide and conquer", " math"], "title": "1111-C", "statement": "C. Creative Snaptime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThanos wants to destroy the avengers base, but he needs to destroy the avengers along with their base.Let we represent their base with an array, where each position can be occupied by many avengers, but one avenger can occupy only one position. Length of their base is a perfect power of $$$2$$$. Thanos wants to destroy the base using minimum power. He starts with the whole base and in one step he can do either of following:if the current length is at least $$$2$$$, divide the base into $$$2$$$ equal halves and destroy them separately, orburn the current base. If it contains no avenger in it, it takes $$$A$$$ amount of power, otherwise it takes his $$$B \\\\cdot n_a \\\\cdot l$$$ amount of power, where $$$n_a$$$ is the number of avengers and $$$l$$$ is the length of the current base.Output the minimum power needed by Thanos to destroy the avengers' base.InputThe first line contains four integers $$$n$$$, $$$k$$$, $$$A$$$ and $$$B$$$ ($$$1 \\\\leq n \\\\leq 30$$$, $$$1 \\\\leq k \\\\leq 10^5$$$, $$$1 \\\\leq A,B \\\\leq 10^4$$$), where $$$2^n$$$ is the length of the base, $$$k$$$ is the number of avengers and $$$A$$$ and $$$B$$$ are the constants explained in the question.The second line contains $$$k$$$ integers $$$a_{1}, a_{2}, a_{3}, \\\\ldots, a_{k}$$$ ($$$1 \\\\leq a_{i} \\\\leq 2^n$$$), where $$$a_{i}$$$ represents the position of avenger in the base.OutputOutput one integer — the minimum power needed to destroy the avengers base.ExamplesInput2 2 1 2 1 3Output6Input3 2 1 2 1 7Output8NoteConsider the first example.One option for Thanos is to burn the whole base $$$1-4$$$ with power $$$2 \\\\cdot 2 \\\\cdot 4 = 16$$$.Otherwise he can divide the base into two parts $$$1-2$$$ and $$$3-4$$$.For base $$$1-2$$$, he can either burn it with power $$$2 \\\\cdot 1 \\\\cdot 2 = 4$$$ or divide it into $$$2$$$ parts $$$1-1$$$ and $$$2-2$$$.For base $$$1-1$$$, he can burn it with power $$$2 \\\\cdot 1 \\\\cdot 1 = 2$$$. For $$$2-2$$$, he can destroy it with power $$$1$$$, as there are no avengers. So, the total power for destroying $$$1-2$$$ is $$$2 + 1 = 3$$$, which is less than $$$4$$$.Similarly, he needs $$$3$$$ power to destroy $$$3-4$$$. The total minimum power needed is $$$6$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "911a40ac", "template_md5": "35d339e4", "result": "You are given an array of length $2^n$ representing a base. Some positions in the array contain avengers, and each avenger occupies only one position.  \n\nYou can destroy the base in the following ways:\n\n1. If the length of the base is at least 2, divide it into two equal halves and destroy them separately.\n2. Burn the entire base.\n\nBurning the base costs $A$ power if it is empty, otherwise it costs $B \\cdot n_a \\cdot l$ power, where $n_a$ is the number of avengers in the base and $l$ is the length of the base.\n\nFind the minimum power required to destroy the base.\n\n**Input:**\n\n* $n$: An integer such that $2^n$ is the length of the base.\n* $k$: The number of avengers in the base.\n* $A$: The cost of burning an empty base.\n* $B$: The cost per avenger per unit length of the base.\n* $a_1, a_2, ..., a_k$: The positions of the avengers in the base.\n\n**Output:**\n\n* The minimum power required to destroy the base."}, {"prompt_md5": "d1adda04", "template_md5": "465699a0", "result": "You are given a line of length $2^n$ that can have avengers at certain positions. You can destroy the line in two ways:\n\n1. Divide the line into two equal halves and destroy them separately.\n2. Burn the entire line.\n\nBurning the line costs a fixed amount of power if it's empty, otherwise it costs a power proportional to the number of avengers and the length of the line.\n\nFind the minimum power needed to destroy the line."}]}