{"uid": "1113-B", "url": "https://codeforces.com/contest/1113/problem/B", "tags": ["greedy", " number theory"], "title": "1113-B", "statement": "B. Sasha and Magnetic Machinestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOne day Sasha visited the farmer 2D and his famous magnetic farm. On this farm, the crop grows due to the influence of a special magnetic field. Maintaining of the magnetic field is provided by $$$n$$$ machines, and the power of the $$$i$$$-th machine is $$$a_i$$$.This year 2D decided to cultivate a new culture, but what exactly he didn't say. For the successful growth of the new culture, it is necessary to slightly change the powers of the machines. 2D canat most oncechoose an arbitrary integer $$$x$$$, then choose one machine and reduce the power of its machine by $$$x$$$ times, and at the same time increase the power of one another machine by $$$x$$$ times (powers of all the machines must staypositive integers). Note that he may not do that if he wants. More formally, 2D can choose two such indices $$$i$$$ and $$$j$$$, and one integer $$$x$$$ such that $$$x$$$ is a divisor of $$$a_i$$$, and change powers as following: $$$a_i = \\\\frac{a_i}{x}$$$, $$$a_j = a_j \\\\cdot x$$$Sasha is very curious, that's why he wants to calculate theminimumtotal power the farmer can reach. There are too many machines, and Sasha can't cope with computations, help him!InputThe first line contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 5 \\\\cdot 10^4$$$) — the number of machines.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 100$$$) — the powers of the machines.OutputPrint one integer — minimum total power.ExamplesInput5 1 2 3 4 5Output14Input4 4 2 4 4Output14Input5 2 4 2 3 7Output18NoteIn the first example, the farmer can reduce the power of the $$$4$$$-th machine by $$$2$$$ times, and increase the power of the $$$1$$$-st machine by $$$2$$$ times, then the powers will be: $$$[2, 2, 3, 2, 5]$$$.In the second example, the farmer can reduce the power of the $$$3$$$-rd machine by $$$2$$$ times, and increase the power of the $$$2$$$-nd machine by $$$2$$$ times. At the same time, the farmer can leave is be as it is and the total power won't change.In the third example, it is optimal to leave it be as it is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "23b126f9", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, $a_1, a_2, ..., a_n$, representing the power of $n$ machines. You can perform the following operation at most once:\n\n1. Choose two indices $i$ and $j$ where $1 \\le i, j \\le n$.\n2. Choose an integer $x$ that divides $a_i$.\n3. Set $a_i = \\frac{a_i}{x}$ and $a_j = a_j \\cdot x$.\n\nFind the minimum possible sum of the powers of the machines after performing the operation (or if the operation is not performed, the sum of the original powers). \n\n**Constraints:**\n\n* $2 \\le n \\le 5 \\cdot 10^4$\n* $1 \\le a_i \\le 100$"}, {"prompt_md5": "6b233b01", "template_md5": "465699a0", "result": "You are given a list of positive integers. You can choose two numbers from the list and a divisor of one of them. You can then divide the first number by the divisor and multiply the second number by the divisor.  What is the smallest possible sum of all the numbers after you perform this operation at most once?"}]}