{"uid": "1114-D", "url": "https://codeforces.com/contest/1114/problem/D", "tags": ["dp"], "title": "1114-D", "statement": "D. Flood Filltime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a line of $$$n$$$ colored squares in a row, numbered from $$$1$$$ to $$$n$$$ from left to right. The $$$i$$$-th square initially has the color $$$c_i$$$.Let's say, that two squares $$$i$$$ and $$$j$$$ belong to the same connected component if $$$c_i = c_j$$$, and $$$c_i = c_k$$$ for all $$$k$$$ satisfying $$$i < k < j$$$. In other words, all squares on the segment from $$$i$$$ to $$$j$$$ should have the same color.For example, the line $$$[3, 3, 3]$$$ has $$$1$$$ connected component, while the line $$$[5, 2, 4, 4]$$$ has $$$3$$$ connected components.The game \"flood fill\" is played on the given line as follows:At the start of the game you pick any starting square (this is not counted as a turn).Then, in each game turn, change the color of the connected component containing the starting square to any other color.Find the minimum number of turns needed for the entire line to be changed into a single color.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 5000$$$) — the number of squares.The second line contains integers $$$c_1, c_2, \\\\ldots, c_n$$$ ($$$1 \\\\le c_i \\\\le 5000$$$) — the initial colors of the squares.OutputPrint a single integer — the minimum number of the turns needed.ExamplesInput4 5 2 2 1Output2Input8 4 5 2 2 1 3 5 5Output4Input1 4Output0NoteIn the first example, a possible way to achieve an optimal answer is to pick square with index $$$2$$$ as the starting square and then play as follows:$$$[5, 2, 2, 1]$$$$$$[5, 5, 5, 1]$$$$$$[1, 1, 1, 1]$$$In the second example, a possible way to achieve an optimal answer is to pick square with index $$$5$$$ as the starting square and then perform recoloring into colors $$$2, 3, 5, 4$$$ in that order.In the third example, the line already consists of one color only.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "18408132", "template_md5": "35d339e4", "result": "You are given a line of $n$ colored squares. Each square has a color from 1 to 5000.  Two squares are connected if they have the same color and all the squares between them also have the same color.\n\nThe goal is to change all the squares to a single color using the following rule:\n\n* In each turn, you choose a connected group of squares and change their color to any other color.\n\nWhat is the minimum number of turns needed to change all the squares to a single color?"}, {"prompt_md5": "862604e9", "template_md5": "465699a0", "result": "You have a line of colored squares.  You can change the color of a group of connected squares (all the same color) to a new color in one turn. What is the fewest turns it takes to make all the squares the same color?"}]}