{"uid": "1116-C2", "url": "https://codeforces.com/contest/1116/problem/C2", "tags": [], "title": "1116-C2", "statement": "C2. \"Is the bit string periodic?\" oracletime limit per test4 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputImplement a quantum oracle on $$$N$$$ qubits which checks whether the bits in the input vector $$$\\\\vec{x}$$$ form a periodic bit string (i.e., implements the function $$$f(\\\\vec{x}) = 1$$$ if $$$\\\\vec{x}$$$ is periodic, and 0 otherwise).A bit string of length $$$N$$$ is considered periodic with period $$$P$$$ ($$$1 \\\\le P \\\\le N - 1$$$) if for all $$$i \\\\in [0, N - P - 1]$$$ $$$x_i = x_{i + P}$$$. Note that $$$P$$$ does not have to divide $$$N$$$ evenly; for example, bit string\"01010\"is periodic with period $$$P = 2$$$.You have to implement an operation which takes the following inputs:an array of $$$N$$$ ($$$2 \\\\le N \\\\le 7$$$) qubits $$$x$$$ in an arbitrary state (input register),a qubit $$$y$$$ in an arbitrary state (output qubit),and performs a transformation $$$|x\\\\rangle|y\\\\rangle \\\\rightarrow |x\\\\rangle|y \\\\oplus f(x)\\\\rangle$$$. The operation doesn't have an output; its \"output\" is the state in which it leaves the qubits. Note that the input register $$$x$$$ has to remain unchanged after applying the operation.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Primitive;open Microsoft.Quantum.Canon;operation Solve (x : Qubit[], y : Qubit) : Unit {body (...) {// your code here}adjoint auto;}}Note: the operation has to have an adjoint specified for it;adjoint automeans that the adjoint will be generated automatically. For details on adjoint, seeOperation Definitions.You are not allowed to use measurements in your operation.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "631f6c10", "template_md5": "35d339e4", "result": "You are given a set of $N$ qubits ($2 \\le N \\le 7$) representing a bit string.  You need to create a quantum operation that takes these qubits and an additional qubit as input.  \n\nThe operation should:\n\n1. Leave the input qubits unchanged.\n2. Flip the state of the additional qubit if and only if the input bit string is periodic.\n\nA bit string is periodic with period $P$ ($1 \\le P \\le N-1$) if for all $i$ from 0 to $N-P-1$, the $i$th bit is equal to the $(i+P)$th bit.\n\nThe operation should not use any measurements. You also need to provide the adjoint of this operation."}, {"prompt_md5": "2c88e74e", "template_md5": "465699a0", "result": "You need to write a program that takes a sequence of bits and a single qubit as input. The program should change the state of the single qubit based on whether the sequence of bits is repeating. If the sequence is repeating, the single qubit should be flipped. If the sequence is not repeating, the single qubit should remain unchanged."}]}