{"uid": "1116-D4", "url": "https://codeforces.com/contest/1116/problem/D4", "tags": [], "title": "1116-D4", "statement": "D4. TIE fightertime limit per test2 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputImplement a unitary operation on $$$N$$$ qubits which is represented by a square matrix of size $$$2^N$$$ which has non-zero elements in the following positions:the central 2x2 sub-matrix,the diagonals of the top right and bottom left square sub-matrices of size $$$2^{N-1}-1$$$ that do not overlap with the central 2x2 sub-matrix,the anti-diagonals of the top left and bottom right square sub-matrices of size $$$2^{N-1}-1$$$ that do not overlap with the central 2x2 sub-matrix.For example, for $$$N = 3$$$ the matrix of the operation should have the following shape:..X..X...X....X.X......X...XX......XX...X......X.X....X...X..X..HereXdenotes a \"non-zero\" element of the matrix (a complex number which has the square of the absolute value greater than or equal to $$$10^{-5}$$$), and.denotes a \"zero\" element of the matrix (a complex number which has the square of the absolute value less than $$$10^{-5}$$$).The row and column indices of the matrix follow little endian format: the least significant bit of the index is stored first in the qubit array. Thus, the first column of the matrix gives you the coefficients of the basis states you'll get if you apply the unitary to the $$$|00..0\\\\rangle$$$ basis state, the second column - to the $$$|10..0\\\\rangle$$$ basis state etc. You can use theDumpUnitary toolto get the coefficients of the matrix your unitary implements (up to relative phases between columns) and the corresponding pattern ofXs and.s.You have to implement an operation which takes an array of $$$N$$$ ($$$2 \\\\le N \\\\le 5$$$) qubits as an input and applies the unitary transformation with the matrix of the described shape to it. If there are multiple unitaries which satisfy the requirements, you can implement any of them. The \"output\" of your operation is the pattern of the matrix coefficients implemented by it; you can see the testing harness in theUnitaryPatternskata.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Primitive;open Microsoft.Quantum.Canon;operation Solve (qs : Qubit[]) : Unit {// your code here}}You are not allowed to use measurements in your operation.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "25b0bc8d", "template_md5": "35d339e4", "result": "You are given a number $N$ ($2 \\le N \\le 5$).  You need to design a quantum operation that acts on $N$ qubits. This operation is represented by a square matrix of size $2^N$. The matrix has non-zero elements in the following specific positions:\n\n* A central $2 \\times 2$ sub-matrix.\n* The diagonals of two square sub-matrices of size $2^{N-1}-1$ located in the top-right and bottom-left corners, excluding the central $2 \\times 2$ sub-matrix.\n* The anti-diagonals of two square sub-matrices of size $2^{N-1}-1$ located in the top-left and bottom-right corners, excluding the central $2 \\times 2$ sub-matrix.\n\nThe matrix elements are complex numbers.  A non-zero element has a squared absolute value greater than or equal to $10^{-5}$, while a zero element has a squared absolute value less than $10^{-5}$.\n\nYou need to write a program that takes an array of $N$ qubits as input and applies this unitary transformation to them. The output of your program is the pattern of the matrix coefficients. \n\nYou cannot use measurements in your operation."}, {"prompt_md5": "3f0a504c", "template_md5": "465699a0", "result": "You need to write a program that applies a specific transformation to a set of qubits. This transformation is defined by a matrix with a particular pattern of \"on\" and \"off\" values. The program should output the pattern of the matrix used for the transformation."}]}