{"uid": "1118-C", "url": "https://codeforces.com/contest/1118/problem/C", "tags": ["constructive algorithms", " implementation"], "title": "1118-C", "statement": "C. Palindromic Matrixtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's call some square matrix with integer values in its cellspalindromicif it doesn't change after the order of rows is reversed and it doesn't change after the order of columns is reversed.For example, the following matrices arepalindromic:The following matrices arenotpalindromicbecause they change after the order of rows is reversed:The following matrices arenotpalindromicbecause they change after the order of columns is reversed:You are given $$$n^2$$$ integers. Put them into a matrix of $$$n$$$ rows and $$$n$$$ columns so that each number is used exactly once, each cell contains exactly one number and the resulting matrix ispalindromic. If there are multiple answers, print any. If there is no solution, print \"NO\".InputThe first line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 20$$$).The second line contains $$$n^2$$$ integers $$$a_1, a_2, \\\\dots, a_{n^2}$$$ ($$$1 \\\\le a_i \\\\le 1000$$$) — the numbers to put into a matrix of $$$n$$$ rows and $$$n$$$ columns.OutputIf it is possible to put all of the $$$n^2$$$ numbers into a matrix of $$$n$$$ rows and $$$n$$$ columns so that each number is used exactly once, each cell contains exactly one number and the resulting matrix ispalindromic, then print \"YES\". Then print $$$n$$$ lines with $$$n$$$ space-separated numbers — the resulting matrix.If it's impossible to construct any matrix, then print \"NO\".You can print each letter in any case (upper or lower). For example, \"YeS\", \"no\" and \"yES\" are all acceptable.ExamplesInput4 1 8 8 1 2 2 2 2 2 2 2 2 1 8 8 1OutputYES 1 2 2 1 8 2 2 8 8 2 2 8 1 2 2 1Input3 1 1 1 1 1 3 3 3 3OutputYES 1 3 1 3 1 3 1 3 1Input4 1 2 1 9 8 4 3 8 8 3 4 8 9 2 1 1OutputNOInput1 10OutputYES 10NoteNote that there exist multiple answers for the first two examples.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5b4fae75", "template_md5": "35d339e4", "result": "You are given $n^2$ integers.  You need to arrange these integers into an $n \\times n$ matrix such that:\n\n* Each integer is used exactly once.\n* Each cell in the matrix contains exactly one integer.\n* The matrix is palindromic, meaning it reads the same upside down and sideways.\n\nIf it's possible to create such a matrix, print \"YES\" followed by the matrix. If it's not possible, print \"NO\"."}, {"prompt_md5": "970c154f", "template_md5": "465699a0", "result": "You are given a set of numbers.  Arrange them into a square matrix so that:\n\n* Each number is used exactly once.\n* The matrix reads the same upside down and sideways.\n\nIf this is possible, print \"YES\" and the matrix. If not, print \"NO\"."}]}