{"uid": "1129-D", "url": "https://codeforces.com/contest/1129/problem/D", "tags": ["data structures", " dp"], "title": "1129-D", "statement": "D. Isolationtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputFind the number of ways to divide an array $$$a$$$ of $$$n$$$ integers into any number of disjoint non-empty segments so that, in each segment, there exist at most $$$k$$$ distinct integers that appear exactly once.Since the answer can be large, find it modulo $$$998\\\\,244\\\\,353$$$.InputThe first line contains two space-separated integers $$$n$$$ and $$$k$$$ ($$$1 \\\\leq k \\\\leq n \\\\leq 10^5$$$) — the number of elements in the array $$$a$$$ and the restriction from the statement.The following line contains $$$n$$$ space-separated integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\leq a_i \\\\leq n$$$) — elements of the array $$$a$$$.OutputThe first and only line contains the number of ways to divide an array $$$a$$$ modulo $$$998\\\\,244\\\\,353$$$.ExamplesInput3 1 1 1 2Output3Input5 2 1 1 2 1 3Output14Input5 5 1 2 3 4 5Output16NoteIn the first sample, the three possible divisions are as follows.$$$[[1], [1], [2]]$$$$$$[[1, 1], [2]]$$$$$$[[1, 1, 2]]$$$Division $$$[[1], [1, 2]]$$$ is not possible because two distinct integers appear exactly once in the second segment $$$[1, 2]$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2f95dfd7", "template_md5": "465699a0", "result": "You are given a list of numbers.  Find the number of ways to split the list into groups, where each group has at most  'k' unique numbers, and each number in a group appears only once.  The answer should be the count of these splits, calculated modulo 998244353."}, {"prompt_md5": "9062e514", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers ($a_1, a_2, ..., a_n$).  You need to divide this array into segments.  \n\n* Each segment must have at least one integer.\n* Each segment can have any number of integers.\n* In each segment, there can be at most $k$ distinct integers, and each of those distinct integers must appear exactly once.\n\nFind the number of ways to divide the array into segments, and output the result modulo 998244353."}]}