{"uid": "1131-B", "url": "https://codeforces.com/contest/1131/problem/B", "tags": ["greedy", " implementation"], "title": "1131-B", "statement": "B. Draw!time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou still have partial information about the score during the historic football match. You are given a set of pairs $$$(a_i, b_i)$$$, indicating that at some point during the match the score was \"$$$a_i$$$: $$$b_i$$$\". It is known that if the current score is «$$$x$$$:$$$y$$$», then after the goal it will change to \"$$$x+1$$$:$$$y$$$\" or \"$$$x$$$:$$$y+1$$$\". What is the largest number of times a draw could appear on the scoreboard?The pairs \"$$$a_i$$$:$$$b_i$$$\" are given in chronological order (time increases), but you are given score only for some moments of time. The last pair corresponds to the end of the match.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10000$$$) — the number of known moments in the match.Each of the next $$$n$$$ lines contains integers $$$a_i$$$ and $$$b_i$$$ ($$$0 \\\\le a_i, b_i \\\\le 10^9$$$), denoting the score of the match at that moment (that is, the number of goals by the first team and the number of goals by the second team).All moments are given in chronological order, that is, sequences $$$x_i$$$ and $$$y_j$$$ are non-decreasing. The last score denotes the final result of the match.OutputPrint the maximum number of moments of time, during which the score was a draw. The starting moment of the match (with a score 0:0) is also counted.ExamplesInput32 03 13 4Output2Input30 00 00 0Output1Input15 4Output5NoteIn the example one of the possible score sequences leading to the maximum number of draws is as follows: 0:0, 1:0, 2:0, 2:1, 3:1, 3:2, 3:3, 3:4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8a79029f", "template_md5": "35d339e4", "result": "You are given a list of scores from a football match. Each score is represented as  $a_i:b_i$, where $a_i$ is the number of goals scored by the first team and $b_i$ is the number of goals scored by the second team. The scores are given in chronological order.\n\nYour task is to find the maximum number of times the score was a draw during the match. A draw occurs when $a_i = b_i$. \n\n\nThe starting score of 0:0 is also considered a draw."}, {"prompt_md5": "7019d174", "template_md5": "465699a0", "result": "You are given a list of scores from a football match at different points in time.  The scores only increase by 1 at a time.  Find the maximum number of times the score was tied."}]}