{"uid": "1132-A", "url": "https://codeforces.com/contest/1132/problem/A", "tags": ["greedy", " implementation"], "title": "1132-A", "statement": "A. Regular Bracket Sequencetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA string is calledbracket sequenceif it does not contain any characters other than \"(\" and \")\". A bracket sequence is calledregularif it it is possible to obtain correct arithmetic expression by inserting characters \"+\" and \"1\" into this sequence. For example, \"\", \"(())\" and \"()()\" are regular bracket sequences; \"))\" and \")((\" are bracket sequences (but not regular ones), and \"(a)\" and \"(1)+(1)\" are not bracket sequences at all.You have a number of strings; each string is a bracket sequence of length $$$2$$$. So, overall you have $$$cnt_1$$$ strings \"((\", $$$cnt_2$$$ strings \"()\", $$$cnt_3$$$ strings \")(\" and $$$cnt_4$$$ strings \"))\". You want to write all these strings in some order, one after another; after that, you will get a long bracket sequence of length $$$2(cnt_1 + cnt_2 + cnt_3 + cnt_4)$$$. You wonder: is it possible to choose some order of the strings you have such that you will get a regular bracket sequence?Note that you may not remove any characters or strings, and you may not add anything either.InputThe input consists of four lines, $$$i$$$-th of them contains one integer $$$cnt_i$$$ ($$$0 \\\\le cnt_i \\\\le 10^9$$$).OutputPrint one integer: $$$1$$$ if it is possible to form a regular bracket sequence by choosing the correct order of the given strings, $$$0$$$ otherwise.ExamplesInput3 1 4 3Output1Input0 0 0 0Output1Input1 2 3 4Output0NoteIn the first example it is possible to construct a string \"(())()(()((()()()())))\", which is a regular bracket sequence.In the second example it is possible to construct a string \"\", which is a regular bracket sequence.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8c590374", "template_md5": "35d339e4", "result": "You are given four numbers: $cnt_1$, $cnt_2$, $cnt_3$, and $cnt_4$. These numbers represent the number of times you have the following bracket sequences:\n\n* \"(( \"  ($cnt_1$ times)\n* \"()\"  ($cnt_2$ times)\n* \")(\"  ($cnt_3$ times)\n* \"))\"  ($cnt_4$ times)\n\nYou want to arrange these sequences in a specific order to form a single long bracket sequence.  \n\n**Question:**\n\nIs it possible to arrange these sequences in a way that the resulting long bracket sequence can be transformed into a valid arithmetic expression by inserting \"+\" and \"1\" characters?\n\n**Output:**\n\n* 1 if it's possible to form a valid arithmetic expression.\n* 0 if it's not possible."}, {"prompt_md5": "3e395876", "template_md5": "465699a0", "result": "You have a set of four types of bracket sequences: \"((\", \"()\", \")(\", \"))\".  You have a certain number of each type. Can you arrange all these sequences together to form a longer sequence that can be turned into a valid mathematical expression by adding \"+\" and \"1\" signs? \n\n\nIf yes, output 1, otherwise output 0."}]}