{"uid": "1133-F2", "url": "https://codeforces.com/contest/1133/problem/F2", "tags": ["constructive algorithms", " dfs and similar", " dsu", " graphs", " greedy"], "title": "1133-F2", "statement": "F2. Spanning Tree with One Fixed Degreetime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an undirected unweighted connected graph consisting of $$$n$$$ vertices and $$$m$$$ edges. It is guaranteed that there are no self-loops or multiple edges in the given graph.Your task is to findanyspanning tree of this graph such that thedegree of the first vertex (vertex with label $$$1$$$ on it)is equal to $$$D$$$ (or say that there are no such spanning trees). Recall that the degree of a vertex is the number of edges incident to it.InputThe first line contains three integers $$$n$$$, $$$m$$$ and $$$D$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$n - 1 \\\\le m \\\\le min(2 \\\\cdot 10^5, \\\\frac{n(n-1)}{2}), 1 \\\\le D < n$$$) — the number of vertices, the number of edges and required degree of the first vertex, respectively.The following $$$m$$$ lines denote edges: edge $$$i$$$ is represented by a pair of integers $$$v_i$$$, $$$u_i$$$ ($$$1 \\\\le v_i, u_i \\\\le n$$$, $$$u_i \\\\ne v_i$$$), which are the indices of vertices connected by the edge. There are no loops or multiple edges in the given graph, i. e. for each pair ($$$v_i, u_i$$$) there are no other pairs ($$$v_i, u_i$$$) or ($$$u_i, v_i$$$) in the list of edges, and for each pair $$$(v_i, u_i)$$$ the condition $$$v_i \\\\ne u_i$$$ is satisfied.OutputIf there is no spanning tree satisfying the condition from the problem statement, print \"NO\" in the first line.Otherwise print \"YES\" in the first line and then print $$$n-1$$$ lines describing the edges of a spanning tree such that thedegree of the first vertex (vertex with label $$$1$$$ on it)is equal to $$$D$$$. Make sure that the edges of the printed spanning tree form some subset of the input edges (order doesn't matter and edge $$$(v, u)$$$ is considered the same as the edge $$$(u, v)$$$).If there are multiple possible answers, print any of them.ExamplesInput4 5 1 1 2 1 3 1 4 2 3 3 4OutputYES 2 1 2 3 3 4Input4 5 3 1 2 1 3 1 4 2 3 3 4OutputYES 1 2 1 3 4 1Input4 4 3 1 2 1 4 2 3 3 4OutputNONoteThe picture corresponding to the first and second examples:The picture corresponding to the third example:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "49b987f3", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ vertices and $m$ edges.  The degree of a vertex is the number of edges connected to it.\n\nYour task is to find a spanning tree of this graph where the degree of the first vertex (vertex labeled 1) is equal to $D$.  A spanning tree is a subset of the edges that connects all the vertices without any cycles.\n\nIf no such spanning tree exists, print \"NO\". Otherwise, print \"YES\" and then list the edges of a spanning tree that satisfies the condition."}, {"prompt_md5": "e6c62832", "template_md5": "465699a0", "result": "You are given a connected network of points.  Find a path that connects all the points together, where the starting point has a specific number of connections. If no such path exists, say so."}]}