{"uid": "1133-F1", "url": "https://codeforces.com/contest/1133/problem/F1", "tags": ["graphs"], "title": "1133-F1", "statement": "F1. Spanning Tree with Maximum Degreetime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an undirected unweighted connected graph consisting of $$$n$$$ vertices and $$$m$$$ edges. It is guaranteed that there are no self-loops or multiple edges in the given graph.Your task is to findanyspanning tree of this graph such that the maximum degree over all vertices is maximum possible. Recall that the degree of a vertex is the number of edges incident to it.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$n - 1 \\\\le m \\\\le min(2 \\\\cdot 10^5, \\\\frac{n(n-1)}{2})$$$) — the number of vertices and edges, respectively.The following $$$m$$$ lines denote edges: edge $$$i$$$ is represented by a pair of integers $$$v_i$$$, $$$u_i$$$ ($$$1 \\\\le v_i, u_i \\\\le n$$$, $$$u_i \\\\ne v_i$$$), which are the indices of vertices connected by the edge. There are no loops or multiple edges in the given graph, i. e. for each pair ($$$v_i, u_i$$$) there are no other pairs ($$$v_i, u_i$$$) or ($$$u_i, v_i$$$) in the list of edges, and for each pair $$$(v_i, u_i)$$$ the condition $$$v_i \\\\ne u_i$$$ is satisfied.OutputPrint $$$n-1$$$ lines describing the edges of a spanning tree such that the maximum degree over all vertices is maximum possible. Make sure that the edges of the printed spanning tree form some subset of the input edges (order doesn't matter and edge $$$(v, u)$$$ is considered the same as the edge $$$(u, v)$$$).If there are multiple possible answers, print any of them.ExamplesInput5 5 1 2 2 3 3 5 4 3 1 5Output3 5 2 1 3 2 3 4Input4 6 1 2 1 3 1 4 2 3 2 4 3 4Output4 1 1 2 1 3Input8 9 1 2 2 3 2 5 1 6 3 4 6 5 4 5 2 7 5 8Output3 2 2 5 8 5 6 1 2 7 1 2 3 4NotePicture corresponding to the first example:In this example the number of edges of spanning tree incident to the vertex $$$3$$$ is $$$3$$$. It is the maximum degree over all vertices of the spanning tree. It is easy to see that we cannot obtain a better answer.Picture corresponding to the second example:In this example the number of edges of spanning tree incident to the vertex $$$1$$$ is $$$3$$$. It is the maximum degree over all vertices of the spanning tree. It is easy to see that we cannot obtain a better answer.Picture corresponding to the third example:In this example the number of edges of spanning tree incident to the vertex $$$2$$$ is $$$4$$$. It is the maximum degree over all vertices of the spanning tree. It is easy to see that we cannot obtain a better answer. But because this example is symmetric, we can choose almost the same spanning tree but with vertex $$$5$$$ instead of $$$2$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e9ef0b4", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ vertices and $m$ edges.  Find a spanning tree of the graph where the maximum degree of any vertex is as large as possible.  \n\nThe degree of a vertex is the number of edges connected to it.  \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of vertices and edges, respectively.\n* The following $m$ lines each contain two integers, $v_i$ and $u_i$, representing an edge between vertices $v_i$ and $u_i$.\n\n**Output:**\n\n* Print $n-1$ lines, each containing two integers, representing the edges of a spanning tree that maximizes the maximum degree of any vertex."}, {"prompt_md5": "45e23816", "template_md5": "465699a0", "result": "You are given a network of connected points.  Find a subset of the connections that form a single loop without any cycles, where the point with the most connections has the highest possible number of connections."}]}