{"uid": "1144-F", "url": "https://codeforces.com/contest/1144/problem/F", "tags": ["dfs and similar", " graphs"], "title": "1144-F", "statement": "F. Graph Without Long Directed Pathstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a connected undirected graph consisting of $$$n$$$ vertices and $$$m$$$ edges. There are no self-loops or multiple edges in the given graph.You have to direct its edges in such a way that the obtained directed graph does not contain any paths of length two or greater (where the length of path is denoted as the number of traversed edges).InputThe first line contains two integer numbers $$$n$$$ and $$$m$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$n - 1 \\\\le m \\\\le 2 \\\\cdot 10^5$$$) — the number of vertices and edges, respectively.The following $$$m$$$ lines contain edges: edge $$$i$$$ is given as a pair of vertices $$$u_i$$$, $$$v_i$$$ ($$$1 \\\\le u_i, v_i \\\\le n$$$, $$$u_i \\\\ne v_i$$$). There are no multiple edges in the given graph, i. e. for each pair ($$$u_i, v_i$$$) there are no other pairs ($$$u_i, v_i$$$) and ($$$v_i, u_i$$$) in the list of edges. It is also guaranteed that the given graph is connected (there is a path between any pair of vertex in the given graph).OutputIf it is impossible to direct edges of the given graph in such a way that the obtained directed graph does not contain paths of length at least two, print \"NO\" in the first line.Otherwise print \"YES\" in the first line, and then printanysuitable orientation of edges: a binary string (the string consisting only of '0' and '1') of length $$$m$$$. The $$$i$$$-th element of this string should be '0' if the $$$i$$$-th edge of the graph should be directed from $$$u_i$$$ to $$$v_i$$$, and '1' otherwise. Edges are numbered in the order they are given in the input.ExampleInput6 5 1 5 2 1 1 4 3 1 6 1OutputYES 10100NoteThe picture corresponding to the first example:And one of possible answers:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7f042e35", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ vertices and $m$ edges.  There are no loops or duplicate edges.  \n\nYour task is to assign a direction to each edge, turning the graph into a directed graph.  The goal is to make sure that there are no paths of length 2 or more in the resulting directed graph.\n\nIf this is possible, output \"YES\" followed by a string of 0s and 1s representing the direction of each edge.  A 0 means the edge goes from the first vertex to the second, and a 1 means it goes from the second vertex to the first.\n\nIf it's impossible to create such a directed graph, output \"NO\"."}, {"prompt_md5": "7725cdac", "template_md5": "465699a0", "result": "You are given a connected network of points with lines connecting them.  You need to assign a direction to each line so that no path of two or more lines exists between any two points.  If this is possible, say \"YES\" and show one way to do it. If it's not possible, say \"NO\"."}]}