{"uid": "1146-A", "url": "https://codeforces.com/contest/1146/problem/A", "tags": ["implementation", " strings"], "title": "1146-A", "statement": "A. Love \"A\"time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice has a string $$$s$$$. She really likes the letter \"a\". She calls a string good if strictly more than half of the characters in that string are \"a\"s. For example \"aaabb\", \"axaa\" are good strings, and \"baca\", \"awwwa\", \"\" (empty string) are not.Alice can erase some characters from her string $$$s$$$. She would like to know what is the longest string remaining after erasing some characters (possibly zero) to get a good string. It is guaranteed that the string has at least one \"a\" in it, so the answer always exists.InputThe first line contains a string $$$s$$$ ($$$1 \\\\leq |s| \\\\leq 50$$$) consisting of lowercase English letters. It is guaranteed that there is at least one \"a\" in $$$s$$$.OutputPrint a single integer, the length of the longest good string that Alice can get after erasing some characters from $$$s$$$.ExamplesInputxaxxxxaOutput3InputaaabaaOutput6NoteIn the first example, it's enough to erase any four of the \"x\"s. The answer is $$$3$$$ since that is the maximum number of characters that can remain.In the second example, we don't need to erase any characters.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ba20bd2c", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  The string contains at least one \"a\".  \n\nDetermine the length of the longest possible substring that can be created by removing some characters from the original string, such that the substring has more than half of its characters as \"a\"s."}, {"prompt_md5": "a5426e9a", "template_md5": "465699a0", "result": "Given a string, find the length of the longest possible substring where more than half the characters are 'a'.  You can remove any characters from the string."}]}