{"uid": "1147-A", "url": "https://codeforces.com/contest/1147/problem/A", "tags": ["graphs"], "title": "1147-A", "statement": "A. Hide and Seektime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob are playing a game on a line with $$$n$$$ cells. There are $$$n$$$ cells labeled from $$$1$$$ through $$$n$$$. For each $$$i$$$ from $$$1$$$ to $$$n-1$$$, cells $$$i$$$ and $$$i+1$$$ are adjacent.Alice initially has a token on some cell on the line, and Bob tries to guess where it is.Bob guesses a sequence of line cell numbers $$$x_1, x_2, \\\\ldots, x_k$$$ in order. In the $$$i$$$-th question, Bob asks Alice if her token is currently on cell $$$x_i$$$. That is, Alice can answer either \"YES\" or \"NO\" to each Bob's question.At most one timein this process, before or after answering a question, Alice is allowed to move her token from her current cell to someadjacentcell. Alice acted in such a way that she was able to answer \"NO\" toallof Bob's questions.Note that Alice can even move her token before answering the first question or after answering the last question. Alice can also choose to not move at all.You are given $$$n$$$ and Bob's questions $$$x_1, \\\\ldots, x_k$$$. You would like to count the number of scenarios that let Alice answer \"NO\" to all of Bob's questions.Let $$$(a,b)$$$ denote a scenario where Alice starts at cell $$$a$$$ and ends at cell $$$b$$$. Two scenarios $$$(a_i, b_i)$$$ and $$$(a_j, b_j)$$$ are different if $$$a_i \\\\neq a_j$$$ or $$$b_i \\\\neq b_j$$$.InputThe first line contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\leq n,k \\\\leq 10^5$$$) — the number of cells and the number of questions Bob asked.The second line contains $$$k$$$ integers $$$x_1, x_2, \\\\ldots, x_k$$$ ($$$1 \\\\leq x_i \\\\leq n$$$) — Bob's questions.OutputPrint a single integer, the number of scenarios that let Alice answer \"NO\" to all of Bob's questions.ExamplesInput5 3 5 1 4Output9Input4 8 1 2 3 4 4 3 2 1Output0Input100000 1 42Output299997NoteThe notation $$$(i,j)$$$ denotes a scenario where Alice starts at cell $$$i$$$ and ends at cell $$$j$$$.In the first example, the valid scenarios are $$$(1, 2), (2, 1), (2, 2), (2, 3), (3, 2), (3, 3), (3, 4), (4, 3), (4, 5)$$$. For example, $$$(3,4)$$$ is valid since Alice can start at cell $$$3$$$, stay there for the first three questions, then move to cell $$$4$$$ after the last question.$$$(4,5)$$$ is valid since Alice can start at cell $$$4$$$, stay there for the first question, the move to cell $$$5$$$ for the next two questions. Note that $$$(4,5)$$$ is only counted once, even though there are different questions that Alice can choose to do the move, but remember, we only count each pair of starting and ending positions once.In the second example, Alice has no valid scenarios.In the last example, all $$$(i,j)$$$ where $$$|i-j| \\\\leq 1$$$ except for $$$(42, 42)$$$ are valid scenarios.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "03da4a1a", "template_md5": "35d339e4", "result": "There are $n$ cells numbered from 1 to $n$.  A player starts at a cell and must answer questions about the location of the token.  The player can move the token once, before or after answering any questions.  \n\nFor each question $i$, the player is asked if the token is in cell $x_i$. The player must answer \"NO\" to all questions.\n\nHow many different starting and ending cell combinations are possible? \n\n\nInput:\n\n* The first line contains two integers $n$ and $k$ ($1 \\le n, k \\le 10^5$) — the number of cells and the number of questions.\n* The second line contains $k$ integers $x_1, x_2, ..., x_k$ ($1 \\le x_i \\le n$) — the questions.\n\nOutput:\n\n* Print a single integer, the number of possible starting and ending cell combinations."}, {"prompt_md5": "395118e6", "template_md5": "465699a0", "result": "You are given a line with a number of cells.  A player starts at a secret cell on the line.  Another player asks a series of questions about which cell the first player is on. The first player can move to an adjacent cell at most once during the process.  Find the number of ways the first player can answer \"no\" to all the questions."}]}