{"uid": "1147-B", "url": "https://codeforces.com/contest/1147/problem/B", "tags": ["brute force", " strings"], "title": "1147-B", "statement": "B. Chladni Figuretime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputInaka has a disc, the circumference of which is $$$n$$$ units. The circumference is equally divided by $$$n$$$ points numbered clockwise from $$$1$$$ to $$$n$$$, such that points $$$i$$$ and $$$i + 1$$$ ($$$1 \\\\leq i < n$$$) are adjacent, and so are points $$$n$$$ and $$$1$$$.There are $$$m$$$ straight segments on the disc, the endpoints of which are all among the aforementioned $$$n$$$ points.Inaka wants to know if her image isrotationally symmetrical, i.e. if there is an integer $$$k$$$ ($$$1 \\\\leq k < n$$$), such that if all segments are rotated clockwise around the center of the circle by $$$k$$$ units, the new image will be the same as the original one.InputThe first line contains two space-separated integers $$$n$$$ and $$$m$$$ ($$$2 \\\\leq n \\\\leq 100\\\\,000$$$, $$$1 \\\\leq m \\\\leq 200\\\\,000$$$) — the number of points and the number of segments, respectively.The $$$i$$$-th of the following $$$m$$$ lines contains two space-separated integers $$$a_i$$$ and $$$b_i$$$ ($$$1 \\\\leq a_i, b_i \\\\leq n$$$, $$$a_i \\\\neq b_i$$$) that describe a segment connecting points $$$a_i$$$ and $$$b_i$$$.It is guaranteed that no segments coincide.OutputOutput one line — \"Yes\" if the image is rotationally symmetrical, and \"No\" otherwise (both excluding quotation marks).You can output each letter in any case (upper or lower).ExamplesInput12 6 1 3 3 7 5 7 7 11 9 11 11 3OutputYesInput9 6 4 5 5 6 7 8 8 9 1 2 2 3OutputYesInput10 3 1 2 3 2 7 2OutputNoInput10 2 1 6 2 7OutputYesNoteThe first two examples are illustrated below. Both images become the same as their respective original ones after a clockwise rotation of $$$120$$$ degrees around the center.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e7b9f574", "template_md5": "35d339e4", "result": "You are given a circle divided into $n$ points numbered from 1 to $n$. There are $m$ line segments on the circle, each connecting two of these points. \n\nDetermine if it's possible to rotate the circle by some angle (a multiple of 360 degrees / $n$) so that the arrangement of the line segments is the same as the original. If such a rotation exists, output \"Yes\"; otherwise, output \"No\"."}, {"prompt_md5": "3930c492", "template_md5": "465699a0", "result": "You have a circle divided into points.  There are lines connecting some of these points.  Determine if you can rotate the lines by a certain amount and have them match the original arrangement."}]}