{"uid": "1148-A", "url": "https://codeforces.com/contest/1148/problem/A", "tags": ["greedy"], "title": "1148-A", "statement": "A. Another One Bites The Dusttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's call a stringgoodif and only if it consists of only two types of letters — 'a' and 'b' and every two consecutive letters are distinct. For example \"baba\" and \"aba\" are good strings and \"abb\" is a bad string.You have $$$a$$$ strings \"a\", $$$b$$$ strings \"b\" and $$$c$$$ strings \"ab\". You want to choose some subset of these strings and concatenate them in any arbitrarily order.What is the length of the longest good string you can obtain this way?InputThe first line contains three positive integers $$$a$$$, $$$b$$$, $$$c$$$ ($$$1 \\\\leq a, b, c \\\\leq 10^9$$$) — the number of strings \"a\", \"b\" and \"ab\" respectively.OutputPrint a single number — the maximum possible length of the good string you can obtain.ExamplesInput1 1 1Output4Input2 1 2Output7Input3 5 2Output11Input2 2 1Output6Input1000000000 1000000000 1000000000Output4000000000NoteIn the first example the optimal string is \"baba\".In the second example the optimal string is \"abababa\".In the third example the optimal string is \"bababababab\".In the fourth example the optimal string is \"ababab\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "47d4fe1a", "template_md5": "35d339e4", "result": "You are given three numbers: $a$, $b$, and $c$.  \n\n* $a$ represents the number of strings that are \"a\".\n* $b$ represents the number of strings that are \"b\".\n* $c$ represents the number of strings that are \"ab\".\n\nYou can choose any combination of these strings and put them together in any order.  \n\nA string is considered \"good\" if it only contains the letters 'a' and 'b', and no two letters in a row are the same.\n\nWhat is the longest possible \"good\" string you can create?"}, {"prompt_md5": "a6457f2c", "template_md5": "465699a0", "result": "You have a bunch of \"a\" strings, \"b\" strings, and \"ab\" strings.  You can pick some of these strings and put them together in any order. What's the longest string you can make where no two letters in a row are the same?"}]}