{"uid": "1149-E", "url": "https://codeforces.com/contest/1149/problem/E", "tags": ["games", " graphs"], "title": "1149-E", "statement": "E. Election Promisestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn Byteland, there are two political parties fighting for seats in the Parliament in the upcoming elections:Wrong Answer PartyandTime Limit Exceeded Party. As they want to convince as many citizens as possible to cast their votes on them, they keep promising lower and lower taxes.There are $$$n$$$ cities in Byteland, connected by $$$m$$$ one-way roads. Interestingly enough, the road network has no cycles — it's impossible to start in any city, follow a number of roads, and return to that city. Last year, citizens of the $$$i$$$-th city had to pay $$$h_i$$$ bourles of tax.Parties will now alternately hold the election conventions in various cities. If a party holds a convention in city $$$v$$$, the party needs todecreasethe taxes in this city to a non-negative integer amount of bourles. However, at the same time they can arbitrarily modify the taxes in each of the cities that can be reached from $$$v$$$ using a single road. The only condition that must be fulfilled that the tax in each city has to remain a non-negative integer amount of bourles.The first party to hold the convention isWrong Answer Party. It's predicted that the party to hold the last convention will win the election. CanWrong Answer Partywin regardless ofTime Limit Exceeded Party's moves?InputThe first line of the input contains two integers $$$n$$$, $$$m$$$ ($$$1 \\\\leq n \\\\leq 200\\\\,000$$$, $$$0 \\\\leq m \\\\leq 200\\\\,000$$$) — the number of cities and roads in Byteland.The next line contains $$$n$$$ space-separated integers $$$h_1, h_2, \\\\dots, h_n$$$ ($$$0 \\\\leq h_i \\\\leq 10^9$$$); $$$h_i$$$ denotes the amount of taxes paid in the $$$i$$$-th city.Each of the following $$$m$$$ lines contains two integers ($$$1 \\\\leq u, v \\\\leq n$$$, $$$u \\\\neq v$$$), and describes a one-way road leading from the city $$$u$$$ to the city $$$v$$$. There will be no cycles in the road network. No two roads will connect the same pair of cities.We can show that the conventions cannot be held indefinitely for any correct test case.OutputIfWrong Answer Partycan win the election, outputWINin the first line of your output. In this case, you're additionally asked to produce any convention allowing the party to win regardless of the opponent's actions. The second line should contain $$$n$$$ non-negative integers $$$h'_1, h'_2, \\\\dots, h'_n$$$ ($$$0 \\\\leq h'_i \\\\leq 2 \\\\cdot 10^{18}$$$) describing the amount of taxes paid in consecutive cities after the convention. If there are multiple answers, output any. We guarantee that if the party has any winning move, there exists a move after which no city has to pay more than $$$2 \\\\cdot 10^{18}$$$ bourles.If the party cannot assure their victory, outputLOSEin the first and only line of the output.ExamplesInput4 2 2 1 1 5 1 2 3 4OutputWIN 1 5 1 5Input4 2 1 5 1 5 1 2 3 4OutputLOSEInput3 3 314 159 265 1 2 1 3 3 2OutputWIN 0 0 0Input6 4 2 2 5 5 6 6 1 3 2 4 3 5 4 6OutputLOSENoteIn the first example,Wrong Answer Partyshould hold the convention in the city $$$1$$$. The party will decrease the taxes in this city to $$$1$$$ bourle. As the city $$$2$$$ is directly reachable from $$$1$$$, we can arbitrarily modify the taxes in this city. The party should change the tax to $$$5$$$ bourles. It can be easily proved thatTime Limit Exceededcannot win the election after this move ifWrong Answer Partyplays optimally.The second example test presents the situation we created after a single move in the previous test; as it'sWrong Answer Party's move now, the party cannot win.In the third test, we should hold the convention in the first city. This allows us to change the taxes in any city to any desired value; we can for instance decide to set all the taxes to zero, which allows theWrong Answer Partyto win the election immediately.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "483d0e30", "template_md5": "35d339e4", "result": "There are $n$ cities connected by $m$ one-way roads. Each city has a tax amount $h_i$. Two parties will take turns holding conventions in the cities.  \n\nWhen a party holds a convention in city $v$, they can set the tax in city $v$ to any non-negative integer. They can also set the tax in any city that can be reached from $v$ in one road step to any non-negative integer.\n\nThe first party to hold a convention is Party A.  Can Party A guarantee a win regardless of the other party's moves? If so, provide a sequence of conventions for Party A that guarantees a win. \n\n**Input:**\n\n* The first line contains two integers $n$ and $m$ ($1 \\le n \\le 200,000$, $0 \\le m \\le 200,000$) representing the number of cities and roads.\n* The second line contains $n$ integers $h_1, h_2, ..., h_n$ ($0 \\le h_i \\le 10^9$) representing the initial tax amounts in each city.\n* Each of the following $m$ lines contains two integers $u$ and $v$ ($1 \\le u, v \\le n$, $u \\neq v$) representing a one-way road from city $u$ to city $v$.\n\n**Output:**\n\n* If Party A can guarantee a win, output \"WIN\" followed by a line containing $n$ integers $h'_1, h'_2, ..., h'_n$ ($0 \\le h'_i \\le 2 \\cdot 10^{18}$) representing the tax amounts after Party A's winning sequence of conventions.\n* If Party A cannot guarantee a win, output \"LOSE\"."}, {"prompt_md5": "0a89ad76", "template_md5": "465699a0", "result": "There are cities connected by one-way roads.  A game is played where two players take turns choosing a city to lower taxes in that city and all cities directly connected to it. The player who makes the last move wins.  Determine if one player can always win, and if so, what their winning strategy is."}]}