{"uid": "1149-A", "url": "https://codeforces.com/contest/1149/problem/A", "tags": ["constructive algorithms", " greedy", " math", " number theory"], "title": "1149-A", "statement": "A. Prefix Sum Primestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWe're giving away nice huge bags containing number tiles! A bag we want to present to you contains $$$n$$$ tiles. Each of them has a single number written on it — either $$$1$$$ or $$$2$$$.However, there is one condition you must fulfill in order to receive the prize. You will need to put all the tiles from the bag in a sequence, in any order you wish. We will then compute the sums of all prefixes in the sequence, and then count how many of these sums are prime numbers. If you want to keep the prize, you will need to maximize the number of primes you get.Can you win the prize? Hurry up, the bags are waiting!InputThe first line of the input contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 200\\\\,000$$$) — the number of number tiles in the bag. The following line contains $$$n$$$ space-separated integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$a_i \\\\in \\\\{1, 2\\\\}$$$) — the values written on the tiles.OutputOutput a permutation $$$b_1, b_2, \\\\dots, b_n$$$ of the input sequence $$$(a_1, a_2, \\\\dots, a_n)$$$ maximizing the number of the prefix sums being prime numbers. If there are multiple optimal permutations, output any.ExamplesInput5 1 2 1 2 1Output1 1 1 2 2Input9 1 1 2 1 1 1 2 1 1Output1 1 1 2 1 1 1 2 1NoteThe first solution produces the prefix sums $$$1, \\\\mathbf{\\\\color{blue}{2}}, \\\\mathbf{\\\\color{blue}{3}}, \\\\mathbf{\\\\color{blue}{5}}, \\\\mathbf{\\\\color{blue}{7}}$$$ (four primes constructed), while the prefix sums in the second solution are $$$1, \\\\mathbf{\\\\color{blue}{2}}, \\\\mathbf{\\\\color{blue}{3}}, \\\\mathbf{\\\\color{blue}{5}}, 6, \\\\mathbf{\\\\color{blue}{7}}, 8, 10, \\\\mathbf{\\\\color{blue}{11}}$$$ (five primes). Primes are marked bold and blue. In each of these cases, the number of produced primes is maximum possible.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "65eb991d", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ numbers, each of which is either 1 or 2.  You need to arrange these numbers in a specific order.  \n\nThe goal is to find an arrangement that maximizes the number of prime numbers that can be formed by summing up all the numbers in the sequence up to a given point (prefix sums).\n\nFor example, if the sequence is [1, 2, 1, 2, 1], one possible arrangement is [1, 1, 1, 2, 2]. The prefix sums for this arrangement are:\n\n[1, 2, 3, 5, 7]\n\nThere are four prime numbers in this list.\n\nOutput the arrangement that produces the most prime prefix sums."}, {"prompt_md5": "255787b5", "template_md5": "465699a0", "result": "You are given a sequence of 1s and 2s. Rearrange the sequence to maximize the number of unique sums you can get by adding up consecutive elements of the sequence (prefix sums)."}]}