{"uid": "1153-C", "url": "https://codeforces.com/contest/1153/problem/C", "tags": ["greedy", " strings"], "title": "1153-C", "statement": "C. Serval and Parenthesis Sequencetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputServal soon said goodbye to Japari kindergarten, and began his life in Japari Primary School.In his favorite math class, the teacher taught him the following interesting definitions.Aparenthesis sequenceis a string, containing only characters \"(\" and \")\".Acorrect parenthesis sequenceis a parenthesis sequence that can be transformed into a correct arithmetic expression by inserting characters \"1\" and \"+\" between the original characters of the sequence. For example, parenthesis sequences \"()()\", \"(())\" are correct (the resulting expressions are: \"(1+1)+(1+1)\", \"((1+1)+1)\"), while \")(\" and \")\" are not. Note that the empty string is a correct parenthesis sequence by definition.We define that $$$|s|$$$ as the length of string $$$s$$$. Astrict prefix$$$s[1\\\\dots l]$$$ $$$(1\\\\leq l< |s|)$$$ of a string $$$s = s_1s_2\\\\dots s_{|s|}$$$ is string $$$s_1s_2\\\\dots s_l$$$. Note that the empty string and the whole string are not strict prefixes of any string by the definition.Having learned these definitions, he comes up with a new problem. He writes down a string $$$s$$$ containing only characters \"(\", \")\" and \"?\". And what he is going to do, is to replace each of the \"?\" in $$$s$$$ independently by one of \"(\" and \")\" to make all strict prefixes of the new sequence not a correct parenthesis sequence, while the new sequence should be a correct parenthesis sequence.After all, he is just a primary school student so this problem is too hard for him to solve. As his best friend, can you help him to replace the question marks? If there are many solutions, any of them is acceptable.InputThe first line contains a single integer $$$|s|$$$ ($$$1\\\\leq |s|\\\\leq 3 \\\\cdot 10^5$$$), the length of the string.The second line contains a string $$$s$$$, containing only \"(\", \")\" and \"?\".OutputA single line contains a string representing the answer.If there are many solutions, any of them is acceptable.If there is no answer, print a single line containing \":(\" (without the quotes).ExamplesInput6 (?????Output(()())Input10 (???(???(?Output:(NoteIt can be proved that there is no solution for the second sample, so print \":(\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "219ec3e0", "template_md5": "35d339e4", "result": "You are given a string $s$ of length $|s|$ containing only \"(\", \")\", and \"?\".  \n\nYour task is to replace each \"?\" in $s$ with either \"(\" or \")\" to create a new string that satisfies the following conditions:\n\n1.  The new string is a correct parenthesis sequence (can be transformed into a valid arithmetic expression by inserting \"1\" and \"+\" between characters).\n2.  No strict prefix of the new string is a correct parenthesis sequence.\n\nIf a solution exists, output any one valid string. If no solution exists, output \":(\"."}, {"prompt_md5": "a201d210", "template_md5": "465699a0", "result": "You are given a string containing parentheses and question marks.  Replace the question marks with parentheses to create a valid parenthesis sequence.  A valid parenthesis sequence can be turned into a mathematical expression by inserting \"1\" and \"+\" between the parentheses.  \n\nThe resulting sequence must be valid, but all of its prefixes (substrings starting at the beginning) must be invalid. \n\n\nIf no solution exists, print \":(\"."}]}