{"uid": "1155-B", "url": "https://codeforces.com/contest/1155/problem/B", "tags": ["games", " greedy", " implementation"], "title": "1155-B", "statement": "B. Game with Telephone Numberstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA telephone number is a sequence ofexactly$$$11$$$ digits such that its first digit is8.Vasya and Petya are playing a game. Initially they have a string $$$s$$$ of length $$$n$$$ ($$$n$$$ is odd) consisting of digits. Vasya makes the first move, then players alternate turns. In one move the playermustchoose a character and erase it from the current string. For example, if the current string1121, after the player's move it may be112,111or121. The game ends when the length of string $$$s$$$ becomes11. If the resulting string is a telephone number, Vasya wins, otherwise Petya wins.You have to determine if Vasya has a winning strategy (that is, if Vasya can win the game no matter which characters Petya chooses during his moves).InputThe first line contains one integer $$$n$$$ ($$$13 \\\\le n < 10^5$$$, $$$n$$$ is odd) — the length of string $$$s$$$.The second line contains the string $$$s$$$ ($$$|s| = n$$$) consisting only of decimal digits.OutputIf Vasya has a strategy that guarantees him victory, printYES.Otherwise printNO.ExamplesInput13 8380011223344OutputYESInput15 807345619350641OutputNONoteIn the first example Vasya needs to erase the second character. Then Petya cannot erase a character from the remaining string880011223344so that it does not become a telephone number.In the second example after Vasya's turn Petya can erase one character character8. The resulting string can't be a telephone number, because there is no digit8at all.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0bd1c5d2", "template_md5": "35d339e4", "result": "You are given a string of digits of odd length. The string must start with the digit '8'. Two players take turns erasing one digit from the string at a time. The game ends when the string has only one digit left. If the final string is a valid telephone number (starts with '8' and has 11 digits), the first player wins. Otherwise, the second player wins. \n\nDetermine if the first player can always win, no matter what the second player does. \n\n\nInput:\n\n* The first line contains an integer $n$ ($13 \\le n < 10^5$, $n$ is odd) representing the length of the string.\n* The second line contains the string of digits.\n\nOutput:\n\n* Print \"YES\" if the first player can always win, otherwise print \"NO\"."}, {"prompt_md5": "5e8aeda4", "template_md5": "465699a0", "result": "Two players take turns removing one digit at a time from a string of odd length. The string must start with the digit '8'. The player who makes the string into a valid phone number (a sequence of digits starting with '8') wins.  Determine if the first player can always win."}]}