{"uid": "1165-B", "url": "https://codeforces.com/contest/1165/problem/B", "tags": ["data structures", " greedy", " sortings"], "title": "1165-B", "statement": "B. Polycarp Trainingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp wants to train before another programming competition. During the first day of his training he should solve exactly $$$1$$$ problem, during the second day — exactly $$$2$$$ problems, during the third day — exactly $$$3$$$ problems, and so on. During the $$$k$$$-th day he should solve $$$k$$$ problems.Polycarp has a list of $$$n$$$ contests, the $$$i$$$-th contest consists of $$$a_i$$$ problems. During each day Polycarp has to chooseexactly oneof the contests he didn't solve yet and solve it. He solvesexactly $$$k$$$ problems from this contest. Other problems are discarded from it. If there are no contests consisting of at least $$$k$$$ problems that Polycarp didn't solve yet during the $$$k$$$-th day, then Polycarp stops his training.How many days Polycarp can train if he chooses the contests optimally?InputThe first line of the input contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the number of contests.The second line of the input contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 2 \\\\cdot 10^5$$$) — the number of problems in the $$$i$$$-th contest.OutputPrint one integer — the maximum number of days Polycarp can train if he chooses the contests optimally.ExamplesInput4 3 1 4 1Output3Input3 1 1 1Output1Input5 1 1 1 2 2Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "43d98d3e", "template_md5": "35d339e4", "result": "There are $n$ contests, each with a different number of problems.  On day $k$, you must solve exactly $k$ problems from a contest you haven't already completed.  You can only choose one contest to solve problems from each day. If there are no contests with at least $k$ unsolved problems on day $k$, you stop training. What is the maximum number of days you can train? \n\nInput:\n\n* The first line contains $n$ (the number of contests).\n* The second line contains $a_1, a_2, ..., a_n$ (the number of problems in each contest).\n\nOutput:\n\n* The maximum number of days you can train."}, {"prompt_md5": "d377d244", "template_md5": "465699a0", "result": "You have a list of contests, each with a different number of problems. You need to solve a specific number of problems each day, increasing by one each day (1 problem on day 1, 2 problems on day 2, and so on).  You can only choose one contest each day and solve a number of problems from it equal to the day's target. If there aren't enough unsolved problems in any contest to meet the day's target, you stop training. What is the maximum number of days you can train?"}]}