{"uid": "1167-C", "url": "https://codeforces.com/contest/1167/problem/C", "tags": ["dfs and similar", " dsu", " graphs"], "title": "1167-C", "statement": "C. News Distributiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn some social network, there are $$$n$$$ users communicating with each other in $$$m$$$ groups of friends. Let's analyze the process of distributing some news between users.Initially, some user $$$x$$$ receives the news from some source. Then he or she sends the news to his or her friends (two users are friends if there is at least one group such that both of them belong to this group). Friends continue sending the news to their friends, and so on. The process ends when there is no pair of friends such that one of them knows the news, and another one doesn't know.For each user $$$x$$$ you have to determine what is the number of users that will know the news if initially only user $$$x$$$ starts distributing it.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 5 \\\\cdot 10^5$$$) — the number of users and the number of groups of friends, respectively.Then $$$m$$$ lines follow, each describing a group of friends. The $$$i$$$-th line begins with integer $$$k_i$$$ ($$$0 \\\\le k_i \\\\le n$$$) — the number of users in the $$$i$$$-th group. Then $$$k_i$$$distinctintegers follow, denoting the users belonging to the $$$i$$$-th group.It is guaranteed that $$$\\\\sum \\\\limits_{i = 1}^{m} k_i \\\\le 5 \\\\cdot 10^5$$$.OutputPrint $$$n$$$ integers. The $$$i$$$-th integer should be equal to the number of users that will know the news if user $$$i$$$ starts distributing it.ExampleInput7 5 3 2 5 4 0 2 1 2 1 1 2 6 7Output4 4 1 4 4 2 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "582c153c", "template_md5": "35d339e4", "result": "There are $n$ users and $m$ groups of friends. Each group contains a set of users.  \n\nYou are given the groups of friends.  \n\nFor each user $x$, determine the total number of users who will eventually know a piece of news if user $x$ is the first to know it. The news spreads through the network as follows:\n\n* A user who knows the news can share it with all their friends (users in the same groups).\n* This process continues until no user can share the news to a friend who doesn't already know it. \n\n\n\nOutput $n$ integers, where the $i$-th integer is the number of users who will know the news if user $i$ starts it."}, {"prompt_md5": "da0e3d64", "template_md5": "465699a0", "result": "You have a network of people connected in groups.  Each person can spread information to their group members.  Given a starting person, determine how many people will eventually know the information."}]}