{"uid": "1167-A", "url": "https://codeforces.com/contest/1167/problem/A", "tags": ["brute force", " greedy", " strings"], "title": "1167-A", "statement": "A. Telephone Numbertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA telephone number is a sequence of exactly11digits, where the first digit is8. For example, the sequence80011223388is a telephone number, but the sequences70011223388and80000011223388are not.You are given a string $$$s$$$ of length $$$n$$$, consisting of digits.In one operation you can delete any character from string $$$s$$$. For example, it is possible to obtain strings112,111or121from string1121.You need to determine whether there is such a sequence of operations (possibly empty), after which the string $$$s$$$ becomes a telephone number.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of test cases.The first line of each test case contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 100$$$) — the length of string $$$s$$$.The second line of each test case contains the string $$$s$$$ ($$$|s| = n$$$) consisting of digits.OutputFor each test print one line.If there is a sequence of operations, after which $$$s$$$ becomes a telephone number, printYES.Otherwise, printNO.ExampleInput2 13 7818005553535 11 31415926535OutputYES NONoteIn the first test case you need to delete the first and the third digits. Then the string7818005553535becomes88005553535.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cd333fe2", "template_md5": "35d339e4", "result": "You are given a string of digits.  Determine if you can remove digits from the string to make it a valid telephone number. A valid telephone number is a 11-digit string that starts with the digit 8. \n\n\nFor example:\n\n* \"7818005553535\" can be made into a valid telephone number by removing the first and third digits.\n* \"31415926535\" cannot be made into a valid telephone number. \n\n\nInput:\n\nThe first line contains the number of test cases. Each test case has two lines:\n\n* The first line contains the length of the string.\n* The second line contains the string of digits.\n\nOutput:\n\nFor each test case, print \"YES\" if the string can be made into a valid telephone number, and \"NO\" otherwise."}, {"prompt_md5": "0042f5c6", "template_md5": "465699a0", "result": "Given a string of digits, determine if you can remove digits from it to make a valid telephone number (starts with 8 and has 11 digits)."}]}