{"uid": "117-C", "url": "https://codeforces.com/contest/117/problem/C", "tags": ["dfs and similar", " graphs"], "title": "117-C", "statement": "C. Cycletime limit per test2.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAtournamentis a directed graph without self-loops in which every pair of vertexes is connected by exactly one directed edge. That is, for any two vertexesuandv(u≠v) exists either an edge going fromutov, or an edge fromvtou.You are given a tournament consisting ofnvertexes. Your task is to find there a cycle of length three.InputThe first line contains an integern(1 ≤n≤ 5000). Nextnlines contain the adjacency matrixAof the graph (without spaces).Ai,j= 1if the graph has an edge going from vertexito vertexj, otherwiseAi,j= 0.Ai,jstands for thej-th character in thei-th line.It is guaranteed that the given graph is a tournament, that is,Ai,i= 0,Ai,j≠Aj,i(1 ≤i,j≤n,i≠j).OutputPrint three distinct vertexes of the grapha1,a2,a3(1 ≤ai≤n), such thatAa1,a2=Aa2,a3=Aa3,a1= 1, or \"-1\", if a cycle whose length equals three does not exist.If there are several solutions, print any of them.ExamplesInput50010010000010011110111000Output1 3 2Input50111100000010000110001110Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "248d46ef", "template_md5": "35d339e4", "result": "You are given a directed graph with $n$ vertices ($1 \\le n \\le 5000$).  Every pair of vertices has exactly one directed edge between them.  \n\nYou need to find three distinct vertices $a_1$, $a_2$, and $a_3$ such that there is a cycle of length three:\n\n*  There is a directed edge from $a_1$ to $a_2$.\n*  There is a directed edge from $a_2$ to $a_3$.\n*  There is a directed edge from $a_3$ to $a_1$.\n\nThe graph is represented by an adjacency matrix $A$ where $A_{i,j} = 1$ if there is an edge from vertex $i$ to vertex $j$, and $A_{i,j} = 0$ otherwise.\n\nIf no such cycle exists, print \"-1\". Otherwise, print any three vertices that form a cycle."}, {"prompt_md5": "557d6318", "template_md5": "465699a0", "result": "You are given a directed graph with a specific structure.  Find three distinct points in the graph that form a cycle of length three. If no such cycle exists, output -1."}]}