{"uid": "117-A", "url": "https://codeforces.com/contest/117/problem/A", "tags": ["implementation", " math"], "title": "117-A", "statement": "A. Elevatortime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAnd now the numerous qualifying tournaments for one of the most prestigious Russian contestsRussian Codec Cupare over. Allnparticipants who have made it to the finals found themselves in a hugem-floored108-star hotel. Of course the first thought to come in a place like this is \"How about checking out the elevator?\".The hotel's elevator moves between floors according to one never changing scheme. Initially (at the moment of time0) the elevator is located on the1-st floor, then it moves to the2-nd floor, then — to the3-rd floor and so on until it reaches them-th floor. After that the elevator moves to floorm- 1, then to floorm- 2, and so on until it reaches the first floor. This process is repeated infinitely. We know that the elevator has infinite capacity; we also know that on every floor people get on the elevator immediately. Moving between the floors takes a unit of time.For each of thenparticipant you are givensi, which represents the floor where thei-th participant starts,fi, which represents the floor thei-th participant wants to reach, andti, which represents the time when thei-th participant starts on the floorsi.For each participant print the minimum time of his/her arrival to the floorfi.If the elevator stops on the floorsiat the timeti, then thei-th participant can enter the elevator immediately. If the participant starts on the floorsiand that's the floor he wanted to reach initially (si=fi), then the time of arrival to the floorfifor this participant is considered equal toti.InputThe first line contains two space-separated integersnandm(1 ≤n≤ 105, 2 ≤m≤ 108).Nextnlines contain information about the participants in the form of three space-separated integerssifiti(1 ≤si,fi≤m, 0 ≤ti≤ 108), described in the problem statement.OutputPrintnlines each containing one integer — the time of the arrival for each participant to the required floor.ExamplesInput7 42 4 31 2 02 2 01 2 14 3 51 2 24 2 0Output91071075Input5 51 5 41 3 11 3 43 1 54 2 5Output12101087NoteLet's consider the first sample. The first participant starts at floors= 2by the time equal tot= 3. To get to the floorf= 4, he has to wait until the time equals7, that's the time when the elevator will go upwards for the second time. Then the first participant should get on the elevator and go two floors up. In this case the first participant gets to the floorfat time equal to9. The second participant starts at the timet= 0on the floors= 1, enters the elevator immediately, and arrives to the floorf= 2. The third participant doesn't wait for the elevator, because he needs to arrive to the same floor where he starts.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "babcade1", "template_md5": "35d339e4", "result": "There is an elevator in a building with $m$ floors. The elevator moves in a repeating pattern:\n\n1. It goes up from floor 1 to floor $m$.\n2. It goes down from floor $m-1$ to floor 1.\n\nThis pattern repeats infinitely.\n\nYou are given information about $n$ people:\n\n* $s_i$: The floor where the $i$-th person starts.\n* $f_i$: The floor the $i$-th person wants to reach.\n* $t_i$: The time when the $i$-th person starts on their floor.\n\nFor each person, determine the minimum time it takes for them to reach their desired floor.\n\n**Important Notes:**\n\n* The elevator has infinite capacity.\n* People get on the elevator immediately when it arrives at their floor.\n* If a person starts on the same floor they want to reach, their arrival time is their starting time.\n* Moving between floors takes 1 unit of time."}, {"prompt_md5": "16f6988e", "template_md5": "465699a0", "result": "An elevator moves up and down a building floor by floor. People want to get to different floors.  You are given the starting floor, destination floor, and starting time for each person.  Determine the minimum time it takes for each person to reach their destination floor."}]}