{"uid": "1170-D", "url": "https://codeforces.com/contest/1170/problem/D", "tags": ["*special", " data structures", " implementation"], "title": "1170-D", "statement": "D. Decoding of Integer Sequencestime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp is developing a method for transmitting $$$n$$$ integer sequences over a network. This method should support the transmission of an arbitrary number of integer sequences; sequences can have different lengths. The sequences contain arbitrarynon-negativeintegers.Polycarp developed the following encoding procedure:We assume that the sequences are numbered from $$$1$$$ to $$$n$$$.We add a special terminating marker to each sequence at the end, an element equal to-1.The encoding result is a new single sequence that contains all the elements of the specified $$$n$$$ in a special order: first, add to the result of coding all the first elements of the sequences (in the order from the $$$1$$$-st to the $$$n$$$-th), then all the second elements (in the order from the $$$1$$$-st to the $$$n$$$-th) and so on, if the sequence does not have the corresponding element, then it is simply skipped. The process ends when all elements of all sequences are added.For example, if you want to encode three sequences $$$[3, 1, 4]$$$, $$$[2, 7]$$$ and $$$[1, 2, 3, 4]$$$, then the sequence of actions will be as follows:we modify all three sequences by appending-1: $$$[3, 1, 4, -1]$$$, $$$[2, 7, -1]$$$ and $$$[1, 2, 3, 4, -1]$$$;we write out all the first elements, we get $$$[3, 2, 1]$$$;then write down all the second elements, we get $$$[3, 2, 1, 1, 7, 2]$$$;then write down all the third elements, we get $$$[3, 2, 1, 1, 7, 2, 4, -1, 3]$$$;then write down all fourth elements, get $$$[3, 2, 1, 1, 7, 2, 4, -1, 3, -1, 4]$$$ (note that the second sequence has already ended);then write down all the fifth elements, we get $$$[3, 2, 1, 1, 7, 2, 4, -1, 3, -1, 4, -1]$$$ (note that the first and second sequences have already ended);all the sequences are ended now, and the encoding process is finished;the encoding result is: $$$[3, 2, 1, 1, 7, 2, 4, -1, 3, -1, 4, -1]$$$.Your task is to implement decoding by a given encoding result.InputThe first line contains integer number $$$m$$$ ($$$1 \\\\le m \\\\le 3\\\\cdot10^5$$$), denoting the length of the encoding result. The second line contains the result of encoding as a sequence of integers $$$b_1, b_2, \\\\dots, b_m$$$ ($$$-1 \\\\le b_i \\\\le 100$$$).It is guaranteed that in the initial sequences before encoding contains only non-negative integers from $$$0$$$ to $$$100$$$, that you are in fact given the result of correct encoding (in other words, it is guaranteed that the answer exists). It is possible that one or more initial sequences were empty before encoding.OutputPrint $$$n$$$, where $$$n$$$ is the number of encoded sequences. Then print $$$n$$$ lines in the format $$$k_i, a_{i1}, a_{i2}, \\\\dots, a_{ik_i}$$$, where $$$k_i$$$ is the length of the $$$i$$$-th sequence, and $$$a_{i1}, a_{i2}, \\\\dots, a_{ik_i}$$$ are its elements. Separate the numbers in the lines with spaces. Please note that the encoding procedure is such that every possible encoding result can be decoded in only one way.ExamplesInput12 3 2 1 1 7 2 4 -1 3 -1 4 -1Output3 3 3 1 4 2 2 7 4 1 2 3 4Input6 2 -1 2 -1 3 -1Output3 1 2 0 2 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c6114203", "template_md5": "35d339e4", "result": "You are given a sequence of integers $b_1, b_2, ..., b_m$ representing the encoded form of multiple integer sequences.  \n\nThe encoding process works as follows:\n\n1. Each original sequence is appended with a special marker, -1.\n2. The encoded sequence is formed by concatenating the first elements of all original sequences, then the second elements, and so on. If a sequence is shorter than a particular position, it is skipped.\n\nYour task is to decode the given sequence $b_1, b_2, ..., b_m$ and output:\n\n1. The number of original sequences, $n$.\n2. Each original sequence in the format $k_i, a_{i1}, a_{i2}, ..., a_{ik_i}$, where $k_i$ is the length of the $i$-th sequence and $a_{i1}, a_{i2}, ..., a_{ik_i}$ are its elements. \n\n**Constraints:**\n\n* $1 \\le m \\le 3 \\cdot 10^5$\n* $-1 \\le b_i \\le 100$\n* It is guaranteed that the input is a valid encoding and can be decoded uniquely."}, {"prompt_md5": "cd9b0bde", "template_md5": "465699a0", "result": "You are given a sequence of numbers. This sequence was created by taking multiple shorter sequences, adding a special marker (-1) to the end of each, and then concatenating them in a specific order.  Your task is to reverse this process and find the original shorter sequences."}]}