{"uid": "118-C", "url": "https://codeforces.com/contest/118/problem/C", "tags": ["brute force", " greedy", " sortings", " strings"], "title": "118-C", "statement": "C. Fancy Numbertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA car number in Berland consists of exactlyndigits. A number is called beautiful if it has at leastkequal digits. Vasya wants to change the digits in his car's number so that the number became beautiful. To replace one ofndigits Vasya has to pay the sum of money, equal to the absolute difference between the old digit and the new one.Help Vasya: find the minimum sum of money he should pay to make the number of his car beautiful. You should also find the resulting beautiful number. If there are several such numbers, then print the lexicographically minimum one.InputThe first line contains two space-separated integersnandk(2 ≤n≤ 104, 2 ≤k≤n) which represent how many digits the number has and how many equal digits a beautiful number should have. The second line consists ofndigits. It describes the old number of Vasya's car. It is guaranteed that the number contains no spaces and only contains digits.OutputOn the first line print the minimum sum of money Vasya needs to change the number. On the second line print the car's new number. If there are several solutions, print the lexicographically minimum one.ExamplesInput6 5898196Output4888188Input3 2533Output0533Input10 60001112223Output30000002223NoteIn the first sample replacing the second digit with an \"8\" costs|9 - 8| = 1. Replacing the fifth digit with an \"8\" costs the same. Replacing the sixth digit costs|6 - 8| = 2. As a result, Vasya will pay1 + 1 + 2 = 4for a beautiful number \"888188\".The lexicographical comparison of strings is performed by the < operator in modern programming languages. The stringxis lexicographically smaller than the stringy, if there exists suchi(1 ≤i≤n), thatxi<yi, and for anyj(1 ≤j<i)xj=yj. The strings compared in this problem will always have the lengthn.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "55431a2b", "template_md5": "35d339e4", "result": "You are given a number with $n$ digits.  You need to change some digits so that the number has at least $k$ identical digits.  The cost of changing a digit is the absolute difference between the old digit and the new digit. Find the minimum cost to make the number beautiful and the resulting beautiful number. If there are multiple solutions, output the lexicographically smallest one."}, {"prompt_md5": "3d8ee582", "template_md5": "465699a0", "result": "You are given a number with a certain number of digits.  You need to change some digits to make the number have at least a specific number of repeating digits.  Find the smallest total change needed to make the number \"beautiful\" and output the resulting beautiful number.  If there are multiple solutions, output the smallest one alphabetically."}]}