{"uid": "1181-B", "url": "https://codeforces.com/contest/1181/problem/B", "tags": ["greedy", " implementation", " strings"], "title": "1181-B", "statement": "B. Split a Numbertime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputDima worked all day and wrote down on a long paper strip his favorite number $$$n$$$ consisting of $$$l$$$ digits. Unfortunately, the strip turned out to be so long that it didn't fit in the Dima's bookshelf.To solve the issue, Dima decided to split the strip into two non-empty parts so that each of them contains apositiveinteger without leading zeros. After that he will compute the sum of the two integers and write it down on a new strip.Dima wants the resulting integer to be as small as possible, because it increases the chances that the sum will fit it in the bookshelf. Help Dima decide what is the minimum sum he can obtain.InputThe first line contains a single integer $$$l$$$ ($$$2 \\\\le l \\\\le 100\\\\,000$$$) — the length of the Dima's favorite number.The second line contains the positive integer $$$n$$$ initially written on the strip: the Dima's favorite number.The integer $$$n$$$ consists of exactly $$$l$$$ digits and it does not contain leading zeros. Dima guarantees, that there is at least one valid way to split the strip.OutputPrint a single integer — the smallest number Dima can obtain.ExamplesInput7 1234567Output1801Input3 101Output11NoteIn the first example Dima can split the number $$$1234567$$$ into integers $$$1234$$$ and $$$567$$$. Their sum is $$$1801$$$.In the second example Dima can split the number $$$101$$$ into integers $$$10$$$ and $$$1$$$. Their sum is $$$11$$$. Note that it is impossible to split the strip into \"1\" and \"01\" since the numbers can't start with zeros.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ec9b9001", "template_md5": "35d339e4", "result": "You are given a positive integer $n$ with $l$ digits.  You need to split this integer into two non-empty parts, each of which is also a positive integer with no leading zeros. Find the smallest possible sum of these two parts."}, {"prompt_md5": "169a2d10", "template_md5": "465699a0", "result": "You are given a number. Split it into two parts, each of which is a positive integer without leading zeros. Find the smallest possible sum of the two parts."}]}