{"uid": "1182-D", "url": "https://codeforces.com/contest/1182/problem/D", "tags": ["constructive algorithms", " dfs and similar", " dp", " hashing", " implementation", " trees"], "title": "1182-D", "statement": "D. Complete Mirrortime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have given tree consist of $$$n$$$ vertices. Select a vertex as root vertex that satisfies the condition below.For all vertices $$$v_{1}$$$ and $$$v_{2}$$$, if $$$distance$$$($$$root$$$, $$$v_{1}$$$) $$$= distance$$$($$$root$$$, $$$v_{2})$$$ then $$$degree$$$($$$v_{1}$$$) $$$= degree$$$($$$v_{2}$$$), where $$$degree$$$ means the number of vertices connected to that vertex, and $$$distance$$$ means the number of edges between two vertices.Determine and find if there is such root vertex in the tree. If there are multiple answers, find any of them.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^{5}$$$) — the number of vertices.Each of the next $$$n-1$$$ lines contains two integers $$$v_{i}$$$ and $$$u_{i}$$$ ($$$1 \\\\le v_{i} \\\\lt u_{i} \\\\le n$$$) — it means there is an edge exist between $$$v_{i}$$$ and $$$u_{i}$$$. It is guaranteed that the graph forms tree.OutputIf there is such root vertex exists, print any of them. Otherwise, print $$$-1$$$.ExamplesInput7 1 2 2 3 3 4 4 5 3 6 6 7Output3Input6 1 3 2 3 3 4 4 5 4 6Output-1NoteThis is the picture for the first example. $$$1$$$, $$$5$$$, $$$7$$$ also can be a valid answer.This is the picture for the second example. You can see that it's impossible to find such root vertex.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97babac7", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices.  A root vertex is a special vertex in the tree.  \n\nA root vertex satisfies this condition: For any two vertices $v_1$ and $v_2$, if the distance from the root to $v_1$ is equal to the distance from the root to $v_2$, then the degree of $v_1$ must be equal to the degree of $v_2$.\n\nThe degree of a vertex is the number of edges connected to it. The distance between two vertices is the number of edges between them.\n\nDetermine if there is a root vertex that satisfies the condition. If there is, print any one of them. If there is no such root vertex, print -1."}, {"prompt_md5": "a282a244", "template_md5": "465699a0", "result": "You are given a tree-shaped network.  Find a central point in the network where all points that are the same distance away from the central point have the same number of connections. If such a point exists, output it. Otherwise, output -1."}]}