{"uid": "1183-C", "url": "https://codeforces.com/contest/1183/problem/C", "tags": ["binary search", " math"], "title": "1183-C", "statement": "C. Computer Gametime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVova is playing a computer game. There are in total $$$n$$$ turns in the game and Vova really wants to play all of them. The initial charge of his laptop battery (i.e. the charge before the start of the game) is $$$k$$$.During each turn Vova can choose what to do:If the current charge of his laptop battery is strictly greater than $$$a$$$, Vova canjust play, and then the charge of his laptop battery will decrease by $$$a$$$;if the current charge of his laptop battery is strictly greater than $$$b$$$ ($$$b<a$$$), Vova canplay and chargehis laptop, and then the charge of his laptop battery will decrease by $$$b$$$;if the current charge of his laptop battery is less than or equal to $$$a$$$ and $$$b$$$ at the same time then Vova cannot do anything and loses the game.Regardless of Vova's turns the charge of the laptop battery is always decreases.Vova wants to complete the game (Vova can complete the game if after each of $$$n$$$ turns the charge of the laptop battery isstrictly greater than $$$0$$$). Vova has to playexactly $$$n$$$ turns. Among all possible ways to complete the game, Vova wants to choose the one where the number of turns when hejust plays(first type turn) is themaximumpossible. It is possible that Vova cannot complete the game at all.Your task is to find out themaximumpossible number of turns Vova canjust play(make thefirst type turn) or report that Vova cannot complete the game.You have to answer $$$q$$$ independent queries.InputThe first line of the input contains one integer $$$q$$$ ($$$1 \\\\le q \\\\le 10^5$$$) — the number of queries. Each query is presented by a single line.The only line of the query contains four integers $$$k, n, a$$$ and $$$b$$$ ($$$1 \\\\le k, n \\\\le 10^9, 1 \\\\le b < a \\\\le 10^9$$$) — the initial charge of Vova's laptop battery, the number of turns in the game and values $$$a$$$ and $$$b$$$, correspondingly.OutputFor each query print one integer:-1if Vova cannot complete the game or themaximumnumber of turns Vova canjust play(make thefirst type turn) otherwise.ExampleInput6 15 5 3 2 15 5 4 3 15 5 2 1 15 5 5 1 16 7 5 2 20 5 7 3Output4 -1 5 2 0 1NoteIn the first example query Vova canjust play$$$4$$$ turns and spend $$$12$$$ units of charge and then one turnplay and chargeand spend $$$2$$$ more units. So the remaining charge of the battery will be $$$1$$$.In the second example query Vova cannot complete the game because even if he willplay and chargethe battery during each turn then the charge of the laptop battery will be $$$0$$$ after the last turn.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "81840ad2", "template_md5": "35d339e4", "result": "There are $n$ turns in a game.  You start with a battery charge of $k$.  On each turn, you can choose to:\n\n* **Play:** If your battery charge is greater than $a$, you can play and your battery charge decreases by $a$.\n* **Play and Charge:** If your battery charge is greater than $b$ ($b<a$), you can play and charge, and your battery charge decreases by $b$.\n\nYou cannot do anything if your battery charge is less than or equal to both $a$ and $b$.\n\nYou must play for all $n$ turns.  You want to maximize the number of turns where you choose to just \"Play\".  \n\nGiven $q$ different scenarios (each with values for $k$, $n$, $a$, and $b$), determine the maximum number of \"Play\" turns possible in each scenario, or report that it's impossible to complete the game."}, {"prompt_md5": "6a47b85c", "template_md5": "465699a0", "result": "You have a limited amount of energy. Each turn, you can either use a larger amount of energy to do something, or a smaller amount of energy to do something and recharge a little. You must complete a set number of turns. Find the maximum number of turns you can complete using the larger amount of energy, or say it's impossible."}]}