{"uid": "1184-A1", "url": "https://codeforces.com/contest/1184/problem/A1", "tags": ["brute force", " math", " number theory"], "title": "1184-A1", "statement": "A1. Heidi Learns Hashing (Easy)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMelody Pond was stolen from her parents as a newborn baby by Madame Kovarian, to become a weapon of the Silence in their crusade against the Doctor. Madame Kovarian changed Melody's name to River Song, giving her a new identity that allowed her to kill the Eleventh Doctor.Heidi figured out that Madame Kovarian uses a very complicated hashing function in order to change the names of the babies she steals. In order to prevent this from happening to future Doctors, Heidi decided to prepare herself by learning some basic hashing techniques.The first hashing function she designed is as follows.Given two positive integers $$$(x, y)$$$ she defines $$$H(x,y):=x^2+2xy+x+1$$$.Now, Heidi wonders if the function is reversible. That is, given a positive integer $$$r$$$, can you find a pair $$$(x, y)$$$ (of positive integers) such that $$$H(x, y) = r$$$?If multiple such pairs exist, output the one with smallest possible $$$x$$$. If there is no such pair, output \"NO\".InputThe first and only line contains an integer $$$r$$$ ($$$1 \\\\le r \\\\le 10^{12}$$$).OutputOutput integers $$$x, y$$$ such that $$$H(x,y) = r$$$ and $$$x$$$ is smallest possible, or \"NO\" if no such pair exists.ExamplesInput19Output1 8Input16OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d59c25a7", "template_md5": "35d339e4", "result": "Given a positive integer $r$, find two positive integers $x$ and $y$ such that  $x^2 + 2xy + x + 1 = r$. If there are multiple solutions, output the one with the smallest possible $x$. If no such pair exists, output \"NO\"."}, {"prompt_md5": "5363d5da", "template_md5": "465699a0", "result": "Given a number, find two positive numbers that add up to that number using a specific pattern. If no such pair exists, say \"NO\"."}]}