{"uid": "1185-D", "url": "https://codeforces.com/contest/1185/problem/D", "tags": ["implementation", " math"], "title": "1185-D", "statement": "D. Extra Elementtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA sequence $$$a_1, a_2, \\\\dots, a_k$$$ is called an arithmetic progression if for each $$$i$$$ from $$$1$$$ to $$$k$$$ elements satisfy the condition $$$a_i = a_1 + c \\\\cdot (i - 1)$$$ for some fixed $$$c$$$.For example, these five sequences are arithmetic progressions: $$$[5, 7, 9, 11]$$$, $$$[101]$$$, $$$[101, 100, 99]$$$, $$$[13, 97]$$$ and $$$[5, 5, 5, 5, 5]$$$. And these four sequences aren't arithmetic progressions: $$$[3, 1, 2]$$$, $$$[1, 2, 4, 8]$$$, $$$[1, -1, 1, -1]$$$ and $$$[1, 2, 3, 3, 3]$$$.You are given a sequence of integers $$$b_1, b_2, \\\\dots, b_n$$$. Find any index $$$j$$$ ($$$1 \\\\le j \\\\le n$$$), such that if you delete $$$b_j$$$ from the sequence, you can reorder the remaining $$$n-1$$$ elements, so that you will get an arithmetic progression. If there is no such index, output the number-1.InputThe first line of the input contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 2\\\\cdot10^5$$$) — length of the sequence $$$b$$$. The second line contains $$$n$$$ integers $$$b_1, b_2, \\\\dots, b_n$$$ ($$$-10^9 \\\\le b_i \\\\le 10^9$$$) — elements of the sequence $$$b$$$.OutputPrint such index $$$j$$$ ($$$1 \\\\le j \\\\le n$$$), so that if you delete the $$$j$$$-th element from the sequence, you can reorder the remaining elements, so that you will get an arithmetic progression. If there are multiple solutions, you are allowed to print any of them. If there is no such index, print-1.ExamplesInput5 2 6 8 7 4Output4Input8 1 2 3 4 5 6 7 8Output1Input4 1 2 4 8Output-1NoteNote to the first example. If you delete the $$$4$$$-th element, you can get the arithmetic progression $$$[2, 4, 6, 8]$$$.Note to the second example. The original sequence is already arithmetic progression, so you can delete $$$1$$$-st or last element and you will get an arithmetical progression again.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3ec0ff04", "template_md5": "465699a0", "result": "You are given a list of numbers. Find an index in the list such that if you remove the number at that index, the remaining numbers can be arranged in order to form an arithmetic sequence (where the difference between consecutive numbers is constant). If no such index exists, output -1."}, {"prompt_md5": "520302e4", "template_md5": "35d339e4", "result": "You are given a sequence of integers $b_1, b_2, ..., b_n$.  Find an index $j$ (where $1 \\le j \\le n$) such that if you remove the element $b_j$ from the sequence, the remaining $n-1$ elements can be rearranged to form an arithmetic progression.  \n\nAn arithmetic progression is a sequence where the difference between consecutive terms is constant.  \n\nIf no such index exists, output -1."}]}