{"uid": "1188-D", "url": "https://codeforces.com/contest/1188/problem/D", "tags": ["dp"], "title": "1188-D", "statement": "D. Make Equaltime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given $$$n$$$ numbers $$$a_1, a_2, \\\\dots, a_n$$$. In one operation we can add to any one of those numbers a nonnegative integer power of $$$2$$$.What is the smallest number of operations we need to perform to make all $$$n$$$ numbers equal? It can be proved that under given constraints it doesn't exceed $$$10^{18}$$$.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$).The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$0 \\\\le a_i \\\\le 10^{17}$$$).OutputOutput exactly one integer — the smallest number of operations we need to perform to make all $$$n$$$ numbers equal.ExamplesInput4 228 228 228 228Output0Input3 2 2 8Output3NoteIn the first example, all numbers are already equal. So the needed number of operation is $$$0$$$.In the second example, we can apply the operation $$$3$$$ times: add $$$8$$$ to first $$$2$$$, add $$$8$$$ to second $$$2$$$, add $$$2$$$ to $$$8$$$, making all numbers equal to $$$10$$$. It can be proved that we can't make all numbers equal in less than $$$3$$$ operations.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c9d35bd9", "template_md5": "465699a0", "result": "You are given a list of numbers. You can add a power of 2 to any number in the list. What is the fewest times you need to do this to make all the numbers the same?"}, {"prompt_md5": "d73b29b9", "template_md5": "35d339e4", "result": "You are given $n$ numbers $a_1, a_2, ..., a_n$. You can perform an operation on any of these numbers by adding a non-negative power of 2 to it. What is the fewest number of operations needed to make all $n$ numbers equal? \n\nInput:\n\n* The first line contains an integer $n$ ($1 \\le n \\le 10^5$).\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 \\le a_i \\le 10^{17}$).\n\nOutput:\n\n* Output a single integer representing the minimum number of operations needed."}]}