{"uid": "1189-A", "url": "https://codeforces.com/contest/1189/problem/A", "tags": ["strings"], "title": "1189-A", "statement": "A. Keanu Reevestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter playing Neo in the legendary \"Matrix\" trilogy, Keanu Reeves started doubting himself: maybe we really live in virtual reality? To find if this is true, he needs to solve the following problem.Let's call a string consisting of only zeroes and onesgoodif it containsdifferentnumbers of zeroes and ones. For example,1,101,0000are good, while01,1001, and111000are not good.We are given a string $$$s$$$ of length $$$n$$$ consisting of only zeroes and ones. We need to cut $$$s$$$ intominimal possiblenumber of substrings $$$s_1, s_2, \\\\ldots, s_k$$$ such thatallof them are good. More formally, we have to findminimalby number of strings sequence of good strings $$$s_1, s_2, \\\\ldots, s_k$$$ such that their concatenation (joining) equals $$$s$$$, i.e. $$$s_1 + s_2 + \\\\dots + s_k = s$$$.For example, cuttings110010into110and010or into11and0010are valid, as110,010,11,0010are all good, and we can't cut110010to the smaller number of substrings as110010isn't good itself. At the same time, cutting of110010into1100and10isn't valid as both strings aren't good. Also, cutting of110010into1,1,0010isn't valid, as it isn't minimal, even though all $$$3$$$ strings are good.Can you help Keanu? We can show that the solution always exists. If there are multiple optimal answers, print any.InputThe first line of the input contains a single integer $$$n$$$ ($$$1\\\\le n \\\\le 100$$$) — the length of the string $$$s$$$.The second line contains the string $$$s$$$ of length $$$n$$$ consisting only from zeros and ones.OutputIn the first line, output a single integer $$$k$$$ ($$$1\\\\le k$$$) — aminimalnumber of strings you have cut $$$s$$$ into.In the second line, output $$$k$$$ strings $$$s_1, s_2, \\\\ldots, s_k$$$ separated with spaces. The length of each string has to be positive. Their concatenation has to be equal to $$$s$$$ and all of them have to be good.If there are multiple answers, print any.ExamplesInput1 1Output1 1Input2 10Output2 1 0Input6 100011Output2 100 011NoteIn the first example, the string1wasn't cut at all. As it is good, the condition is satisfied.In the second example,1and0both are good. As10isn't good, the answer is indeed minimal.In the third example,100and011both are good. As100011isn't good, the answer is indeed minimal.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a959f764", "template_md5": "35d339e4", "result": "You are given a string of 0s and 1s.  You need to cut this string into the fewest possible substrings such that each substring has a different number of 0s and 1s. \n\nFor example, the string \"110010\" can be cut into:\n\n* \"110\" and \"010\" \n* \"11\" and \"0010\"\n\nOutput the minimum number of substrings and the substrings themselves."}, {"prompt_md5": "5cfa6f98", "template_md5": "465699a0", "result": "You are given a string of 0s and 1s.  Cut the string into the fewest possible pieces so that each piece has a different number of 0s and 1s."}]}