{"uid": "1195-C", "url": "https://codeforces.com/contest/1195/problem/C", "tags": ["dp"], "title": "1195-C", "statement": "C. Basketball Exercisetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputFinally, a basketball court has been opened in SIS, so Demid has decided to hold a basketball exercise session. $$$2 \\\\cdot n$$$ students have come to Demid's exercise session, and he lined up them into two rows of the same size (there are exactly $$$n$$$ people in each row). Students are numbered from $$$1$$$ to $$$n$$$ in each row in order from left to right.Now Demid wants to choose a team to play basketball. He will choose players from left to right, and the index of each chosen player (excluding the first onetaken) will be strictly greater than the index of the previously chosen player. To avoid giving preference to one of the rows, Demid chooses students in such a way that no consecutive chosen students belong to the same row. The first student can be chosen among all $$$2n$$$ students (there are no additional constraints), and a team can consist of any number of students.Demid thinks, that in order to compose a perfect team, he should choose students in such a way, that the total height of all chosen students is maximum possible. Help Demid to find the maximum possible total height of players in a team he can choose.InputThe first line of the input contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$) — the number of students in each row.The second line of the input contains $$$n$$$ integers $$$h_{1, 1}, h_{1, 2}, \\\\ldots, h_{1, n}$$$ ($$$1 \\\\le h_{1, i} \\\\le 10^9$$$), where $$$h_{1, i}$$$ is the height of the $$$i$$$-th student in the first row.The third line of the input contains $$$n$$$ integers $$$h_{2, 1}, h_{2, 2}, \\\\ldots, h_{2, n}$$$ ($$$1 \\\\le h_{2, i} \\\\le 10^9$$$), where $$$h_{2, i}$$$ is the height of the $$$i$$$-th student in the second row.OutputPrint a single integer — the maximum possible total height of players in a team Demid can choose.ExamplesInput5 9 3 5 7 3 5 8 1 4 5Output29Input3 1 2 9 10 1 1Output19Input1 7 4Output7NoteIn the first example Demid can choose the following team as follows:In the second example Demid can choose the following team as follows:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7606cf0c", "template_md5": "35d339e4", "result": "There are two rows of students, each with $n$ students.  The height of each student is given.  \n\nYou need to choose a team of students from both rows, where no two consecutive students chosen are in the same row.  The goal is to find the maximum possible total height of the team."}, {"prompt_md5": "4ed17410", "template_md5": "465699a0", "result": "You have two rows of people, each with a different height. You need to pick a team of people from both rows, where you can't pick two people from the same row in a row. What is the maximum total height of people you can pick for your team?"}]}