{"uid": "1198-F", "url": "https://codeforces.com/contest/1198/problem/F", "tags": ["greedy", " number theory", " probabilities"], "title": "1198-F", "statement": "F. GCD Groups 2time limit per test0.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array of $$$n$$$ integers. You need to split all integers into two groups so that the GCD of all integers in the first group is equal to one and the GCD of all integers in the second group is equal to one.The GCD of a group of integers is the largest non-negative integer that divides all the integers in the group.Both groups have to be non-empty.InputThe first line contains a single integer $$$n$$$ ($$$2 \\\\leq n \\\\leq 10^5$$$).The second line contains $$$n$$$ integers $$$a_1$$$, $$$a_2$$$, $$$\\\\ldots$$$, $$$a_n$$$ ($$$1 \\\\leq a_i \\\\leq 10^9$$$) — the elements of the array.OutputIn the first line print \"YES\" (without quotes), if it is possible to split the integers into two groups as required, and \"NO\" (without quotes) otherwise.If it is possible to split the integers, in the second line print $$$n$$$ integers, where the $$$i$$$-th integer is equal to $$$1$$$ if the integer $$$a_i$$$ should be in the first group, and $$$2$$$ otherwise.If there are multiple solutions, print any.ExamplesInput4 2 3 6 7OutputYES 2 2 1 1Input5 6 15 35 77 22OutputYES 2 1 2 1 1Input5 6 10 15 1000 75OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "56e79cc2", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers.  You need to divide the integers into two groups. The greatest common divisor (GCD) of all the numbers in the first group must be 1, and the GCD of all the numbers in the second group must also be 1.  \n\n* The GCD of a set of numbers is the largest number that divides evenly into all of them.\n* Both groups must have at least one number.\n\nOutput \"YES\" if you can divide the numbers into two groups like this, and \"NO\" if you can't. If you can, also output a list of 1s and 2s, where a 1 means the number should be in the first group, and a 2 means it should be in the second group."}, {"prompt_md5": "809b691f", "template_md5": "465699a0", "result": "You are given a list of numbers.  You need to divide the list into two groups.  The numbers in each group must share no common divisors other than 1.  \n\nLet me know if you want to try solving it!"}]}