{"uid": "1199-B", "url": "https://codeforces.com/contest/1199/problem/B", "tags": ["geometry", " math"], "title": "1199-B", "statement": "B. Water Lilytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhile sailing on a boat, Inessa noticed a beautiful water lily flower above the lake's surface. She came closer and it turned out that the lily was exactly $$$H$$$ centimeters above the water surface. Inessa grabbed the flower and sailed the distance of $$$L$$$ centimeters. Exactly at this point the flower touched the water surface.Suppose that the lily grows at some point $$$A$$$ on the lake bottom, and its stem is always a straight segment with one endpoint at point $$$A$$$. Also suppose that initially the flower was exactly above the point $$$A$$$, i.e. its stem was vertical. Can you determine the depth of the lake at point $$$A$$$?InputThe only line contains two integers $$$H$$$ and $$$L$$$ ($$$1 \\\\le H < L \\\\le 10^{6}$$$).OutputPrint a single number — the depth of the lake at point $$$A$$$. The absolute or relative error should not exceed $$$10^{-6}$$$.Formally, let your answer be $$$A$$$, and the jury's answer be $$$B$$$. Your answer is accepted if and only if $$$\\\\frac{|A - B|}{\\\\max{(1, |B|)}} \\\\le 10^{-6}$$$.ExamplesInput1 2Output1.5000000000000Input3 5Output2.6666666666667", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b92339d7", "template_md5": "35d339e4", "result": "A water lily was $H$ centimeters above the water surface.  A boat sailed $L$ centimeters, and at that point, the lily touched the water.  The lily grows from a point on the lake bottom.  Initially, the lily stem was vertical. What is the depth of the lake at the point where the lily grows?\n\nInput: Two numbers, $H$ and $L$ ($1 \\le H < L \\le 10^6$)\n\nOutput: A single number representing the depth of the lake. The answer should be accurate to at least six decimal places."}, {"prompt_md5": "01a2f756", "template_md5": "465699a0", "result": "A flower was a certain height above the water. It was then moved a certain distance horizontally, at which point it touched the water.  What was the original depth of the water at the flower's starting point?"}]}