{"uid": "120-D", "url": "https://codeforces.com/contest/120/problem/D", "tags": ["brute force"], "title": "120-D", "statement": "D. Three Sonstime limit per test1 secondmemory limit per test256 megabytesinputinput.txtoutputoutput.txtThree sons inherited from their father a rectangular corn fiend divided inton×msquares. For each square we know how many tons of corn grows on it. The father, an old farmer did not love all three sons equally, which is why he bequeathed to divide his field into three parts containingA,BandCtons of corn.The field should be divided by two parallel lines. The lines should be parallel to one side of the field and to each other. The lines should go strictly between the squares of the field. Each resulting part of the field should consist of at least one square.Your task is to find the number of ways to divide the field as is described above, that is, to mark two lines, dividing the field in three parts so that on one of the resulting parts grewAtons of corn,Bon another one andCon the remaining one.InputThe first line contains space-separated integersnandm— the sizes of the original (1 ≤n,m≤ 50,max(n,m) ≥ 3). Then the field's description follows:nlines, each containingmspace-separated integerscij, (0 ≤cij≤ 100) — the number of tons of corn each square contains. The last line contains space-separated integersA,B,C(0 ≤A,B,C≤ 106).OutputPrint the answer to the problem: the number of ways to divide the father's field so that one of the resulting parts containedAtons of corn, another one containedBtons, and the remaining one containedCtons. If no such way exists, print 0.ExamplesInput3 31 1 11 1 11 1 13 3 3Output2Input2 51 1 1 1 12 2 2 2 23 6 6Output3Input3 31 2 33 1 22 3 15 6 7Output0NoteThe lines dividing the field can be horizontal or vertical, but they should be parallel to each other.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5d29ef7d", "template_md5": "35d339e4", "result": "You are given a rectangular field divided into an $n \\times m$ grid of squares. Each square contains a certain number of tons of corn.  \n\nYou need to divide the field into three parts using two vertical or horizontal lines. The lines must be parallel to each other and run between the squares. Each part must contain at least one square.\n\nYou are given three target amounts of corn: $A$, $B$, and $C$.  \n\nFind the number of ways to divide the field so that one part contains $A$ tons of corn, another part contains $B$ tons of corn, and the remaining part contains $C$ tons of corn. If it's impossible to divide the field this way, print 0."}, {"prompt_md5": "6680ad47", "template_md5": "465699a0", "result": "You are given a rectangular grid of numbers.  Each number represents a value. You need to divide the grid into three sections using two vertical or horizontal lines.  The lines must be parallel and go between the grid squares.  Find the number of ways to divide the grid so that each section has a specific target value."}]}