{"uid": "120-C", "url": "https://codeforces.com/contest/120/problem/C", "tags": ["implementation", " math"], "title": "120-C", "statement": "C. Winnie-the-Pooh and honeytime limit per test1 secondmemory limit per test256 megabytesinputinput.txtoutputoutput.txtAs we all know, Winnie-the-Pooh just adores honey. Ones he and the Piglet found out that the Rabbit has recently gotten hold of an impressive amount of this sweet and healthy snack. As you may guess, Winnie and the Piglet asked to come at the Rabbit's place. Thus, there arenjars of honey lined up in front of Winnie-the-Pooh, jar numbericontainsaikilos of honey. Winnie-the-Pooh eats the honey like that: each time he chooses a jar containing most honey. If the jar has less thatkkilos of honey or if Winnie-the-Pooh has already eaten from it three times, he gives the jar to Piglet. Otherwise he eats exactlykkilos of honey from the jar and puts it back. Winnie does so until he gives all jars to the Piglet. Count how much honey Piglet will overall get after Winnie satisfies his hunger.InputThe first line contains two integersnandk(1 ≤n≤ 100, 1 ≤k≤ 100). The second line containsnintegersa1,a2, ...,an, separated by spaces (1 ≤ai≤ 100).OutputPrint a single number — how many kilos of honey gets Piglet.ExamplesInput3 315 8 10Output9", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c91c72f9", "template_md5": "35d339e4", "result": "You are given $n$ jars of honey, each containing a different amount of honey. The amount of honey in the $i$-th jar is $a_i$ kilos. \n\nA person eats honey from the jar with the most honey. If a jar has less than $k$ kilos of honey or has already been eaten from three times, it is given to another person. Otherwise, the person eats exactly $k$ kilos of honey from the jar and puts it back. This continues until all jars are given away.\n\nCalculate the total amount of honey the other person receives. \n\n\nInput:\n\n* The first line contains two integers $n$ and $k$ (1 ≤ $n$ ≤ 100, 1 ≤ $k$ ≤ 100).\n* The second line contains $n$ integers $a_1$, $a_2$, ..., $a_n$, separated by spaces (1 ≤ $a_i$ ≤ 100).\n\nOutput:\n\n* Print a single number — the total amount of honey the other person receives."}, {"prompt_md5": "c73390b1", "template_md5": "465699a0", "result": "You are given a list of numbers representing the amount of honey in each jar.  A person eats from the jar with the most honey, taking a fixed amount each time. If a jar has less than a certain amount or has been eaten from three times, it is given away.  Count the total amount of honey given away."}]}