{"uid": "120-J", "url": "https://codeforces.com/contest/120/problem/J", "tags": ["divide and conquer", " geometry", " sortings"], "title": "120-J", "statement": "J. Minimum Sumtime limit per test2 secondsmemory limit per test256 megabytesinputinput.txtoutputoutput.txtYou are given a set ofnvectors on a plane. For each vector you are allowed to multiply any of its coordinates by-1. Thus, each vectorvi= (xi,yi)can be transformed into one of the following four vectors:vi1= (xi,yi),vi2= ( -xi,yi),vi3= (xi,  -yi),vi4= ( -xi,  -yi).You should find two vectors from the set and determine which of their coordinates should be multiplied by-1so that the absolute value of the sum of the resulting vectors was minimally possible. More formally, you should choose two vectorsvi,vj(1 ≤i,j≤n,i≠j) and two numbersk1,k2(1 ≤k1,k2≤ 4), so that the value of the expression|vik1+vjk2|were minimum.InputThe first line contains a single integern(2 ≤n≤ 105). Thennlines contain vectors as pairs of integers \"xiyi\" (- 10000 ≤xi,yi≤ 10000), one pair per line.OutputPrint on the first line four space-separated numbers \"ik1jk2\" — the answer to the problem. If there are several variants the absolute value of whose sums is minimum, you can print any of them.ExamplesInput5-7 -39 0-8 67 -84 -5Output3 2 4 2Input53 2-4 7-6 0-8 45 1Output3 4 5 4NoteA sum of two vectorsv= (xv,yv)andu= (xu,yu)is vectors=v+u= (xv+xu,yv+yu).An absolute value of vectorv= (x,y)is number.In the second sample there are several valid answers, such as:(3 1 4 2), (3 1 4 4), (3 4 4 1), (3 4 4 3), (4 1 3 2), (4 1 3 4), (4 2 3 1).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "167827a9", "template_md5": "35d339e4", "result": "You are given a set of $n$ vectors on a plane. Each vector is represented as a pair of integers $(x, y)$. You can multiply either the $x$ or $y$ coordinate of each vector by -1.  \n\nFind two vectors from the set and determine which coordinates to multiply by -1 so that the absolute value of the sum of the resulting vectors is minimized. \n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 10⁵), representing the number of vectors.\n* The next $n$ lines each contain a pair of integers \"xi yi\" (-10000 ≤ $xi$, $yi$ ≤ 10000), representing the coordinates of a vector.\n\n**Output:**\n\n* Print four space-separated numbers \"ik1 jk2\", where:\n    * $i$ and $j$ are the indices of the two chosen vectors (1 ≤ $i$, $j$ ≤ $n$, $i$ ≠ $j$).\n    * $k1$ and $k2$ are the indices (1 ≤ $k1$, $k2$ ≤ 4) indicating which coordinate of each vector to multiply by -1.\n\n**Example:**\n\nInput:\n```\n5\n-7 -3\n9 0\n-8 6\n-7 -8\n4 5\n```\n\nOutput:\n```\n3 2 4 2\n```"}, {"prompt_md5": "04e93f73", "template_md5": "465699a0", "result": "You are given a set of points on a 2D plane. Each point can be reflected across either the x-axis or the y-axis. Find two points and determine which reflections of each point will result in the smallest sum of their coordinates."}]}