{"uid": "120-G", "url": "https://codeforces.com/contest/120/problem/G", "tags": ["implementation"], "title": "120-G", "statement": "G. Boomtime limit per test1 secondmemory limit per test256 megabytesinputinput.txtoutputoutput.txtLet's consider the famous game called Boom (aka Hat) with simplified rules.There arenteams playing the game. Each team has two players. The purpose of the game is to explain the words to the teammate without using any words that contain the same root or that sound similarly.Playerjfrom teami(1 ≤i≤n, 1 ≤j≤ 2)is characterized by two numbers:aijandbij. The numbers correspondingly represent the skill of explaining and the skill of understanding this particular player has.Besides,mcards are used for the game. Each card has a word written on it. The card numberk(1 ≤k≤m)is characterized by numberck— the complexity of the word it contains.Before the game starts the cards are put in a deck and shuffled. Then the teams play in turns like that: the 1-st player of the 1-st team, the 1-st player of the 2-nd team, ... , the 1-st player of then-th team, the 2-nd player of the 1-st team, ... , the 2-nd player of then-th team, the 1-st player of the 1-st team and so on.Each turn continues fortseconds. It goes like that: Initially the time for each turn ist. While the time left to a player is more than 0, a player takes a card from the top of the deck and starts explaining the word it has to his teammate. The time needed for thej-th player of thei-th team to explain the word from the cardkto his teammate (theq-th player of thei-th team) equalsmax(1,ck- (aij+biq) -dik)(ifj= 1,thenq= 2,elseq= 1). The valuedikis the number of seconds thei-th team has already spent explaining the wordkduring the previous turns. Initially, alldikequal 0. If a team manages to guess the word before the end of the turn, then the time given above is substracted from the duration of the turn, the card containing the guessed word leaves the game, the team wins one point and the game continues. If the team doesn't manage to guess the word, then the card is put at the bottom of the deck,dikincreases on the amount of time of the turn, spent on explaining the word. Thus, when this team gets the very same word, they start explaining it not from the beginning, but from the point where they stopped. The game ends when words from allmcards are guessed correctly.You are givennteams and a deck ofmcards. You should determine for each team, how many points it will have by the end of the game and which words the team will have guessed.InputThe first line contains two integersn,t(1 ≤n,t≤ 100), which correspondingly denote the number of teams and a turn's duration.Nextnlines of the input file contain four integers each:ai1,bi1,ai2,bi2(1 ≤aij,bij≤ 100)— the skills of the first and the second player of thei-th team. The teams are given in the order in which they play.The next line of the input file contains integerm(1 ≤m≤ 100)the number of cards.Next2mlines contain the cards' descriptions. Two lines describe each card. The first line of the description contains the word that consists of no more than 20 characters. The words only contain small Latin letters. The second line of the description contains an integerck(1 ≤ck≤ 100) — the complexity of the word written on thek-th card. The cards are listed in the order in which the lie in the deck from top to bottom. The words on all cards are different.OutputPrintnlines. On thei-th line first print numbersithe number of points thei-th team wins. Then printsispace-separated words — the words from the cards guessed by teamiin the order in which they were guessed.ExamplesInput2 21 1 1 11 1 1 13home1car1brother1Output2 home car1 brotherInput2 41 2 2 12 3 2 24armchair3quetzalcoatl10pilotage5defibrillator7Output2 armchair quetzalcoatl2 pilotage defibrillator", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4f689af6", "template_md5": "35d339e4", "result": "There are $n$ teams, each with two players.  The teams take turns playing a game.\n\nIn each turn, a team member draws a card with a word on it. The complexity of the word is represented by $c_k$. The player has $t$ seconds to explain the word to their teammate. The time it takes to explain the word depends on the player's skills ($a_{ij}$ for explaining, $b_{iq}$ for understanding) and the complexity of the word, as well as the time already spent explaining the same word ($d_{ik}$).\n\nIf the teammate guesses the word before time runs out, the team scores a point, the card is removed, and the game continues. If they don't guess the word, the card is put back in the deck, and the time spent explaining is added to $d_{ik}$.\n\nThe game ends when all the words have been guessed.\n\nYour task is to determine:\n\n* For each team, how many points they will score.\n* The order in which each team guesses the words.\n\n\n\nYou are given:\n\n* $n$: the number of teams\n* $t$: the duration of each turn\n* $a_{ij}$ and $b_{ij}$: the skills of each player on each team\n* $m$: the number of cards\n* $c_k$: the complexity of each word on each card"}, {"prompt_md5": "1e753329", "template_md5": "465699a0", "result": "There are teams of two players. Each team takes turns trying to guess words from a deck of cards.  Each word has a difficulty level.  A player's skill at explaining and understanding affects how quickly they can guess the word.  If a team guesses a word correctly, they get a point and the word is removed from the deck. If they don't guess it, the word goes back to the bottom of the deck and the team has to start explaining it again from where they left off. The game ends when all the words are guessed.  Determine how many points each team will get and which words they will guess."}]}