{"uid": "1201-C", "url": "https://codeforces.com/contest/1201/problem/C", "tags": ["binary search", " greedy", " math", " sortings"], "title": "1201-C", "statement": "C. Maximum Mediantime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array $$$a$$$ of $$$n$$$ integers, where $$$n$$$ is odd. You can make the following operation with it:Choose one of the elements of the array (for example $$$a_i$$$) and increase it by $$$1$$$ (that is, replace it with $$$a_i + 1$$$).You want to make the median of the array the largest possible using at most $$$k$$$ operations.The median of the odd-sized array is the middle element after the array is sorted in non-decreasing order. For example, the median of the array $$$[1, 5, 2, 3, 5]$$$ is $$$3$$$.InputThe first line contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$n$$$ is odd, $$$1 \\\\le k \\\\le 10^9$$$) — the number of elements in the array and the largest number of operations you can make.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$).OutputPrint a single integer — the maximum possible median after the operations.ExamplesInput3 2 1 3 5Output5Input5 5 1 2 1 1 1Output3Input7 7 4 1 2 4 3 4 4Output5NoteIn the first example, you can increase the second element twice. Than array will be $$$[1, 5, 5]$$$ and it's median is $$$5$$$.In the second example, it is optimal to increase the second number and than increase third and fifth. This way the answer is $$$3$$$.In the third example, you can make four operations: increase first, fourth, sixth, seventh element. This way the array will be $$$[5, 1, 2, 5, 3, 5, 5]$$$ and the median will be $$$5$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e4653b50", "template_md5": "35d339e4", "result": "You are given an array of $n$ odd integers. You can increase any element of the array by 1 at most $k$ times.  What is the largest possible median of the array after these operations?\n\nThe median of an array is the middle element when the array is sorted in increasing order."}, {"prompt_md5": "62e66070", "template_md5": "465699a0", "result": "You have a list of odd number of integers. You can increase any integer in the list by 1 a limited number of times. What is the largest possible middle number you can make in the sorted list?"}]}