{"uid": "1207-C", "url": "https://codeforces.com/contest/1207/problem/C", "tags": ["dp", " greedy"], "title": "1207-C", "statement": "C. Gas Pipelinetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are responsible for installing a gas pipeline along a road. Let's consider the road (for simplicity) as a segment $$$[0, n]$$$ on $$$OX$$$ axis. The road can have several crossroads, but for simplicity, we'll denote each crossroad as an interval $$$(x, x + 1)$$$ with integer $$$x$$$. So we can represent the road as a binary string consisting of $$$n$$$ characters, where character0means that current interval doesn't contain a crossroad, and1means that there is a crossroad.Usually, we can install the pipeline along the road on height of $$$1$$$ unit with supporting pillars in each integer point (so, if we are responsible for $$$[0, n]$$$ road, we must install $$$n + 1$$$ pillars). But on crossroads we should lift the pipeline up to the height $$$2$$$, so the pipeline won't obstruct the way for cars.We can do so inserting several zig-zag-like lines. Each zig-zag can be represented as a segment $$$[x, x + 1]$$$ with integer $$$x$$$ consisting of three parts: $$$0.5$$$ units of horizontal pipe + $$$1$$$ unit of vertical pipe + $$$0.5$$$ of horizontal. Note that if pipeline is currently on height $$$2$$$, the pillars that support it should also have length equal to $$$2$$$ units.Each unit of gas pipeline costs us $$$a$$$ bourles, and each unit of pillar — $$$b$$$ bourles. So, it's not always optimal to make the whole pipeline on the height $$$2$$$. Find the shape of the pipeline with minimum possible cost and calculate that cost.Note that youmuststart and finish the pipeline on height $$$1$$$ and, also, it's guaranteed that the first and last characters of the input string are equal to0.InputThe fist line contains one integer $$$T$$$ ($$$1 \\\\le T \\\\le 100$$$) — the number of queries. Next $$$2 \\\\cdot T$$$ lines contain independent queries — one query per two lines.The first line contains three integers $$$n$$$, $$$a$$$, $$$b$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$1 \\\\le a \\\\le 10^8$$$, $$$1 \\\\le b \\\\le 10^8$$$) — the length of the road, the cost of one unit of the pipeline and the cost of one unit of the pillar, respectively.The second line contains binary string $$$s$$$ ($$$|s| = n$$$, $$$s_i \\\\in \\\\{0, 1\\\\}$$$, $$$s_1 = s_n = 0$$$) — the description of the road.It's guaranteed that the total length of all strings $$$s$$$ doesn't exceed $$$2 \\\\cdot 10^5$$$.OutputPrint $$$T$$$ integers — one per query. For each query print the minimum possible cost of the constructed pipeline.ExampleInput4 8 2 5 00110010 8 1 1 00110010 9 100000000 100000000 010101010 2 5 1 00Output94 25 2900000000 13NoteThe optimal pipeline for the first query is shown at the picture above.The optimal pipeline for the second query is pictured below:The optimal (and the only possible) pipeline for the third query is shown below:The optimal pipeline for the fourth query is shown below:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ff2bc342", "template_md5": "35d339e4", "result": "You are building a gas pipeline along a road represented by a binary string of length $n$.  The string has '0' for no crossroads and '1' for crossroads.\n\nYou need to build the pipeline with the following rules:\n\n* The pipeline starts and ends at height 1.\n* At crossroads (positions with '1' in the string), the pipeline must be raised to height 2.\n* You can use zig-zag lines to raise the pipeline. Each zig-zag is a segment of 0.5 units horizontal, 1 unit vertical, and 0.5 units horizontal.\n* The cost of a horizontal pipeline unit is $a$ bourles, and the cost of a vertical pillar unit is $b$ bourles.\n\nFind the cheapest way to build the pipeline and calculate the total cost. \n\n\n\nInput:\n\n* $T$: The number of test cases.\n* For each test case:\n    * $n$: The length of the road.\n    * $a$: The cost of a horizontal pipeline unit.\n    * $b$: The cost of a vertical pillar unit.\n    * $s$: The binary string representing the road.\n\nOutput:\n\n* For each test case, print the minimum cost of building the pipeline."}, {"prompt_md5": "cd742983", "template_md5": "465699a0", "result": "You need to build a pipeline along a road with some intersections. The pipeline can be built at a height of 1 or 2.  At intersections, it must be at height 2.  \n\nThe cost of building the pipeline is different at each height. You need to find the cheapest way to build the pipeline, considering the cost of the pipeline and the supports."}]}