{"uid": "1211-B", "url": "https://codeforces.com/contest/1211/problem/B", "tags": ["*special", " implementation"], "title": "1211-B", "statement": "B. Traveling Around the Golden Ring of Berlandtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe Golden Ring is the special tourist route in Berland. This route consists of $$$n$$$ cities and the cyclic railway route. Cities are numbered from $$$1$$$ to $$$n$$$ so that:the next city for $$$1$$$ is the city $$$2$$$,the next city for $$$2$$$ is the city $$$3$$$,...the next city for $$$n$$$ is the city $$$1$$$.Thus, the route is a cycle, cities are numbered in the direction of travel (the route is directed in one way).Blogger Polycarp wants to start his journey in the city $$$1$$$. For each city he knows the value $$$a_i$$$ — how many selfies he wants to do in $$$i$$$-th city. He can take no more than one selfie in one visit to each city. Since he is traveling by train, he can't skip the city (he always moves from the city $$$i$$$ to the city $$$i+1$$$ for $$$1 \\\\le i < n$$$ and from $$$n$$$ to $$$1$$$). Thus, when the train stops in the city, Polycarp must visit this city. If Polycarp visits the city multiple times, all visits are counted separately.What is the least number of city visits Polycarp will have to complete to fulfill his plan for the number of selfies for each city? Note that he always visits the city $$$1$$$, since it is this city that his journey begins in.InputThe first line contains an integer $$$n$$$ ($$$3 \\\\le n \\\\le 2\\\\cdot10^5$$$) — the number of cities in the Golden Ring of Berland.The next line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$0 \\\\le a_i \\\\le 10^9$$$), where $$$a_i$$$ is equal to the required number of selfies in the $$$i$$$-th city.It is guaranteed that at least one of the numbers $$$a_i$$$ is strictly greater than zero.OutputPrint a single integer — the required minimum number of visits.ExamplesInput3 1 0 0Output1Input3 2 0 2Output6Input5 0 3 1 3 2Output14Input5 1000000000 1000000000 1000000000 1000000000 0Output4999999999", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dd96cfbf", "template_md5": "35d339e4", "result": "There is a circular route with $n$ cities numbered from 1 to $n$.  You must visit each city exactly once. For each city $i$, you need to take $a_i$ selfies there. What is the minimum number of times you need to travel the entire route to take all the required selfies? \n\nYou start at city 1. \n\n\nInput:\n\n* The first line contains an integer $n$ ($3 \\le n \\le 2 \\cdot 10^5$) - the number of cities.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 \\le a_i \\le 10^9$) - the number of selfies required for each city.\n\nOutput:\n\n* Print a single integer - the minimum number of times you need to travel the route."}, {"prompt_md5": "b08804c3", "template_md5": "465699a0", "result": "You have a circular route with  cities. Each city has a number associated with it. You must visit each city at least once, and the number of times you visit a city must be at least equal to its associated number. What is the minimum number of times you need to travel the entire route to satisfy these conditions?"}]}