{"uid": "1213-D1", "url": "https://codeforces.com/contest/1213/problem/D1", "tags": ["brute force", " implementation"], "title": "1213-D1", "statement": "D1. Equalizing by Division (easy version)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe only difference between easy and hard versions is the number of elements in the array.You are given an array $$$a$$$ consisting of $$$n$$$ integers. In one move you can choose any $$$a_i$$$ and divide it by $$$2$$$ rounding down (in other words, in one move you can set $$$a_i := \\\\lfloor\\\\frac{a_i}{2}\\\\rfloor$$$).You can perform such an operationany(possibly, zero) number of times withany$$$a_i$$$.Your task is to calculate the minimum possible number of operations required to obtain at least $$$k$$$ equal numbers in the array.Don't forget that it is possible to have $$$a_i = 0$$$ after some operations, thus the answer always exists.InputThe first line of the input contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 50$$$) — the number of elements in the array and the number of equal numbers required.The second line of the input contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 2 \\\\cdot 10^5$$$), where $$$a_i$$$ is the $$$i$$$-th element of $$$a$$$.OutputPrint one integer — the minimum possible number of operations required to obtain at least $$$k$$$ equal numbers in the array.ExamplesInput5 3 1 2 2 4 5Output1Input5 3 1 2 3 4 5Output2Input5 3 1 2 3 3 3Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3a2b82be", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers. You can repeatedly divide any integer in the array by 2 and round down (e.g., 7 / 2 = 3). What is the minimum number of times you need to perform this operation to have at least $k$ equal numbers in the array? \n\nThe input consists of two lines. The first line contains two integers, $n$ and $k$ ($1 \\le k \\le n \\le 50$), representing the number of elements in the array and the desired number of equal elements. The second line contains $n$ integers, $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le 2 \\cdot 10^5$), representing the elements of the array.\n\nOutput a single integer representing the minimum number of operations required."}, {"prompt_md5": "d273b256", "template_md5": "465699a0", "result": "You have a list of numbers. You can repeatedly divide any number in the list by 2 (rounding down). What is the fewest times you need to do this to have at least k numbers that are the same?"}]}