{"uid": "1213-C", "url": "https://codeforces.com/contest/1213/problem/C", "tags": ["math"], "title": "1213-C", "statement": "C. Book Readingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp is reading a book consisting of $$$n$$$ pages numbered from $$$1$$$ to $$$n$$$. Every time he finishes the page with the number divisible by $$$m$$$, he writes down the last digit of this page number. For example, if $$$n=15$$$ and $$$m=5$$$, pages divisible by $$$m$$$ are $$$5, 10, 15$$$. Their last digits are $$$5, 0, 5$$$ correspondingly, their sum is $$$10$$$.Your task is to calculate the sum of all digits Polycarp has written down.You have to answer $$$q$$$ independent queries.InputThe first line of the input contains one integer $$$q$$$ ($$$1 \\\\le q \\\\le 1000$$$) — the number of queries.The following $$$q$$$ lines contain queries, one per line. Each query is given as two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 10^{16}$$$) — the number of pages in the book and required divisor, respectively.OutputFor each query print the answer for it — the sum of digits written down by Polycarp.ExampleInput7 1 1 10 1 100 3 1024 14 998244353 1337 123 144 1234312817382646 13Output1 45 153 294 3359835 0 427262129093995", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d1433a3d", "template_md5": "35d339e4", "result": "You are given a book with $n$ pages numbered from 1 to $n$.  Every time a page number divisible by $m$ is finished, the last digit of that page number is written down.  \n\nFor a given $n$ and $m$, find the sum of all the digits that would be written down.\n\nYou will be given multiple pairs of $n$ and $m$ to process."}, {"prompt_md5": "78c7f8c0", "template_md5": "465699a0", "result": "You are given a book with a certain number of pages.  Every time a page number is divisible by a given number, write down the last digit of that page number.  Calculate the sum of all the digits you wrote down.  You have to do this for multiple different books."}]}