{"uid": "1214-B", "url": "https://codeforces.com/contest/1214/problem/B", "tags": ["brute force", " math"], "title": "1214-B", "statement": "B. Badgestime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere are $$$b$$$ boys and $$$g$$$ girls participating in Olympiad of Metropolises. There will be a board games tournament in the evening and $$$n$$$ participants have accepted the invitation. The organizers do not know how many boys and girls are among them.Organizers are preparing red badges for girls and blue ones for boys.Vasya prepared $$$n+1$$$ decks of badges. The $$$i$$$-th (where $$$i$$$ is from $$$0$$$ to $$$n$$$, inclusive) deck contains $$$i$$$ blue badges and $$$n-i$$$ red ones. The total number of badges in any deck is exactly $$$n$$$.Determine theminimumnumber of decks among these $$$n+1$$$ that Vasya should take, so that there will be a suitable deck no matter how many girls and boys there will be among the participants of the tournament.InputThe first line contains an integer $$$b$$$ ($$$1 \\\\le b \\\\le 300$$$), the number of boys.The second line contains an integer $$$g$$$ ($$$1 \\\\le g \\\\le 300$$$), the number of girls.The third line contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le b + g$$$), the number of the board games tournament participants.OutputOutput the only integer, theminimumnumber of badge decks that Vasya could take.ExamplesInput5 6 3Output4Input5 3 5Output4NoteIn the first example, each of 4 decks should be taken: (0 blue, 3 red), (1 blue, 2 red), (2 blue, 1 red), (3 blue, 0 red).In the second example, 4 decks should be taken: (2 blue, 3 red), (3 blue, 2 red), (4 blue, 1 red), (5 blue, 0 red). Piles (0 blue, 5 red) and (1 blue, 4 red) can not be used.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0b18e8f9", "template_md5": "35d339e4", "result": "There are $b$ boys and $g$ girls participating in a tournament.  $n$ people in total have signed up.  \n\nThere are $n+1$ decks of badges, with the $i$th deck containing $i$ blue badges and $n-i$ red badges.\n\nWhat is the minimum number of decks that must be taken to ensure there is a suitable deck for any possible number of boys and girls attending the tournament?"}, {"prompt_md5": "cdd3bf2f", "template_md5": "465699a0", "result": "You have a certain number of red and blue items. You need to choose the minimum number of sets, where each set has a different number of red and blue items, so that no matter how many red and blue items you need, you can make a set that has the correct amount."}]}