{"uid": "1220-D", "url": "https://codeforces.com/contest/1220/problem/D", "tags": ["bitmasks", " math", " number theory"], "title": "1220-D", "statement": "D. Alex and Juliantime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBoy Dima gave Julian a birthday present — set $$$B$$$ consisting of positive integers. However, he didn't know, that Julian hates sets, but enjoys bipartite graphs more than anything else!Julian was almost upset, but her friend Alex said, that he can build an undirected graph using this set in such a way: let all integer numbers be vertices, then connect any two $$$i$$$ and $$$j$$$ with an edge if $$$|i - j|$$$ belongs to $$$B$$$.Unfortunately, Julian doesn't like the graph, that was built using $$$B$$$. Alex decided to rectify the situation, so he wants to erase some numbers from $$$B$$$, so that graph built using the new set is bipartite. The difficulty of this task is that the graph, Alex has to work with, has an infinite number of vertices and edges! It is impossible to solve this task alone, so Alex asks you for help. Write a program that erases a subset ofminimumsize from $$$B$$$ so that graph constructed on the new set is bipartite.Recall, that graph is bipartite if all its vertices can be divided into two disjoint sets such that every edge connects a vertex from different sets.InputFirst line contains an integer $$$n ~ (1 \\\\leqslant n \\\\leqslant 200\\\\,000)$$$ — size of $$$B$$$Second line contains $$$n$$$ integers $$$b_1, b_2, \\\\ldots, b_n ~ (1 \\\\leqslant b_i \\\\leqslant 10^{18})$$$ — numbers of $$$B$$$, all $$$b_i$$$ areuniqueOutputIn the first line print single integer $$$k$$$ – the number of erased elements. In the second line print $$$k$$$ integers — values of erased elements.If there are multiple answers, print any of them.ExamplesInput3 1 2 3Output1 2Input2 2 6Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a307714a", "template_md5": "35d339e4", "result": "You are given a set of $n$ positive integers.  \n\nYou need to find the smallest number of integers you can remove from the set so that the graph constructed using the remaining integers is bipartite. \n\nThe graph is constructed as follows:\n\n* Each integer in the set is a vertex.\n* There is an edge between two vertices $i$ and $j$ if the absolute difference between $i$ and $j$ ($|i-j|$) is present in the set.\n\nA bipartite graph is a graph whose vertices can be divided into two disjoint sets such that every edge connects a vertex from one set to a vertex in the other set.\n\nOutput the minimum number of integers to remove and the integers themselves. If there are multiple solutions, output any one."}, {"prompt_md5": "22b32d7a", "template_md5": "465699a0", "result": "You are given a set of numbers.  You need to remove the fewest numbers from the set so that the graph created using the remaining numbers is bipartite.  A bipartite graph is a graph whose nodes can be divided into two groups so that every edge connects a node from one group to a node in the other group."}]}