{"uid": "1220-A", "url": "https://codeforces.com/contest/1220/problem/A", "tags": ["implementation", " sortings", " strings"], "title": "1220-A", "statement": "A. Cardstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhen Serezha was three years old, he was given a set of cards with letters for his birthday. They were arranged into words in the way which formed the boy's mother favorite number in binary notation. Serezha started playing with them immediately and shuffled them because he wasn't yet able to read. His father decided to rearrange them. Help him restore the original number, on condition that it was the maximum possible one.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\leqslant n \\\\leqslant 10^5$$$) — the length of the string. The second line contains a string consisting of English lowercase letters: 'z', 'e', 'r', 'o' and 'n'.It is guaranteed that it is possible to rearrange the letters in such a way that they form a sequence of words, each being either \"zero\" which corresponds to the digit $$$0$$$ or \"one\" which corresponds to the digit $$$1$$$.OutputPrint the maximum possible number in binary notation. Print binary digits separated by a space. The leading zeroes are allowed.ExamplesInput4 ezorOutput0Input10 nznooeeoerOutput1 1 0NoteIn the first example, the correct initial ordering is \"zero\".In the second example, the correct initial ordering is \"oneonezero\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "06838d89", "template_md5": "35d339e4", "result": "You are given a string of characters: 'z', 'e', 'r', 'o' and 'n'.  \n\nThe goal is to rearrange these characters to form a sequence of words, where \"zero\" represents the digit 0 and \"one\" represents the digit 1.\n\nOutput the largest possible binary number that can be formed from these rearranged words. \n\nFor example:\n\nInput: 4 ezor\nOutput: 0\n\nInput: 10 nznooeeoer\nOutput: 1 1 0"}, {"prompt_md5": "25d239ca", "template_md5": "465699a0", "result": "You are given a shuffled sequence of letters representing a binary number.  The letters are 'z', 'e', 'r', 'o' and 'n'.  'zero' represents 0 and 'one' represents 1.  Find the largest possible binary number that can be formed from these letters."}]}