{"uid": "1221-B", "url": "https://codeforces.com/contest/1221/problem/B", "tags": ["constructive algorithms", " greedy"], "title": "1221-B", "statement": "B. Knightstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a chess board with $$$n$$$ rows and $$$n$$$ columns. Initially all cells of the board are empty, and you have to put a white or a black knight into each cell of the board.A knight is a chess piece that can attack a piece in cell ($$$x_2$$$, $$$y_2$$$) from the cell ($$$x_1$$$, $$$y_1$$$) if one of the following conditions is met:$$$|x_1 - x_2| = 2$$$ and $$$|y_1 - y_2| = 1$$$, or$$$|x_1 - x_2| = 1$$$ and $$$|y_1 - y_2| = 2$$$.Here are some examples of which cells knight can attack. In each of the following pictures, if the knight is currently in the blue cell, it can attack all red cells (and only them).Aduel of knightsis a pair of knights ofdifferentcolors such that these knights attack each other. You have to put a knight (a white one or a black one) into each cell in such a way that the number of duels is maximum possible.InputThe first line contains one integer $$$n$$$ ($$$3 \\\\le n \\\\le 100$$$) — the number of rows (and columns) in the board.OutputPrint $$$n$$$ lines with $$$n$$$ characters in each line. The $$$j$$$-th character in the $$$i$$$-th line should beW, if the cell ($$$i$$$, $$$j$$$) contains a white knight, orB, if it contains a black knight. The number of duels should be maximum possible. If there are multiple optimal answers, print any of them.ExampleInput3OutputWBW BBB WBWNoteIn the first example, there are $$$8$$$ duels:the white knight in ($$$1$$$, $$$1$$$) attacks the black knight in ($$$3$$$, $$$2$$$);the white knight in ($$$1$$$, $$$1$$$) attacks the black knight in ($$$2$$$, $$$3$$$);the white knight in ($$$1$$$, $$$3$$$) attacks the black knight in ($$$3$$$, $$$2$$$);the white knight in ($$$1$$$, $$$3$$$) attacks the black knight in ($$$2$$$, $$$1$$$);the white knight in ($$$3$$$, $$$1$$$) attacks the black knight in ($$$1$$$, $$$2$$$);the white knight in ($$$3$$$, $$$1$$$) attacks the black knight in ($$$2$$$, $$$3$$$);the white knight in ($$$3$$$, $$$3$$$) attacks the black knight in ($$$1$$$, $$$2$$$);the white knight in ($$$3$$$, $$$3$$$) attacks the black knight in ($$$2$$$, $$$1$$$).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f9d6c5ab", "template_md5": "35d339e4", "result": "You are given a square chessboard of size $n x n$. You need to place either a white or black knight in each cell of the board. \n\nKnights move in an \"L\" shape: two squares in one direction (horizontally or vertically) and then one square in a perpendicular direction.\n\nTwo knights attack each other if they can move to each other's squares.\n\nYour goal is to place the knights so that the maximum number of knights attack each other. \n\nOutput the arrangement of knights on the board (W for white, B for black)."}, {"prompt_md5": "eb6c6535", "template_md5": "465699a0", "result": "You are given a square grid. You need to place white and black pieces on the grid so that the number of pieces that attack each other is maximized.  Pieces attack if they are on adjacent squares in a specific \"L\" shape."}]}