{"uid": "123-B", "url": "https://codeforces.com/contest/123/problem/B", "tags": ["math"], "title": "123-B", "statement": "B. Squarestime limit per test0.5 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou are given an infinite checkered field. You should get from a square (x1;y1) to a square (x2;y2). Using the shortest path is not necessary. You can move on the field squares in four directions. That is, when you are positioned in any square, you can move to any other side-neighboring one.A square (x;y) is considered bad, if at least one of the two conditions is fulfilled:|x+y| ≡ 0(mod2a),|x-y| ≡ 0(mod2b).Your task is to find the minimum number of bad cells one will have to visit on the way from (x1;y1) to (x2;y2).InputThe only line contains integersa,b,x1,y1,x2andy2— the parameters of the bad squares, the coordinates of the initial and the final squares correspondingly (2 ≤a,b≤ 109and|x1|,|y1|,|x2|,|y2| ≤ 109). It is guaranteed that the initial and the final square aren't bad.OutputPrint a single number — the minimum number of bad cells that one will have to visit in order to travel from square (x1;y1) to square (x2;y2).ExamplesInput2 2 1 0 0 1Output1Input2 2 10 11 0 1Output5Input2 4 3 -1 3 7Output2NoteIn the third sample one of the possible paths in (3;-1)->(3;0)->(3;1)->(3;2)->(4;2)->(4;3)->(4;4)->(4;5)->(4;6)->(4;7)->(3;7). Squares (3;1) and (4;4) are bad.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aba8a3cb", "template_md5": "35d339e4", "result": "You are given a checkered field that extends infinitely in all directions. You start at a square with coordinates ($x_1$, $y_1$) and need to reach a square with coordinates ($x_2$, $y_2$).  \n\nA square is considered \"bad\" if either of these conditions is true:\n\n*  $|x + y| \\equiv 0 \\pmod{2a}$ \n*  $|x - y| \\equiv 0 \\pmod{2b}$\n\nwhere $a$ and $b$ are given numbers.\n\nFind the smallest number of bad squares you must pass through to get from ($x_1$, $y_1$) to ($x_2$, $y_2$). You don't need to take the shortest path. You can move to any of the four adjacent squares (up, down, left, right) from your current position. \n\n\n**Input:**\n\nThe first line contains five integers: $a$, $b$, $x_1$, $y_1$, $x_2$, and $y_2$.\n\n**Output:**\n\nPrint a single integer representing the minimum number of bad squares you must visit."}, {"prompt_md5": "cf3015c9", "template_md5": "465699a0", "result": "You need to travel from one square to another on a grid.  Some squares are marked as \"bad\".  Find the fewest bad squares you must pass through to get to your destination."}]}