{"uid": "123-A", "url": "https://codeforces.com/contest/123/problem/A", "tags": ["implementation", " number theory", " strings"], "title": "123-A", "statement": "A. Prime Permutationtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou are given a strings, consisting of small Latin letters. Let's denote the length of the string as|s|. The characters in the string are numbered starting from1.Your task is to find out if it is possible to rearrange characters in stringsso that for any prime numberp≤ |s|and for any integeriranging from1to|s| /p(inclusive) the following condition was fulfilledsp=sp×i. If the answer is positive, find one way to rearrange the characters.InputThe only line contains the initial strings, consisting of small Latin letters (1 ≤ |s| ≤ 1000).OutputIf it is possible to rearrange the characters in the string so that the above-mentioned conditions were fulfilled, then print in the first line \"YES\" (without the quotes) and print on the second line one of the possible resulting strings. If such permutation is impossible to perform, then print the single string \"NO\".ExamplesInputabcOutputYESabcInputabcdOutputNOInputxxxyxxxOutputYESxxxxxxyNoteIn the first sample any of the six possible strings will do: \"abc\", \"acb\", \"bac\", \"bca\", \"cab\" or \"cba\".In the second sample no letter permutation will satisfy the condition atp= 2(s2=s4).In the third test any string where character \"y\" doesn't occupy positions 2, 3, 4, 6 will be valid.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "44730edc", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  Determine if it is possible to rearrange the letters so that for every prime number $p$ less than or equal to the length of the string, and for every integer $i$ from 1 to the length of the string divided by $p$ (inclusive), the following condition holds:\n\n$p = s_p \\times i$\n\nwhere $s_p$ is the substring of the rearranged string starting at position $p$ and having length $p$.\n\nIf such a rearrangement is possible, output \"YES\" followed by one possible rearranged string. Otherwise, output \"NO\"."}, {"prompt_md5": "4c0c2953", "template_md5": "465699a0", "result": "Given a string of letters, can you rearrange the letters so that for every prime number less than or equal to the length of the string, and for every number from 1 to the length of the string divided by that prime number, the product of the prime number and the number equals the length of a substring of the rearranged string? If yes, provide one such rearrangement. If no such rearrangement is possible, say \"NO\"."}]}