{"uid": "1236-A", "url": "https://codeforces.com/contest/1236/problem/A", "tags": ["brute force", " greedy", " math"], "title": "1236-A", "statement": "A. Stonestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice is playing with some stones.Now there are three numbered heaps of stones. The first of them contains $$$a$$$ stones, the second of them contains $$$b$$$ stones and the third of them contains $$$c$$$ stones.Each time she can do one of two operations:take one stone from the first heap and two stones from the second heap (this operation can be done only if the first heap contains at least one stone and the second heap contains at least two stones);take one stone from the second heap and two stones from the third heap (this operation can be done only if the second heap contains at least one stone and the third heap contains at least two stones).She wants to get the maximum number of stones, but she doesn't know what to do. Initially, she has $$$0$$$ stones. Can you help her?InputThe first line contains one integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$)  — the number of test cases. Next $$$t$$$ lines describe test cases in the following format:Line contains three non-negative integers $$$a$$$, $$$b$$$ and $$$c$$$, separated by spaces ($$$0 \\\\leq a,b,c \\\\leq 100$$$) — the number of stones in the first, the second and the third heap, respectively.In hacksit is allowed to use only one test case in the input, so $$$t = 1$$$ should be satisfied.OutputPrint $$$t$$$ lines, the answers to the test cases in the same order as in the input. The answer to the test case is the integer  — the maximum possible number of stones that Alice can take after making some operations.ExampleInput3 3 4 5 1 0 5 5 3 2Output9 0 6NoteFor the first test case in the first test, Alice can take two stones from the second heap and four stones from the third heap, making the second operation two times. Then she can take one stone from the first heap and two stones from the second heap, making the first operation one time. The summary number of stones, that Alice will take is $$$9$$$. It is impossible to make some operations to take more than $$$9$$$ stones, so the answer is $$$9$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e396a207", "template_md5": "35d339e4", "result": "There are three heaps of stones with $a$, $b$, and $c$ stones respectively.  You can perform one of two operations:\n\n1. Take 1 stone from the first heap and 2 stones from the second heap (if the first heap has at least 1 stone and the second heap has at least 2 stones).\n2. Take 1 stone from the second heap and 2 stones from the third heap (if the second heap has at least 1 stone and the third heap has at least 2 stones).\n\nWhat is the maximum number of stones you can take?\n\nInput:\n\nThe first line contains the number of test cases, $t$. \nEach of the next $t$ lines contains three integers, $a$, $b$, and $c$, representing the number of stones in each heap.\n\nOutput:\n\nPrint $t$ lines, each containing the maximum number of stones that can be taken for the corresponding test case."}, {"prompt_md5": "b19c0ddb", "template_md5": "465699a0", "result": "You have three piles of stones. You can take one stone from the first pile and two stones from the second pile, or one stone from the second pile and two stones from the third pile.  You want to take as many stones as possible. What is the maximum number of stones you can take?"}]}