{"uid": "1236-B", "url": "https://codeforces.com/contest/1236/problem/B", "tags": ["combinatorics", " math"], "title": "1236-B", "statement": "B. Alice and the List of Presentstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice got many presents these days. So she decided to pack them into boxes and send them to her friends.There are $$$n$$$ kinds of presents. Presents of one kind are identical (i.e. there is no way to distinguish two gifts of the same kind). Presents of different kinds are different (i.e. that is, two gifts of different kinds are distinguishable). The number of presents of each kind, that Alice has is very big, so we can consider Alice has an infinite number of gifts of each kind.Also, there are $$$m$$$ boxes. All of them are for different people, so they are pairwise distinct (consider that the names of $$$m$$$ friends are written on the boxes). For example, putting the first kind of present into the first box but not into the second box, is different from putting the first kind of present into the second box but not into the first box.Alice wants to pack presents with the following rules:She won't pack more than one present of each kind into the same box, so each box should contain presents of different kinds (i.e. each box contains a subset of $$$n$$$ kinds, empty boxes are allowed);For each kind at least one present should be packed into some box.Now Alice wants to know how many different ways to pack the presents exists. Please, help her and calculate this number. Since the answer can be huge, output it by modulo $$$10^9+7$$$.See examples and their notes for clarification.InputThe first line contains two integers $$$n$$$ and $$$m$$$, separated by spaces ($$$1 \\\\leq n,m \\\\leq 10^9$$$) — the number of kinds of presents and the number of boxes that Alice has.OutputPrint one integer  — the number of ways to pack the presents with Alice's rules, calculated by modulo $$$10^9+7$$$ExamplesInput1 3Output7Input2 2Output9NoteIn the first example, there are seven ways to pack presents:$$$\\\\{1\\\\}\\\\{\\\\}\\\\{\\\\}$$$$$$\\\\{\\\\}\\\\{1\\\\}\\\\{\\\\}$$$$$$\\\\{\\\\}\\\\{\\\\}\\\\{1\\\\}$$$$$$\\\\{1\\\\}\\\\{1\\\\}\\\\{\\\\}$$$$$$\\\\{\\\\}\\\\{1\\\\}\\\\{1\\\\}$$$$$$\\\\{1\\\\}\\\\{\\\\}\\\\{1\\\\}$$$$$$\\\\{1\\\\}\\\\{1\\\\}\\\\{1\\\\}$$$In the second example there are nine ways to pack presents:$$$\\\\{\\\\}\\\\{1,2\\\\}$$$$$$\\\\{1\\\\}\\\\{2\\\\}$$$$$$\\\\{1\\\\}\\\\{1,2\\\\}$$$$$$\\\\{2\\\\}\\\\{1\\\\}$$$$$$\\\\{2\\\\}\\\\{1,2\\\\}$$$$$$\\\\{1,2\\\\}\\\\{\\\\}$$$$$$\\\\{1,2\\\\}\\\\{1\\\\}$$$$$$\\\\{1,2\\\\}\\\\{2\\\\}$$$$$$\\\\{1,2\\\\}\\\\{1,2\\\\}$$$For example, the way $$$\\\\{2\\\\}\\\\{2\\\\}$$$ is wrong, because presents of the first kind should be used in the least one box.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "16e93086", "template_md5": "35d339e4", "result": "There are $n$ types of presents and $m$ boxes.  You can put any number of presents of each type into each box, but you can only put one present of each type into a single box.  \n\nFind the number of ways to distribute the presents into the boxes so that at least one present of each type goes into a box.  The answer may be very large, so output it modulo $10^9+7$."}, {"prompt_md5": "756e64cf", "template_md5": "465699a0", "result": "You have many types of items and boxes. Each box can hold a different set of items, but no two boxes can have the same type of item.  You need to figure out how many different ways you can put the items into the boxes, making sure at least one of each item type goes into a box."}]}