{"uid": "1238-E", "url": "https://codeforces.com/contest/1238/problem/E", "tags": ["bitmasks", " dp"], "title": "1238-E", "statement": "E. Keyboard Purchasetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have a password which you often type — a string $$$s$$$ of length $$$n$$$. Every character of this string is one of the first $$$m$$$ lowercase Latin letters.Since you spend a lot of time typing it, you want to buy a new keyboard.A keyboard is a permutation of the first $$$m$$$ Latin letters. For example, if $$$m = 3$$$, then there are six possible keyboards:abc,acb,bac,bca,cabandcba.Since you type your password with one finger, you need to spend time moving your finger from one password character to the next. The time to move from character $$$s_i$$$ to character $$$s_{i+1}$$$ is equal to the distance between these characters on keyboard. The total time you have to spend typing the password with a keyboard is called theslownessof this keyboard.More formaly, the slowness of keyboard is equal to $$$\\\\sum\\\\limits_{i=2}^{n} |pos_{s_{i-1}} - pos_{s_i} |$$$, where $$$pos_x$$$ is position of letter $$$x$$$ in keyboard.For example, if $$$s$$$ isaacabcand the keyboard isbac, then the total time of typing this password is $$$|pos_a - pos_a| + |pos_a - pos_c| + |pos_c - pos_a| + |pos_a - pos_b| + |pos_b - pos_c|$$$ = $$$|2 - 2| + |2 - 3| + |3 - 2| + |2 - 1| + |1 - 3|$$$ = $$$0 + 1 + 1 + 1 + 2 = 5$$$.Before buying a new keyboard you want to know the minimum possible slowness that the keyboard can have.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 10^5, 1 \\\\le m \\\\le 20$$$).The second line contains the string $$$s$$$ consisting of $$$n$$$ characters. Each character is one of the first $$$m$$$ Latin letters (lowercase).OutputPrint one integer – the minimum slowness a keyboard can have.ExamplesInput6 3 aacabcOutput5Input6 4 aaaaaaOutput0Input15 4 abacabadabacabaOutput16NoteThe first test case is considered in the statement.In the second test case the slowness of any keyboard is $$$0$$$.In the third test case one of the most suitable keyboards isbacd.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9c89f9d1", "template_md5": "35d339e4", "result": "You have a password of length $n$ consisting of $m$ lowercase letters. You want to buy a new keyboard that is a permutation of these $m$ letters.  The time it takes to type the password on a keyboard is the sum of the distances between consecutive letters in the password, where the distance is the difference in their positions on the keyboard.\n\nFind the minimum possible total typing time (slowness) for any possible keyboard. \n\nInput:\n\n* The first line contains two integers $n$ and $m$ ($1 \\le n \\le 10^5$, $1 \\le m \\le 20$).\n* The second line contains the password string of length $n$.\n\nOutput:\n\n* Print one integer, the minimum possible slowness."}, {"prompt_md5": "201acba6", "template_md5": "465699a0", "result": "You have a password of length *n*. You want to find the minimum time it takes to type the password on a keyboard where each key is a letter. The time it takes to type a letter is the distance between the current letter and the next letter on the keyboard."}]}