{"uid": "1238-C", "url": "https://codeforces.com/contest/1238/problem/C", "tags": ["dp", " greedy", " math"], "title": "1238-C", "statement": "C. Standard Free2playtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are playing a game where your character should overcome different obstacles. The current problem is to come down from a cliff. The cliff has height $$$h$$$, and there is a moving platform on each height $$$x$$$ from $$$1$$$ to $$$h$$$.Each platform is either hidden inside the cliff or moved out. At first, there are $$$n$$$ moved out platforms on heights $$$p_1, p_2, \\\\dots, p_n$$$. The platform on height $$$h$$$ is moved out (and the character is initially standing there).If you character is standing on some moved out platform on height $$$x$$$, then he can pull a special lever, which switches the state oftwo platforms: on height $$$x$$$ and $$$x - 1$$$. In other words, the platform you are currently standing on will hide in the cliff and the platform one unit below will change it state: it will hide if it was moved out or move out if it was hidden. In the second case, you will safely land on it.Note that this is the only way to move from one platform to another.Your character is quite fragile, so it can safely fall from the height no more than $$$2$$$. In other words falling from the platform $$$x$$$ to platform $$$x - 2$$$ is okay, but falling from $$$x$$$ to $$$x - 3$$$ (or lower) is certain death.Sometimes it's not possible to come down from the cliff, but you can always buy (for donate currency) several magic crystals. Each magic crystal can be used to change the state of any single platform (except platform on height $$$h$$$, which is unaffected by the crystals). After being used, the crystal disappears.What is the minimum number of magic crystal you need to buy to safely land on the $$$0$$$ ground level?InputThe first line contains one integer $$$q$$$ ($$$1 \\\\le q \\\\le 100$$$) — the number of queries. Each query contains two lines and is independent of all other queries.The first line of each query contains two integers $$$h$$$ and $$$n$$$ ($$$1 \\\\le h \\\\le 10^9$$$, $$$1 \\\\le n \\\\le \\\\min(h, 2 \\\\cdot 10^5)$$$) — the height of the cliff and the number of moved out platforms.The second line contains $$$n$$$ integers $$$p_1, p_2, \\\\dots, p_n$$$ ($$$h = p_1 > p_2 > \\\\dots > p_n \\\\ge 1$$$) — the corresponding moved out platforms in the descending order of their heights.The sum of $$$n$$$ over all queries does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each query print one integer — the minimum number of magic crystals you have to spend to safely come down on the ground level (with height $$$0$$$).ExampleInput4 3 2 3 1 8 6 8 7 6 5 3 2 9 6 9 8 5 4 3 1 1 1 1Output0 1 2 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "43d9cb87", "template_md5": "465699a0", "result": "You have a cliff of a certain height. There are platforms at different heights on the cliff, some are visible and some are hidden. You start on the top platform. You can switch the visibility of two adjacent platforms by using a lever.  You can only move between platforms if they are adjacent and visible.  You can buy magic crystals to change the visibility of any platform except the bottom one. What is the minimum number of crystals needed to reach the ground?"}, {"prompt_md5": "6818c4aa", "template_md5": "35d339e4", "result": "You have a cliff of height $h$. There are platforms at each height from 1 to $h$. Some platforms are moved out, and some are hidden inside the cliff. \n\nInitially, the platform at height $h$ is moved out, and you are standing on it.\n\nYou can use a lever to switch the state of two platforms: the one you are standing on and the one one unit below it.  Switching the state means hiding a moved out platform or moving out a hidden platform.\n\nYou can only fall safely from a platform to a platform two units below it.\n\nYou can buy magic crystals to change the state of any platform (except the one at height $h$).\n\nGiven the initial state of the platforms, find the minimum number of magic crystals you need to buy to safely reach the ground (height 0).\n\n\nInput:\n\nThe first line contains the number of queries $q$. Each query has two lines:\n\n* The first line contains two integers $h$ and $n$ - the height of the cliff and the number of initially moved out platforms.\n* The second line contains $n$ integers $p_1, p_2, ..., p_n$ - the heights of the initially moved out platforms in descending order.\n\nOutput:\n\nFor each query, print the minimum number of magic crystals needed to reach the ground."}]}