{"uid": "124-B", "url": "https://codeforces.com/contest/124/problem/B", "tags": ["brute force", " combinatorics", " implementation"], "title": "124-B", "statement": "B. Permutationstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou are givennk-digit integers. You have to rearrange the digits in the integers so that the difference between the largest and the smallest number was minimum. Digits should be rearranged by the same rule in all integers.InputThe first line contains integersnandk— the number and digit capacity of numbers correspondingly (1 ≤n,k≤ 8). Nextnlines containk-digit positive integers. Leading zeroes are allowed both in the initial integers and the integers resulting from the rearranging of digits.OutputPrint a single number: the minimally possible difference between the largest and the smallest number after the digits are rearranged in all integers by the same rule.ExamplesInput6 4523727537523572353272537Output2700Input3 3010909012Output3Input7 550808366033719844911299944254350156Output20522NoteIn the first sample, if we rearrange the digits in numbers as (3,1,4,2), then the 2-nd and the 4-th numbers will equal 5237 and 2537 correspondingly (they will be maximum and minimum for such order of digits).In the second sample, if we swap the second digits and the first ones, we get integers 100, 99 and 102.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "71ae7e58", "template_md5": "35d339e4", "result": "You are given $n$ $k$-digit integers.  Rearrange the digits in each integer so that the difference between the largest and smallest resulting integers is minimized. The digits in all integers must be rearranged using the same rule.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$, representing the number of integers and the number of digits in each integer, respectively (1 ≤ $n$, $k$ ≤ 8).\n* The next $n$ lines each contain a $k$-digit positive integer.\n\n**Output:**\n\n* Print a single integer representing the minimum possible difference between the largest and smallest integers after rearranging the digits."}, {"prompt_md5": "72dee919", "template_md5": "465699a0", "result": "You are given a set of numbers. Rearrange the digits within each number in the same way to make the difference between the largest and smallest number as small as possible. What is the minimum possible difference?"}]}