{"uid": "1243-B1", "url": "https://codeforces.com/contest/1243/problem/B1", "tags": ["strings"], "title": "1243-B1", "statement": "B1. Character Swap (Easy Version)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis problem is different from the hard version. In this version Ujan makesexactlyone exchange. You can hack this problem only if you solve both problems.After struggling and failing many times, Ujan decided to try to clean up his house again. He decided to get his strings in order first.Ujan has twodistinctstrings $$$s$$$ and $$$t$$$ of length $$$n$$$ consisting of only of lowercase English characters. He wants to make them equal. Since Ujan is lazy, he will perform the following operation exactly once: he takes two positions $$$i$$$ and $$$j$$$ ($$$1 \\\\le i,j \\\\le n$$$, the values $$$i$$$ and $$$j$$$ can be equal or different), and swaps the characters $$$s_i$$$ and $$$t_j$$$. Can he succeed?Note that he has to perform this operationexactlyonce. Hehasto perform this operation.InputThe first line contains a single integer $$$k$$$ ($$$1 \\\\leq k \\\\leq 10$$$), the number of test cases.For each of the test cases, the first line contains a single integer $$$n$$$ ($$$2 \\\\leq n \\\\leq 10^4$$$), the length of the strings $$$s$$$ and $$$t$$$.Each of the next two lines contains the strings $$$s$$$ and $$$t$$$, each having length exactly $$$n$$$. The strings consist only of lowercase English letters. It is guaranteed that strings are different.OutputFor each test case, output \"Yes\" if Ujan can make the two strings equal and \"No\" otherwise.You can print each letter in any case (upper or lower).ExampleInput4 5 souse houhe 3 cat dog 2 aa az 3 abc bcaOutputYes No No NoNoteIn the first test case, Ujan can swap characters $$$s_1$$$ and $$$t_4$$$, obtaining the word \"house\".In the second test case, it is not possible to make the strings equal using exactly one swap of $$$s_i$$$ and $$$t_j$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2a73e08c", "template_md5": "35d339e4", "result": "You are given two strings,  $s$ and $t$, of the same length $n$. You can perform exactly one operation: swap any two characters from the strings.  Determine if it is possible to make the two strings equal after performing this operation.\n\nInput:\n\n* The first line contains an integer $k$, the number of test cases.\n* For each test case:\n    * The first line contains an integer $n$, the length of the strings.\n    * The next two lines contain the strings $s$ and $t$, respectively.\n\nOutput:\n\n* For each test case, print \"Yes\" if it is possible to make the strings equal, and \"No\" otherwise."}, {"prompt_md5": "51674cbb", "template_md5": "465699a0", "result": "You are given two strings of the same length. You can swap one pair of characters from the strings. Can you make the two strings identical after this swap?"}]}