{"uid": "1245-E", "url": "https://codeforces.com/contest/1245/problem/E", "tags": ["dp", " probabilities", " shortest paths"], "title": "1245-E", "statement": "E. Hyakugoku and Ladderstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputHyakugoku has just retired from being the resident deity of the South Black Snail Temple in order to pursue her dream of becoming a cartoonist. She spent six months in that temple just playing \"Cat's Cradle\" so now she wants to try a different game — \"Snakes and Ladders\". Unfortunately, she already killed all the snakes, so there are only ladders left now.The game is played on a $$$10 \\\\times 10$$$ board as follows:At the beginning of the game, the player is at the bottom left square.The objective of the game is for the player to reach the Goal (the top left square) by following the path and climbing vertical ladders. Once the player reaches the Goal, the game ends.The path is as follows: if a square is not the end of its row, it leads to the square next to it along the direction of its row; if a square is the end of its row, it leads to the square above it. The direction of a row is determined as follows: the direction of the bottom row is to the right; the direction of any other row is opposite the direction of the row below it. See Notes section for visualization of path.During each turn, the player rolls a standard six-sided dice. Suppose that the number shown on the dice is $$$r$$$. If the Goal is less than $$$r$$$ squares away on the path, the player doesn't move (but the turn is performed). Otherwise, the player advances exactly $$$r$$$ squares along the path and then stops. If the player stops on a square with the bottom of a ladder, the playerchooses whether or not to climb upthat ladder. If she chooses not to climb, then she stays in that square for the beginning of the next turn.Some squares have a ladder in them. Ladders are only placed vertically — each one leads to the same square of some of the upper rows. In order for the player to climb up a ladder, after rolling the dice, she must stop at the square containing the bottom of the ladder. After using the ladder, the player will end up in the square containing the top of the ladder. She cannot leave the ladder in the middle of climbing. And if the square containing the top of the ladder also contains the bottom of another ladder, she is not allowed to use that second ladder.The numbers on the faces of the dice are 1, 2, 3, 4, 5, and 6, with each number having the same probability of being shown.Please note that:it is possible for ladders to overlap, but the player cannot switch to the other ladder while in the middle of climbing the first one;it is possible for ladders to go straight to the top row, but not any higher;it is possible for two ladders to lead to the same tile;it is possible for a ladder to lead to a tile that also has a ladder, but the player will not be able to use that second ladder if she uses the first one;the player can only climb up ladders, not climb down.Hyakugoku wants to finish the game as soon as possible. Thus, on each turn she chooses whether to climb the ladder or not optimally. Help her to determine the minimum expected number of turns the game will take.InputInput will consist of ten lines. The $$$i$$$-th line will contain 10 non-negative integers $$$h_{i1}, h_{i2}, \\\\dots, h_{i10}$$$. If $$$h_{ij}$$$ is $$$0$$$, then the tile at the $$$i$$$-th row and $$$j$$$-th column has no ladder. Otherwise, the ladder at that tile will have a height of $$$h_{ij}$$$, i.e. climbing it will lead to the tile $$$h_{ij}$$$ rows directly above. It is guaranteed that $$$0 \\\\leq h_{ij} < i$$$. Also, the first number of the first line and the first number of the last line always contain $$$0$$$, i.e. the Goal and the starting tile never have ladders.OutputPrint only one line containing a single floating-point number — the minimum expected number of turns Hyakugoku can take to finish the game. Your answer will be considered correct if its absolute or relative error does not exceed $$$10^{-6}$$$.ExamplesInput0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0Output33.0476190476Input0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 3 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 3 0 0 0 0 0 0 0 0 0 4 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 9Output20.2591405923Input0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 6 6 6 6 6 6 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0Output15.9047592939NoteA visualization of the path and the board from example 2 is as follows:The tile with an 'S' is the starting tile and the tile with an 'E' is the Goal.For the first example, there are no ladders.For the second example, the board looks like the one in the right part of the image (the ladders have been colored for clarity).It is possible for ladders to overlap, as is the case with the red and yellow ladders and green and blue ladders. It is also possible for ladders to go straight to the top, as is the case with the black and blue ladders. However, it is not possible for ladders to go any higher (outside of the board). It is also possible that two ladders lead to the same tile, as is the case with the red and yellow ladders. Also, notice that the red and yellow ladders lead to the tile with the orange ladder. So if the player chooses to climb either of the red and yellow ladders, they will not be able to climb the orange ladder. Finally, notice that the green ladder passes through the starting tile of the blue ladder. The player cannot transfer from the green ladder to the blue ladder while in the middle of climbing the green ladder.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8d9690c0", "template_md5": "35d339e4", "result": "You are given a 10x10 grid. Some squares have ladders that lead to a higher row. The goal is to reach the top left corner of the grid, starting from the bottom left corner.\n\nYou roll a six-sided die on each turn. The number you roll determines how many squares you move along the grid.  \n\n* If the number you roll is less than or equal to the number of squares remaining to reach the goal, you do not move.\n* Otherwise, you move that many squares.\n\nIf you land on a square with a ladder, you can choose to climb it. Climbing a ladder takes you directly to the square indicated by the ladder's height.\n\nFind the minimum expected number of turns it takes to reach the goal, assuming you always make the optimal choice about whether or not to climb ladders."}, {"prompt_md5": "2b650f4f", "template_md5": "465699a0", "result": "You are on a 10x10 grid. You start at the bottom left and must reach the top left. You can move right or up, but only up ladders. Ladders are vertical and go to a higher row. You roll a die to determine how many spaces you move.  Find the minimum number of turns it takes to reach the goal, making optimal decisions about when to use ladders."}]}