{"uid": "1246-F", "url": "https://codeforces.com/contest/1246/problem/F", "tags": [], "title": "1246-F", "statement": "F. Cursor Distancetime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere is a string $$$s$$$ of lowercase English letters. A cursor is positioned on one of the characters. The cursor can be moved with the following operation: choose a letter $$$c$$$ and a direction (left or right). The cursor is then moved to the closest occurence of $$$c$$$ in the chosen direction. If there is no letter $$$c$$$ in that direction, the cursor stays in place. For example, if $$$s = \\\\mathtt{abaab}$$$ with the cursor on the second character ($$$\\\\mathtt{a[b]aab}$$$), then:moving to the closest letter $$$\\\\mathtt{a}$$$ to the left places the cursor on the first character ($$$\\\\mathtt{[a]baab}$$$);moving to the closest letter $$$\\\\mathtt{a}$$$ to the right places the cursor the third character ($$$\\\\mathtt{ab[a]ab}$$$);moving to the closest letter $$$\\\\mathtt{b}$$$ to the right places the cursor on the fifth character ($$$\\\\mathtt{abaa[b]}$$$);any other operation leaves the cursor in place.Let $$$\\\\mathrm{dist}(i, j)$$$ be the smallest number of operations needed to move the cursor from the $$$i$$$-th character to the $$$j$$$-th character. Compute $$$\\\\displaystyle \\\\sum_{i = 1}^n \\\\sum_{j = 1}^n \\\\mathrm{dist}(i, j)$$$.InputThe only line contains a non-empty string $$$s$$$ of at most $$$10^5$$$ lowercase English letters.OutputPrint a single integer $$$\\\\displaystyle \\\\sum_{i = 1}^n \\\\sum_{j = 1}^n \\\\mathrm{dist}(i, j)$$$.ExamplesInputabcdeOutput20InputabacabaOutput58NoteIn the first sample case, $$$\\\\mathrm{dist}(i, j) = 0$$$ for any pair $$$i = j$$$, and $$$1$$$ for all other pairs.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3f5e861f", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  The cursor starts at a position in the string. You can move the cursor to the closest occurrence of a chosen letter, either to the left or right. If there is no occurrence of the chosen letter in that direction, the cursor stays put.\n\nYour task is to calculate the sum of the minimum number of moves needed to move the cursor from every position in the string to every other position."}, {"prompt_md5": "7862975a", "template_md5": "465699a0", "result": "You are given a string.  Find the total number of \"steps\" needed to move a cursor between every pair of positions in the string. A step moves the cursor to the nearest occurrence of a chosen letter, either to the left or right. If there is no such letter in the chosen direction, the cursor stays put."}]}