{"uid": "125-E", "url": "https://codeforces.com/contest/125/problem/E", "tags": ["binary search", " graphs"], "title": "125-E", "statement": "E. MST Companytime limit per test8 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe MST (Meaningless State Team) company won another tender for an important state reform in Berland.There arencities in Berland, some pairs of the cities are connected by roads. Each road has its price. One can move along any road in any direction. The MST team should carry out the repair works on some set of roads such that one can get from any city to any other one moving only along the repaired roads. Moreover, this set should contain exactlykcapital roads (that is, the roads that start or finish in the capital). The number of the capital is 1.As the budget has already been approved, the MST Company will profit by finding the set with minimum lengths of roads.InputThe first input line contains three integersn,m,k(1 ≤n≤ 5000;0 ≤m≤ 105;0 ≤k< 5000), wherenis the number of cities in the country,mis the number of roads in the country,kis the number of capital roads in the required set. Thenmlines enumerate the roads in question. Each road is specified by three numbersai,bi,wi(1 ≤ai,bi≤n;1 ≤w≤ 105), whereai,biare the numbers of cities linked by a road andwiis its length.Between each pair of cities no more than one road exists. There are no roads that start and finish in one city. The capital's number is 1.OutputIn the first line print the number of roads in the required set. The second line should contain the numbers of roads included in the sought set. If the sought set does not exist, print -1.ExamplesInput4 5 21 2 12 3 13 4 11 3 31 4 2Output31 5 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e49778b8", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ roads connecting them. Each road has a length $w$.  You need to choose a set of $k$ roads that:\n\n1. Connect all cities together (meaning you can travel from any city to any other city using only the chosen roads).\n2. Include exactly $k$ roads that start or end at city 1 (the capital).\n\nThe goal is to find the set of roads with the smallest total length. If no such set exists, output -1.\n\n**Input:**\n\n* The first line contains three integers: $n$, $m$, and $k$.\n* The next $m$ lines each contain three integers: $a_i$, $b_i$, and $w_i$, representing a road connecting cities $a_i$ and $b_i$ with length $w_i$.\n\n**Output:**\n\n* The first line should contain the number of roads in the chosen set.\n* The second line should contain the numbers of the roads in the chosen set."}, {"prompt_md5": "60edb0af", "template_md5": "465699a0", "result": "You are given a map with cities connected by roads. Each road has a cost.  You need to choose a set of roads to connect all cities, including a specific number of roads that start or end at city 1 (the capital). The goal is to find the set of roads with the lowest total cost. If no such set exists, output -1."}]}