{"uid": "125-B", "url": "https://codeforces.com/contest/125/problem/B", "tags": ["implementation"], "title": "125-B", "statement": "B. Simple XMLtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLet's define a string<x>as an opening tag, wherexis any small letter of the Latin alphabet. Each opening tag matches a closing tag of the type</x>, wherexis the same letter.Tegs can be nested into each other: in this case one opening and closing tag pair is located inside another pair.Let's define the notion of aXML-text:an empty string is aXML-textifsis aXML-text, thens'=<a>+s+</a>also is aXML-text, whereais any small Latin letterifs1,s2areXML-texts, thens1+s2also is aXML-textYou are given a XML-text (it is guaranteed that the text is valid), your task is to print in the following form:each tag (opening and closing) is located on a single lineprint before the tag2 *hspaces, wherehis the level of the tag's nestedness.InputThe input data consists on the only non-empty string — the XML-text, its length does not exceed 1000 characters. It is guaranteed that the text is valid. The text contains no spaces.OutputPrint the given XML-text according to the above-given rules.ExamplesInput<a><b><c></c></b></a>Output<a><b><c></c></b></a>Input<a><b></b><d><c></c></d></a>Output<a><b></b><d><c></c></d></a>", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ed15697f", "template_md5": "35d339e4", "result": "You are given a string of characters representing a simple XML structure.  The string will only contain lowercase letters and the characters '<', '>', and '/'.  \n\nYour task is to reformat the string so that each opening and closing tag is on a separate line.  \n\n* Each opening tag should be indented by two spaces for every level of nesting. For example, a tag inside another tag should be indented more than a tag on the same level.\n\n**Example:**\n\n**Input:**\n\n`<a><b><c></c></b></a>`\n\n**Output:**\n\n<a>\n  <b>\n    <c></c>\n  </b>\n</a> \n\n\n\nLet me know if you'd like to see more examples!"}, {"prompt_md5": "ee6f48d1", "template_md5": "465699a0", "result": "You are given a string of opening and closing tags like \"<a><b><c></b></b></a>\".  Your task is to format this string by indenting each tag based on its nesting level.  Tags that are nested deeper should have more indentation."}]}