{"uid": "125-D", "url": "https://codeforces.com/contest/125/problem/D", "tags": ["constructive algorithms", " greedy"], "title": "125-D", "statement": "D. Two progressionstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAn arithmetic progression is such anon-emptysequence of numbers where the difference between any two successive numbers is constant. This constant number is called common difference. For example, the sequence 3, 7, 11, 15 is an arithmetic progression. The definition implies that any sequences whose length equals 1 or 2 are arithmetic and all sequences whose length equals 0 are non-arithmetic.You are given a sequence ofdifferentintegersa1,a2, ...,an. You should either split it into two arithmetic progressions or find out that the operation is impossible to perform. Splitting assigns each member of the given sequence to one of two progressions, but the relative order of numbers does not change. Splitting is an inverse operation tomerging.InputThe first line contains a positive integern(2 ≤n≤ 30000),nis the length of the given sequence. The second line contains elements of the given sequencea1,a2, ...,an(- 108≤ai≤ 108). The elements of the progression are different integers.OutputPrint the required arithmetic progressions, one per line. The progressions can be positioned in any order. Each progression should contain at least one number. If there's no solution, then print \"No solution\" (without the quotes)in the only line of the input file. If there are several solutions, print any of them.ExamplesInput64 1 2 7 3 10Output1 2 34 7 10Input51 2 3 -2 -7Output1 2 3-2 -7NoteIn the second sample another solution is also possible (number three can be assigned to the second progression): 1, 2 and 3, -2, -7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "01982cdf", "template_md5": "35d339e4", "result": "You are given a sequence of distinct integers $a_1, a_2, ..., a_n$.  Determine if you can split this sequence into two arithmetic progressions. An arithmetic progression is a sequence where the difference between any two consecutive numbers is constant.  \n\nIf a split is possible, output the two arithmetic progressions, one per line. If no split is possible, output \"No solution\". \n\nThe order of the numbers within each progression can be arbitrary."}, {"prompt_md5": "6225b2c6", "template_md5": "465699a0", "result": "You are given a list of numbers.  Determine if you can split the list into two separate lists where the numbers in each list form an arithmetic sequence (meaning the difference between consecutive numbers is constant). If you can, output the two lists. If not, say \"No solution\"."}]}