{"uid": "125-C", "url": "https://codeforces.com/contest/125/problem/C", "tags": ["constructive algorithms", " greedy"], "title": "125-C", "statement": "C. Hobbits' Partytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutEveryone knows that hobbits love to organize all sorts of parties and celebrations. There arenhobbits living in the Shire. They decided to organize the Greatest Party (GP) that would last for several days. Next day the hobbits wrote a guest list, some non-empty set containing all the inhabitants of the Shire. To ensure that everybody enjoy themselves and nobody gets bored, for any two days (say, days A and B) of the GP there existed at least one hobbit, invited to come on day A and on day B. However, to ensure that nobody has a row, for any three different days A, B, C there shouldn't be a hobbit invited on days A, B and C. The Shire inhabitants are keen on keeping the GP going for as long as possible. Your task is given numbern, to indicate the GP's maximum duration and the guest lists for each day.InputThe first line contains an integern(3 ≤n≤ 10000), representing the number of hobbits.OutputIn the first output line print a numberk— the maximum duration of GP in days. Then onklines print the guest lists, (the guests should be separated by spaces). Print each guest list on the single line. Each list can contain an arbitrary positive number of hobbits. The hobbits are numbered with integers from1ton.ExamplesInput4Output31 21 32 3Input5Output31 21 32 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f43fce2e", "template_md5": "35d339e4", "result": "You are given a number $n$ representing the number of people.  \n\nYour task is to determine the longest possible number of days a party can last, given the following rules:\n\n* For any two days of the party, there must be at least one person attending both days.\n* For any three different days of the party, there cannot be a person attending all three days.\n\nOutput the maximum number of days the party can last ($k$) and a list of attendees for each day."}, {"prompt_md5": "45825300", "template_md5": "465699a0", "result": "You are given a number representing the number of people.  You need to determine the longest possible sequence of days where each day has a unique set of people, but for any two days, there is at least one person present on both days. Output the maximum length of this sequence and the list of people for each day."}]}