{"uid": "1252-H", "url": "https://codeforces.com/contest/1252/problem/H", "tags": ["greedy", " implementation"], "title": "1252-H", "statement": "H. Twin Buildingstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAs you might already know, space has always been a problem in ICPC Jakarta. To cope with this, ICPC Jakarta is planning to buildtwonew buildings. These buildings should have a shape of a rectangle of the same size. Now, their problem is to find land to build the buildings.There are $$$N$$$ lands available for sale. The $$$i^{th}$$$ land has a rectangular shape of size $$$L_i \\\\times W_i$$$. For a good feng shui, the building's side should be parallel to the land's sides.One way is to build the two buildings on two different lands, one on each land (not necessarily with the same orientation). A building of size $$$A \\\\times B$$$ can be build on the $$$i^{th}$$$ land if and only if at least one of the following is satisfied:$$$A \\\\le L_i$$$ and $$$B \\\\le W_i$$$, or$$$A \\\\le W_i$$$ and $$$B \\\\le L_i$$$.Alternatively, it is also possible to build two buildings of $$$A \\\\times B$$$ on the $$$i^{th}$$$ land with the same orientation. Formally, it is possible to build two buildings of $$$A \\\\times B$$$ on the $$$i^{th}$$$ land if and only if at least one of the following is satisfied:$$$A \\\\times 2 \\\\le L_i$$$ and $$$B \\\\le W_i$$$, or$$$A \\\\times 2 \\\\le W_i$$$ and $$$B \\\\le L_i$$$, or$$$A \\\\le L_i$$$ and $$$B \\\\times 2 \\\\le W_i$$$, or$$$A \\\\le W_i$$$ and $$$B \\\\times 2 \\\\le L_i$$$.Your task in this problem is to help ICPC Jakarta to figure out the largest possible buildings they can build given $$$N$$$ available lands. Note that ICPC Jakarta has to build two buildings of $$$A \\\\times B$$$; output the largest possible for $$$A \\\\times B$$$.InputInput begins with a line containing an integer: $$$N$$$ ($$$1 \\\\le N \\\\le 100\\\\,000$$$) representing the number of available lands. The next $$$N$$$ lines each contains two integers: $$$L_i$$$ $$$W_i$$$ ($$$1 \\\\le L_i, W_i \\\\le 10^9$$$) representing the size of the land.OutputOutput in a line a number representing the largest building that ICPC Jakarta can build with exactly one decimal point (see sample input/output for clarity).ExamplesInput2 5 5 3 4Output12.5Input2 2 5 4 3Output8.0Input3 10 1 9 8 7 6Output42.0NoteExplanation for the sample input/output #1Two buildings of $$$2.5 \\\\times 5$$$ can be built both on the first land.Explanation for the sample input/output #2Two buildings of $$$2 \\\\times 4$$$ can be built each on the first and second lands.Explanation for the sample input/output #3Two buildings of $$$7 \\\\times 6$$$ can be built each on the second and third lands.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "58c37690", "template_md5": "35d339e4", "result": "There are $N$ pieces of land available for sale. Each piece of land is a rectangle with dimensions $L_i \\times W_i$.  You need to find the largest possible size of a rectangle $A \\times B$ that can be built on these lands. \n\nHere are the rules:\n\n* You can build two buildings of size $A \\times B$ on a single piece of land if:\n    *  $A \\le L_i$ and $B \\le W_i$ \n    *  $A \\le W_i$ and $B \\le L_i$\n    *  $A \\times 2 \\le L_i$ and $B \\le W_i$\n    *  $A \\times 2 \\le W_i$ and $B \\le L_i$\n    *  $A \\le L_i$ and $B \\times 2 \\le W_i$\n    *  $A \\le W_i$ and $B \\times 2 \\le L_i$\n\n* You can build one building of size $A \\times B$ on each of two different pieces of land.\n\nOutput the largest possible value of $A \\times B$ that you can build."}, {"prompt_md5": "92a78d3e", "template_md5": "465699a0", "result": "You have a number of rectangular plots of land.  You want to find the largest possible rectangle that can be built on one or two of these plots, with the building's sides parallel to the plot's sides.  The building can be built on a plot if its dimensions are less than or equal to the plot's dimensions, or if its dimensions are half the plot's dimensions.  What is the largest possible size of the building?"}]}