{"uid": "1254-A", "url": "https://codeforces.com/contest/1254/problem/A", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "1254-A", "statement": "A. Feeding Chickentime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLong is a huge fan of CFC (Codeforces Fried Chicken). But the price of CFC is increasing, so he decides to breed the chicken on his own farm.His farm is presented by a rectangle grid with $$$r$$$ rows and $$$c$$$ columns. Some of these cells contain rice, others are empty. $$$k$$$ chickens are living on his farm.The number of chickens is not greater than the number of cells with rice on the farm.Long wants to give his chicken playgrounds by assigning these farm cells to his chickens. He would like to satisfy the following requirements:Each cell of the farm is assigned toexactly onechicken.Each chicken is assignedat least onecell.The set of cells assigned to every chicken forms a connected area. More precisely, if two cells $$$(x, y)$$$ and $$$(u, v)$$$ are assigned to the same chicken, this chicken is able to walk from $$$(x, y)$$$ to $$$(u, v)$$$ by passing only its cells and moving from each cell to another cell sharing a side.Long also wants to prevent his chickens from fighting for food. Hence he wants the difference between the maximum and the minimum number of cells with rice assigned to a chicken to be as small as possible. Please help him.InputEach test contains multiple test cases. The first line contains the number of test cases $$$T$$$ ($$$1 \\\\le T \\\\le 2 \\\\cdot 10^4$$$). Description of the test cases follows.The first line of each test case contains three integers $$$r$$$, $$$c$$$ and $$$k$$$ ($$$1 \\\\leq r, c \\\\leq 100, 1 \\\\leq k \\\\leq 62$$$), representing the size of Long's farm and the number of chickens Long has.Each of the next $$$r$$$ lines contains $$$c$$$ characters, each is either \".\" or \"R\", representing an empty cell or a cell with rice. It is guaranteed thatthe number of chickens is not greater than the number of cells with rice on the farm.It is guaranteed that the sum of $$$r \\\\cdot c$$$ over all test cases does not exceed $$$2 \\\\cdot 10^4$$$.OutputFor each test case, print $$$r$$$ lines with $$$c$$$ characters on each line. Each character should be either a lowercase English character, an uppercase English character, or a digit. Two characters should be equal if and only if the two corresponding cells are assigned to the same chicken.Uppercase and lowercase characters are considered different, so \"A\" and \"a\" belong to two different chickens.If there are multiple optimal answers, print any.ExampleInput4 3 5 3 ..R.. ...R. ....R 6 4 6 R..R R..R RRRR RRRR R..R R..R 5 5 4 RRR.. R.R.. RRR.. R..R. R...R 2 31 62 RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRROutput11122 22223 33333 aacc aBBc aBBc CbbA CbbA CCAA 11114 22244 32444 33344 33334 abcdefghijklmnopqrstuvwxyzABCDE FGHIJKLMNOPQRSTUVWXYZ0123456789NoteThese pictures explain the sample output. Each color represents one chicken. Cells filled with patterns (not solid colors) contain rice.In the first test case, each chicken has one cell with rice. Hence, the difference between the maximum and the minimum number of cells with rice assigned to a chicken is $$$0$$$.In the second test case, there are $$$4$$$ chickens with $$$3$$$ cells of rice, and $$$2$$$ chickens with $$$2$$$ cells of rice. Hence, the difference between the maximum and the minimum number of cells with rice assigned to a chicken is $$$3 - 2 = 1$$$.In the third test case, each chicken has $$$3$$$ cells with rice.In the last test case, since there are $$$62$$$ chicken with exactly $$$62$$$ cells of rice, each chicken must be assigned to exactly one cell. The sample output is one of the possible way.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "300d0e69", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $r \\times c$ representing a farm. Some cells contain rice (\"R\") and others are empty (\".\") .  There are $k$ chickens that need to be placed on the farm.\n\n**Rules:**\n\n* Each cell must be assigned to exactly one chicken.\n* Each chicken must be assigned at least one cell.\n* The cells assigned to each chicken must form a connected area (meaning you can walk from any cell to any other cell assigned to the same chicken by only moving to adjacent cells).\n\n**Goal:**\n\nFind a way to assign the chickens to the cells so that the difference between the maximum and minimum number of rice cells assigned to any chicken is as small as possible.\n\n**Input:**\n\n* The first line contains the number of test cases, $T$.\n* For each test case:\n    * The first line contains three integers: $r$, $c$, and $k$.\n    * The next $r$ lines contain $c$ characters each, representing the farm grid.\n\n**Output:**\n\n* For each test case, print a grid of the same size as the input, where each cell contains a character representing the chicken assigned to that cell. \n* Different characters represent different chickens."}, {"prompt_md5": "cd89be3a", "template_md5": "465699a0", "result": "You are given a grid of cells, some containing food. You need to divide the cells into groups so that each group is connected and each group represents a chicken's territory. Each chicken needs at least one cell, and each cell can only belong to one chicken. The goal is to minimize the difference between the number of food cells in the largest and smallest chicken territories."}]}