{"uid": "1256-E", "url": "https://codeforces.com/contest/1256/problem/E", "tags": ["dp", " greedy", " sortings"], "title": "1256-E", "statement": "E. Yet Another Division Into Teamstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ students at your university. The programming skill of the $$$i$$$-th student is $$$a_i$$$. As a coach, you want to divide them into teams to prepare them for the upcoming ICPC finals. Just imagine how good this university is if it has $$$2 \\\\cdot 10^5$$$ students ready for the finals!Each team should consist ofat least three students. Each student should belong toexactly one team. Thediversityof a team is the difference between themaximumprogramming skill of some student that belongs to this team and theminimumprogramming skill of some student that belongs to this team (in other words, if the team consists of $$$k$$$ students with programming skills $$$a[i_1], a[i_2], \\\\dots, a[i_k]$$$, then thediversityof this team is $$$\\\\max\\\\limits_{j=1}^{k} a[i_j] - \\\\min\\\\limits_{j=1}^{k} a[i_j]$$$).The totaldiversityis the sum ofdiversitiesof all teams formed.Your task is to minimize the totaldiversityof the division of students and find the optimal way to divide the students.InputThe first line of the input contains one integer $$$n$$$ ($$$3 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the number of students.The second line of the input contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$), where $$$a_i$$$ is the programming skill of the $$$i$$$-th student.OutputIn the first line print two integers $$$res$$$ and $$$k$$$ — the minimum totaldiversityof the division of students and the number of teams in your division, correspondingly.In the second line print $$$n$$$ integers $$$t_1, t_2, \\\\dots, t_n$$$ ($$$1 \\\\le t_i \\\\le k$$$), where $$$t_i$$$ is the number of team to which the $$$i$$$-th student belong.If there are multiple answers, you can print any. Note that you don't need to minimize the number of teams. Each team should consist ofat least three students.ExamplesInput5 1 1 3 4 2Output3 1 1 1 1 1 1Input6 1 5 12 13 2 15Output7 2 2 2 1 1 2 1Input10 1 2 5 129 185 581 1041 1909 1580 8150Output7486 3 3 3 3 2 2 2 2 1 1 1NoteIn the first example, there is only one team with skills $$$[1, 1, 2, 3, 4]$$$ so the answer is $$$3$$$. It can be shown that you cannot achieve a better answer.In the second example, there are two teams with skills $$$[1, 2, 5]$$$ and $$$[12, 13, 15]$$$ so the answer is $$$4 + 3 = 7$$$.In the third example, there are three teams with skills $$$[1, 2, 5]$$$, $$$[129, 185, 581, 1041]$$$ and $$$[1580, 1909, 8150]$$$ so the answer is $$$4 + 912 + 6570 = 7486$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0f461000", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, where each integer represents the programming skill of a student. You need to divide these students into teams, with each team having at least 3 students.  \n\nThe diversity of a team is the difference between the highest and lowest programming skill of the students in that team. The total diversity is the sum of the diversity of all the teams.\n\nYour goal is to find the way to divide the students into teams that minimizes the total diversity. Output the minimum total diversity and the number of teams used."}, {"prompt_md5": "2b13584b", "template_md5": "465699a0", "result": "You have a group of people with different skill levels. You need to divide them into teams of at least three people each. Each team's \"diversity\" is the difference between the highest and lowest skill levels in the team.  Find the way to divide the people into teams that results in the lowest total diversity across all teams."}]}