{"uid": "1257-B", "url": "https://codeforces.com/contest/1257/problem/B", "tags": ["math"], "title": "1257-B", "statement": "B. Magic Sticktime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently Petya walked in the forest and found a magic stick.Since Petya really likes numbers, the first thing he learned was spells for changing numbers. So far, he knows only two spells that can be applied to apositiveinteger:If the chosen number $$$a$$$ is even, then the spell will turn it into $$$\\\\frac{3a}{2}$$$;If the chosen number $$$a$$$ is greater than one, then the spell will turn it into $$$a-1$$$.Note that if the number is even and greater than one, then Petya can choose which spell to apply.Petya now has only one number $$$x$$$. He wants to know if his favorite number $$$y$$$ can be obtained from $$$x$$$ using the spells he knows. The spells can be used any number of times in any order. It is not required to use spells, Petya can leave $$$x$$$ as it is.InputThe first line contains single integer $$$T$$$ ($$$1 \\\\le T \\\\le 10^4$$$) — the number of test cases. Each test case consists of two lines.The first line of each test case contains two integers $$$x$$$ and $$$y$$$ ($$$1 \\\\le x, y \\\\le 10^9$$$) — the current number and the number that Petya wants to get.OutputFor the $$$i$$$-th test case print the answer on it —YESif Petya can get the number $$$y$$$ from the number $$$x$$$ using known spells, andNOotherwise.You may print every letter in any case you want (so, for example, the stringsyEs,yes,YesandYESwill all be recognized as positive answer).ExampleInput7 2 3 1 1 3 6 6 8 1 2 4 1 31235 6578234OutputYES YES NO YES NO YES YES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3d81fa65", "template_md5": "35d339e4", "result": "You are given two integers,  $x$ and $y$. You have two operations you can perform on $x$:\n\n1. If $x$ is even, you can multiply it by $\\frac{3}{2}$.\n2. If $x$ is greater than 1, you can subtract 1 from it.\n\nDetermine if it is possible to transform $x$ into $y$ using these operations, possibly zero or more times. \n\n\nIf it is possible, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "817f645b", "template_md5": "465699a0", "result": "Given two numbers, determine if the second number can be reached from the first by repeatedly applying two operations:\n\n1. If the number is even, divide it by 2 and multiply by 3.\n2. If the number is greater than 1, subtract 1."}]}