{"uid": "126-B", "url": "https://codeforces.com/contest/126/problem/B", "tags": ["binary search", " dp", " hashing", " string suffix structures", " strings"], "title": "126-B", "statement": "B. Passwordtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAsterix, Obelix and their temporary buddies Suffix and Prefix has finally found the Harmony temple. However, its doors were firmly locked and even Obelix had no luck opening them.A little later they found a strings, carved on a rock below the temple's gates. Asterix supposed that that's the password that opens the temple and read the string aloud. However, nothing happened. Then Asterix supposed that a password is some substringtof the strings.Prefix supposed that the substringtis the beginning of the strings; Suffix supposed that the substringtshould be the end of the strings; and Obelix supposed thattshould be located somewhere inside the strings, that is,tis neither its beginning, nor its end.Asterix chose the substringtso as to please all his companions. Besides, from all acceptable variants Asterix chose the longest one (as Asterix loves long strings). When Asterix read the substringtaloud, the temple doors opened.You know the strings. Find the substringtor determine that such substring does not exist and all that's been written above is just a nice legend.InputYou are given the stringswhose length can vary from1to106(inclusive), consisting of small Latin letters.OutputPrint the stringt. If a suitabletstring does not exist, then print \"Just a legend\" without the quotes.ExamplesInputfixprefixsuffixOutputfixInputabcdabcOutputJust a legend", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a0372f42", "template_md5": "35d339e4", "result": "You are given a string of lowercase English letters.  Find the longest substring of this string that satisfies the following conditions:\n\n* It is a prefix of the string.\n* It is a suffix of the string.\n* It is not just the entire string itself.\n\nIf no such substring exists, print \"Just a legend\"."}, {"prompt_md5": "4a2cd698", "template_md5": "465699a0", "result": "Given a string, find the longest substring that can be found at the beginning, end, or somewhere in the middle of the string. If no such substring exists, print \"Just a legend\"."}]}