{"uid": "126-E", "url": "https://codeforces.com/contest/126/problem/E", "tags": ["brute force", " flows"], "title": "126-E", "statement": "E. Pillstime limit per test1.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDoctor prescribed medicine to his patient. The medicine is represented by pills. Each pill consists of a shell and healing powder. The shell consists of two halves; each half has one of four colors — blue, red, white or yellow.The doctor wants to put28pills in a rectangular box7 × 8in size. Besides, each pill occupies exactly two neighboring cells and any cell contains exactly one half of a pill. Thus, the result is a four colored picture7 × 8in size.The doctor thinks that a patient will recover sooner if the picture made by the pills will be special. Unfortunately, putting the pills in the box so as to get the required picture is not a very easy task. That's why doctor asks you to help.Doctor has some amount of pills of each of10painting types. They all contain the same medicine, that's why it doesn't matter which28of them will be stored inside the box.Place the pills in the box so that the required picture was formed. If it is impossible to place the pills in the required manner, then place them so that the number of matching colors in all56cells in the final arrangement and the doctor's picture were maximum.InputFirst7lines contain the doctor's picture. Each line contains8characters, each character can be \"B\", \"R\", \"W\" and \"Y\" that stands for blue, red, white and yellow colors correspondingly.Next four lines contain10numbers that stand for, correspondingly, the number of pills painted:\"BY\" \"BW\" \"BR\" \"BB\"\"RY\" \"RW\" \"RR\"\"WY\" \"WW\"\"YY\"Those numbers lie within range from0to28inclusively. It is guaranteed that the total number of pills in no less than28.OutputPrint on the first line the maximal number cells for which the colors match.Then print13lines each containing15characters — the pills' position in the optimal arrangement. The intersections of odd lines and odd columns should contain characters \"B\", \"R\", \"W\" and \"Y\". All other positions should contain characters \".\", \"-\" and \"|\". Use \"-\" and \"|\" to show which halves belong to one pill. See the samples for more clarification.If there are several possible solutions, print any of them.ExamplesInputWWWBBWWWWWWBBWWWYYWBBWWWYYWBBWRRYYWBBWRRYYWBBWRRYYWBBWRR0 0 0 80 1 51 105Output53W.W.W.B.B.W.W.W|.|.|.|.|.|.|.|W.W.W.B.B.W.W.W...............Y.Y.W.B.B.W.W-W|.|.|.|.|.|....Y.Y.W.B.B.W.R.R............|.|Y.Y.W.B.B.R.R.R|.|.|.|.|.|....Y.Y.W.B.B.W.R.R............|.|Y-Y.B-B.B-B.R.RInputWWWWWWWWWBYWRBBYBRYRBWYYWWBRYWBBBWWRWBYWRBWRBWYYWWWWWWWW0 0 0 10 0 10 125Output15W.Y.Y-Y.Y-Y.Y-Y|.|............W.Y.Y.Y.Y.B-B.Y....|.|.|.....|Y-Y.Y.Y.Y.Y-Y.Y...............Y.Y.Y.R.Y.Y.Y-Y|.|.|.|.|.|....Y.Y.Y.R.Y.Y.Y.Y............|.|Y-Y.Y.Y-Y.Y.Y.Y....|.....|....Y-Y.Y.Y-Y.Y.Y-Y", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a8f22f48", "template_md5": "35d339e4", "result": "You are given a 7x8 grid representing a picture. Each cell in the grid can be one of four colors: blue (B), red (R), white (W), or yellow (Y). \n\nYou are also given 10 types of pills, each with a specific number of pills available. Each pill occupies two adjacent cells in the grid, with one half of the pill in each cell.  \n\nYour task is to arrange the pills in the grid to match the given picture as closely as possible. If it's impossible to perfectly match the picture, arrange the pills to maximize the number of matching colors between the picture and the final arrangement.\n\n**Input:**\n\n* The first 7 lines contain the target picture, with each line having 8 characters representing the colors.\n* The next 4 lines contain 10 numbers, representing the number of pills of each type available.\n\n**Output:**\n\n* The first line should output the maximum number of matching colors.\n* The next 13 lines should show the arrangement of the pills in the grid. Each line should have 15 characters, with the following rules:\n    * The intersections of odd lines and odd columns should contain the pill colors (B, R, W, Y).\n    * All other positions should contain \".\", \"-\", or \"|\".\n    * \"-\" and \"|\" should be used to show which halves belong to the same pill."}, {"prompt_md5": "dd4ec58c", "template_md5": "465699a0", "result": "You are given a 7x8 grid representing a target picture made of four colors. You also have a set of pills, each consisting of two halves of different colors.  \n\nPlace the pills in the grid to match the target picture as closely as possible. If a perfect match is impossible, place the pills to maximize the number of matching colors between the target picture and the final arrangement."}]}