{"uid": "126-D", "url": "https://codeforces.com/contest/126/problem/D", "tags": ["dp", " math"], "title": "126-D", "statement": "D. Fibonacci Sumstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutFibonacci numbers have the following form:F1= 1,F2= 2,Fi=Fi- 1+Fi- 2,i> 2.Let's consider some non-empty setS= {s1,s2, ...,sk}, consisting ofdifferentFibonacci numbers. Let's find the sum of values of this set's elements:Let's call the setSa numbern'sdecomposition into Fibonacci sum.It's easy to see that several numbers have several decompositions into Fibonacci sum. For example, for13we have13, 5 + 8, 2 + 3 + 8— three decompositions, and for16:3 + 13, 1 + 2 + 13, 3 + 5 + 8, 1 + 2 + 5 + 8— four decompositions.By the given numberndetermine the number of its possible different decompositions into Fibonacci sum.InputThe first line contains an integert— the number of tests (1 ≤t≤ 105). Each of the followingtlines contains one test.Each test is an integern(1 ≤n≤ 1018).Please do not use the%lldspecificator to read or write 64-bit integers in C++. It is preferred to use thecin,coutstreams or the%I64dspecificator.OutputFor each input data test print a single number on a single line — the answer to the problem.ExamplesInput21316Output34NoteTwo decompositions are different if there exists a number that is contained in the first decomposition, but is not contained in the second one. Decompositions that differ only in the order of summands are considered equal.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ed913bc4", "template_md5": "35d339e4", "result": "You are given a number $n$.  Find the number of ways to write $n$ as a sum of distinct Fibonacci numbers. \n\nFor example, the Fibonacci sequence is: 1, 2, 3, 5, 8, 13, 21, ... where each number is the sum of the two preceding ones.\n\nThe number 13 can be written as the sum of Fibonacci numbers in these ways:\n\n* 13\n* 5 + 8\n* 2 + 3 + 8\n\nTherefore, the answer for $n=13$ is 3. \n\n\nInput:\n\nThe first line contains the number of test cases $t$. Each of the following $t$ lines contains an integer $n$.\n\nOutput:\n\nFor each test case, print the number of ways to write $n$ as a sum of distinct Fibonacci numbers."}, {"prompt_md5": "14d5c0bb", "template_md5": "465699a0", "result": "Given a number, find the number of ways to express it as a sum of unique Fibonacci numbers."}]}