{"uid": "1260-A", "url": "https://codeforces.com/contest/1260/problem/A", "tags": ["math"], "title": "1260-A", "statement": "A. Heatingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSeveral days ago you bought a new house and now you are planning to start a renovation. Since winters in your region can be very cold you need to decide how to heat rooms in your house.Your house has $$$n$$$ rooms. In the $$$i$$$-th room you can install at most $$$c_i$$$ heating radiators. Each radiator can have several sections, but the cost of the radiator with $$$k$$$ sections is equal to $$$k^2$$$ burles.Since rooms can have different sizes, you calculated that you need at least $$$sum_i$$$ sections in total in the $$$i$$$-th room.For each room calculate the minimum cost to install at most $$$c_i$$$ radiators with total number of sections not less than $$$sum_i$$$.InputThe first line contains single integer $$$n$$$ ($$$1 \\\\le n \\\\le 1000$$$) — the number of rooms.Each of the next $$$n$$$ lines contains the description of some room. The $$$i$$$-th line contains two integers $$$c_i$$$ and $$$sum_i$$$ ($$$1 \\\\le c_i, sum_i \\\\le 10^4$$$) — the maximum number of radiators and the minimum total number of sections in the $$$i$$$-th room, respectively.OutputFor each room print one integer — the minimum possible cost to install at most $$$c_i$$$ radiators with total number of sections not less than $$$sum_i$$$.ExampleInput4 1 10000 10000 1 2 6 4 6Output100000000 1 18 10NoteIn the first room, you can install only one radiator, so it's optimal to use the radiator with $$$sum_1$$$ sections. The cost of the radiator is equal to $$$(10^4)^2 = 10^8$$$.In the second room, you can install up to $$$10^4$$$ radiators, but since you need only one section in total, it's optimal to buy one radiator with one section.In the third room, there $$$7$$$ variants to install radiators: $$$[6, 0]$$$, $$$[5, 1]$$$, $$$[4, 2]$$$, $$$[3, 3]$$$, $$$[2, 4]$$$, $$$[1, 5]$$$, $$$[0, 6]$$$. The optimal variant is $$$[3, 3]$$$ and it costs $$$3^2+ 3^2 = 18$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2cf1c825", "template_md5": "35d339e4", "result": "You have $n$ rooms to heat. Each room has a maximum number of radiators ($c_i$) that can be installed and a minimum number of sections ($sum_i$) needed. Each radiator section costs $k^2$ burles. \n\nFind the minimum cost to install radiators in each room to meet the minimum section requirement. \n\n**Input:**\n\n* The first line contains $n$ (the number of rooms).\n* Each of the next $n$ lines contains two integers: $c_i$ (maximum radiators) and $sum_i$ (minimum sections) for each room.\n\n**Output:**\n\n* For each room, print the minimum cost to install radiators."}, {"prompt_md5": "9caf5ed5", "template_md5": "465699a0", "result": "You have to heat multiple rooms. Each room has a limit on the number of heaters you can install and a minimum number of sections the heaters must have.  Find the minimum cost to heat each room. The cost of a heater is the square of the number of sections it has."}]}