{"uid": "1264-D2", "url": "https://codeforces.com/contest/1264/problem/D2", "tags": ["combinatorics", " probabilities"], "title": "1264-D2", "statement": "D2. Beautiful Bracket Sequence (hard version)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is the hard version of this problem. The only difference is the limit of $$$n$$$ - the length of the input string. In this version, $$$1 \\\\leq n \\\\leq 10^6$$$.Let's define a correct bracket sequence and its depth as follow:An empty string is a correct bracket sequence with depth $$$0$$$.If \"s\" is a correct bracket sequence with depth $$$d$$$ then \"(s)\" is a correct bracket sequence with depth $$$d + 1$$$.If \"s\" and \"t\" are both correct bracket sequences then their concatenation \"st\" is a correct bracket sequence with depth equal to the maximum depth of $$$s$$$ and $$$t$$$.For a (not necessarily correct) bracket sequence $$$s$$$, we define its depth as the maximum depth of anycorrectbracket sequence induced by removing some characters from $$$s$$$ (possibly zero). For example: the bracket sequence $$$s = $$$\"())(())\" has depth $$$2$$$, because by removing the third character we obtain a correct bracket sequence \"()(())\" with depth $$$2$$$.Given a string $$$a$$$ consists of only characters '(', ')' and '?'. Consider all (not necessarily correct) bracket sequences obtained by replacing all characters '?' in $$$a$$$ by either '(' or ')'. Calculate the sum of all the depths of all these bracket sequences. As this number can be large, find it modulo $$$998244353$$$.Hacksin this problem can be done only if easy and hard versions of this problem was solved.InputThe only line contains a non-empty string consist of only '(', ')' and '?'. The length of the string is at most $$$10^6$$$.OutputPrint the answer modulo $$$998244353$$$ in a single line.ExamplesInput??Output1Input(?(?))Output9NoteIn the first test case, we can obtain $$$4$$$ bracket sequences by replacing all characters '?' with either '(' or ')':\"((\". Its depth is $$$0$$$;\"))\". Its depth is $$$0$$$;\")(\". Its depth is $$$0$$$;\"()\". Its depth is $$$1$$$.So, the answer is $$$1 = 0 + 0 + 0 + 1$$$.In the second test case, we can obtain $$$4$$$ bracket sequences by replacing all characters '?' with either '(' or ')':\"(((())\". Its depth is $$$2$$$;\"()()))\". Its depth is $$$2$$$;\"((()))\". Its depth is $$$3$$$;\"()(())\". Its depth is $$$2$$$.So, the answer is $$$9 = 2 + 2 + 3 + 2$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d70ef717", "template_md5": "35d339e4", "result": "You are given a string  $a$ consisting of characters '(', ')', and '?'.  \n\nA bracket sequence is considered \"correct\" if it follows these rules:\n\n* An empty string is a correct bracket sequence.\n* If $s$ is a correct bracket sequence, then \"(s)\" is also a correct bracket sequence.\n* If $s$ and $t$ are correct bracket sequences, then $st$ is also a correct bracket sequence.\n\nThe \"depth\" of a bracket sequence is the maximum depth of any correct bracket sequence you can get by removing some characters from it.\n\nFor example, the string \"())(())\" has a depth of 2 because you can remove the third character to get the correct sequence \"()(())\".\n\nYour task is to:\n\n1. Replace all the '?' characters in the string $a$ with either '(' or ')'. This will create many possible bracket sequences.\n2. Calculate the sum of the depths of all these possible bracket sequences.\n3. Find the remainder when this sum is divided by 998244353. \n\n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "49266a45", "template_md5": "465699a0", "result": "You are given a string containing parentheses '(' , ')' and question marks '?'.  Replace each '?' with either '(' or ')'.  Calculate the sum of the maximum depths of all possible resulting bracket sequences. The depth of a bracket sequence is the highest nesting level of parentheses.  The answer should be given modulo 998244353."}]}