{"uid": "1264-B", "url": "https://codeforces.com/contest/1264/problem/B", "tags": ["brute force", " constructive algorithms", " greedy"], "title": "1264-B", "statement": "B. Beautiful Sequencetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAn integer sequence is calledbeautifulif the difference between any two consecutive numbers is equal to $$$1$$$. More formally, a sequence $$$s_1, s_2, \\\\ldots, s_{n}$$$ is beautiful if $$$|s_i - s_{i+1}| = 1$$$ for all $$$1 \\\\leq i \\\\leq n - 1$$$.Trans has $$$a$$$ numbers $$$0$$$, $$$b$$$ numbers $$$1$$$, $$$c$$$ numbers $$$2$$$ and $$$d$$$ numbers $$$3$$$. He wants to construct a beautiful sequence using all of these $$$a + b + c + d$$$ numbers.However, it turns out to be a non-trivial task, and Trans was not able to do it. Could you please help Trans?InputThe only input line contains four non-negative integers $$$a$$$, $$$b$$$, $$$c$$$ and $$$d$$$ ($$$0 < a+b+c+d \\\\leq 10^5$$$).OutputIf it is impossible to construct a beautiful sequence satisfying the above constraints, print \"NO\" (without quotes) in one line.Otherwise, print \"YES\" (without quotes) in the first line. Then in the second line print $$$a + b + c + d$$$ integers, separated by spaces — a beautiful sequence. There should be $$$a$$$ numbers equal to $$$0$$$, $$$b$$$ numbers equal to $$$1$$$, $$$c$$$ numbers equal to $$$2$$$ and $$$d$$$ numbers equal to $$$3$$$.If there are multiple answers, you can print any of them.ExamplesInput2 2 2 1OutputYES 0 1 0 1 2 3 2Input1 2 3 4OutputNOInput2 2 2 3OutputNONoteIn the first test, it is easy to see, that the sequence is beautiful because the difference between any two consecutive numbers is equal to $$$1$$$. Also, there are exactly two numbers, equal to $$$0$$$, $$$1$$$, $$$2$$$ and exactly one number, equal to $$$3$$$.It can be proved, that it is impossible to construct beautiful sequences in the second and third tests.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0c0e3ee1", "template_md5": "465699a0", "result": "You are given four numbers representing the count of each of four distinct values (0, 1, 2, 3).  Determine if it is possible to arrange these values into a sequence where each consecutive pair of values differs by 1. If possible, output \"YES\" followed by the sequence. Otherwise, output \"NO\"."}, {"prompt_md5": "20fcbc7e", "template_md5": "35d339e4", "result": "You are given four integers $a$, $b$, $c$, and $d$.  You need to determine if it is possible to create a sequence of $a+b+c+d$ numbers that meets the following conditions:\n\n* The sequence must contain exactly $a$ zeros, $b$ ones, $c$ twos, and $d$ threes.\n* The difference between any two consecutive numbers in the sequence must be 1.\n\nIf it is possible to create such a sequence, print \"YES\" followed by the sequence. Otherwise, print \"NO\"."}]}