{"uid": "1267-L", "url": "https://codeforces.com/contest/1267/problem/L", "tags": ["constructive algorithms", " strings"], "title": "1267-L", "statement": "L. Lexicographytime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputLucy likes letters. She studied the definition of the lexicographical order at school and plays with it.At first, she tried to construct the lexicographically smallest word out of given letters. It was so easy! Then she tried to build multiple words and minimize one of them. This was much harder!Formally, Lucy wants to make $$$n$$$ words of length $$$l$$$ each out of the given $$$n \\\\cdot l$$$ letters, so that the $$$k$$$-th of them in the lexicographic order is lexicographically as small as possible.InputThe first line contains three integers $$$n$$$, $$$l$$$, and $$$k$$$ ($$$1\\\\le k \\\\le n \\\\le 1\\\\,000$$$; $$$1 \\\\le l \\\\le 1\\\\,000$$$) — the total number of words, the length of each word, and the index of the word Lucy wants to minimize.The next line contains a string of $$$n \\\\cdot l$$$ lowercase letters of the English alphabet.OutputOutput $$$n$$$ words of $$$l$$$ letters each, one per line, using the letters from the input. Words must be sorted in the lexicographic order, and the $$$k$$$-th of them must be lexicographically as small as possible. If there are multiple answers with the smallest $$$k$$$-th word, output any of them.ExamplesInput3 2 2 abcdefOutputaf bc edInput2 3 1 abcabcOutputaab bcc", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9756f3c6", "template_md5": "35d339e4", "result": "You are given $n$ words of length $l$ each, and a number $k$ ($1 \\le k \\le n$). You need to arrange $n$ words of length $l$ each, using a given set of $n \\cdot l$ letters, such that:\n\n1. The words are arranged in lexicographical order.\n2. The $k$-th word in this order is as small as possible lexicographically.\n\nOutput the $n$ words. If there are multiple solutions with the same smallest $k$-th word, output any one of them."}, {"prompt_md5": "37e39f29", "template_md5": "465699a0", "result": "You are given a set of letters.  You need to create a list of words of a specific length from these letters. The words must be arranged in alphabetical order.  Find a list of words where the word at a specific position in the list is as short as possible alphabetically."}]}