{"uid": "1267-K", "url": "https://codeforces.com/contest/1267/problem/K", "tags": ["combinatorics", " math"], "title": "1267-K", "statement": "K. Key Storagetime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputKarl is developing a key storage service. Each user has a positive integer key.Karl knows that storing keys in plain text is bad practice. So, instead of storing a key, he decided to store a fingerprint of a key. However, using some existing fingerprint algorithm looked too boring to him, so he invented his own one.Karl's fingerprint is calculated by the following process: divide the given integer by 2, then divide the result by 3, then divide the result by 4, and so on, until we get a result that equals zero (we are speaking about integer division each time). The fingerprint is defined as the multiset of the remainders of these divisions.For example, this is how Karl's fingerprint algorithm is applied to the key 11: 11 divided by 2 has remainder 1 and result 5, then 5 divided by 3 has remainder 2 and result 1, and 1 divided by 4 has remainder 1 and result 0. Thus, the key 11 produces the sequence of remainders $$$[1, 2, 1]$$$ and has the fingerprint multiset $$$\\\\{1, 1, 2\\\\}$$$.Ksenia wants to prove that Karl's fingerprint algorithm is not very good. For example, she found that both keys 178800 and 123456 produce the fingerprint of $$$\\\\{0, 0, 0, 0, 2, 3, 3, 4\\\\}$$$. Thus, users are at risk of fingerprint collision with some commonly used and easy to guess keys like 123456.Ksenia wants to make her words more persuasive. She wants to calculate the number of other keys that have the same fingerprint as the keys in the given list of some commonly used keys. Your task is to help her.InputThe first line contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 50\\\\,000$$$) — the number of commonly used keys to examine. Each of the next $$$t$$$ lines contains one integer $$$k_i$$$ ($$$1 \\\\le k_i \\\\le 10^{18}$$$) — the key itself.OutputFor each of the keys print one integer — the number of other keys that have the same fingerprint.ExampleInput3 1 11 123456Output0 1 127NoteThe other key with the same fingerprint as 11 is 15. 15 produces a sequence of remainders $$$[1, 1, 2]$$$. So both numbers have the fingerprint multiset $$$\\\\{1, 1, 2\\\\}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ccfc9626", "template_md5": "465699a0", "result": "Given a list of numbers, count how many other numbers in the list have the same \"fingerprint\".  \n\nTo get the fingerprint of a number:\n\n1. Repeatedly divide the number by increasing integers (2, 3, 4, etc.)\n2. Keep track of the remainders from each division.\n3. The fingerprint is the set of all the remainders."}, {"prompt_md5": "37c659f0", "template_md5": "35d339e4", "result": "Given a list of integers, determine for each integer the number of other integers in the list that share the same fingerprint. \n\nThe fingerprint of an integer is calculated as follows:\n\n1. Divide the integer by 2, note the remainder.\n2. Divide the result by 3, note the remainder.\n3. Divide the result by 4, note the remainder.\n4. Continue this process, dividing by increasing integers (5, 6, 7, ...) until the result is 0.\n5. The fingerprint is the set of all the remainders obtained in this process. \n\n\nFor example, the fingerprint of 11 is {1, 1, 2} because:\n\n11 / 2 = 5 remainder 1\n5 / 3 = 1 remainder 2\n1 / 4 = 0 remainder 1"}]}