{"uid": "1267-B", "url": "https://codeforces.com/contest/1267/problem/B", "tags": [], "title": "1267-B", "statement": "B. Balls of Bumatime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputBalph is learning to play a game called Buma. In this game, he is given a row of colored balls. He has to choose the color of one new ball and the place to insert it (between two balls, or to the left of all the balls, or to the right of all the balls).When the ball is inserted the following happens repeatedly: if some segment of balls of the same color became longer as a result of a previous action and its length became at least $$$3$$$, then all the balls of this segment are eliminated.Consider, for example, a row of balls 'AAABBBWWBB'. Suppose Balph chooses a ball of color 'W' and the place to insert it after the sixth ball, i. e. to the left of the two 'W's. After Balph inserts this ball, the balls of color 'W' are eliminated, since this segment was made longer and has length $$$3$$$ now, so the row becomes 'AAABBBBB'. The balls of color 'B' are eliminated now, because the segment of balls of color 'B' became longer and has length $$$5$$$ now. Thus, the row becomes 'AAA'. However, none of the balls are eliminated now, because there is no elongated segment.Help Balph count the number of possible ways to choose a color of a new ball and a place to insert it that leads to the elimination of all the balls.InputThe only line contains a non-empty string of uppercase English letters of length at most $$$3 \\\\cdot 10^5$$$. Each letter represents a ball with the corresponding color.OutputOutput the number of ways to choose a color and a position of a new ball in order to eliminate all the balls.ExamplesInputBBWWBBOutput3InputBWWBOutput0InputBBWBBOutput0InputOOOWWWOutput0InputWWWOOOOOOWWWOutput7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "19c5b9de", "template_md5": "35d339e4", "result": "You are given a string of letters representing a row of colored balls. Each letter represents a different color. You can insert a new ball of any color at any position in the row (including before the first ball or after the last ball). \n\nAfter inserting a ball, if any segment of balls of the same color becomes at least 3 balls long, all balls in that segment are removed.\n\nYour task is to find the number of ways to choose a color for the new ball and a position to insert it so that all the balls are eventually removed."}, {"prompt_md5": "e34e90d0", "template_md5": "465699a0", "result": "You are given a sequence of colors. You can add a new ball of any color in any position.  After adding a ball, if any group of the same color has at least 3 balls, all balls in that group are removed.  Find the number of ways to add a ball that will eventually remove all the balls."}]}