{"uid": "127-A", "url": "https://codeforces.com/contest/127/problem/A", "tags": ["geometry"], "title": "127-A", "statement": "A. Wasted Timetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutMr. Scrooge, a very busy man, decided to count the time he wastes on all sorts of useless stuff to evaluate the lost profit. He has already counted the time he wastes sleeping and eating. And now Mr. Scrooge wants to count the time he has wasted signing papers.Mr. Scrooge's signature can be represented as a polylineA1A2...An. Scrooge signs like that: first it places a pen at the pointA1, then draws a segment from pointA1to pointA2, then he draws a segment from pointA2to pointA3and so on to pointAn, where he stops signing and takes the pen off the paper. At that the resulting line can intersect with itself and partially repeat itself but Scrooge pays no attention to it and never changes his signing style. As Scrooge makes the signature, he never takes the pen off the paper and his writing speed is constant —50millimeters per second.Scrooge signed exactlykpapers throughout his life and all those signatures look the same.Find the total time Scrooge wasted signing the papers.InputThe first line contains two integersnandk(2 ≤n≤ 100,1 ≤k≤ 1000). Each of the followingnlines contains the coordinates of the polyline's endpoints. Thei-th one contains coordinates of the pointAi— integersxiandyi, separated by a space.All pointsAiare different. The absolute value of all coordinates does not exceed20. The coordinates are measured in millimeters.OutputPrint one real number — the total time Scrooges wastes on signing the papers in seconds. The absolute or relative error should not exceed10- 6.ExamplesInput2 10 010 0Output0.200000000Input5 103 1-5 6-2 -13 210 0Output6.032163204Input6 105 04 06 03 07 02 0Output3.000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "41e76254", "template_md5": "35d339e4", "result": "You are given a sequence of points that represent a signature. The signature is made up of line segments connecting these points.  \n\nYou are also given the number of times this signature was drawn.\n\nCalculate the total time it took to draw all the signatures, assuming the drawing speed is 50 millimeters per second. \n\n**Input:**\n\n* Two integers, *n* and *k*:\n    * *n*: The number of points in the signature.\n    * *k*: The number of times the signature was drawn.\n* *n* lines, each containing two integers *x* and *y*: The coordinates of a point in the signature.\n\n**Output:**\n\n* A real number representing the total time taken to draw all the signatures in seconds."}, {"prompt_md5": "c997f860", "template_md5": "465699a0", "result": "Given a set of points, representing a signature, calculate the total time it takes to draw that signature at a constant speed.  You are given the number of times the signature is drawn."}]}