{"uid": "127-B", "url": "https://codeforces.com/contest/127/problem/B", "tags": ["implementation"], "title": "127-B", "statement": "B. Canvas Framestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutNicholas, a painter is going to paint several new canvases. Nicholas is sure that the canvases will turn out so great that each one will need framing and being hung on the wall. Frames are what Nicholas decided to begin with.Nicholas hasnsticks whose lengths equala1,a2, ...an. Nicholas does not want to break the sticks or glue them together. To make ah×w-sized frame, he needs two sticks whose lengths equalhand two sticks whose lengths equalw. Specifically, to make a square frame (whenh=w), he needs four sticks of the same length.Now Nicholas wants to make from the sticks that he has as many frames as possible; to be able to paint as many canvases as possible to fill the frames. Help him in this uneasy task. Note that it is not necessary to use all the sticks Nicholas has.InputThe first line contains an integern(1 ≤n≤ 100) — the number of sticks. The second line containsnspace-separated integers. Thei-th integer equals the length of thei-th stickai(1 ≤ai≤ 100).OutputPrint the single number — the maximum number of frames Nicholas can make for his future canvases.ExamplesInput52 4 3 2 3Output1Input132 2 4 4 4 4 6 6 6 7 7 9 9Output3Input43 3 3 5Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "88d8bca1", "template_md5": "35d339e4", "result": "You are given $n$ sticks of different lengths.  The lengths of the sticks are represented by the integers $a_1, a_2, ..., a_n$.  You want to make as many frames as possible using these sticks.  A frame can be square or rectangular.  A square frame requires four sticks of the same length, and a rectangular frame requires two sticks of one length and two sticks of another length.  \n\nYou do not have to use all of the sticks.\n\nOutput the maximum number of frames that can be made."}, {"prompt_md5": "99071761", "template_md5": "465699a0", "result": "You are given a list of stick lengths. Determine the maximum number of frames you can make using these sticks, where each frame requires four sticks of equal length."}]}