{"uid": "1276-C", "url": "https://codeforces.com/contest/1276/problem/C", "tags": ["brute force", " combinatorics", " constructive algorithms", " data structures", " greedy", " math"], "title": "1276-C", "statement": "C. Beautiful Rectangletime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given $$$n$$$ integers. You need to choose a subset and put the chosen numbers in a beautiful rectangle (rectangular matrix). Each chosen number should occupy one of its rectangle cells, each cell must be filled with exactly one chosen number. Some of the $$$n$$$ numbers may not be chosen.A rectangle (rectangular matrix) is called beautiful if in each row and in each column all values are different.What is the largest (by the total number of cells) beautiful rectangle you can construct? Print the rectangle itself.InputThe first line contains $$$n$$$ ($$$1 \\\\le n \\\\le 4\\\\cdot10^5$$$). The second line contains $$$n$$$ integers ($$$1 \\\\le a_i \\\\le 10^9$$$).OutputIn the first line print $$$x$$$ ($$$1 \\\\le x \\\\le n$$$) — the total number of cells of the required maximum beautiful rectangle. In the second line print $$$p$$$ and $$$q$$$ ($$$p \\\\cdot q=x$$$): its sizes. In the next $$$p$$$ lines print the required rectangle itself. If there are several answers, print any.ExamplesInput12 3 1 4 1 5 9 2 6 5 3 5 8Output12 3 4 1 2 3 5 3 1 5 4 5 6 8 9Input5 1 1 1 1 1Output1 1 1 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c7a1b298", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers.  You need to choose some of these integers and arrange them into a rectangle.  Each integer can only be used once, and each cell in the rectangle must contain exactly one integer.\n\nA rectangle is considered \"beautiful\" if every row and every column contains different integers.\n\nFind the largest possible beautiful rectangle you can create.  Output the number of cells in the rectangle, the dimensions of the rectangle (number of rows and columns), and the integers arranged in the rectangle. \n\n\nIf there are multiple solutions, you can output any one of them."}, {"prompt_md5": "66b46941", "template_md5": "465699a0", "result": "You are given a list of numbers.  You need to choose some of these numbers and arrange them into a rectangle where each number appears only once.  The rectangle must have different numbers in each row and each column.  Find the largest possible rectangle you can make this way and show its contents."}]}