{"uid": "1278-F", "url": "https://codeforces.com/contest/1278/problem/F", "tags": ["combinatorics", " dp", " math", " number theory", " probabilities"], "title": "1278-F", "statement": "F. Cardstime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputConsider the following experiment. You have a deck of $$$m$$$ cards, and exactly one card is a joker. $$$n$$$ times, you do the following: shuffle the deck, take the top card of the deck, look at it and return it into the deck.Let $$$x$$$ be the number of times you have taken the joker out of the deck during this experiment. Assuming that every time you shuffle the deck, all $$$m!$$$ possible permutations of cards are equiprobable, what is the expected value of $$$x^k$$$? Print the answer modulo $$$998244353$$$.InputThe only line contains three integers $$$n$$$, $$$m$$$ and $$$k$$$ ($$$1 \\\\le n, m < 998244353$$$, $$$1 \\\\le k \\\\le 5000$$$).OutputPrint one integer — the expected value of $$$x^k$$$, taken modulo $$$998244353$$$ (the answer can always be represented as an irreducible fraction $$$\\\\frac{a}{b}$$$, where $$$b \\\\mod 998244353 \\\\ne 0$$$; you have to print $$$a \\\\cdot b^{-1} \\\\mod 998244353$$$).ExamplesInput1 1 1Output1Input1 1 5000Output1Input2 2 2Output499122178Input998244352 1337 5000Output326459680", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ad797eaf", "template_md5": "35d339e4", "result": "You have a deck of $m$ cards with one joker. You shuffle the deck $n$ times. Each time, you take the top card, look at it, and put it back in the deck.  Let $x$ be the number of times you draw the joker. What is the expected value of $x^k$ ?\n\nThe answer should be given modulo 998244353."}, {"prompt_md5": "07f56f28", "template_md5": "465699a0", "result": "You have a deck of cards with one special card. You repeatedly shuffle the deck, take the top card, look at it, and put it back. What is the average (expected) value of the number of times you see the special card raised to a given power, after doing this many times?"}]}