{"uid": "128-A", "url": "https://codeforces.com/contest/128/problem/A", "tags": ["dfs and similar"], "title": "128-A", "statement": "A. Statuestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn this task Anna and Maria play a game with a very unpleasant rival. Anna and Maria are in the opposite squares of a chessboard (8 × 8): Anna is in the upper right corner, and Maria is in the lower left one. Apart from them, the board has several statues. Each statue occupies exactly one square. A square that contains a statue cannot have anything or anyone — neither any other statues, nor Anna, nor Maria.Anna is present on the board as a figurant (she stands still and never moves), and Maria has been actively involved in the game. Her goal is — to come to Anna's square. Maria and statues move in turn, Maria moves first. During one move Maria can go to any adjacent on the side or diagonal cell in which there is no statue, or she can stay in the cell where she is. The statues during their move must go one square down simultaneously, and those statues that were in the bottom row fall from the board and are no longer appeared.At that moment, when one of the statues is in the cell in which the Maria is, the statues are declared winners. At the moment when Maria comes into the cell where Anna has been waiting, Maria is declared the winner.Obviously, nothing depends on the statues, so it all depends on Maria. Determine who will win, if Maria does not make a strategic error.InputYou are given the8strings whose length equals8, describing the initial position on the board. The first line represents the top row of the board, the next one — for the second from the top, and so on, the last line represents the bottom row. Each character string matches a single cell board in the appropriate row, and the characters are in the same manner as that of the corresponding cell. If the cell is empty, the corresponding character is \".\". If a cell has Maria, then it is represented by character \"M\". If a cell has Anna, it is represented by the character \"A\". If a cell has a statue, then the cell is represented by character \"S\".It is guaranteed that the last character of the first row is always \"A\", the first character of the last line is always \"M\". The remaining characters are \".\" or \"S\".OutputIf Maria wins, print string \"WIN\". If the statues win, print string \"LOSE\".ExamplesInput.......A................................................M.......OutputWINInput.......A........................................SS......M.......OutputLOSEInput.......A.................................S......S.......MS......OutputLOSE", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "98286a14", "template_md5": "465699a0", "result": "A player starts in the bottom left corner of an 8x8 grid.  They can move one space up, down, left, or right to an empty space.  Other pieces on the grid move down one space each turn.  If a player lands on a space with a piece, the other player wins. The player's goal is to reach the top right corner. Determine if the player can win."}, {"prompt_md5": "1fb00df3", "template_md5": "35d339e4", "result": "You are given an 8x8 grid representing a chessboard.  \n\n*  The top right corner is occupied by a fixed piece.\n*  The bottom left corner is occupied by a movable piece.\n*  The rest of the squares can be empty (\".\") or occupied by a statue (\"S\").\n\nThe movable piece wants to reach the fixed piece.  \n\nOn each turn, the movable piece can move to an adjacent empty square (horizontally or diagonally). Statues move simultaneously, each moving one square down. Statues that reach the bottom row fall off the board.\n\nIf the movable piece reaches the fixed piece, the movable piece wins. If a statue lands on the square occupied by the movable piece, the statues win.\n\nDetermine the winner if the movable piece plays optimally."}]}