{"uid": "1280-D", "url": "https://codeforces.com/contest/1280/problem/D", "tags": ["dp", " greedy", " trees"], "title": "1280-D", "statement": "D. Miss Punyversetime limit per test4 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThe Oak has $$$n$$$ nesting places, numbered with integers from $$$1$$$ to $$$n$$$. Nesting place $$$i$$$ is home to $$$b_i$$$ bees and $$$w_i$$$ wasps.Some nesting places are connected by branches. We call two nesting placesadjacentif there exists a branch between them. Asimple pathfrom nesting place $$$x$$$ to $$$y$$$ is given by a sequence $$$s_0, \\\\ldots, s_p$$$ of distinct nesting places, where $$$p$$$ is a non-negative integer, $$$s_0 = x$$$, $$$s_p = y$$$, and $$$s_{i-1}$$$ and $$$s_{i}$$$ are adjacent for each $$$i = 1, \\\\ldots, p$$$. The branches of The Oak are set up in such a way that for any two pairs of nesting places $$$x$$$ and $$$y$$$, there exists a unique simple path from $$$x$$$ to $$$y$$$. Because of this, biologists and computer scientists agree that The Oak is in fact, a tree.Avillageis anonemptyset $$$V$$$ of nesting places such that for any two $$$x$$$ and $$$y$$$ in $$$V$$$, there exists a simple path from $$$x$$$ to $$$y$$$ whose intermediate nesting places all lie in $$$V$$$.A set of villages $$$\\\\cal P$$$ is called apartitionif each of the $$$n$$$ nesting places is contained in exactly one of the villages in $$$\\\\cal P$$$. In other words, no two villages in $$$\\\\cal P$$$ share any common nesting place, and altogether, they contain all $$$n$$$ nesting places.The Oak holds its annual Miss Punyverse beauty pageant. The two contestants this year are Ugly Wasp and Pretty Bee. The winner of the beauty pageant is determined by voting, which we will now explain. Suppose $$$\\\\mathcal{P}$$$ is a partition of the nesting places into $$$m$$$ villages $$$V_1, \\\\ldots, V_m$$$. There is a local election in each village. Each of the insects in this village vote for their favorite contestant. If there arestrictlymore votes for Ugly Wasp than Pretty Bee, then Ugly Wasp is said towinin that village. Otherwise, Pretty Beewins. Whoever wins in the most number of villages wins.As it always goes with these pageants, bees always vote for the bee (which is Pretty Bee this year) and wasps always vote for the wasp (which is Ugly Wasp this year). Unlike their general elections, no one abstains from voting for Miss Punyverse as everyone takes it very seriously.Mayor Waspacito, and his assistant Alexwasp, wants Ugly Wasp to win. He has the power to choose how to partition The Oak into exactly $$$m$$$ villages. If he chooses the partition optimally, determine the maximum number of villages in which Ugly Wasp wins.InputThe first line of input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) denoting the number of test cases. The next lines contain descriptions of the test cases.The first line of each test case contains two space-separated integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le m \\\\le n \\\\le 3000$$$). The second line contains $$$n$$$ space-separated integers $$$b_1, b_2, \\\\ldots, b_n$$$ ($$$0 \\\\le b_i \\\\le 10^9$$$). The third line contains $$$n$$$ space-separated integers $$$w_1, w_2, \\\\ldots, w_n$$$ ($$$0 \\\\le w_i \\\\le 10^9$$$). The next $$$n - 1$$$ lines describe the pairs of adjacent nesting places. In particular, the $$$i$$$-th of them contains two space-separated integers $$$x_i$$$ and $$$y_i$$$ ($$$1 \\\\le x_i, y_i \\\\le n$$$, $$$x_i \\\\neq y_i$$$) denoting the numbers of two adjacent nesting places. It is guaranteed that these pairs form a tree.It is guaranteed that the sum of $$$n$$$ in a single file is at most $$$10^5$$$.OutputFor each test case, output a single line containing a single integer denoting the maximum number of villages in which Ugly Wasp wins, among all partitions of The Oak into $$$m$$$ villages.ExampleInput2 4 3 10 160 70 50 70 111 111 0 1 2 2 3 3 4 2 1 143 420 214 349 2 1Output2 0NoteIn the first test case, we need to partition the $$$n = 4$$$ nesting places into $$$m = 3$$$ villages. We can make Ugly Wasp win in $$$2$$$ villages via the following partition: $$$\\\\{\\\\{1, 2\\\\}, \\\\{3\\\\}, \\\\{4\\\\}\\\\}$$$. In this partition,Ugly Wasp wins in village $$$\\\\{1, 2\\\\}$$$, garnering $$$181$$$ votes as opposed to Pretty Bee's $$$170$$$;Ugly Wasp also wins in village $$$\\\\{3\\\\}$$$, garnering $$$111$$$ votes as opposed to Pretty Bee's $$$70$$$;Ugly Wasp loses in the village $$$\\\\{4\\\\}$$$, garnering $$$0$$$ votes as opposed to Pretty Bee's $$$50$$$.Thus, Ugly Wasp wins in $$$2$$$ villages, and it can be shown that this is the maximum possible number.In the second test case, we need to partition the $$$n = 2$$$ nesting places into $$$m = 1$$$ village. There is only one way to do this: $$$\\\\{\\\\{1, 2\\\\}\\\\}$$$. In this partition's sole village, Ugly Wasp gets $$$563$$$ votes, and Pretty Bee also gets $$$563$$$ votes. Ugly Wasp needs strictly more votes in order to win. Therefore, Ugly Wasp doesn't win in any village.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "078c623c", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, each node having a number of bees ($b_i$) and wasps ($w_i$).  You need to partition the tree into $m$ villages.  \n\nIn each village, the contestant who gets more votes wins. Bees always vote for the bee, and wasps always vote for the wasp.\n\nFind the maximum number of villages where the wasp can win. \n\n\nInput:\n\n* $t$: the number of test cases\n* For each test case:\n    * $n$: the number of nodes\n    * $m$: the number of villages\n    * $b_1, b_2, ..., b_n$: the number of bees at each node\n    * $w_1, w_2, ..., w_n$: the number of wasps at each node\n    * $n-1$ lines, each containing two integers $x_i$ and $y_i$, representing an edge between nodes $x_i$ and $y_i$.\n\nOutput:\n\n* For each test case, output the maximum number of villages where the wasp can win."}, {"prompt_md5": "8da9bc8b", "template_md5": "465699a0", "result": "You are given a tree with $n$ nodes, each node having a number of bees and wasps. You need to divide the tree into $m$ groups.  Each group represents a village.  In each village, the contestant who gets more votes wins. Bees always vote for bees, and wasps always vote for wasps. Find the maximum number of villages where the wasp candidate can win."}]}