{"uid": "1285-A", "url": "https://codeforces.com/contest/1285/problem/A", "tags": ["math"], "title": "1285-A", "statement": "A. Mezo Playing Zomatime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputToday, Mezo is playing a game. Zoma, a character in that game, is initially at position $$$x = 0$$$. Mezo starts sending $$$n$$$ commands to Zoma. There are two possible commands:'L' (Left) sets the position $$$x: =x - 1$$$;'R' (Right) sets the position $$$x: =x + 1$$$.Unfortunately, Mezo's controller malfunctions sometimes. Some commands are sent successfully and some are ignored. If the command is ignored then the position $$$x$$$ doesn't change and Mezo simply proceeds to the next command.For example, if Mezo sends commands \"LRLR\", then here are some possible outcomes (underlined commands are sent successfully):\"LRLR\" — Zoma moves to the left, to the right, to the left again and to the right for the final time, ending up at position $$$0$$$;\"LRLR\" — Zoma recieves no commands, doesn't move at all and ends up at position $$$0$$$ as well;\"LRLR\" — Zoma moves to the left, then to the left again and ends up in position $$$-2$$$.Mezo doesn't know which commands will be sent successfully beforehand. Thus, he wants to know how many different positions may Zoma end up at.InputThe first line contains $$$n$$$ $$$(1 \\\\le n \\\\le 10^5)$$$ — the number of commands Mezo sends.The second line contains a string $$$s$$$ of $$$n$$$ commands, each either 'L' (Left) or 'R' (Right).OutputPrint one integer — the number of different positions Zoma may end up at.ExampleInput4 LRLROutput5NoteIn the example, Zoma may end up anywhere between $$$-2$$$ and $$$2$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f9eab5e7", "template_md5": "35d339e4", "result": "You are given a sequence of 'L' (Left) and 'R' (Right) commands. Each command represents a movement: 'L' moves a position to the left, and 'R' moves a position to the right.  \n\nSome commands may be ignored, meaning they have no effect on the position.\n\nDetermine the number of unique positions that can be reached after executing the commands, considering that some commands might be ignored. \n\nInput:\n\n* The first line contains an integer  $n$ ($1 \\le n \\le 10^5$) representing the number of commands.\n* The second line contains a string of $n$ characters, each either 'L' or 'R'.\n\nOutput:\n\n* Print a single integer representing the number of unique positions that can be reached."}, {"prompt_md5": "66537bbb", "template_md5": "465699a0", "result": "You are given a sequence of 'L' and 'R' commands.  'L' means move left, 'R' means move right.  Some commands may be ignored.  What are the possible final positions after executing the commands?"}]}