{"uid": "129-B", "url": "https://codeforces.com/contest/129/problem/B", "tags": ["brute force", " dfs and similar", " graphs", " implementation"], "title": "129-B", "statement": "B. Students and Shoelacestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAnna and Maria are in charge of the math club for junior students. When the club gathers together, the students behave badly. They've brought lots of shoe laces to the club and got tied with each other. Specifically, each string ties together two students. Besides, if two students are tied, then the lace connects the first student with the second one as well as the second student with the first one.To restore order, Anna and Maria do the following. First, for each student Anna finds out what other students he is tied to. If a student is tied to exactly one other student, Anna reprimands him. Then Maria gathers in a single groupallthe students who have been just reprimanded. She kicks them out from the club. This group of students immediately leaves the club. These students takes with them the laces that used to tie them. Then again for every student Anna finds out how many other students he is tied to and so on. And they do so until Anna can reprimand at least one student.Determine how many groups of students will be kicked out of the club.InputThe first line contains two integersnandm— the initial number of students and laces (). The students are numbered from1ton, and the laces are numbered from1tom. Nextmlines each contain two integersaandb— the numbers of students tied by thei-th lace (1 ≤a,b≤n,a≠b). It is guaranteed that no two students are tied with more than one lace. No lace ties a student to himself.OutputPrint the single number — the number of groups of students that will be kicked out from the club.ExamplesInput3 31 22 33 1Output0Input6 31 22 33 4Output2Input6 51 42 43 45 46 4Output1NoteIn the first sample Anna and Maria won't kick out any group of students — in the initial position every student is tied to two other students and Anna won't be able to reprimand anyone.In the second sample four students are tied in a chain and two more are running by themselves. First Anna and Maria kick out the two students from both ends of the chain (1 and 4), then — two other students from the chain (2 and 3). At that the students who are running by themselves will stay in the club.In the third sample Anna and Maria will momentarily kick out all students except for the fourth one and the process stops at that point. The correct answer is one.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a09cf884", "template_md5": "35d339e4", "result": "There are $n$ students and $m$ shoelaces. Each shoelace connects two different students.  \n\nA student is reprimanded if they are connected to only one other student.\n\nAnna identifies reprimanded students and Maria removes them from the club along with the shoelaces connecting them.\n\nThis process repeats until no more students can be reprimanded.\n\nDetermine the number of groups of students removed from the club. \n\n\nInput:\n\n* The first line contains two integers, $n$ and $m$, representing the number of students and shoelaces, respectively.\n* The next $m$ lines each contain two integers, $a$ and $b$, representing the two students connected by the $i$-th shoelace.\n\nOutput:\n\n* Print a single integer representing the number of groups of students removed from the club."}, {"prompt_md5": "1af6fa25", "template_md5": "465699a0", "result": "You are given a number of people and a number of connections between them.  Each connection links two people.  \n\nA person is reprimanded if they are connected to only one other person.  \n\nReprimanded people are removed from the group, along with their connections.  \n\nThis process repeats until no more people can be reprimanded.\n\nCount how many times this removal process happens."}]}