{"uid": "1294-E", "url": "https://codeforces.com/contest/1294/problem/E", "tags": ["greedy", " implementation", " math"], "title": "1294-E", "statement": "E. Obtain a Permutationtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a rectangular matrix of size $$$n \\\\times m$$$ consisting of integers from $$$1$$$ to $$$2 \\\\cdot 10^5$$$.In one move, you can:chooseany elementof the matrix and change its value toanyinteger between $$$1$$$ and $$$n \\\\cdot m$$$, inclusive;takeany columnand shift it one cell up cyclically (see the example of such cyclic shift below).A cyclic shift is an operation such that you choose some $$$j$$$ ($$$1 \\\\le j \\\\le m$$$) and set $$$a_{1, j} := a_{2, j}, a_{2, j} := a_{3, j}, \\\\dots, a_{n, j} := a_{1, j}$$$simultaneously.Example of cyclic shift of the first columnYou want to perform the minimum number of moves to make this matrix look like this:In other words, the goal is to obtain the matrix, where $$$a_{1, 1} = 1, a_{1, 2} = 2, \\\\dots, a_{1, m} = m, a_{2, 1} = m + 1, a_{2, 2} = m + 2, \\\\dots, a_{n, m} = n \\\\cdot m$$$ (i.e. $$$a_{i, j} = (i - 1) \\\\cdot m + j$$$) with theminimum number of movesperformed.InputThe first line of the input contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 2 \\\\cdot 10^5, n \\\\cdot m \\\\le 2 \\\\cdot 10^5$$$) — the size of the matrix.The next $$$n$$$ lines contain $$$m$$$ integers each. The number at the line $$$i$$$ and position $$$j$$$ is $$$a_{i, j}$$$ ($$$1 \\\\le a_{i, j} \\\\le 2 \\\\cdot 10^5$$$).OutputPrint one integer — the minimum number of moves required to obtain the matrix, where $$$a_{1, 1} = 1, a_{1, 2} = 2, \\\\dots, a_{1, m} = m, a_{2, 1} = m + 1, a_{2, 2} = m + 2, \\\\dots, a_{n, m} = n \\\\cdot m$$$ ($$$a_{i, j} = (i - 1)m + j$$$).ExamplesInput3 3 3 2 1 1 2 3 4 5 6Output6Input4 3 1 2 3 4 5 6 7 8 9 10 11 12Output0Input3 4 1 6 3 4 5 10 7 8 9 2 11 12Output2NoteIn the first example, you can set $$$a_{1, 1} := 7, a_{1, 2} := 8$$$ and $$$a_{1, 3} := 9$$$ then shift the first, the second and the third columns cyclically, so the answer is $$$6$$$. It can be shown that you cannot achieve a better answer.In the second example, the matrix is already good so the answer is $$$0$$$.In the third example, it is enough to shift the second column cyclically twice to obtain a good matrix, so the answer is $$$2$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cf3d554e", "template_md5": "35d339e4", "result": "You are given a rectangular matrix of size $n \\times m$ filled with integers from 1 to $2 \\times 10^5$. \n\nYou can perform two types of operations:\n\n1. **Change:** Choose any element in the matrix and change its value to any integer between 1 and $n \\times m$, inclusive.\n2. **Shift:** Choose any column and shift its elements one cell up cyclically. For example, if the column is:\n\n   ```\n   1\n   2\n   3\n   ```\n\n   After a cyclic shift, it becomes:\n\n   ```\n   2\n   3\n   1\n   ```\n\nYour goal is to transform the matrix so that each element is in its correct position according to the following pattern:\n\n*  $a_{1,1} = 1$, $a_{1,2} = 2$, ..., $a_{1,m} = m$\n*  $a_{2,1} = m + 1$, $a_{2,2} = m + 2$, ..., $a_{n,m} = n \\times m$\n\nFind the minimum number of operations (Change or Shift) required to achieve this transformation."}, {"prompt_md5": "8995e0ff", "template_md5": "465699a0", "result": "You are given a grid of numbers. You can change any number in the grid to any other number within a certain range. You can also shift entire columns of the grid up by one position, wrapping around to the top.  What is the fewest changes and shifts needed to make the grid look like a specific pattern?"}]}