{"uid": "1294-F", "url": "https://codeforces.com/contest/1294/problem/F", "tags": ["dfs and similar", " dp", " greedy", " trees"], "title": "1294-F", "statement": "F. Three Paths on a Treetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an unweighted tree with $$$n$$$ vertices. Recall that a tree is a connected undirected graph without cycles.Your task is to choosethree distinctvertices $$$a, b, c$$$ on this tree such that the number of edges which belong toat leastone of the simple paths between $$$a$$$ and $$$b$$$, $$$b$$$ and $$$c$$$, or $$$a$$$ and $$$c$$$ is the maximum possible. See the notes section for a better understanding.The simple path is the path that visits each vertex at most once.InputThe first line contains one integer number $$$n$$$ ($$$3 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the number of vertices in the tree.Next $$$n - 1$$$ lines describe the edges of the tree in form $$$a_i, b_i$$$ ($$$1 \\\\le a_i$$$, $$$b_i \\\\le n$$$, $$$a_i \\\\ne b_i$$$). It is guaranteed that given graph is a tree.OutputIn the first line print one integer $$$res$$$ — the maximum number of edges which belong toat leastone of the simple paths between $$$a$$$ and $$$b$$$, $$$b$$$ and $$$c$$$, or $$$a$$$ and $$$c$$$.In the second line print three integers $$$a, b, c$$$ such that $$$1 \\\\le a, b, c \\\\le n$$$ and $$$a \\\\ne, b \\\\ne c, a \\\\ne c$$$.If there are several answers, you can print any.ExampleInput8 1 2 2 3 3 4 4 5 4 6 3 7 3 8Output5 1 8 6NoteThe picture corresponding to the first example (andanother one correct answer):If you choose vertices $$$1, 5, 6$$$ then the path between $$$1$$$ and $$$5$$$ consists of edges $$$(1, 2), (2, 3), (3, 4), (4, 5)$$$, the path between $$$1$$$ and $$$6$$$ consists of edges $$$(1, 2), (2, 3), (3, 4), (4, 6)$$$ and the path between $$$5$$$ and $$$6$$$ consists of edges $$$(4, 5), (4, 6)$$$. The union of these paths is $$$(1, 2), (2, 3), (3, 4), (4, 5), (4, 6)$$$ so the answer is $$$5$$$. It can be shown that there is no better answer.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a142d6bd", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices. A tree is a connected graph with no cycles.  \n\nYour task is to find three distinct vertices $a$, $b$, and $c$ in the tree such that the maximum number of edges are used in at least one of the following paths:\n\n* Path between $a$ and $b$\n* Path between $b$ and $c$\n* Path between $a$ and $c$\n\nA path is a sequence of edges connecting two vertices, where each vertex is visited at most once.\n\nOutput the maximum number of edges used and three vertices that achieve this."}, {"prompt_md5": "6c63b49a", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes.  Find three distinct nodes such that the maximum number of edges are shared by the paths between each pair of the three nodes is as large as possible."}]}