{"uid": "1295-E", "url": "https://codeforces.com/contest/1295/problem/E", "tags": ["data structures", " divide and conquer"], "title": "1295-E", "statement": "E. Permutation Separationtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a permutation $$$p_1, p_2, \\\\dots , p_n$$$ (an array where each integer from $$$1$$$ to $$$n$$$ appears exactly once). The weight of the $$$i$$$-th element of this permutation is $$$a_i$$$.At first, you separate your permutation into twonon-emptysets — prefix and suffix. More formally, the first set contains elements $$$p_1, p_2, \\\\dots , p_k$$$, the second — $$$p_{k+1}, p_{k+2}, \\\\dots , p_n$$$, where $$$1 \\\\le k < n$$$.After that, you may move elements between sets. The operation you are allowed to do is to choose some element of the first set and move it to the second set, or vice versa (move from the second set to the first). You have to pay $$$a_i$$$ dollars to move the element $$$p_i$$$.Your goal is to make it so that each element of the first set is less than each element of the second set. Note that if one of the sets is empty, this condition is met.For example, if $$$p = [3, 1, 2]$$$ and $$$a = [7, 1, 4]$$$, then the optimal strategy is: separate $$$p$$$ into two parts $$$[3, 1]$$$ and $$$[2]$$$ and then move the $$$2$$$-element into first set (it costs $$$4$$$). And if $$$p = [3, 5, 1, 6, 2, 4]$$$, $$$a = [9, 1, 9, 9, 1, 9]$$$, then the optimal strategy is: separate $$$p$$$ into two parts $$$[3, 5, 1]$$$ and $$$[6, 2, 4]$$$, and then move the $$$2$$$-element into first set (it costs $$$1$$$), and $$$5$$$-element into second set (it also costs $$$1$$$).Calculate the minimum number of dollars you have to spend.InputThe first line contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the length of permutation.The second line contains $$$n$$$ integers $$$p_1, p_2, \\\\dots , p_n$$$ ($$$1 \\\\le p_i \\\\le n$$$). It's guaranteed that this sequence contains each element from $$$1$$$ to $$$n$$$ exactly once.The third line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots , a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$).OutputPrint one integer — the minimum number of dollars you have to spend.ExamplesInput3 3 1 2 7 1 4Output4Input4 2 4 1 3 5 9 8 3Output3Input6 3 5 1 6 2 4 9 1 9 9 1 9Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fde9fe4e", "template_md5": "35d339e4", "result": "You are given a permutation of numbers from 1 to $n$ (a sequence where each number appears exactly once). Each number has a weight associated with it.\n\nYou need to divide this permutation into two non-empty sets: a prefix and a suffix.  \n\nYou can move numbers between these sets, but it costs money to do so. The cost to move a number is equal to its weight.\n\nYour goal is to rearrange the numbers so that all numbers in the prefix set are smaller than all numbers in the suffix set.\n\nFind the minimum amount of money you need to spend to achieve this. \n\n\nInput:\n\n* The first line contains an integer $n$ (the length of the permutation).\n* The second line contains $n$ integers representing the permutation.\n* The third line contains $n$ integers representing the weights of the numbers.\n\nOutput:\n\n* Print the minimum cost to achieve the desired arrangement."}, {"prompt_md5": "6243b969", "template_md5": "465699a0", "result": "You are given a list of numbers. You need to split the list into two parts and rearrange the numbers between the parts so that all numbers in the first part are smaller than all numbers in the second part.  You pay a cost to move each number between parts. Find the minimum cost to achieve this."}]}