{"uid": "1299-D", "url": "https://codeforces.com/contest/1299/problem/D", "tags": ["bitmasks", " combinatorics", " dfs and similar", " dp", " graphs", " graphs", " math", " trees"], "title": "1299-D", "statement": "D. Around the Worldtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputGuy-Manuel and Thomas are planning $$$144$$$ trips around the world.You are given a simple weighted undirected connected graph with $$$n$$$ vertexes and $$$m$$$ edges with the following restriction: there isn't any simple cycle (i. e. a cycle which doesn't pass through any vertex more than once) of length greater than $$$3$$$ which passes through the vertex $$$1$$$. The cost of a path (not necessarily simple) in this graph is defined as theXORof weights of all edges in that path with each edge being counted as many times as the path passes through it.But the trips with cost $$$0$$$ aren't exciting.You may choose any subset of edges incident to the vertex $$$1$$$ and remove them. How many are there such subsets, that, when removed, there is not any nontrivial cycle with the cost equal to $$$0$$$ which passes through the vertex $$$1$$$ in the resulting graph? A cycle is callednontrivialif it passes through some edge odd number of times. As the answer can be very big, output it modulo $$$10^9+7$$$.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n,m \\\\le 10^5$$$) — the number of vertexes and edges in the graph. The $$$i$$$-th of the next $$$m$$$ lines contains three integers $$$a_i$$$, $$$b_i$$$ and $$$w_i$$$ ($$$1 \\\\le a_i, b_i \\\\le n, a_i \\\\neq b_i, 0 \\\\le w_i < 32$$$) — the endpoints of the $$$i$$$-th edge and its weight. It's guaranteed there aren't any multiple edges, the graph is connected and there isn't any simple cycle of length greater than $$$3$$$ which passes through the vertex $$$1$$$.OutputOutput the answer modulo $$$10^9+7$$$.ExamplesInput6 8 1 2 0 2 3 1 2 4 3 2 6 2 3 4 8 3 5 4 5 4 5 5 6 6Output2Input7 9 1 2 0 1 3 1 2 3 9 2 4 3 2 5 4 4 5 7 3 6 6 3 7 7 6 7 8Output1Input4 4 1 2 27 1 3 1 1 4 1 3 4 0Output6NoteThe pictures below represent the graphs from examples.In the first example, there aren't any nontrivial cycles with cost $$$0$$$, so we can either remove or keep the only edge incident to the vertex $$$1$$$.In the second example, if we don't remove the edge $$$1-2$$$, then there is a cycle $$$1-2-4-5-2-1$$$ with cost $$$0$$$; also if we don't remove the edge $$$1-3$$$, then there is a cycle $$$1-3-2-4-5-2-3-1$$$ of cost $$$0$$$. The only valid subset consists of both edges.In the third example, all subsets are valid except for those two in which both edges $$$1-3$$$ and $$$1-4$$$ are kept.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8248f8a8", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ vertices and $m$ edges. Each edge has a weight between 0 and 31.  There are no cycles of length greater than 3 that pass through vertex 1.\n\nThe cost of a path in the graph is the XOR of the weights of the edges in the path.  \n\nYou can remove any subset of the edges connected to vertex 1.  \n\nFind the number of subsets you can remove so that there are no nontrivial cycles (cycles that pass through some edge an odd number of times) with a cost of 0 in the remaining graph.  The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "bf366ba3", "template_md5": "465699a0", "result": "You are given a connected graph with a special vertex (vertex 1).  You can remove some edges connected to vertex 1.  Find the number of ways to remove edges so that there are no cycles in the remaining graph that pass through vertex 1 an odd number of times.  The answer should be given modulo 10^9+7."}]}