{"uid": "13-C", "url": "https://codeforces.com/contest/13/problem/C", "tags": ["dp", " sortings"], "title": "13-C", "statement": "C. Sequencetime limit per test1 secondmemory limit per test64 megabytesinputstdinoutputstdoutLittle Petya likes to play very much. And most of all he likes to play the following game:He is given a sequence ofNinteger numbers. At each step it is allowed to increase the value of any number by1or to decrease it by1. The goal of the game is to make the sequence non-decreasing with the smallest number of steps. Petya is not good at math, so he asks for your help.The sequenceais called non-decreasing ifa1≤a2≤ ... ≤aNholds, whereNis the length of the sequence.InputThe first line of the input contains single integerN(1 ≤N≤ 5000) — the length of the initial sequence. The followingNlines contain one integer each — elements of the sequence. These numbers do not exceed109by absolute value.OutputOutput one integer — minimum number of steps required to achieve the goal.ExamplesInput53 2 -1 2 11Output4Input52 1 1 1 1Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d045c091", "template_md5": "35d339e4", "result": "You are given a sequence of $N$ integers.  You can increase any number in the sequence by 1 or decrease any number by 1.  What is the minimum number of operations needed to make the sequence non-decreasing (i.e., $a_1 \\le a_2 \\le ... \\le a_N$)? \n\nInput:\n\n* The first line contains an integer $N$ (1 ≤ $N$ ≤ 5000), the length of the sequence.\n* The next $N$ lines each contain an integer, representing the elements of the sequence. Each integer is at most $10^9$ in absolute value.\n\nOutput:\n\n* Output a single integer, the minimum number of operations needed to make the sequence non-decreasing."}, {"prompt_md5": "eff45fc3", "template_md5": "465699a0", "result": "You are given a list of numbers. You can increase or decrease each number by 1. What is the fewest changes needed to make the list of numbers go from smallest to largest?"}]}