{"uid": "130-J", "url": "https://codeforces.com/contest/130/problem/J", "tags": ["*special"], "title": "130-J", "statement": "J. Date calculationtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutIn Gregorian calendar a typical year consists of365days and12months. The numbers of days in the months are:31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31. If year index is divisible by400, or divisible by4but not by100, the year becomes leap year, with one extra day in the second month (the one which typically has28days).You are given the index of the year and the index of the day in the year. Find out the date of this day (day and month it will fall upon).InputThe first line of input contains the year index, between1600and2400, inclusive. The second line contains the day index, between1and366, inclusive. It is guaranteed that the day index will be valid for this year, i.e., day366will occur only in a leap year.OutputOutput the index of the day and the index of the month, separated with a space.ExamplesInput2011324Output20 11Input2012274Output30 9NoteAll indexes are1-based.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5cbeae2b", "template_md5": "35d339e4", "result": "You are given a year between 1600 and 2400 and a day number between 1 and 366.  Determine the month and day of the year that corresponds to this day number.\n\nHere's how to determine if a year is a leap year:\n\n* If the year is divisible by 400, it is a leap year.\n* If the year is divisible by 4 but not by 100, it is a leap year.\n* Otherwise, it is not a leap year.\n\nLeap years have 366 days, with an extra day in February. \n\n\nThe months have the following number of days:\n\n* January: 31\n* February: 28 (29 in a leap year)\n* March: 31\n* April: 30\n* May: 31\n* June: 30\n* July: 31\n* August: 31\n* September: 30\n* October: 31\n* November: 30\n* December: 31"}, {"prompt_md5": "0556e012", "template_md5": "465699a0", "result": "Given a year and a day number within that year, determine the corresponding month and day of the year."}]}