{"uid": "1303-D", "url": "https://codeforces.com/contest/1303/problem/D", "tags": ["bitmasks", " greedy"], "title": "1303-D", "statement": "D. Fill The Bagtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have a bag of size $$$n$$$. Also you have $$$m$$$ boxes. The size of $$$i$$$-th box is $$$a_i$$$, where each $$$a_i$$$ is an integer non-negative power of two.You can divide boxes into two parts of equal size. Your goal is to fill the bag completely.For example, if $$$n = 10$$$ and $$$a = [1, 1, 32]$$$ then you have to divide the box of size $$$32$$$ into two parts of size $$$16$$$, and then divide the box of size $$$16$$$. So you can fill the bag with boxes of size $$$1$$$, $$$1$$$ and $$$8$$$.Calculate the minimum number of divisions required to fill the bag of size $$$n$$$.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 10^{18}, 1 \\\\le m \\\\le 10^5$$$) — the size of bag and the number of boxes, respectively.The second line of each test case contains $$$m$$$ integers $$$a_1, a_2, \\\\dots , a_m$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — the sizes of boxes. It is guaranteed that each $$$a_i$$$ is a power of two.It is also guaranteed that sum of all $$$m$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case print one integer — the minimum number of divisions required to fill the bag of size $$$n$$$ (or $$$-1$$$, if it is impossible).ExampleInput3 10 3 1 32 1 23 4 16 1 4 1 20 5 2 1 16 1 8Output2 -1 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1186c60a", "template_md5": "35d339e4", "result": "You have a bag with a size of $n$. You also have $m$ boxes, where the size of the $i$-th box is $a_i$, and each $a_i$ is a power of 2.\n\nYou want to divide the boxes into two equal groups. Your goal is to fill the bag completely using boxes from these groups.\n\nFor example, if $n = 10$ and $a = [1, 1, 32]$, you would divide the box of size 32 into two parts of size 16, and then divide the box of size 16. This allows you to fill the bag with boxes of size 1, 1, and 8.\n\nFind the minimum number of divisions needed to fill the bag of size $n$. If it's impossible, output -1. \n\n\nInput:\n\n* The first line contains $t$ (the number of test cases).\n* For each test case:\n    * The first line contains $n$ and $m$ (the bag size and the number of boxes).\n    * The second line contains $m$ integers $a_1, a_2, ..., a_m$ (the sizes of the boxes).\n\nOutput:\n\n* For each test case, print the minimum number of divisions needed. If it's impossible, print -1."}, {"prompt_md5": "4ed0b03c", "template_md5": "465699a0", "result": "You have a bag of a certain size and a set of boxes, each with a size that is a power of two.  You need to divide the boxes into groups of equal size to fill the bag completely. Find the fewest divisions needed to do this. If it's impossible, say so."}]}