{"uid": "1303-C", "url": "https://codeforces.com/contest/1303/problem/C", "tags": ["dfs and similar", " greedy", " implementation"], "title": "1303-C", "statement": "C. Perfect Keyboardtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp wants to assemble his own keyboard. Layouts with multiple rows are too complicated for him — his keyboard will consist of only one row, where all $$$26$$$ lowercase Latin letters will be arranged in some order.Polycarp uses the same password $$$s$$$ on all websites where he is registered (it is bad, but he doesn't care). He wants to assemble a keyboard that will allow to type this password very easily. He doesn't like to move his fingers while typing the password, so, for each pair of adjacent characters in $$$s$$$, they should be adjacent on the keyboard. For example, if the password isabacaba, then the layoutcabdefghi...is perfect, since charactersaandcare adjacent on the keyboard, andaandbare adjacent on the keyboard. It is guaranteed that there are no two adjacent equal characters in $$$s$$$, so, for example, the password cannot bepassword(two characterssare adjacent).Can you help Polycarp with choosing the perfect layout of the keyboard, if it is possible?InputThe first line contains one integer $$$T$$$ ($$$1 \\\\le T \\\\le 1000$$$) — the number of test cases.Then $$$T$$$ lines follow, each containing one string $$$s$$$ ($$$1 \\\\le |s| \\\\le 200$$$) representing the test case. $$$s$$$ consists of lowercase Latin letters only. There are no two adjacent equal characters in $$$s$$$.OutputFor each test case, do the following:if it is impossible to assemble a perfect keyboard, printNO(in upper case,it matters in this problem);otherwise, printYES(in upper case), and then a string consisting of $$$26$$$ lowercase Latin letters — the perfect layout. Each Latin letter should appear in this string exactly once. If there are multiple answers, print any of them.ExampleInput5 ababa codedoca abcda zxzytyz abcdefghijklmnopqrstuvwxyzaOutputYES bacdefghijklmnopqrstuvwxyz YES edocabfghijklmnpqrstuvwxyz NO YES xzytabcdefghijklmnopqrsuvw NO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "79a49b9b", "template_md5": "35d339e4", "result": "You are given a string $s$ consisting of lowercase English letters.  You need to determine if it is possible to arrange the 26 lowercase English letters in a single row such that the relative order of adjacent letters in the string $s$ is preserved in the arrangement. \n\nIf such an arrangement is possible, output \"YES\" followed by the arrangement. Otherwise, output \"NO\". \n\n**Constraints:**\n\n* $1 \\le T \\le 1000$ (number of test cases)\n* $1 \\le |s| \\le 200$ (length of the string)\n* There are no two adjacent equal characters in $s$."}, {"prompt_md5": "4a826f90", "template_md5": "465699a0", "result": "Given a string of unique lowercase letters, determine if it's possible to arrange 26 letters in a linear order so that adjacent letters in the string are also adjacent in the arrangement. If possible, output \"YES\" followed by the arrangement. Otherwise, output \"NO\"."}]}