{"uid": "1304-B", "url": "https://codeforces.com/contest/1304/problem/B", "tags": ["brute force", " constructive algorithms", " greedy", " implementation", " strings"], "title": "1304-B", "statement": "B. Longest Palindrometime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputReturning back to problem solving, Gildong is now studying about palindromes. He learned that apalindromeis a string that is the same as its reverse. For example, strings \"pop\", \"noon\", \"x\", and \"kkkkkk\" are palindromes, while strings \"moon\", \"tv\", and \"abab\" are not.An empty string is also a palindrome.Gildong loves this concept so much, so he wants to play with it. He has $$$n$$$distinctstrings of equal length $$$m$$$. He wants to discard some of the strings (possibly none or all) and reorder the remaining strings so that the concatenation becomes a palindrome. He also wants the palindrome to be as long as possible. Please help him find one.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 100$$$, $$$1 \\\\le m \\\\le 50$$$) — the number of strings and the length of each string.Next $$$n$$$ lines contain a string of length $$$m$$$ each, consisting of lowercase Latin letters only. All strings aredistinct.OutputIn the first line, print the length of the longest palindrome string you made.In the second line, print that palindrome. If there are multiple answers, print any one of them. If the palindrome is empty, print an empty line or don't print this line at all.ExamplesInput3 3 tab one batOutput6 tabbatInput4 2 oo ox xo xxOutput6 oxxxxoInput3 5 hello codef orcesOutput0Input9 4 abab baba abcd bcde cdef defg wxyz zyxw ijjiOutput20 ababwxyzijjizyxwbabaNoteIn the first example, \"battab\" is also a valid answer.In the second example, there can be 4 different valid answers including the sample output. We are not going to provide any hints for what the others are.In the third example, the empty string is the only valid palindrome string.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f121be3b", "template_md5": "35d339e4", "result": "You are given $n$ distinct strings, each of length $m$.  You can choose some or all of these strings and rearrange them to form a palindrome (a string that reads the same backward as forward).  Find the length of the longest possible palindrome you can create in this way. If no palindrome can be formed, output 0. \n\n\nIf a palindrome can be formed, output its length followed by the string itself."}, {"prompt_md5": "947ea547", "template_md5": "465699a0", "result": "You are given a set of words of equal length.  You can choose some or all of the words and rearrange them to form the longest possible palindrome. Output the length of the longest palindrome and the palindrome itself.  If no palindrome can be formed, output 0."}]}