{"uid": "131-A", "url": "https://codeforces.com/contest/131/problem/A", "tags": ["implementation", " strings"], "title": "131-A", "statement": "A. cAPS lOCKtime limit per test0.5 secondmemory limit per test256 megabytesinputstdinoutputstdoutwHAT DO WE NEED cAPS LOCK FOR?Caps lock is a computer keyboard key. Pressing it sets an input mode in which typed letters are capital by default. If it is pressed by accident, it leads to accidents like the one we had in the first passage.Let's consider that a word has been typed with the Caps lock key accidentally switched on, if:either it only contains uppercase letters;or all letters except for the first one are uppercase.In this case we should automatically change the case of all letters. For example, the case of the letters that form words \"hELLO\", \"HTTP\", \"z\" should be changed.Write a program that applies the rule mentioned above. If the rule cannot be applied, the program should leave the word unchanged.InputThe first line of the input data contains a word consisting of uppercase and lowercase Latin letters. The word's length is from 1 to 100 characters, inclusive.OutputPrint the result of the given word's processing.ExamplesInputcAPSOutputCapsInputLockOutputLock", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2f6f501", "template_md5": "465699a0", "result": "Given a word, determine if it should be changed to have consistent capitalization. \n\nA word should be changed if:\n\n* It only contains uppercase letters.\n* It contains all uppercase letters except for the first one.\n\nIf the word doesn't meet these conditions, leave it unchanged."}, {"prompt_md5": "cacf956a", "template_md5": "35d339e4", "result": "You are given a word consisting of uppercase and lowercase English letters.  \n\nDetermine if the word should be changed to have consistent capitalization based on these rules:\n\n* **Rule 1:** If all letters in the word are uppercase.\n* **Rule 2:** If all letters except the first letter are uppercase.\n\nIf either rule applies, change the case of all letters in the word. Otherwise, leave the word unchanged.\n\nPrint the resulting word. \n\n\n**Examples:**\n\n* Input: `cAPS`  Output: `Caps`\n* Input: `Lock` Output: `Lock`"}]}