{"uid": "1310-A", "url": "https://codeforces.com/contest/1310/problem/A", "tags": ["data structures", " greedy", " sortings"], "title": "1310-A", "statement": "A. Recommendationstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputVK news recommendation system daily selects interesting publications of one of $$$n$$$ disjoint categories for each user. Each publication belongs to exactly one category. For each category $$$i$$$ batch algorithm selects $$$a_i$$$ publications.The latest A/B test suggests that users are reading recommended publications more actively if each category has a different number of publications within daily recommendations. The targeted algorithm can find a single interesting publication of $$$i$$$-th category within $$$t_i$$$ seconds.What is the minimum total time necessary to add publications to the result of batch algorithm execution, so all categories have a different number of publications? You can't remove publications recommended by the batch algorithm.InputThe first line of input consists of single integer $$$n$$$ — the number of news categories ($$$1 \\\\le n \\\\le 200\\\\,000$$$).The second line of input consists of $$$n$$$ integers $$$a_i$$$ — the number of publications of $$$i$$$-th category selected by the batch algorithm ($$$1 \\\\le a_i \\\\le 10^9$$$).The third line of input consists of $$$n$$$ integers $$$t_i$$$ — time it takes for targeted algorithm to find one new publication of category $$$i$$$ ($$$1 \\\\le t_i \\\\le 10^5)$$$.OutputPrint one integer — the minimal required time for the targeted algorithm to get rid of categories with the same size.ExamplesInput5 3 7 9 7 8 5 2 5 7 5Output6Input5 1 2 3 4 5 1 1 1 1 1Output0NoteIn the first example, it is possible to find three publications of the second type, which will take 6 seconds.In the second example, all news categories contain a different number of publications.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9ae1b74f", "template_md5": "35d339e4", "result": "There are $n$ news categories. For each category $i$, a batch algorithm has already selected $a_i$ publications.  A separate algorithm can find one new publication of category $i$ in $t_i$ seconds.\n\nThe goal is to find the minimum time it takes to add new publications to each category so that each category has a different number of publications. You cannot remove any publications already selected by the batch algorithm. \n\nInput:\n\n* The first line contains $n$.\n* The second line contains $a_1, a_2, ..., a_n$.\n* The third line contains $t_1, t_2, ..., t_n$.\n\nOutput:\n\n* The minimum time required."}, {"prompt_md5": "c9653996", "template_md5": "465699a0", "result": "You have several categories of items. Each category has a certain number of items already selected. You need to add more items to some categories so that each category has a unique number of items.  You can add one item to a category in a specific amount of time. What is the minimum total time needed to add items to all categories?"}]}