{"uid": "1311-E", "url": "https://codeforces.com/contest/1311/problem/E", "tags": ["brute force", " constructive algorithms", " trees"], "title": "1311-E", "statement": "E. Construct the Binary Treetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two integers $$$n$$$ and $$$d$$$. You need to construct a rooted binary tree consisting of $$$n$$$ vertices with a root at the vertex $$$1$$$ and the sum of depths of all vertices equals to $$$d$$$.A tree is a connected graph without cycles. A rooted tree has a special vertex called the root. A parent of a vertex $$$v$$$ is the last different from $$$v$$$ vertex on the path from the root to the vertex $$$v$$$. The depth of the vertex $$$v$$$ is the length of the path from the root to the vertex $$$v$$$. Children of vertex $$$v$$$ are all vertices for which $$$v$$$ is the parent. The binary tree is such a tree that no vertex has more than $$$2$$$ children.You have to answer $$$t$$$ independent test cases.InputThe first line of the input contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.The only line of each test case contains two integers $$$n$$$ and $$$d$$$ ($$$2 \\\\le n, d \\\\le 5000$$$) — the number of vertices in the tree and the required sum of depths of all vertices.It is guaranteed that the sum of $$$n$$$ and the sum of $$$d$$$ both does not exceed $$$5000$$$ ($$$\\\\sum n \\\\le 5000, \\\\sum d \\\\le 5000$$$).OutputFor each test case, print the answer.If it is impossible to construct such a tree, print \"NO\" (without quotes) in the first line. Otherwise, print \"{YES}\" in the first line. Then print $$$n-1$$$ integers $$$p_2, p_3, \\\\dots, p_n$$$ in the second line, where $$$p_i$$$ is the parent of the vertex $$$i$$$. Note that the sequence of parents you print should describe some binary tree.ExampleInput3 5 7 10 19 10 18OutputYES 1 2 1 3  YES 1 2 3 3 9 9 2 1 6  NONotePictures corresponding to the first and the second test cases of the example:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac9aac39", "template_md5": "35d339e4", "result": "You are given two numbers, $n$ and $d$. You need to create a tree with $n$ nodes, where:\n\n* The tree has a single root node (node 1).\n* The sum of the depths of all nodes in the tree is equal to $d$.\n\nA tree is a connected graph with no cycles. The depth of a node is the number of edges on the path from the root to that node.\n\n**Output:**\n\n* If it's impossible to create such a tree, print \"NO\".\n* If it's possible, print \"YES\" followed by $n-1$ numbers. Each number represents the parent of a node (except for the root node, which has no parent). \n\n\n\nLet me know if you'd like help understanding any part of the problem!"}, {"prompt_md5": "b9863d35", "template_md5": "465699a0", "result": "You are given a number of nodes and a target depth.  You need to build a tree with those nodes where the total depth of all nodes equals the target depth.  If it's impossible, say \"NO\". Otherwise, list the parent of each node (except the root, which has no parent)."}]}