{"uid": "1311-A", "url": "https://codeforces.com/contest/1311/problem/A", "tags": ["greedy", " implementation", " math"], "title": "1311-A", "statement": "A. Add Odd or Subtract Eventime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two positive integers $$$a$$$ and $$$b$$$.In one move, you canchange$$$a$$$ in the following way:Choose any positiveoddinteger $$$x$$$ ($$$x > 0$$$) and replace $$$a$$$ with $$$a+x$$$;choose any positiveeveninteger $$$y$$$ ($$$y > 0$$$) and replace $$$a$$$ with $$$a-y$$$.You can perform as many such operations as you want. You can choose the same numbers $$$x$$$ and $$$y$$$ in different moves.Your task is to find the minimum number of moves required to obtain $$$b$$$ from $$$a$$$. It is guaranteed that you can always obtain $$$b$$$ from $$$a$$$.You have to answer $$$t$$$ independent test cases.InputThe first line of the input contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Then $$$t$$$ test cases follow. Each test case is given as two space-separated integers $$$a$$$ and $$$b$$$ ($$$1 \\\\le a, b \\\\le 10^9$$$).OutputFor each test case, print the answer — the minimum number of moves required to obtain $$$b$$$ from $$$a$$$ if you can perform any number of moves described in the problem statement. It is guaranteed that you can always obtain $$$b$$$ from $$$a$$$.ExampleInput5 2 3 10 10 2 4 7 4 9 3Output1 0 2 2 1NoteIn the first test case, you can just add $$$1$$$.In the second test case, you don't need to do anything.In the third test case, you can add $$$1$$$ two times.In the fourth test case, you can subtract $$$4$$$ and add $$$1$$$.In the fifth test case, you can just subtract $$$6$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9a7ef71e", "template_md5": "35d339e4", "result": "You are given two positive integers $a$ and $b$. You can change $a$ by:\n\n* Adding any positive odd integer $x$ to $a$\n* Subtracting any positive even integer $y$ from $a$\n\nYou can do these operations any number of times.\n\nFind the fewest number of operations needed to change $a$ to $b$. \n\nYou will be given multiple pairs of $a$ and $b$ to solve."}, {"prompt_md5": "c22cc914", "template_md5": "465699a0", "result": "You have two numbers. You can increase the first number by an odd number or decrease it by an even number. Find the fewest times you need to do this to make the first number equal to the second number."}]}