{"uid": "1312-A", "url": "https://codeforces.com/contest/1312/problem/A", "tags": ["geometry", " greedy", " math", " number theory"], "title": "1312-A", "statement": "A. Two Regular Polygonstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two integers $$$n$$$ and $$$m$$$ ($$$m < n$$$). Consider aconvexregular polygon of $$$n$$$ vertices. Recall that a regular polygon is a polygon that is equiangular (all angles are equal in measure) and equilateral (all sides have the same length).Examples of convex regular polygonsYour task is to say if it is possible to build anotherconvexregular polygon with $$$m$$$ vertices such that its center coincides with the center of the initial polygon and each of its vertices is some vertex of the initial polygon.You have to answer $$$t$$$ independent test cases.InputThe first line of the input contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The next $$$t$$$ lines describe test cases. Each test case is given as two space-separated integers $$$n$$$ and $$$m$$$ ($$$3 \\\\le m < n \\\\le 100$$$) — the number of vertices in the initial polygon and the number of vertices in the polygon you want to build.OutputFor each test case, print the answer — \"YES\" (without quotes), if it is possible to build anotherconvexregular polygon with $$$m$$$ vertices such that its center coincides with the center of the initial polygon and each of its vertices is some vertex of the initial polygon and \"NO\" otherwise.ExampleInput2 6 3 7 3OutputYES NONoteThe first test case of the exampleIt can be shown that the answer for the second test case of the example is \"NO\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0f4dfc4a", "template_md5": "35d339e4", "result": "You are given two numbers,  $n$ and $m$ ($m < n$).  \n\nA regular polygon has $n$ sides and all sides are equal in length and all angles are equal.\n\nDetermine if it is possible to create another regular polygon with $m$ sides, where:\n\n* The center of this new polygon is the same as the center of the original polygon with $n$ sides.\n* Each vertex of the new polygon is a vertex of the original polygon.\n\nYou will be given multiple test cases, each with a pair of numbers $n$ and $m$. For each test case, answer \"YES\" if it's possible to create the new polygon, and \"NO\" if it's not possible."}, {"prompt_md5": "e3b19235", "template_md5": "465699a0", "result": "You are given two numbers,  'n' and 'm' (where 'm' is smaller than 'n').  You have a shape with 'n' sides. Can you make a smaller shape with 'm' sides using only the corners of the bigger shape?  You have to answer this question for multiple sets of 'n' and 'm'."}]}