{"uid": "1323-A", "url": "https://codeforces.com/contest/1323/problem/A", "tags": ["brute force", " dp", " greedy", " implementation"], "title": "1323-A", "statement": "A. Even Subset Sum Problemtime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given an array $$$a$$$ consisting of $$$n$$$ positive integers. Find anon-emptysubset of its elements such that their sum iseven(i.e. divisible by $$$2$$$) or determine that there is no such subset.Both the given array and required subset may contain equal values.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$), number of test cases to solve. Descriptions of $$$t$$$ test cases follow.A description of each test case consists of two lines. The first line contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 100$$$), length of array $$$a$$$.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\leq a_i \\\\leq 100$$$), elements of $$$a$$$. The given array $$$a$$$ can contain equal values (duplicates).OutputFor each test case output $$$-1$$$ if there is no such subset of elements. Otherwise output positive integer $$$k$$$, number of elements in the required subset. Then output $$$k$$$ distinct integers ($$$1 \\\\leq p_i \\\\leq n$$$), indexes of the chosen elements. If there are multiple solutions output any of them.ExampleInput3 3 1 4 3 1 15 2 3 5Output1 2 -1 2 1 2NoteThere are three test cases in the example.In the first test case, you can choose the subset consisting of only the second element. Its sum is $$$4$$$ and it is even.In the second test case, there is only one non-empty subset of elements consisting of the first element, however sum in it is odd, so there is no solution.In the third test case, the subset consisting of all array's elements has even sum.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "28c6d203", "template_md5": "35d339e4", "result": "You are given an array of positive integers. Find a subset of the array where the sum of the numbers in the subset is even. If no such subset exists, output -1. \n\nIf a subset with an even sum exists, output the number of elements in the subset, followed by the indices of those elements. \n\n\n**Input:**\n\n* The first line contains the number of test cases,  *t*.\n* For each test case:\n    * The first line contains the length of the array, *n*.\n    * The second line contains *n* integers, the elements of the array.\n\n**Output:**\n\n* For each test case:\n    * If no subset with an even sum exists, output -1.\n    * Otherwise, output the number of elements in the subset, followed by the indices of those elements."}, {"prompt_md5": "ce09abd5", "template_md5": "465699a0", "result": "You are given a list of numbers. Find a group of numbers from the list that add up to an even number. If no such group exists, say so."}]}