{"uid": "1325-E", "url": "https://codeforces.com/contest/1325/problem/E", "tags": ["brute force", " dfs and similar", " graphs", " number theory", " shortest paths"], "title": "1325-E", "statement": "E. Ehab's REAL Number Theory Problemtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array $$$a$$$ of length $$$n$$$ that has a special condition: every element in this array has at most 7 divisors. Find the length of the shortest non-empty subsequence of this array product of whose elements is a perfect square.A sequence $$$a$$$ is a subsequence of an array $$$b$$$ if $$$a$$$ can be obtained from $$$b$$$ by deletion of several (possibly, zero or all) elements.InputThe first line contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$) — the length of $$$a$$$.The second line contains $$$n$$$ integers $$$a_1$$$, $$$a_2$$$, $$$\\\\ldots$$$, $$$a_{n}$$$ ($$$1 \\\\le a_i \\\\le 10^6$$$) — the elements of the array $$$a$$$.OutputOutput the length of the shortest non-empty subsequence of $$$a$$$ product of whose elements is a perfect square. If there are several shortest subsequences, you can find any of them. If there's no such subsequence, print \"-1\".ExamplesInput3 1 4 6Output1Input4 2 3 6 6Output2Input3 6 15 10Output3Input4 2 3 5 7Output-1NoteIn the first sample, you can choose a subsequence $$$[1]$$$.In the second sample, you can choose a subsequence $$$[6, 6]$$$.In the third sample, you can choose a subsequence $$$[6, 15, 10]$$$.In the fourth sample, there is no such subsequence.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e380b6e", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers ($1 \\le n \\le 10^5$). Each number in the array has at most 7 divisors.  Find the shortest subsequence (a sequence of numbers taken from the array, not necessarily consecutive) where the product of the numbers in the subsequence is a perfect square. If no such subsequence exists, output -1. \n\nThe input will be:\n\n* The first line contains the integer $n$.\n* The second line contains $n$ integers, the elements of the array.\n\nThe output should be:\n\n* The length of the shortest subsequence whose product is a perfect square."}, {"prompt_md5": "3f2e7d10", "template_md5": "465699a0", "result": "You are given a list of numbers.  Find the shortest list within the original list where the product of all the numbers in the shorter list is a perfect square. If no such list exists, output -1."}]}