{"uid": "1326-D1", "url": "https://codeforces.com/contest/1326/problem/D1", "tags": ["hashing", " string suffix structures", " strings"], "title": "1326-D1", "statement": "D1. Prefix-Suffix Palindrome (Easy version)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is the easy version of the problem. The difference is the constraint on the sum of lengths of strings and the number of test cases. You can make hacks only if you solve all versions of this task.You are given a string $$$s$$$, consisting of lowercase English letters. Find the longest string, $$$t$$$, which satisfies the following conditions:The length of $$$t$$$ does not exceed the length of $$$s$$$.$$$t$$$ is a palindrome.There exists two strings $$$a$$$ and $$$b$$$ (possibly empty), such that $$$t = a + b$$$ ( \"$$$+$$$\" represents concatenation), and $$$a$$$ is prefix of $$$s$$$ while $$$b$$$ is suffix of $$$s$$$.InputThe input consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 1000$$$), the number of test cases. The next $$$t$$$ lines each describe a test case.Each test case is a non-empty string $$$s$$$, consisting of lowercase English letters.It is guaranteed that the sum of lengths of strings over all test cases does not exceed $$$5000$$$.OutputFor each test case, print the longest string which satisfies the conditions described above. If there exists multiple possible solutions, print any of them.ExampleInput5 a abcdfdcecba abbaxyzyx codeforces acbbaOutputa abcdfdcba xyzyx c abbaNoteIn the first test, the string $$$s = $$$\"a\" satisfies all conditions.In the second test, the string \"abcdfdcba\" satisfies all conditions, because:Its length is $$$9$$$, which does not exceed the length of the string $$$s$$$, which equals $$$11$$$.It is a palindrome.\"abcdfdcba\" $$$=$$$ \"abcdfdc\" $$$+$$$ \"ba\", and \"abcdfdc\" is a prefix of $$$s$$$ while \"ba\" is a suffix of $$$s$$$.It can be proven that there does not exist a longer string which satisfies the conditions.In the fourth test, the string \"c\" is correct, because \"c\" $$$=$$$ \"c\" $$$+$$$ \"\" and $$$a$$$ or $$$b$$$ can be empty. The other possible solution for this test is \"s\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8fafbeb2", "template_md5": "465699a0", "result": "Given a string, find the longest palindromic substring that can be split into two parts, where the first part is a prefix of the original string and the second part is a suffix of the original string."}, {"prompt_md5": "71152110", "template_md5": "35d339e4", "result": "You are given a string $s$. Find the longest palindromic substring $t$ of $s$ that can be split into two parts, $a$ and $b$, where $a$ is a prefix of $s$ and $b$ is a suffix of $s$. \n\nPrint the longest such $t$. If there are multiple solutions, print any one."}]}