{"uid": "133-B", "url": "https://codeforces.com/contest/133/problem/B", "tags": ["implementation"], "title": "133-B", "statement": "B. Unarytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutUnary is a minimalistic Brainfuck dialect in which programs are written using only one token.Brainfuck programs use 8 commands: \"+\", \"-\", \"[\", \"]\", \"<\", \">\", \".\" and \",\" (their meaning is not important for the purposes of this problem). Unary programs are created from Brainfuck programs using the following algorithm. First, replace each command with a corresponding binary code, using the following conversion table:\">\"→1000,\"<\"→1001,\"+\"→1010,\"-\"→1011,\".\"→1100,\",\"→1101,\"[\"→1110,\"]\"→1111.Next, concatenate the resulting binary codes into one binary number in the same order as in the program. Finally, write this number using unary numeral system — this is the Unary program equivalent to the original Brainfuck one.You are given a Brainfuck program. Your task is to calculate the size of the equivalent Unary program, and print it modulo1000003(106+ 3).InputThe input will consist of a single linepwhich gives a Brainfuck program. Stringpwill contain between 1 and 100 characters, inclusive. Each character ofpwill be \"+\", \"-\", \"[\", \"]\", \"<\", \">\", \".\" or \",\".OutputOutput the size of the equivalent Unary program modulo1000003(106+ 3).ExamplesInput,.Output220Input++++[>,.<-]Output61425NoteTo write a numbernin unary numeral system, one simply has to write 1ntimes. For example, 5 written in unary system will be 11111.In the first example replacing Brainfuck commands with binary code will give us 1101 1100. After we concatenate the codes, we'll get 11011100 in binary system, or 220 in decimal. That's exactly the number of tokens in the equivalent Unary program.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b2b9d476", "template_md5": "35d339e4", "result": "You are given a Brainfuck program.  \n\nBrainfuck programs use these commands:\n\n* `>`\n* `<`\n* `+`\n* `-`\n* `[`\n* `]`\n* `.`\n* `,`\n\nEach command is converted to a 4-bit binary code:\n\n* `>` → 1000\n* `<` → 1001\n* `+` → 1010\n* `-` → 1011\n* `.` → 1100\n* `,` → 1101\n* `[` → 1110\n* `]` → 1111\n\n1. Convert the Brainfuck program to binary by replacing each command with its corresponding code.\n2. Concatenate the binary codes together.\n3. Convert the resulting binary number to unary notation (writing a '1' for each digit).\n\nYour task is to determine the length of the resulting unary program and output it modulo 1000003."}, {"prompt_md5": "7584169c", "template_md5": "465699a0", "result": "You are given a code written in a simplified language.  Convert this code into a different representation using a specific set of rules.  The output is the length of the new representation."}]}