{"uid": "1333-A", "url": "https://codeforces.com/contest/1333/problem/A", "tags": ["constructive algorithms"], "title": "1333-A", "statement": "A. Little Artemtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYoung boy Artem tries to paint a picture, and he asks his mother Medina to help him. Medina is very busy, that's why she asked for your help.Artem wants to paint an $$$n \\\\times m$$$ board. Each cell of the board should be colored in white or black.Lets $$$B$$$ be the number of black cells that have at least one white neighbor adjacent by the side. Let $$$W$$$ be the number of white cells that have at least one black neighbor adjacent by the side. A coloring is calledgoodif $$$B = W + 1$$$.The first coloring shown below has $$$B=5$$$ and $$$W=4$$$ (all cells have at least one neighbor with the opposite color). However, the second coloring is notgoodas it has $$$B=4$$$, $$$W=4$$$ (only the bottom right cell doesn't have a neighbor with the opposite color).Please, help Medina to find anygoodcoloring. It's guaranteed that under given constraints the solution always exists. If there are several solutions, output any of them.InputEach test contains multiple test cases.The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 20$$$). Each of the next $$$t$$$ lines contains two integers $$$n, m$$$ ($$$2 \\\\le n,m \\\\le 100$$$) — the number of rows and the number of columns in the grid.OutputFor each test case print $$$n$$$ lines, each of length $$$m$$$, where $$$i$$$-th line is the $$$i$$$-th row of your colored matrix (cell labeled with'B'means that the cell is black, and'W'means white). Do not use quotes.It's guaranteed that under given constraints the solution always exists.ExampleInput2 3 2 3 3OutputBW WB BB BWB BWW BWBNoteIn the first testcase, $$$B=3$$$, $$$W=2$$$.In the second testcase, $$$B=5$$$, $$$W=4$$$. You can see the coloring in the statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f07aad43", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$. You need to color each cell of the grid either black (B) or white (W).  \n\nA coloring is considered \"good\" if the number of black cells with at least one white neighbor is equal to the number of white cells with at least one black neighbor plus 1.\n\nFind any \"good\" coloring of the grid.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* Each of the next $t$ lines contains two integers, $n$ and $m$, representing the number of rows and columns in the grid.\n\n**Output:**\n\nFor each test case, print $n$ lines, each of length $m$, representing the colored grid. Use 'B' for black and 'W' for white."}, {"prompt_md5": "459f96c4", "template_md5": "465699a0", "result": "You are given a grid of a certain size. You need to color each cell either black or white.  The goal is to find a coloring where the number of black cells with at least one white neighbor is one more than the number of white cells with at least one black neighbor."}]}