{"uid": "1333-E", "url": "https://codeforces.com/contest/1333/problem/E", "tags": ["brute force", " constructive algorithms"], "title": "1333-E", "statement": "E. Road to 1600time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputEgor wants to achieve a rating of 1600 points on the well-known chess portal ChessForces and he needs your help!Before you start solving the problem, Egor wants to remind you how the chess pieces move. Chessrookmoves along straight lines up and down, left and right, as many squares as it wants. And when it wants, it can stop. Thequeenwalks in all directions vertically and diagonally at any distance. You can see the examples below.To reach the goal, Egor should research the next topic:There is an $$$N \\\\times N$$$ board. Each cell of the board has a number from $$$1$$$ to $$$N ^ 2$$$ in it and numbers in all cells are distinct.In the beginning, some chess figure stands in the cell with the number $$$1$$$. Note that this cell is already considered as visited. After that every move is determined by the following rules:Among allnot visitedyet cells to which the figure can get in one move, it goes to the cell that hasminimalnumber.If all accessible cells were already visited and some cells are not yet visited, then the figure is teleported to the not visited cell that has minimal number. If this step happens, the piece pays a fee of $$$1$$$vun.If all cells are already visited, the process is stopped.Egor should find an $$$N \\\\times N$$$ board on which the rook paysstrictly less vunsthan the queen during the round with this numbering. Help him to find such $$$N \\\\times N$$$ numbered board, or tell that it doesn't exist.InputThe only line contains one integer $$$N$$$  — the size of the board, $$$1\\\\le N \\\\le 500$$$.OutputThe output should contain $$$N$$$ lines.In $$$i$$$-th line output $$$N$$$ numbers  — numbers on the $$$i$$$-th row of the board. All numbers from $$$1$$$ to $$$N \\\\times N$$$ must be used exactly once.On your board rook must pay strictly less vuns than the queen.If there are no solutions, print $$$-1$$$.If there are several solutions, you can output any of them.ExamplesInput1Output-1Input4Output4 3 6 12  7 5 9 15  14 1 11 10  13 8 16 2NoteIn case we have $$$1 \\\\times 1$$$ board, both rook and queen do not have a chance to pay fees.In second samplerookgoes through cells $$$1 \\\\to 3 \\\\to 4 \\\\to 6 \\\\to 9 \\\\to 5 \\\\to 7 \\\\to 13 \\\\to 2 \\\\to 8 \\\\to 16 \\\\to 11 \\\\to 10 \\\\to 12 \\\\to 15 \\\\to \\\\textbf{(1 vun)} \\\\to 14$$$.Queengoes through $$$1 \\\\to 3 \\\\to 4 \\\\to 2 \\\\to 5 \\\\to 6 \\\\to 9 \\\\to 7 \\\\to 13 \\\\to 8 \\\\to 11 \\\\to 10 \\\\to 12 \\\\to 15 \\\\to \\\\textbf{(1 vun)} \\\\to 14 \\\\to \\\\textbf{(1 vun)} \\\\to 16$$$.As a result rook pays 1 vun and queen pays 2 vuns.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "46244fa7", "template_md5": "35d339e4", "result": "You are given a square board of size $N x N$. Each cell on the board contains a unique number from 1 to $N^2$. \n\nA piece starts at the cell with the number 1.  The piece can move to any adjacent cell (up, down, left, right) that has not been visited yet.  \n\nThe piece always moves to the cell with the smallest number among the unvisited adjacent cells.\n\nIf there are no unvisited adjacent cells, the piece is teleported to the unvisited cell with the smallest number, and a fee of 1 is charged.\n\nThis process continues until all cells have been visited.\n\n**The Problem:**\n\nFind a valid arrangement of numbers on the board such that a rook (which can only move horizontally or vertically) pays strictly fewer fees than a queen (which can move horizontally, vertically, or diagonally) during this process.\n\nIf no such arrangement exists, output -1."}, {"prompt_md5": "34f93cf8", "template_md5": "465699a0", "result": "You are given a square board with numbers from 1 to N² in each cell. A piece starts at cell 1.  The piece moves to the unvisited cell with the smallest number. If all reachable cells are visited, the piece teleports to the unvisited cell with the smallest number, paying a fee.  \n\nFind a board configuration where a rook pays fewer fees than a queen using the same rules. If no such board exists, output -1."}]}