{"uid": "1335-A", "url": "https://codeforces.com/contest/1335/problem/A", "tags": ["math"], "title": "1335-A", "statement": "A. Candies and Two Sisterstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are two sisters Alice and Betty. You have $$$n$$$ candies. You want to distribute these $$$n$$$ candies between two sisters in such a way that:Alice will get $$$a$$$ ($$$a > 0$$$) candies;Betty will get $$$b$$$ ($$$b > 0$$$) candies;each sister will get someintegernumber of candies;Alice will get a greater amount of candies than Betty (i.e. $$$a > b$$$);all the candies will be given to one of two sisters (i.e. $$$a+b=n$$$).Your task is to calculate the number of ways to distribute exactly $$$n$$$ candies between sisters in a way described above. Candies are indistinguishable.Formally, find the number of ways to represent $$$n$$$ as the sum of $$$n=a+b$$$, where $$$a$$$ and $$$b$$$ are positive integers and $$$a>b$$$.You have to answer $$$t$$$ independent test cases.InputThe first line of the input contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Then $$$t$$$ test cases follow.The only line of a test case contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^9$$$) — the number of candies you have.OutputFor each test case, print the answer — the number of ways to distribute exactly $$$n$$$ candies between two sisters in a way described in the problem statement. If there is no way to satisfy all the conditions, print $$$0$$$.ExampleInput6 7 1 2 3 2000000000 763243547Output3 0 0 1 999999999 381621773NoteFor the test case of the example, the $$$3$$$ possible ways to distribute candies are:$$$a=6$$$, $$$b=1$$$;$$$a=5$$$, $$$b=2$$$;$$$a=4$$$, $$$b=3$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ab0524ef", "template_md5": "465699a0", "result": "You have a number of items.  You need to divide them into two groups. One group must be larger than the other.  How many ways can you divide the items to meet these conditions?"}, {"prompt_md5": "77f8394e", "template_md5": "35d339e4", "result": "You have $n$ candies and want to divide them between two people.  \n\n* Each person must receive a positive number of candies.\n* Person 1 must receive more candies than Person 2.\n* All candies must be given out (the total number of candies for both people must equal $n$).\n\nHow many ways are there to divide the candies according to these rules? \n\nYou will be given multiple test cases, each with a different value for $n$."}]}