{"uid": "134-C", "url": "https://codeforces.com/contest/134/problem/C", "tags": ["constructive algorithms", " graphs", " greedy"], "title": "134-C", "statement": "C. Swapstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arenplayers sitting at a round table. All of them havescards ofncolors in total. Besides, initially the first person had cards of only the first color, the second one had cards of only the second color and so on. They can swap the cards by the following rules:as the players swap, a player can give a card of his color only;a player can't accept a card of a color he already has (particularly, he can't take cards of his color, no matter whether he has given out all of them or not);during one swap a pair of people swaps cards (each person gives one card and takes one card).The aim of allnpeople is as follows: each of them should give out all the cards he had initially (that is, all cards of his color). Your task is to denote whether such sequence of swaps is possible. If the answer is positive, you should list all the swaps.InputThe first line contains integersn(1 ≤n≤ 200000) ands(1 ≤s≤ 200000). The second line containsnnumbers, thei-th number stands for how many cards thei-th player has by the moment the game starts. It is possible that a player has no cards initially.OutputOn the first line print \"No\" if such sequence of swaps is impossible. Otherwise, print \"Yes\". If the answer is positive, next print numberk— the number of the swaps. Then onklines describe the swaps by pairs of indices of the swapping players. Print the swaps and the numbers of the swaps in any order.ExamplesInput4 82 2 2 2OutputYes44 34 21 31 2Input6 121 1 2 2 3 3OutputYes66 56 46 35 45 32 1Input5 50 0 0 0 5OutputNo", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5dc52563", "template_md5": "35d339e4", "result": "There are $n$ players sitting around a table. Each player starts with cards of a single color.  The total number of cards of all colors is $s$. Players can swap cards with each other following these rules:\n\n* A player can only give away a card of their own color.\n* A player cannot receive a card of a color they already have.\n* Swaps happen in pairs, with each player giving one card and receiving one card.\n\nThe goal of each player is to give away all the cards they started with. \n\nDetermine if it is possible for all players to achieve their goal. If it is possible, list out a sequence of swaps that will allow them to do so."}, {"prompt_md5": "869d6366", "template_md5": "465699a0", "result": "There are people sitting around a table, each with cards of a specific color. They can swap cards with each other, but only one card at a time, and only if the receiving person doesn't already have that color.  Can they all get rid of all their cards through swaps? If so, show a sequence of swaps that achieves this."}]}