{"uid": "1342-E", "url": "https://codeforces.com/contest/1342/problem/E", "tags": ["combinatorics", " fft", " math"], "title": "1342-E", "statement": "E. Placing Rookstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputCalculate the number of ways to place $$$n$$$ rooks on $$$n \\\\times n$$$ chessboard so that both following conditions are met:each empty cell is under attack;exactly $$$k$$$ pairs of rooks attack each other.An empty cell is under attack if there is at least one rook in the same row or at least one rook in the same column. Two rooks attack each other if they share the same row or column,and there are no other rooks between them. For example, there are only two pairs of rooks that attack each other in the following picture:One of the ways to place the rooks for $$$n = 3$$$ and $$$k = 2$$$Two ways to place the rooks are considered different if there exists at least one cell which is empty in one of the ways but contains a rook in another way.The answer might be large, so print it modulo $$$998244353$$$.InputThe only line of the input contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 200000$$$; $$$0 \\\\le k \\\\le \\\\frac{n(n - 1)}{2}$$$).OutputPrint one integer — the number of ways to place the rooks, taken modulo $$$998244353$$$.ExamplesInput3 2Output6Input3 3Output0Input4 0Output24Input1337 42Output807905441", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bbc37362", "template_md5": "35d339e4", "result": "You are given a square chessboard of size $n \\times n$. You need to place $n$ rooks on the board such that:\n\n1. Every empty cell on the board is under attack by at least one rook.\n2. Exactly $k$ pairs of rooks attack each other.\n\nTwo rooks attack each other if they are in the same row or column and there are no other rooks between them.\n\nFind the number of ways to place the rooks that satisfy these conditions. The answer may be large, so print it modulo 998244353."}, {"prompt_md5": "15d42c9d", "template_md5": "465699a0", "result": "You have a square board with  'n' rows and 'n' columns. You need to place 'n' pieces on the board so that:\n\n1. Every empty cell is under attack by at least one piece.\n2. Exactly 'k' pairs of pieces attack each other.\n\nPieces attack each other if they are in the same row or column and there are no other pieces between them.\n\nCount the number of ways to do this and give the answer modulo 998244353."}]}