{"uid": "1345-A", "url": "https://codeforces.com/contest/1345/problem/A", "tags": ["math"], "title": "1345-A", "statement": "A. Puzzle Piecestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a special jigsaw puzzle consisting of $$$n\\\\cdot m$$$ identical pieces. Every piece has three tabs and one blank, as pictured below.The jigsaw puzzle is considered solved if the following conditions hold:The pieces are arranged into a grid with $$$n$$$ rows and $$$m$$$ columns.For any two pieces that share an edge in the grid, a tab of one piece fits perfectly into a blank of the other piece.Through rotation and translation of the pieces, determine if it is possible to solve the jigsaw puzzle.InputThe test consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1\\\\le t\\\\le 1000$$$) — the number of test cases. Next $$$t$$$ lines contain descriptions of test cases.Each test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n,m \\\\le 10^5$$$).OutputFor each test case output a single line containing \"YES\" if it is possible to solve the jigsaw puzzle, or \"NO\" otherwise. You can print each letter in any case (upper or lower).ExampleInput3 1 3 100000 100000 2 2OutputYES NO YESNoteFor the first test case, this is an example solution:For the second test case, we can show that no solution exists.For the third test case, this is an example solution:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "245e99fb", "template_md5": "35d339e4", "result": "You are given a jigsaw puzzle made of $n \\times m$ identical pieces. Each piece has three tabs and one blank space.  \n\nDetermine if it is possible to arrange the pieces into a grid of $n$ rows and $m$ columns so that:\n\n*  The pieces fit together perfectly, with a tab from one piece fitting into the blank space of an adjacent piece.\n\nYou can rotate and move the pieces around.\n\nFor each test case, output \"YES\" if it's possible to solve the puzzle, and \"NO\" if it's not."}, {"prompt_md5": "a2495fa2", "template_md5": "465699a0", "result": "You are given a grid of puzzle pieces. Each piece has three tabs and one blank space.  Can you arrange the pieces into a complete grid where the tabs of one piece fit into the blanks of its neighbors?"}]}