{"uid": "1349-D", "url": "https://codeforces.com/contest/1349/problem/D", "tags": ["math", " probabilities"], "title": "1349-D", "statement": "D. Slime and Biscuitstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSlime and his $$$n$$$ friends are at a party. Slime has designed a game for his friends to play.At the beginning of the game, the $$$i$$$-th player has $$$a_i$$$ biscuits. At each second, Slime will choose a biscuit randomly uniformly among all $$$a_1 + a_2 + \\\\ldots + a_n$$$ biscuits, and the owner of this biscuit will give it to a random uniform player among $$$n-1$$$ players except himself. The game stops when one person will have all the biscuits.As the host of the party, Slime wants to know the expected value of the time that the game will last, to hold the next activity on time.For convenience, as the answer can be represented as a rational number $$$\\\\frac{p}{q}$$$ for coprime $$$p$$$ and $$$q$$$, you need to find the value of $$$(p \\\\cdot q^{-1})\\\\mod 998\\\\,244\\\\,353$$$. You can prove that $$$q\\\\mod 998\\\\,244\\\\,353 \\\\neq 0$$$.InputThe first line contains one integer $$$n\\\\ (2\\\\le n\\\\le 100\\\\,000)$$$: the number of people playing the game.The second line contains $$$n$$$ non-negative integers $$$a_1,a_2,\\\\dots,a_n\\\\ (1\\\\le a_1+a_2+\\\\dots+a_n\\\\le 300\\\\,000)$$$, where $$$a_i$$$ represents the number of biscuits the $$$i$$$-th person own at the beginning.OutputPrint one integer: the expected value of the time that the game will last, modulo $$$998\\\\,244\\\\,353$$$.ExamplesInput2 1 1Output1Input2 1 2Output3Input5 0 0 0 0 35Output0Input5 8 4 2 0 1Output801604029NoteFor the first example, in the first second, the probability that player $$$1$$$ will give the player $$$2$$$ a biscuit is $$$\\\\frac{1}{2}$$$, and the probability that player $$$2$$$ will give the player $$$1$$$ a biscuit is $$$\\\\frac{1}{2}$$$. But anyway, the game will stop after exactly $$$1$$$ second because only one player will occupy all biscuits after $$$1$$$ second, so the answer is $$$1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "040ff4e8", "template_md5": "35d339e4", "result": "There are $n$ players, each starting with a certain number of biscuits ($a_1, a_2, ..., a_n$).  \n\nAt each second, one biscuit is randomly chosen from all the biscuits. The owner of that biscuit then randomly gives it to any of the other $n-1$ players.\n\nThe game ends when one player has all the biscuits.\n\nWhat is the average (expected) number of seconds the game will last?\n\nThe answer can be a fraction $p/q$, and you only need to find the value of $(p \\cdot q^{-1}) \\mod 998244353$.  You are guaranteed that $q \\mod 998244353 \\neq 0$."}, {"prompt_md5": "255e3b07", "template_md5": "465699a0", "result": "There are $n$ people, each with a number of items.  Every second, one item is randomly chosen and given to a random other person. The game ends when one person has all the items.  What is the average number of seconds the game lasts?"}]}