{"uid": "135-E", "url": "https://codeforces.com/contest/135/problem/E", "tags": ["combinatorics"], "title": "135-E", "statement": "E. Weak Subsequencetime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya very much likes strings. Recently he has received a voucher to purchase a string as a gift from his mother. The string can be bought in the local shop. One can consider that the shop has all sorts of strings over the alphabet of fixed size. The size of the alphabet is equal tok. However, the voucher has a string type limitation: specifically, the voucher can be used to purchase stringsif the length of string's longest substring that is also its weak subsequence (see the definition given below) equalsw.Stringawith the length ofnis considered the weak subsequence of the stringswith the length ofm, if there exists such a set of indexes1 ≤i1<i2< ... <in≤m, that has the following two properties:ak=sikfor allkfrom1ton;there exists at least one suchk(1 ≤k<n), for whichik+ 1–ik> 1.Petya got interested how many different strings are available for him to purchase in the shop. As the number of strings can be very large, please find it modulo1000000007(109+ 7). If there are infinitely many such strings, print \"-1\".InputThe first line contains two integersk(1 ≤k≤ 106) andw(2 ≤w≤ 109) — the alphabet size and the required length of the maximum substring that also is the weak subsequence, correspondingly.OutputPrint a single number — the number of strings Petya can buy using the voucher, modulo1000000007(109+ 7). If there are infinitely many such strings, print \"-1\" (without the quotes).ExamplesInput2 2Output10Input3 5Output1593Input2 139Output717248223NoteIn the first sample Petya can buy the following strings: aaa, aab, abab, abb, abba, baa, baab, baba, bba, bbb.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "296e249d", "template_md5": "35d339e4", "result": "Given an alphabet size $k$ and a target substring length $w$, find the number of strings of any length that can be formed using this alphabet, such that the longest substring within the string that is also a weak subsequence of the string has length $w$. \n\nA string $a$ of length $n$ is considered a weak subsequence of a string $b$ of length $m$ if:\n\n1. There exists a set of indices $1 \\le i_1 < i_2 < ... < i_n \\le m$ such that $a_k = b_{i_k}$ for all $k$ from 1 to $n$.\n2. There exists at least one $k$ ( $1 \\le k < n$) such that $i_{k+1} - i_k > 1$.\n\nOutput the number of such strings modulo $10^9 + 7$. If there are infinitely many such strings, output \"-1\"."}, {"prompt_md5": "a5933e8c", "template_md5": "465699a0", "result": "You are given a set of letters and a target length.  Find the number of possible strings you can make using these letters where the longest subsequence within the string is of the target length.  If there are infinitely many possibilities, output -1."}]}