{"uid": "135-A", "url": "https://codeforces.com/contest/135/problem/A", "tags": ["greedy", " implementation", " sortings"], "title": "135-A", "statement": "A. Replacementtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya very much likes arrays consisting ofnintegers, where each of them is in the range from1to109, inclusive. Recently he has received one such array as a gift from his mother. Petya didn't like it at once. He decided to choose exactly one element from the array and replace it with another integer that also lies in the range from1to109, inclusive. It isnot allowedto replace a number with itself or to change no number at all.After the replacement Petya sorted the array by the numbers' non-decreasing. Now he wants to know for each position: what minimum number could occupy it after the replacement and the sorting.InputThe first line contains a single integern(1 ≤n≤ 105), which represents how many numbers the array has. The next line containsnspace-separated integers — the array's description. All elements of the array lie in the range from1to109, inclusive.OutputPrintnspace-separated integers — the minimum possible values of each array element after one replacement and the sorting are performed.ExamplesInput51 2 3 4 5Output1 1 2 3 4Input52 3 4 5 6Output1 2 3 4 5Input32 2 2Output1 2 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "253be4d6", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, where $1 \\le n \\le 10^5$ and each integer is between 1 and $10^9$ inclusive. You can choose one element in the array and replace it with a different integer between 1 and $10^9$ (you cannot replace an element with itself). After the replacement, sort the array in non-decreasing order.\n\nFor each position in the sorted array, find the minimum possible value that could occupy that position. \n\nOutput the minimum possible values for each position."}, {"prompt_md5": "77718161", "template_md5": "465699a0", "result": "You are given a list of numbers. You can choose one number in the list and replace it with a different number. After the replacement, sort the list in ascending order. What is the smallest possible number that can be in each position of the sorted list?"}]}