{"uid": "135-D", "url": "https://codeforces.com/contest/135/problem/D", "tags": ["brute force", " dfs and similar", " implementation"], "title": "135-D", "statement": "D. Cycletime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya very much likes rectangular tables that consist of characters \"0\" and \"1\". Recently he has received one such table as a gift from his mother. The table containednrows andmcolumns. The rows are numbered from top to bottom from1ton, the columns are numbered from the left to the right from1tom. Petya immediately decided to find the longest cool cycle whatever it takes.A cycle is a sequence of pairwise distinct cells where each two consecutive cells have a common side; besides, the first cell has a common side with the last cell. A cycle is called cool if it fulfills all the following conditions simultaneously:The cycle entirely consists of the cells that contain \"1\".Each cell that belongs to the cycle, has a common side with exactly two other cells that belong to the cycle.Each cell of the table that contains \"1\" either belongs to the cycle or is positioned outside of it (see definition below).To define the notion of \"outside\" formally, let's draw a cycle on a plane. Let each cell of the cycle(i,j)(iis the row number,jis the column number) correspond to the point(i,j)on the coordinate plane. Let a straight line segment join each pair of points that correspond to the cells belonging to the cycle and sharing a side. Thus, we will get a closed polyline that has no self-intersections and self-touches. The polyline divides the plane into two connected parts: the part of an infinite area and the part of a finite area. It is considered that cell(r,c)lies outside of the cycle if it does not belong to the cycle and the corresponding point on the plane with coordinates(r,c)lies in the part with the infinite area.Help Petya to find the length of the longest cool cycle in the table. The cycle length is defined as the number of cells that belong to the cycle.InputThe first line contains two integersnandm(1 ≤n,m≤ 1000) — the number of rows and columns in the table, respectively. Each of the followingnlines containsmcharacters. Each character can be either \"0\" or \"1\".OutputPrint a single number — the length of the longest cool cycle in the table. If such cycles do not exist, print 0.ExamplesInput3 3111101111Output8Input5 50101010101010101010101010Output0Input7 71111111100010110001011000101100011110000011111111Output24Input5 51111110001101011000111111Output0NoteIn the first example there's only one cycle and it is cool.In the second sample there's no cycle at all.In the third sample there are two cool cycles: their lengths are 12 and 24.In the fourth sample there also is only one cycle but it isn't cool as there's a cell containing \"1\" inside this cycle.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b6103b0f", "template_md5": "35d339e4", "result": "You are given a rectangular grid of $n \\times m$ cells, where each cell contains either a \"0\" or a \"1\".  \n\nA cycle is a sequence of distinct cells where each pair of consecutive cells share a side. A cycle is considered \"cool\" if it meets the following conditions:\n\n1. All cells in the cycle contain a \"1\".\n2. Each cell in the cycle shares a side with exactly two other cells in the cycle.\n3. Every cell containing a \"1\" either belongs to the cycle or is outside of it.\n\nCells outside the cycle are defined as those that are not part of the cycle and lie in the infinite area created when you connect the cells in the cycle with straight lines.\n\nFind the length of the longest cool cycle in the grid. If no cool cycles exist, output 0."}, {"prompt_md5": "16a40549", "template_md5": "465699a0", "result": "Find the longest sequence of connected \"1\" cells in a grid where:\n\n* Each cell in the sequence shares a side with exactly two other cells in the sequence.\n* Every \"1\" cell in the grid is either part of this sequence or not. \n\n\nIf no such sequence exists, output 0."}]}