{"uid": "1351-C", "url": "https://codeforces.com/contest/1351/problem/C", "tags": ["data structures", " implementation"], "title": "1351-C", "statement": "C. Skiertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSkier rides on a snowy field. Its movements can be described by a string of characters 'S', 'N', 'W', 'E' (which correspond to $$$1$$$ meter movement in the south, north, west or east direction respectively).It is known that if he moves along a previously unvisited segment of a path (i.e. this segment of the path is visited the first time), then the time of such movement is $$$5$$$ seconds. If he rolls along previously visited segment of a path (i.e., this segment of the path has been covered by his path before), then it takes $$$1$$$ second.Find the skier's time to roll all the path.InputThe first line contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases in the input. Then $$$t$$$ test cases follow.Each set is given by one nonempty string of the characters 'S', 'N', 'W', 'E'. The length of the string does not exceed $$$10^5$$$ characters.The sum of the lengths of $$$t$$$ given lines over all test cases in the input does not exceed $$$10^5$$$.OutputFor each test case, print the desired path time in seconds.ExampleInput5 NNN NS WWEN WWEE NWNWSOutput15 6 16 12 25", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "30c800b2", "template_md5": "35d339e4", "result": "A skier moves on a snowy field. The skier can move in four directions: south (S), north (N), west (W), and east (E). Each movement is 1 meter long.\n\nThe time it takes to move depends on whether the path has been traveled before:\n\n* **New path:** 5 seconds\n* **Previously traveled path:** 1 second\n\nGiven a sequence of movements (a string of S, N, W, E), calculate the total time it takes the skier to complete the entire path.\n\n**Input:**\n\n* The first line contains the number of test cases,  *t* ($1 \\le t \\le 10^4$).\n* Each test case is a string of S, N, W, E characters representing the skier's movements. The length of each string does not exceed $10^5$ characters.\n* The total length of all strings across all test cases does not exceed $10^5$ characters.\n\n**Output:**\n\nFor each test case, print the total time taken by the skier in seconds."}, {"prompt_md5": "cf85f204", "template_md5": "465699a0", "result": "A person moves in four directions (North, South, West, East).  The time to move to a new location is 5 seconds, and the time to move to a previously visited location is 1 second.  Given a sequence of movements, calculate the total time taken."}]}