{"uid": "1354-E", "url": "https://codeforces.com/contest/1354/problem/E", "tags": ["dfs and similar", " dp", " graphs"], "title": "1354-E", "statement": "E. Graph Coloringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an undirected graph without self-loops or multiple edges which consists of $$$n$$$ vertices and $$$m$$$ edges. Also you are given three integers $$$n_1$$$, $$$n_2$$$ and $$$n_3$$$.Can you label each vertex with one of three numbers1,2or3in such way, that:Each vertex should be labeled by exactly one number1,2or3;The total number of vertices with label1should be equal to $$$n_1$$$;The total number of vertices with label2should be equal to $$$n_2$$$;The total number of vertices with label3should be equal to $$$n_3$$$;$$$|col_u - col_v| = 1$$$ for each edge $$$(u, v)$$$, where $$$col_x$$$ is the label of vertex $$$x$$$.If there are multiple valid labelings, print any of them.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 5000$$$; $$$0 \\\\le m \\\\le 10^5$$$) — the number of vertices and edges in the graph.The second line contains three integers $$$n_1$$$, $$$n_2$$$ and $$$n_3$$$ ($$$0 \\\\le n_1, n_2, n_3 \\\\le n$$$) — the number of labels1,2and3, respectively. It's guaranteed that $$$n_1 + n_2 + n_3 = n$$$.Next $$$m$$$ lines contan description of edges: the $$$i$$$-th line contains two integers $$$u_i$$$, $$$v_i$$$ ($$$1 \\\\le u_i, v_i \\\\le n$$$; $$$u_i \\\\neq v_i$$$) — the vertices the $$$i$$$-th edge connects. It's guaranteed that the graph doesn't contain self-loops or multiple edges.OutputIf valid labeling exists then print \"YES\" (without quotes) in the first line. In the second line print string of length $$$n$$$ consisting of1,2and3. The $$$i$$$-th letter should be equal to the label of the $$$i$$$-th vertex.If there is no valid labeling, print \"NO\" (without quotes).ExamplesInput6 3 2 2 2 3 1 5 4 2 5OutputYES 112323Input5 9 0 2 3 1 2 1 3 1 5 2 3 2 4 2 5 3 4 3 5 4 5OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3173b8ff", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices and $m$ edges.  You need to color each vertex with one of three colors (1, 2, or 3) following these rules:\n\n* Each vertex must have exactly one color.\n* There must be $n_1$ vertices with color 1, $n_2$ vertices with color 2, and $n_3$ vertices with color 3.\n* If two vertices are connected by an edge, their colors must be different (i.e., the absolute difference between their colors must be 1).\n\nIf it's possible to color the graph according to these rules, print \"YES\" followed by the coloring of the vertices. If it's not possible, print \"NO\"."}, {"prompt_md5": "6be2b0e0", "template_md5": "465699a0", "result": "You are given a graph with a set number of nodes and edges. You need to color each node with one of three colors (1, 2, or 3) following these rules:\n\n* Each node must have exactly one color.\n* A specific number of nodes must be colored with each color.\n*  Nodes connected by an edge must have colors that are different by one (e.g., a node colored 1 cannot be connected to another node colored 1).\n\nDetermine if a valid coloring is possible and, if so, provide one."}]}