{"uid": "1354-C1", "url": "https://codeforces.com/contest/1354/problem/C1", "tags": ["binary search", " geometry", " math", " ternary search"], "title": "1354-C1", "statement": "C1. Simple Polygon Embeddingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe statement of this problem is the same as the statement of problem C2. The only difference is that, in problem C1, $$$n$$$ is always even, and in C2, $$$n$$$ is always odd.You are given a regular polygon with $$$2 \\\\cdot n$$$ vertices (it's convex and has equal sides and equal angles) and all its sides have length $$$1$$$. Let's name it as $$$2n$$$-gon.Your task is to find the square of the minimum size such that you can embed $$$2n$$$-gon in the square. Embedding $$$2n$$$-gon in the square means that you need to place $$$2n$$$-gon in the square in such way that each point which lies inside or on a border of $$$2n$$$-gon should also lie inside or on a border of the square.You can rotate $$$2n$$$-gon and/or the square.InputThe first line contains a single integer $$$T$$$ ($$$1 \\\\le T \\\\le 200$$$) — the number of test cases.Next $$$T$$$ lines contain descriptions of test cases — one per line. Each line contains singleeveninteger $$$n$$$ ($$$2 \\\\le n \\\\le 200$$$). Don't forget you need to embed $$$2n$$$-gon, not an $$$n$$$-gon.OutputPrint $$$T$$$ real numbers — one per test case. For each test case, print the minimum length of a side of the square $$$2n$$$-gon can be embedded in. Your answer will be considered correct if its absolute or relative error doesn't exceed $$$10^{-6}$$$.ExampleInput3 2 4 200Output1.000000000 2.414213562 127.321336469", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "83a68a7f", "template_md5": "35d339e4", "result": "You are given a regular polygon with $2n$ vertices (it's convex and has equal sides and equal angles) and all its sides have length 1.  \n\nYour task is to find the smallest square that can contain this polygon.  The square must be large enough so that every point on or inside the polygon is also on or inside the square. You can rotate the polygon and/or the square.\n\n**Input:**\n\n* The first line contains a single integer $T$ ($1 \\le T \\le 200$) — the number of test cases.\n* Each of the next $T$ lines contains a single even integer $n$ ($2 \\le n \\le 200$).\n\n**Output:**\n\n* Print $T$ real numbers — one per test case. For each test case, print the smallest side length of the square that can contain the $2n$-gon. Your answer will be considered correct if its absolute or relative error doesn't exceed $10^{-6}$."}, {"prompt_md5": "6b5e54d6", "template_md5": "465699a0", "result": "You are given a regular polygon with an even number of sides.  Find the smallest square that can fit this polygon inside it, where all corners of the polygon must be inside or on the edge of the square."}]}