{"uid": "1355-E", "url": "https://codeforces.com/contest/1355/problem/E", "tags": ["binary search", " greedy", " math", " sortings", " ternary search"], "title": "1355-E", "statement": "E. Restorer Distancetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have to restore the wall. The wall consists of $$$N$$$ pillars of bricks, the height of the $$$i$$$-th pillar is initially equal to $$$h_{i}$$$, the height is measured in number of bricks. After the restoration all the $$$N$$$ pillars should have equal heights.You are allowed the following operations:put a brick on top of one pillar, the cost of this operation is $$$A$$$;remove a brick from the top of one non-empty pillar, the cost of this operation is $$$R$$$;move a brick from the top of one non-empty pillar to the top of another pillar, the cost of this operation is $$$M$$$.You cannot create additional pillars or ignore some of pre-existing pillars even if their height becomes $$$0$$$.What is the minimal total cost of restoration, in other words, what is the minimal total cost to make all the pillars of equal height?InputThe first line of input contains four integers $$$N$$$, $$$A$$$, $$$R$$$, $$$M$$$ ($$$1 \\\\le N \\\\le 10^{5}$$$, $$$0 \\\\le A, R, M \\\\le 10^{4}$$$) — the number of pillars and the costs of operations.The second line contains $$$N$$$ integers $$$h_{i}$$$ ($$$0 \\\\le h_{i} \\\\le 10^{9}$$$) — initial heights of pillars.OutputPrint one integer — the minimal cost of restoration.ExamplesInput3 1 100 100 1 3 8Output12Input3 100 1 100 1 3 8Output9Input3 100 100 1 1 3 8Output4Input5 1 2 4 5 5 3 6 5Output4Input5 1 2 2 5 5 3 6 5Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b431d28a", "template_md5": "35d339e4", "result": "You have $N$ pillars of different heights. You want to make all the pillars have the same height. You can perform the following operations:\n\n* **Add a brick to the top of a pillar:** Cost is $A$.\n* **Remove a brick from the top of a non-empty pillar:** Cost is $R$.\n* **Move a brick from the top of one pillar to the top of another pillar:** Cost is $M$.\n\nFind the minimum total cost to make all the pillars have the same height.\n\n**Input:**\n\n* The first line contains four integers: $N$, $A$, $R$, $M$ ($1 \\le N \\le 10^5$, $0 \\le A, R, M \\le 10^4$).\n* The second line contains $N$ integers: $h_1$, $h_2$, ..., $h_N$ ($0 \\le h_i \\le 10^9$). These are the initial heights of the pillars.\n\n**Output:**\n\n* Print one integer: the minimum cost to make all the pillars have the same height."}, {"prompt_md5": "e34c2cd9", "template_md5": "465699a0", "result": "You have a number of pillars of different heights. You can make the pillars the same height by adding bricks to the top of a pillar, removing bricks from the top of a pillar, or moving a brick from one pillar to another. What is the least amount of money it will cost to make all the pillars the same height?"}]}