{"uid": "1356-A2", "url": "https://codeforces.com/contest/1356/problem/A2", "tags": ["*special"], "title": "1356-A2", "statement": "A2. Distinguish I from Ztime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an operation that implements a single-qubit unitary transformation: either the identity (I gate) or the Z gate. The operation will have Adjoint and Controlled variants defined.Your task is to perform necessary operations and measurements to figure out which unitary it was and to return 0 if it was the I gate or 1 if it was the Z gate.You are allowed to apply the given operation and its adjoint/controlled variants exactly once.You have to implement an operation which takes a single-qubit operation as an input and returns an integer. Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (unitary : (Qubit => Unit is Adj+Ctl)) : Int {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5a9f9ffc", "template_md5": "465699a0", "result": "You are given a tool that can perform one of two actions on a single item. You need to figure out which action was performed by using the tool and its variations only once.  If the action was the first type, output 0. If the action was the second type, output 1."}, {"prompt_md5": "5bcdedf7", "template_md5": "35d339e4", "result": "You are given a function that performs one of two operations on a single qubit:\n\n* **Identity (I):**  This operation does nothing to the qubit.\n* **Z:** This operation flips the state of the qubit (|0⟩ becomes |1⟩ and |1⟩ becomes |0⟩).\n\nThis function also has two variations:\n\n* **Adjoint:** This reverses the effect of the original operation.\n* **Controlled:** This applies the original operation only if a second qubit is in the state |1⟩.\n\nYour task is to figure out which of the two original operations was used. You can apply the function, its adjoint, or its controlled versions only **once**.\n\nYou need to write a program that takes the function as input and outputs:\n\n* **0** if the original operation was the Identity (I)\n* **1** if the original operation was the Z gate."}]}