{"uid": "1356-A4", "url": "https://codeforces.com/contest/1356/problem/A4", "tags": ["*special"], "title": "1356-A4", "statement": "A4. Distinguish I ⊗ X from CNOTtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an operation that implements a two-qubit unitary transformation: either $$$I \\\\otimes X$$$ (the X gate applied to the second qubit and no effect on the first qubit) or the CNOT gate with the first qubit as control and the second qubit as target. The operation will have Adjoint and Controlled variants defined.Your task is to perform necessary operations and measurements to figure out which unitary it was and to return 0 if it was $$$I \\\\otimes X$$$ or 1 if it was the CNOT gate.You are allowed to apply the given operation and its adjoint/controlled variants exactly once.You have to implement an operation which takes a two-qubit operationunitaryas an input and returns an integer. The operationunitarywill accept an array of qubits as input, but it will fail if the array is empty or has one or more than two qubits. Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (unitary : (Qubit[] => Unit is Adj+Ctl)) : Int {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d79838aa", "template_md5": "35d339e4", "result": "You are given a function that applies a two-qubit transformation. This transformation can be one of two types:\n\n1.  $I \\otimes X$ (The X gate is applied to the second qubit, and the first qubit is unchanged).\n2.  CNOT (The first qubit acts as a control, and the second qubit acts as the target).\n\nYou can apply this function, its inverse, and a controlled version of it exactly once. Your goal is to figure out which type of transformation was applied and return 0 if it was $I \\otimes X$ and 1 if it was the CNOT gate.\n\nYou will be given a function that takes an array of two qubits as input. Your task is to write a function that takes this function as input and returns 0 or 1 based on the type of transformation."}, {"prompt_md5": "88544c70", "template_md5": "465699a0", "result": "You are given a function that performs one of two operations on two bits. You can apply this function, its reverse, or a modified version of it once. Your goal is to figure out which of the two original operations was used."}]}