{"uid": "1356-C", "url": "https://codeforces.com/contest/1356/problem/C", "tags": ["*special"], "title": "1356-C", "statement": "C. Prepare state |01⟩ + |10⟩ + |11⟩time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two qubits in state $$$|00 \\\\rangle$$$. Your task is to prepare the following state on them:$$$$$$\\\\frac{1}{\\\\sqrt{3}} \\\\big( |01 \\\\rangle + |10 \\\\rangle + |11 \\\\rangle)$$$$$$This task is very similar toproblem A1 of the Winter 2019 contest, but this time you are not allowed to use any gates except the Pauli gates (X, Y and Z), the Hadamard gate and the controlled versions of those. However, you are allowed to use measurements.You have to implement an operation which takes an array of 2 qubits as an input and has no output. The \"output\" of your solution is the state in which it left the input qubits.Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (qs : Qubit[]) : Unit {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e4db1f05", "template_md5": "35d339e4", "result": "You are given two qubits in state  $|00\\rangle$. Your task is to transform them into the state:\n\n$$\\frac{1}{\\sqrt{3}} (|01\\rangle + |10\\rangle + |11\\rangle)$$\n\nYou can only use the following quantum gates:\n\n* Pauli-X gate\n* Pauli-Y gate\n* Pauli-Z gate\n* Hadamard gate\n* Controlled versions of the above gates\n\nYou can also use measurements.\n\nYour solution should be a function that takes an array of two qubits as input and leaves the qubits in the desired state. The function does not return any output."}, {"prompt_md5": "49f0d5f3", "template_md5": "465699a0", "result": "You are given two qubits in a specific starting state.  You need to transform them into a target state using only specific allowed operations.  The operations you can use are limited to a set of basic quantum gates and measurements.  You cannot directly observe the final state, but the final state of the qubits is your solution."}]}