{"uid": "1356-A5", "url": "https://codeforces.com/contest/1356/problem/A5", "tags": ["*special"], "title": "1356-A5", "statement": "A5. Distinguish Z from -Ztime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an operation that implements a single-qubit unitary transformation: either the Z gate or the -Z gate (i.e., the $$$-|0\\\\rangle\\\\langle0| + |1\\\\rangle\\\\langle1|$$$ gate: $$$(-Z)(\\\\alpha|0\\\\rangle + \\\\beta|1\\\\rangle) = -\\\\alpha|0\\\\rangle + \\\\beta|1\\\\rangle$$$). The operation will have Adjoint and Controlled variants defined.Your task is to perform necessary operations and measurements to figure out which unitary it was and to return 0 if it was the Z gate or 1 if it was the -Z gate.You are allowed to apply the given operation and its adjoint/controlled variants exactlyonce.You have to implement an operation which takes a single-qubit operation as an input and returns an integer. Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (unitary : (Qubit => Unit is Adj+Ctl)) : Int {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b81eefc2", "template_md5": "35d339e4", "result": "You are given a quantum operation that acts on a single qubit. This operation can be either the Z gate or the -Z gate. The Z gate is defined as:\n\n$$Z |0\\rangle = |0\\rangle$$\n$$Z |1\\rangle = -|1\\rangle$$\n\nThe -Z gate is defined as:\n\n$$-Z |0\\rangle = |0\\rangle$$\n$$-Z |1\\rangle = |1\\rangle$$\n\nYou are allowed to apply this operation, its adjoint (reverse), and its controlled version (which applies the operation only if a second qubit is in the state $|1\\rangle$) exactly once.\n\nYour task is to figure out whether the operation was the Z gate or the -Z gate. You can do this by performing measurements on the qubit.\n\nYou need to write a program that takes the quantum operation as input and outputs 0 if it was the Z gate and 1 if it was the -Z gate."}, {"prompt_md5": "b78a14c6", "template_md5": "465699a0", "result": "You are given a function that performs one of two operations on a single bit. You can apply this function, its inverse, or a controlled version of it only once. Your goal is to determine which of the two original functions was used."}]}