{"uid": "1357-A2", "url": "https://codeforces.com/contest/1357/problem/A2", "tags": [], "title": "1357-A2", "statement": "A2. Distinguish I, CNOTs and SWAPtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an operation that implements a two-qubit unitary transformation: either the identity (I ⊗ I gate), the CNOT gate (either with the first qubit as control and the second qubit as target or vice versa) or the SWAP gate. The operation will have Adjoint and Controlled variants defined.Your task is to perform necessary operations and measurements to figure out which unitary it was and to return0 if it was the I ⊗ I gate,1 if it was the CNOT$$$_{12}$$$ gate,2 if it was the CNOT$$$_{21}$$$ gate,3 if it was the SWAP gate.You are allowed to apply the given operation and its adjoint/controlled variantsat most twice.You have to implement an operation which takes a two-qubit operationunitaryas an input and returns an integer. The operationunitarywill accept an array of qubits as input, but it will fail if the array is empty or has one or more than two qubits. Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (unitary : (Qubit[] => Unit is Adj+Ctl)) : Int {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d5a5de6c", "template_md5": "35d339e4", "result": "You are given a function that performs a two-qubit operation. This operation can be one of three types:\n\n* **Identity:**  Does nothing to the qubits (represented as $I \\otimes I$).\n* **CNOT:**  Flips the target qubit if the control qubit is 1. This can be done with either qubit as control and the other as target.\n* **SWAP:**  Swaps the state of the two qubits.\n\nEach operation also has an \"adjoint\" and \"controlled\" version.\n\nYour task is to figure out which operation was performed using the following rules:\n\n* You can apply the given operation and its variants (adjoint and controlled) at most twice.\n* You can measure the qubits after each operation.\n\nReturn the following integer based on the operation performed:\n\n* 0: Identity ($I \\otimes I$)\n* 1: CNOT with qubit 1 as control ($CNOT_{12}$)\n* 2: CNOT with qubit 2 as control ($CNOT_{21}$)\n* 3: SWAP \n\n\n\nYou need to write a function that takes the operation function as input and returns the integer representing the operation."}, {"prompt_md5": "7f812484", "template_md5": "465699a0", "result": "You are given a function that performs a specific transformation on two bits. You can apply this function and its inverse a limited number of times. Your task is to figure out what kind of transformation it is by observing the results."}]}