{"uid": "1357-A6", "url": "https://codeforces.com/contest/1357/problem/A6", "tags": [], "title": "1357-A6", "statement": "A6. Distinguish four Pauli gatestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an operation that implements a single-qubit unitary transformation: either the identity (I gate) or one of the Pauli gates (X, Y or Z gate). The operation will have Adjoint and Controlled variants defined.Your task is to perform necessary operations and measurements to figure out which unitary it was and to return0 if it was the I gate,1 if it was the X gate,2 if it was the Y gate,3 if it was the Z gate.You are allowed to apply the given operation and its adjoint/controlled variantsexactly once.You have to implement an operation which takes a single-qubit operation as an input and returns an integer. Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (unitary : (Qubit => Unit is Adj+Ctl)) : Int {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f9039030", "template_md5": "35d339e4", "result": "You are given a single-qubit operation that can be one of four types:\n\n* Identity (I)\n* Pauli X gate (X)\n* Pauli Y gate (Y)\n* Pauli Z gate (Z)\n\nEach of these operations also has an adjoint and a controlled variant.\n\nYour task is to figure out which of the four operations was used. You can apply the given operation, its adjoint, or its controlled variant only once.\n\nYou need to write a program that takes the operation as input and outputs an integer:\n\n* 0 if the operation was I\n* 1 if the operation was X\n* 2 if the operation was Y\n* 3 if the operation was Z"}, {"prompt_md5": "6e9d824f", "template_md5": "465699a0", "result": "You are given a special operation that can be applied to a single unit of data. This operation can be one of four types. Your task is to figure out which type of operation it is by applying it and its variations once. You must return a number representing the type of operation."}]}