{"uid": "1357-A4", "url": "https://codeforces.com/contest/1357/problem/A4", "tags": [], "title": "1357-A4", "statement": "A4. Distinguish Rz from R1time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an operation that implements a single-qubit unitary transformation: either the Rz gate or the R1 gate. The operation will have Adjoint and Controlled variants defined.Your task is to perform necessary operations and measurements to figure out which unitary it was and to return 0 if it was the Rz gate or 1 if it was the R1 gate.You are allowed to apply the given operation and its adjoint/controlled variants exactly once (you can pass to it any rotation angle that you choose).You have to implement an operation which takes a single-qubit operationunitaryas an input and returns an integer. The operationunitarywill accept two parameters (similarly toRzandR1intrinsic gates): the first parameter is the rotation angle and the second parameter is the qubit to which the rotation is applied. Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (unitary : ((Double, Qubit) => Unit is Adj+Ctl)) : Int {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "17cdf852", "template_md5": "35d339e4", "result": "You are given a function that applies a single-qubit rotation. This rotation can be either an Rz gate or an R1 gate. Both gates have adjoint and controlled versions.\n\nYour task is to figure out which gate was used (Rz or R1) by applying the function and its variants only once. You can choose the rotation angle.\n\nYou need to write a program that takes the function as input and returns 0 if it was the Rz gate, and 1 if it was the R1 gate. \n\n\nThe function takes two parameters:\n\n*  A double representing the rotation angle.\n*  A qubit (quantum bit) to apply the rotation to. \n\nYour program should have the following structure:\n\n```\nfunction Solve(unitary : ((Double, Qubit) => Unit is Adj+Ctl)) : Int {\n  // Your code here\n}\n```"}, {"prompt_md5": "bbfa11be", "template_md5": "465699a0", "result": "You are given a function that applies a specific type of transformation to a single unit of data. You can apply this function, its inverse, or a controlled version of it only once. Your goal is to figure out the type of transformation being applied and return a specific number (0 or 1) based on the result."}]}