{"uid": "1357-A5", "url": "https://codeforces.com/contest/1357/problem/A5", "tags": [], "title": "1357-A5", "statement": "A5. Distinguish Rz(θ) from Ry(θ)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an angle $$$\\\\theta$$$ (in radians, $$$0.01\\\\pi \\\\le \\\\theta \\\\le 0.99 \\\\pi$$$) and an operation that implements a single-qubit unitary transformation: either the $$$Rz(\\\\theta)$$$ gate or the $$$Ry(\\\\theta)$$$ gate. The operation will have Adjoint and Controlled variants defined.Your task is to perform necessary operations and measurements to figure out which unitary it was and to return 0 if it was the $$$Rz(\\\\theta)$$$ gate or 1 if it was the $$$Ry(\\\\theta)$$$ gate.You are allowed to apply the given operation and its adjoint/controlled variants as many times as you need (within the time limit).You have to implement an operation which takes a floating-point number and a single-qubit operation as an input and returns an integer. Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (theta : Double, unitary : (Qubit => Unit is Adj+Ctl)) : Int {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c1f86975", "template_md5": "35d339e4", "result": "You are given an angle  $θ$ ($0.01π ≤ θ ≤ 0.99π$) and a quantum operation. This operation can be one of two types:\n\n* **Rz(θ):**  A single-qubit rotation around the z-axis by an angle θ.\n* **Ry(θ):** A single-qubit rotation around the y-axis by an angle θ.\n\nBoth operations have \"adjoint\" and \"controlled\" versions.\n\nYour task is to figure out which type of operation was used. You can apply the given operation, its adjoint, and its controlled versions as many times as you need.\n\nYou need to write a program that takes the angle θ and the quantum operation as input and outputs:\n\n* 0 if the operation was Rz(θ)\n* 1 if the operation was Ry(θ)"}, {"prompt_md5": "27281025", "template_md5": "465699a0", "result": "You are given a number and a special operation that can be applied to a single item. You can apply this operation, its reverse, and a modified version of it as many times as you like. Your goal is to figure out the specific type of operation you were given by performing these operations and observing the results.  You must output 0 if the operation was one type and 1 if it was the other type."}]}