{"uid": "1357-A7", "url": "https://codeforces.com/contest/1357/problem/A7", "tags": [], "title": "1357-A7", "statement": "A7. Distinguish Y, XZ, -Y and -XZtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an operation that implements a single-qubit unitary transformation: either the Y gate (possibly with an extra global phase of $$$-1$$$) or the sequence of Pauli Z and Pauli X gates (the Z gate applied first and the X gate applied second; possibly with an extra global phase of $$$-1$$$). The operation will have Adjoint and Controlled variants defined.Your task is to perform necessary operations and measurements to figure out which unitary it was and to return0 if it was the Y gate,1 if it was the $$$-$$$XZ gate,2 if it was the $$$-$$$Y gate,3 if it was the XZ gate.You are allowed to apply the given operation and its adjoint/controlled variantsat most three times.You have to implement an operation which takes a single-qubit operation as an input and returns an integer. Your code should have the following signature:namespace Solution {open Microsoft.Quantum.Intrinsic;operation Solve (unitary : (Qubit => Unit is Adj+Ctl)) : Int {// your code here}}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ea50956f", "template_md5": "35d339e4", "result": "You are given a quantum operation that acts on a single qubit. This operation can be one of four types:\n\n*  Y gate (possibly with an extra global phase of $-1$)\n*  Sequence of Z gate followed by X gate (possibly with an extra global phase of $-1$)\n\nEach of these operations has two variants:\n\n*  Adjoint: The operation reversed in time.\n*  Controlled: The operation applied only if a second qubit is in the state $|1\\rangle$.\n\nYour task is to figure out which of the four operations was used. You can apply the given operation and its variants (adjoint and controlled) at most three times.\n\nYou need to write a program that takes the quantum operation as input and outputs an integer representing the type of operation used:\n\n*  0 for the Y gate\n*  1 for the $-XZ$ gate\n*  2 for the $-Y$ gate\n*  3 for the $XZ$ gate"}, {"prompt_md5": "3156773b", "template_md5": "465699a0", "result": "You are given a special operation that can be applied to a single unit of data. This operation can be one of four types. You need to figure out which type of operation was used by applying it and its variations a maximum of three times.  You must output a number (0, 1, 2, or 3) representing the type of operation."}]}