{"uid": "136-B", "url": "https://codeforces.com/contest/136/problem/B", "tags": ["implementation", " math"], "title": "136-B", "statement": "B. Ternary Logictime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya very much likes computers. Recently he has received a new \"Ternatron IV\" as a gift from his mother. Unlike other modern computers, \"Ternatron IV\" operates with ternary and not binary logic. Petya immediately wondered how thexoroperation is performed on this computer (and whether there is anything like it).It turned out that the operation does exist (however, it is calledtor) and it works like this. Suppose that we need to calculate the value of the expressionatorb. Both numbersaandbare written in the ternary notation one under the other one (bundera). If they have a different number of digits, then leading zeroes are added to the shorter number until the lengths are the same. Then the numbers are summed together digit by digit. The result of summing each two digits is calculated modulo 3. Note that there is no carry between digits (i. e. during this operation the digits aren't transferred). For example:1410tor5010= 01123tor12123= 10213= 3410.Petya wrote numbersaandcon a piece of paper. Help him find such numberb, thatatorb=c. If there are several such numbers, print the smallest one.InputThe first line contains two integersaandc(0 ≤a,c≤ 109). Both numbers are written in decimal notation.OutputPrint the single integerb, such thatatorb=c. If there are several possible numbersb, print the smallest one. You should print the number in decimal notation.ExamplesInput14 34Output50Input50 34Output14Input387420489 225159023Output1000000001Input5 5Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9af387a3", "template_md5": "35d339e4", "result": "You are given two integers $a$ and $c$.  You need to find the smallest integer $b$ such that  $a \\text{ tor } b = c$.\n\nThe operation \"tor\" works as follows:\n\n1.  Write the numbers $a$ and $b$ in ternary notation (base-3). If one number has fewer digits, add leading zeros to make them the same length.\n2.  Add the corresponding digits of the two numbers, taking the result modulo 3 (i.e., the remainder when divided by 3).\n3.  The result of this digit-by-digit addition is the value of $a \\text{ tor } b$.\n\nFor example:\n\n*  $1410 \\text{ tor } 5010 = 01123$\n*  $12123 \\text{ tor } 12123 = 10213 = 3410$ \n\n\n\nLet me know if you'd like more examples or have any other questions."}, {"prompt_md5": "d24fe7f7", "template_md5": "465699a0", "result": "Given two numbers, find the smallest number that, when combined with the first number using a specific digit-by-digit operation, results in the second number."}]}