{"uid": "1361-B", "url": "https://codeforces.com/contest/1361/problem/B", "tags": ["greedy", " implementation", " math", " sortings"], "title": "1361-B", "statement": "B. Johnny and Grandmastertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJohnny has just found the new, great tutorial: \"How to become a grandmaster?\". The tutorial tells many strange and unexpected for Johnny things, such as you have to be patient or that very important is solving many harder and harder problems.The boy has found an online judge with tasks divided by topics they cover. He has picked $$$p^{k_i}$$$ problems from $$$i$$$-th category ($$$p$$$ is his favorite number). He wants to solve them in two weeks (the patience condition is too hard for Johnny, so for simplicity, he looks only at easy tasks, which can be solved in such a period). Now our future grandmaster has to decide which topics to cover first and which the second week. Help him assign topics in such a way, that workload is balanced.Formally, given $$$n$$$ numbers $$$p^{k_i}$$$, the boy wants to divide them into two disjoint sets, minimizing the absolute difference between sums of numbers in each set. Find the minimal absolute difference. Output the result modulo $$$10^{9}+7$$$.InputInput consists of multiple test cases. The first line contains one integer $$$t$$$ $$$(1 \\\\leq t \\\\leq 10^5)$$$ — the number of test cases. Each test case is described as follows:The first line contains two integers $$$n$$$ and $$$p$$$ $$$(1 \\\\leq n, p \\\\leq 10^6)$$$. The second line contains $$$n$$$ integers $$$k_i$$$ $$$(0 \\\\leq k_i \\\\leq 10^6)$$$.The sum of $$$n$$$ over all test cases doesn't exceed $$$10^6$$$.OutputOutput one integer — the reminder of division the answer by $$$1\\\\,000\\\\,000\\\\,007$$$.ExampleInput4 5 2 2 3 4 4 3 3 1 2 10 1000 4 5 0 1 1 100 1 8 89Output4 1 146981438 747093407NoteYou have to minimize the difference, not it's remainder. For example, if the minimum difference is equal to $$$2$$$, but there is also a distribution where the difference is $$$10^9 + 8$$$, then the answer is $$$2$$$, not $$$1$$$.In the first test case of the example, there're the following numbers: $$$4$$$, $$$8$$$, $$$16$$$, $$$16$$$, and $$$8$$$. We can divide them into such two sets: $$${4, 8, 16}$$$ and $$${8, 16}$$$. Then the difference between the sums of numbers in sets would be $$$4$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e4c04130", "template_md5": "35d339e4", "result": "You are given $n$ numbers, where each number is of the form $p^{k_i}$ ($p$ is a constant).  You need to divide these numbers into two groups. The goal is to minimize the absolute difference between the sum of the numbers in the first group and the sum of the numbers in the second group. Output the minimum difference modulo $10^9 + 7$. \n\nInput:\n\n* The first line contains an integer $t$ representing the number of test cases.\n* For each test case:\n    * The first line contains two integers $n$ and $p$.\n    * The second line contains $n$ integers $k_i$.\n\nOutput:\n\n* For each test case, output the minimum difference modulo $10^9 + 7$."}, {"prompt_md5": "86b14e81", "template_md5": "465699a0", "result": "You are given a list of numbers.  Divide the numbers into two groups so that the difference between the sums of the two groups is as small as possible. Output the smallest possible difference."}]}