{"uid": "1368-G", "url": "https://codeforces.com/contest/1368/problem/G", "tags": ["data structures", " geometry", " graphs", " trees"], "title": "1368-G", "statement": "G. Shifting Dominoestime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputBill likes to play with dominoes. He took an $$$n \\\\times m$$$ board divided into equal square cells, and covered it with dominoes. Each domino covers two adjacent cells of the board either horizontally or vertically, and each cell is covered exactly once with a half of one domino (that is, there are no uncovered cells, and no two dominoes cover the same cell twice).After that Bill decided to play with the covered board and share some photos of it on social media. First, he removes exactly one domino from the board, freeing two of the cells. Next, he moves dominoes around. A domino can only be movedalong the line parallel to its longer side. A move in the chosen direction is possible if the next cell in this direction is currently free. Bill doesn't want to lose track of what the original tiling looks like, so he makes sure that at any point each dominoshares at least one cell with its original position.After removing a domino and making several (possibly, zero) moves Bill takes a photo of the board and posts it. However, with the amount of filters Bill is using, domino borders are not visible, soonly the two free cells of the boardcan be identified. When the photo is posted, Bill reverts the board to its original state and starts the process again.Bill wants to post as many photos as possible, but he will not post any photo twice. How many distinct photos can he take? Recall that photos are different if the pairs of free cells in the photos are different.InputThe first line contains two positive integers $$$n$$$ and $$$m$$$ ($$$nm \\\\leq 2 \\\\cdot 10^5$$$) — height and width of the board respectively.The next $$$n$$$ lines describe the tiling of the board, row by row from top to bottom. Each of these lines contains $$$m$$$ characters, describing the cells in the corresponding row left to right. Each character is one ofU,D,L, orR, meaning that the cell is covered with a top, bottom, left, or right half of a domino respectively.It is guaranteed that the described tiling is valid, that is, each half-domino has a counterpart in the relevant location. In particular, since tiling is possible, the number of cells in the board is even.OutputPrint a single integer — the number of distinct photos Bill can take.ExamplesInput2 4 UUUU DDDDOutput4Input2 3 ULR DLROutput6Input6 6 ULRUUU DUUDDD UDDLRU DLRLRD ULRULR DLRDLROutput133NoteIn the first sample case, no moves are possible after removing any domino, thus there are four distinct photos.In the second sample case, four photos are possible after removing the leftmost domino by independently moving/not moving the remaining two dominoes. Two more different photos are obtained by removing one of the dominoes on the right.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "86318cb8", "template_md5": "35d339e4", "result": "You are given a rectangular board of size $n \\times m$ filled with dominoes. Each domino covers two adjacent cells, either horizontally or vertically.  \n\nYou can remove one domino, freeing up two cells. Then, you can move the remaining dominoes along the lines parallel to their longer sides, as long as the next cell in that direction is free.  \n\nThe goal is to find the number of distinct arrangements of free cells you can create by removing one domino and moving the others. Two arrangements are distinct if the pair of free cells is different. \n\n\n\nLet me know if you'd like help with the solution!"}, {"prompt_md5": "19433142", "template_md5": "465699a0", "result": "You have a rectangular grid covered with dominoes. Each domino takes up two adjacent squares. You can remove one domino and then move the rest of the dominoes horizontally or vertically, as long as they don't overlap.  You take a picture of the board after removing a domino and moving others. How many unique pictures can you take?"}]}