{"uid": "1368-H1", "url": "https://codeforces.com/contest/1368/problem/H1", "tags": ["dp", " flows", " greedy"], "title": "1368-H1", "statement": "H1. Breadboard Capacity (easy version)time limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThis is an easier version of the problem H without modification queries.Lester and Delbert work at an electronics company. They are currently working on a microchip component serving to connect two independent parts of a large supercomputer.The component is built on top of abreadboard— a grid-like base for a microchip. The breadboard has $$$n$$$ rows and $$$m$$$ columns, and each row-column intersection contains a node. Also, on each side of the breadboard there are ports that can be attached to adjacent nodes. Left and right side have $$$n$$$ ports each, and top and bottom side have $$$m$$$ ports each. Each of the ports is connected on the outside to one of the parts bridged by the breadboard, and is colored red or blue respectively.Ports can be connected by wires going inside the breadboard. However, there are a few rules to follow:Each wire should connect a red port with a blue port, and each port should be connected to at most one wire.Each part of the wire should be horizontal or vertical, and turns are only possible at one of the nodes.To avoid interference, wires can not have common parts of non-zero length (but may have common nodes). Also, a wire can not cover the same segment of non-zero length twice.Thecapacityof the breadboard is the largest number of red-blue wire connections that can be made subject to the rules above. For example, the breadboard above has capacity $$$7$$$, and one way to make seven connections is pictured below.Up to this point statements of both versions are identical. Differences follow below.Given the current breadboard configuration, help Lester and Delbert find its capacity efficiently.InputThe first line contains three integers $$$n, m, q$$$ ($$$1 \\\\leq n, m \\\\leq 10^5$$$, $$$\\\\pmb{q = 0}$$$). $$$n$$$ and $$$m$$$ are the number of rows and columns of the breadboard respectively.In this version $$$q$$$ is always zero, and is only present for consistency with the harder version.The next four lines describe initial coloring of the ports. Each character in these lines is eitherRorB, depending on the coloring of the respective port. The first two of these lines contain $$$n$$$ characters each, and describe ports on the left and right sides respectively from top to bottom. The last two lines contain $$$m$$$ characters each, and describe ports on the top and bottom sides respectively from left to right.OutputPrint a single integer — the given breadboard capacity.ExampleInput4 5 0 BBRR RBBR BBBBB RRRRROutput7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "60ecc0c0", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$.  Each cell in the grid represents a node. There are ports on the left, right, top, and bottom edges of the grid. Each port is colored either red or blue.\n\nYou can connect ports with wires, following these rules:\n\n* Each wire must connect a red port to a blue port.\n* Each port can be connected to at most one wire.\n* Wires can only travel horizontally or vertically, and can only turn at nodes.\n* Wires cannot overlap.\n\nFind the maximum number of red-blue connections you can make.\n\n\nInput:\n\nThe first line contains three integers $n$, $m$, and $q$ ($1 \\le n, m \\le 10^5$, $q = 0$). $n$ and $m$ are the number of rows and columns of the grid, respectively.\n\nThe next four lines describe the colors of the ports. Each character in these lines is either 'R' or 'B'. The first two lines contain $n$ characters each, and describe the ports on the left and right sides respectively, from top to bottom. The last two lines contain $m$ characters each, and describe the ports on the top and bottom sides respectively, from left to right.\n\nOutput:\n\nPrint a single integer — the maximum number of red-blue connections."}, {"prompt_md5": "62762b01", "template_md5": "465699a0", "result": "You are given a grid. Each cell in the grid can be connected to its neighbors by a wire.  Each wire must connect a red point to a blue point.  Find the maximum number of wires that can be placed without overlapping."}]}