{"uid": "1370-C", "url": "https://codeforces.com/contest/1370/problem/C", "tags": ["games", " math", " number theory"], "title": "1370-C", "statement": "C. Number Gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAshishgup and FastestFinger play a game.They start with a number $$$n$$$ and play in turns. In each turn, a player can makeany oneof the following moves:Divide $$$n$$$ by any of its odd divisors greater than $$$1$$$.Subtract $$$1$$$ from $$$n$$$ if $$$n$$$ is greater than $$$1$$$.Divisors of a number include the number itself.The player who isunable to make a moveloses the game.Ashishgup moves first. Determine the winner of the game if both of them play optimally.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$)  — the number of test cases. The description of the test cases follows.The only line of each test case contains a single integer  — $$$n$$$ ($$$1 \\\\leq n \\\\leq 10^9$$$).OutputFor each test case, print \"Ashishgup\" if he wins, and \"FastestFinger\" otherwise (without quotes).ExampleInput7 1 2 3 4 5 6 12OutputFastestFinger Ashishgup Ashishgup FastestFinger Ashishgup FastestFinger AshishgupNoteIn the first test case, $$$n = 1$$$, Ashishgup cannot make a move. He loses.In the second test case, $$$n = 2$$$, Ashishgup subtracts $$$1$$$ on the first move. Now $$$n = 1$$$, FastestFinger cannot make a move, so he loses.In the third test case, $$$n = 3$$$, Ashishgup divides by $$$3$$$ on the first move. Now $$$n = 1$$$, FastestFinger cannot make a move, so he loses.In the last test case, $$$n = 12$$$, Ashishgup divides it by $$$3$$$. Now $$$n = 4$$$, FastestFinger is forced to subtract $$$1$$$, and Ashishgup gets $$$3$$$, so he wins by dividing it by $$$3$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4c7f75ec", "template_md5": "35d339e4", "result": "Two players take turns playing a game with a starting number $n$.  \n\nOn each turn, a player can:\n\n* Divide $n$ by any odd divisor of $n$ that is greater than 1.\n* Subtract 1 from $n$ if $n$ is greater than 1.\n\nThe first player to be unable to make a move loses. Determine the winner if both players play optimally."}, {"prompt_md5": "d9803b37", "template_md5": "465699a0", "result": "Two players take turns on a number.  On each turn, a player can either divide the number by an odd divisor larger than 1 or subtract 1 if the number is larger than 1. The first player to be unable to make a move loses. Determine the winner if both players play optimally."}]}