{"uid": "1374-E1", "url": "https://codeforces.com/contest/1374/problem/E1", "tags": ["data structures", " greedy", " sortings"], "title": "1374-E1", "statement": "E1. Reading Books (easy version)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEasy and hard versions are actually different problems, so read statements of both problems completely and carefully.Summer vacation has started so Alice and Bob want to play and joy, but... Their mom doesn't think so. She says that they have to read some amount of books before all entertainments. Alice and Bob will read each booktogetherto end this exercise faster.There are $$$n$$$ books in the family library. The $$$i$$$-th book is described by three integers: $$$t_i$$$ — the amount of time Alice and Bob need to spend to read it, $$$a_i$$$ (equals $$$1$$$ if Alice likes the $$$i$$$-th book and $$$0$$$ if not), and $$$b_i$$$ (equals $$$1$$$ if Bob likes the $$$i$$$-th book and $$$0$$$ if not).So they need to choose some books from the given $$$n$$$ books in such a way that:Alice likesat least$$$k$$$ books from the chosen set and Bob likesat least$$$k$$$ books from the chosen set;the total reading time of these books isminimized(they are children and want to play and joy as soon a possible).The set they choose isthe samefor both Alice an Bob (it's shared between them) and they read all bookstogether, so the total reading time is the sum of $$$t_i$$$ over all books that are in the chosen set.Your task is to help them and find any suitable set of books or determine that it is impossible to find such a set.InputThe first line of the input contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 2 \\\\cdot 10^5$$$).The next $$$n$$$ lines contain descriptions of books, one description per line: the $$$i$$$-th line contains three integers $$$t_i$$$, $$$a_i$$$ and $$$b_i$$$ ($$$1 \\\\le t_i \\\\le 10^4$$$, $$$0 \\\\le a_i, b_i \\\\le 1$$$), where:$$$t_i$$$ — the amount of time required for reading the $$$i$$$-th book;$$$a_i$$$ equals $$$1$$$ if Alice likes the $$$i$$$-th book and $$$0$$$ otherwise;$$$b_i$$$ equals $$$1$$$ if Bob likes the $$$i$$$-th book and $$$0$$$ otherwise.OutputIf there is no solution, print only one integer-1. Otherwise print one integer $$$T$$$ — the minimum total reading time of the suitable set of books.ExamplesInput8 47 1 12 1 14 0 18 1 11 0 11 1 11 0 13 0 0Output18Input5 26 0 09 0 01 0 12 1 15 1 0Output8Input5 33 0 02 1 03 1 05 0 13 0 1Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b3ced2eb", "template_md5": "35d339e4", "result": "There are $n$ books. Each book has a reading time $t_i$ and two flags: $a_i$ (1 if a person likes the book, 0 otherwise) and $b_i$ (1 if a person likes the book, 0 otherwise).\n\nYou need to choose a set of books such that:\n\n* At least $k$ books in the set are liked by the first person.\n* At least $k$ books in the set are liked by the second person.\n* The total reading time of the chosen books is minimized.\n\nFind the minimum total reading time or determine if it's impossible to find a suitable set."}, {"prompt_md5": "76718ee6", "template_md5": "465699a0", "result": "You are given a list of items, each with a time cost and two preference flags (one for each person).  Find the minimum total time to select a set of items where each person likes at least a certain number of items. If no such set exists, output -1."}]}