{"uid": "1374-E2", "url": "https://codeforces.com/contest/1374/problem/E2", "tags": ["data structures", " greedy", " implementation", " sortings", " ternary search", " two pointers"], "title": "1374-E2", "statement": "E2. Reading Books (hard version)time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEasy and hard versions are actually different problems, so read statements of both problems completely and carefully.Summer vacation has started so Alice and Bob want to play and joy, but... Their mom doesn't think so. She says that they have to readexactly$$$m$$$ books before all entertainments. Alice and Bob will read each booktogetherto end this exercise faster.There are $$$n$$$ books in the family library. The $$$i$$$-th book is described by three integers: $$$t_i$$$ — the amount of time Alice and Bob need to spend to read it, $$$a_i$$$ (equals $$$1$$$ if Alice likes the $$$i$$$-th book and $$$0$$$ if not), and $$$b_i$$$ (equals $$$1$$$ if Bob likes the $$$i$$$-th book and $$$0$$$ if not).So they need to chooseexactly$$$m$$$ books from the given $$$n$$$ books in such a way that:Alice likesat least$$$k$$$ books from the chosen set and Bob likesat least$$$k$$$ books from the chosen set;the total reading time of these $$$m$$$ books isminimized(they are children and want to play and joy as soon a possible).The set they choose isthe samefor both Alice an Bob (it's shared between them) and they read all bookstogether, so the total reading time is the sum of $$$t_i$$$ over all books that are in the chosen set.Your task is to help them and find any suitable set of books or determine that it is impossible to find such a set.InputThe first line of the input contains three integers $$$n$$$, $$$m$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le m \\\\le n \\\\le 2 \\\\cdot 10^5$$$).The next $$$n$$$ lines contain descriptions of books, one description per line: the $$$i$$$-th line contains three integers $$$t_i$$$, $$$a_i$$$ and $$$b_i$$$ ($$$1 \\\\le t_i \\\\le 10^4$$$, $$$0 \\\\le a_i, b_i \\\\le 1$$$), where:$$$t_i$$$ — the amount of time required for reading the $$$i$$$-th book;$$$a_i$$$ equals $$$1$$$ if Alice likes the $$$i$$$-th book and $$$0$$$ otherwise;$$$b_i$$$ equals $$$1$$$ if Bob likes the $$$i$$$-th book and $$$0$$$ otherwise.OutputIf there is no solution, print only one integer-1.If the solution exists, print $$$T$$$ in the first line — the minimum total reading time of the suitable set of books. In the second line print $$$m$$$ distinct integers from $$$1$$$ to $$$n$$$ in any order — indices of books which are in the set you found.If there are several answers, print any of them.ExamplesInput6 3 16 0 011 1 09 0 121 1 110 1 08 0 1Output246 5 1Input6 3 26 0 011 1 09 0 121 1 110 1 08 0 1Output394 6 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "28f39d92", "template_md5": "35d339e4", "result": "You are given $n$ books. Each book has a reading time $t_i$, and two flags: $a_i$ (1 if Alice likes the book, 0 otherwise) and $b_i$ (1 if Bob likes the book, 0 otherwise).\n\nYou need to choose exactly $m$ books to read, where:\n\n* Alice likes at least $k$ of the chosen books.\n* Bob likes at least $k$ of the chosen books.\n* The total reading time of the $m$ books is minimized.\n\nFind the minimum total reading time and a set of $m$ books that satisfy these conditions. If no such set exists, output -1."}, {"prompt_md5": "aa5207c4", "template_md5": "465699a0", "result": "You are given a list of items, each with a time cost and two preference ratings (one for each person).  You need to choose a set of items that meets the following criteria:\n\n*  At least  'k' items are liked by the first person.\n*  At least 'k' items are liked by the second person.\n* The total time cost of the chosen items is minimized.\n\nFind the minimum total time cost and a set of items that satisfies the criteria. If no such set exists, output -1."}]}