{"uid": "138-C", "url": "https://codeforces.com/contest/138/problem/C", "tags": ["binary search", " data structures", " probabilities", " sortings"], "title": "138-C", "statement": "C. Mushroom Gnomes - 2time limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOne day Natalia was walking in the woods when she met a little mushroom gnome. The gnome told her the following story:Everybody knows that the mushroom gnomes' power lies in the magic mushrooms that grow in the native woods of the gnomes. There arentrees andmmagic mushrooms in the woods: thei-th tree grows at a point on a straight line with coordinatesaiand has the height ofhi, thej-th mushroom grows at the point with coordinatesbjand has magical powerszj.But one day wild mushroommunchers, the sworn enemies of mushroom gnomes unleashed a terrible storm on their home forest. As a result, some of the trees began to fall and crush the magic mushrooms. The supreme oracle of mushroom gnomes calculated in advance the probability for each tree that it will fall to the left, to the right or will stand on. If the tree with the coordinatexand heighthfalls to the left, then all the mushrooms that belong to the right-open interval[x-h,x), are destroyed. If a tree falls to the right, then the mushrooms that belong to the left-open interval(x,x+h]are destroyed. Only those mushrooms that are not hit by a single tree survive.Knowing that all the trees fall independently of each other (i.e., all the events are mutually independent, and besides, the trees do not interfere with other trees falling in an arbitrary direction), the supreme oracle was also able to quickly calculate what would be the expectation of the total power of the mushrooms which survived after the storm. His calculations ultimately saved the mushroom gnomes from imminent death.Natalia, as a good Olympiad programmer, got interested in this story, and she decided to come up with a way to quickly calculate the expectation of the sum of the surviving mushrooms' power.InputThe first line contains two integersnandm(1 ≤n≤ 105,1 ≤m≤ 104) — the number of trees and mushrooms, respectively.Each of the nextnlines contain four integers —ai,hi,li,ri(|ai| ≤ 109,1 ≤hi≤ 109,0 ≤li,ri,li+ri≤ 100) which represent the coordinate of thei-th tree, its height, the percentage of the probabilities that the tree falls to the left and to the right, respectively (the remaining percentage is the probability that the tree will stand on).Each of nextmlines contain two integersbj,zj(|bj| ≤ 109,1 ≤zj≤ 103) which represent the coordinate and the magical power of thej-th mushroom, respectively.An arbitrary number of trees and mushrooms can grow in one point.OutputPrint a real number — the expectation of the total magical power of the surviving mushrooms. The result is accepted with relative or absolute accuracy10- 4.ExamplesInput1 12 2 50 501 1Output0.5000000000Input2 12 2 50 504 2 50 503 1Output0.2500000000NoteIt is believed that the mushroom with the coordinatexbelongs to the right-open interval[l,r)if and only ifl≤x<r. Similarly, the mushroom with the coordinatexbelongs to the left-open interval(l,r]if and only ifl<x≤r.In the first test the mushroom survives with the probability of 50%, depending on where the single tree falls.In the second test the mushroom survives only if neither of the two trees falls on it. It occurs with the probability of 50%×50% = 25%.Pretest №12 is the large test with105trees and one mushroom.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "83d45b1a", "template_md5": "35d339e4", "result": "You are given $n$ trees and $m$ mushrooms. Each tree is located at coordinate $a_i$ and has a height $h_i$.  There are three probabilities associated with each tree:\n\n* $l_i$: The probability the tree falls to the left.\n* $r_i$: The probability the tree falls to the right.\n* $s_i$: The probability the tree stands.\n\n($l_i + r_i + s_i = 1$)\n\nEach mushroom is located at coordinate $b_j$ and has a power of $z_j$.\n\nIf a tree falls to the left, all mushrooms to the right of the tree (exclusive) and within the tree's height are destroyed. If a tree falls to the right, all mushrooms to the left of the tree (exclusive) and within the tree's height are destroyed.\n\nCalculate the expected total power of the surviving mushrooms."}, {"prompt_md5": "0b71a4ee", "template_md5": "465699a0", "result": "You are given a list of trees and mushrooms. Each tree has a location and a height. There is a chance the tree will fall left, right, or stay standing. Each mushroom has a location and a power. If a tree falls, it destroys mushrooms within a certain range. Calculate the expected total power of the surviving mushrooms."}]}