{"uid": "1388-B", "url": "https://codeforces.com/contest/1388/problem/B", "tags": ["greedy", " math"], "title": "1388-B", "statement": "B. Captain Flint and a Long Voyagetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputCaptain Flint and his crew keep heading to a savage shore of Byteland for several months already, drinking rum and telling stories. In such moments uncle Bogdan often remembers his nephew Denis. Today, he has told a story about how Denis helped him to come up with an interesting problem and asked the crew to solve it.In the beginning, uncle Bogdan wrote on a board a positive integer $$$x$$$ consisting of $$$n$$$ digits. After that, he wiped out $$$x$$$ and wrote integer $$$k$$$ instead, which was the concatenation of binary representations of digits $$$x$$$ consists of (without leading zeroes). For example, let $$$x = 729$$$, then $$$k = 111101001$$$ (since $$$7 = 111$$$, $$$2 = 10$$$, $$$9 = 1001$$$).After some time, uncle Bogdan understood that he doesn't know what to do with $$$k$$$ and asked Denis to help. Denis decided to wipe last $$$n$$$ digits of $$$k$$$ and named the new number as $$$r$$$.As a result, Denis proposed to find such integer $$$x$$$ of length $$$n$$$ that $$$r$$$ (as number) is maximum possible. If there are multiple valid $$$x$$$ then Denis is interested in the minimum one.All crew members, including captain Flint himself, easily solved the task. All, except cabin boy Kostya, who was too drunk to think straight. But what about you?Note: in this task, we compare integers ($$$x$$$ or $$$k$$$) as numbers (despite what representations they are written in), so $$$729 < 1999$$$ or $$$111 < 1000$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.Next $$$t$$$ lines contain test cases — one per test case. The one and only line of each test case contains the single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$) — the length of the integer $$$x$$$ you need to find.It's guaranteed that the sum of $$$n$$$ from all test cases doesn't exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, print the minimum integer $$$x$$$ of length $$$n$$$ such that obtained by Denis number $$$r$$$ is maximum possible.ExampleInput2 1 3Output8 998NoteIn the second test case (with $$$n = 3$$$), if uncle Bogdan had $$$x = 998$$$ then $$$k = 100110011000$$$. Denis (by wiping last $$$n = 3$$$ digits) will obtain $$$r = 100110011$$$.It can be proved that the $$$100110011$$$ is the maximum possible $$$r$$$ Denis can obtain and $$$998$$$ is the minimum $$$x$$$ to obtain it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "633ee018", "template_md5": "35d339e4", "result": "You are given an integer $n$. Find the smallest integer $x$ of length $n$ such that the following process results in the largest possible integer $r$:\n\n1. Convert each digit of $x$ to its binary representation.\n2. Concatenate the binary representations of the digits.\n3. Remove the last $n$ digits of the resulting integer."}, {"prompt_md5": "86a64e8c", "template_md5": "465699a0", "result": "You are given a number length. Find the smallest number of that length that, when converted to binary and concatenated, results in the largest possible number after removing the last  number of digits."}]}