{"uid": "139-B", "url": "https://codeforces.com/contest/139/problem/B", "tags": ["implementation", " math"], "title": "139-B", "statement": "B. Wallpapertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutHaving bought his own apartment, Boris decided to paper the walls in every room. Boris's flat hasnrooms, each of which has the form of a rectangular parallelepiped. For every room we known its length, width and height of the walls in meters (different rooms can have different dimensions, including height).Boris chosemtypes of wallpaper to paper the walls of the rooms with (but it is not necessary to use all the types). Each type of wallpaper is sold in rolls of a fixed length and width (the length, naturally, shows how long the unfolded roll will be). In addition, for each type we know the price of one roll of this type.The wallpaper of each type contains strips running along the length of the roll. When gluing the strips must be located strictly vertically (so the roll cannot be rotated, even if the length is less than the width). Besides, a roll can be cut in an arbitrary manner, but the joints of glued pieces should also be vertical. In addition, each room should be papered by only one type of wallpaper. And pieces of the same roll cannot be used to paper different rooms. That is, for each room the rolls are purchased separately. Also, some rolls can be used not completely.After buying an apartment Boris is short of cash, so he wants to spend the minimum money on wallpaper. Help him.InputThe first line contains a positive integern(1 ≤n≤ 500) — the number of rooms in Boris's apartment.Each of the nextnlines contains three space-separated positive integers — the length, width and height of the walls in a given room in meters, respectively.The next line contains a positive integerm(1 ≤m≤ 500) — the number of available wallpaper types.Each of the followingmlines contains three space-separated positive integers — the length and width in meters of a given wallpaper and the price of one roll, respectively.All numbers in the input data do not exceed500. It is guaranteed that each room can be papered using these types of wallpaper.OutputPrint a single number — the minimum total cost of the rolls.ExamplesInput15 5 3310 1 10015 2 3203 19 500Output640NoteNote to the sample:The total length of the walls (the perimeter) of the room is 20 m.One roll of the first type can be cut into pieces to get three vertical 1 meter wide strips, ergo you need 7 rolls of this type, the price equals 700.A roll of the second type can be cut into pieces to get five 2 meter wide strips, we need 2 rolls, the price is 640.One roll of the third type can immediately paper 19 meters out of 20, but we cannot use other types and we have to buy a second roll, the price is 1000.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8981c626", "template_md5": "35d339e4", "result": "There are $n$ rooms, each with a length, width, and height.  There are $m$ types of wallpaper available, each with a length, width, and price per roll.  \n\nYou need to find the minimum cost to wallpaper all the rooms.  \n\n* Each room must be wallpapered with a single type of wallpaper.\n* Wallpaper rolls can be cut vertically, but not rotated.\n* You can buy partial rolls.\n\n\nYou are given the dimensions of each room and the details of each wallpaper type.  Output the minimum total cost to wallpaper all the rooms."}, {"prompt_md5": "fd0d43db", "template_md5": "465699a0", "result": "You have a number of rooms, each with a length, width, and height. You also have a number of types of wallpaper, each with a length, width, and price per roll.  You need to find the cheapest way to wallpaper all the rooms, using whole or cut rolls of wallpaper. Each room must be papered with a single type of wallpaper."}]}