{"uid": "1393-E2", "url": "https://codeforces.com/contest/1393/problem/E2", "tags": ["dp", " hashing", " implementation", " string suffix structures", " strings", " two pointers"], "title": "1393-E2", "statement": "E2. Twilight and Ancient Scroll (harder version)time limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is a harder version of the problem E with larger constraints.Twilight Sparkle has received a new task from Princess Celestia. This time she asked to decipher the ancient scroll containing important knowledge of pony origin.To hide the crucial information from evil eyes, pony elders cast a spell on the scroll. That spell adds exactly one letter in any place to each word it is cast on. To make the path to the knowledge more tangled elders chosesomeof words in the scroll and cast a spell on them.Twilight Sparkle knows that the elders admired the order in all things so the scroll original scroll contained words inlexicographically non-decreasing order. She is asked to delete one letter from some of the words of the scroll (to undo the spell) to get some version of the original scroll.Unfortunately, there may be more than one way to recover the ancient scroll. To not let the important knowledge slip by Twilight has to look through all variants of the original scroll and find the required one. To estimate the maximum time Twilight may spend on the work she needs to know the number of variants she has to look through. She asks you to find that number! Since that number can be very big, Twilight asks you to find it modulo $$$10^9+7$$$.It may occur that princess Celestia has sent a wrong scroll so the answer may not exist.A string $$$a$$$ is lexicographically smaller than a string $$$b$$$ if and only if one of the following holds:$$$a$$$ is a prefix of $$$b$$$, but $$$a \\\\ne b$$$;in the first position where $$$a$$$ and $$$b$$$ differ, the string $$$a$$$ has a letter that appears earlier in the alphabet than the corresponding letter in $$$b$$$.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$): the number of words in the scroll.The $$$i$$$-th of the next $$$n$$$ lines contains a string consisting of lowercase English letters: the $$$i$$$-th word in the scroll. The length of each word is at least one. The sum of lengths of words does not exceed $$$10^6$$$.OutputPrint one integer: the number of ways to get a version of the original from the scroll modulo $$$10^9+7$$$.ExamplesInput3 abcd zaza atakaOutput4Input4 dfs bfs sms mmsOutput8Input3 abc bcd aOutput0Input6 lapochka kartyshka bigbabytape morgenshtern ssshhhiiittt queenOutput2028NoteNotice that the elders could have written an empty word (but they surely cast a spell on it so it holds a length $$$1$$$ now).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e44577f6", "template_md5": "35d339e4", "result": "You are given a list of words. Each word has had one extra letter added to it at some point.  \n\nYour task is to determine the number of ways to remove one letter from some of the words to get a list of words in lexicographically non-decreasing order.  \n\nThe output should be the number of possible valid lists modulo $10^9+7$. \n\n**Input:**\n\n* The first line contains an integer $n$ ($1 \\le n \\le 10^5$) representing the number of words.\n* The next $n$ lines each contain a word consisting of lowercase English letters. Each word has at least one letter and the total number of letters in all words does not exceed $10^6$.\n\n**Output:**\n\n* Print a single integer representing the number of valid lists modulo $10^9+7$."}, {"prompt_md5": "7b0fdcdc", "template_md5": "465699a0", "result": "You are given a list of words. Some words have an extra letter added to them.  Find the number of ways to remove one letter from some of the words to make the list of words lexicographically non-decreasing.  The answer should be the number of possible lists modulo 10^9+7."}]}