{"uid": "1396-A", "url": "https://codeforces.com/contest/1396/problem/A", "tags": ["constructive algorithms", " greedy", " number theory"], "title": "1396-A", "statement": "A. Multiples of Lengthtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array $$$a$$$ of $$$n$$$ integers.You want to make all elements of $$$a$$$ equal to zero by doing the following operationexactly threetimes:Select a segment, for each number in this segment we can add a multiple of $$$len$$$ to it, where $$$len$$$ is the length of this segment (added integers can be different).It can be proven that it is always possible to make all elements of $$$a$$$ equal to zero.InputThe first line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 100\\\\,000$$$): the number of elements of the array.The second line contains $$$n$$$ elements of an array $$$a$$$ separated by spaces: $$$a_1, a_2, \\\\dots, a_n$$$ ($$$-10^9 \\\\le a_i \\\\le 10^9$$$).OutputThe output should contain six lines representing three operations.For each operation, print two lines:The first line contains two integers $$$l$$$, $$$r$$$ ($$$1 \\\\le l \\\\le r \\\\le n$$$): the bounds of the selected segment.The second line contains $$$r-l+1$$$ integers $$$b_l, b_{l+1}, \\\\dots, b_r$$$ ($$$-10^{18} \\\\le b_i \\\\le 10^{18}$$$): the numbers to add to $$$a_l, a_{l+1}, \\\\ldots, a_r$$$, respectively; $$$b_i$$$ should be divisible by $$$r - l + 1$$$.ExampleInput4 1 3 2 4Output1 1  -1 3 4 4 2 2 4 -3 -6 -6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a1c39ae9", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers. You can perform the following operation exactly three times:\n\n1. Choose a segment of the array (from index $l$ to index $r$).\n2. For each number in the segment, add a multiple of the segment's length ($r-l+1$) to it.\n\nThe multiple you add to each number can be different.\n\nYour goal is to make all elements of the array equal to zero using these operations.\n\nOutput three sets of instructions, each representing one operation. For each operation, output:\n\n* Two integers $l$ and $r$, representing the start and end indices of the segment.\n* $r-l+1$ integers, representing the multiples to add to each element in the segment.  Each multiple must be divisible by $r-l+1$."}, {"prompt_md5": "6b1dc38f", "template_md5": "465699a0", "result": "You are given a list of numbers. You can repeatedly choose a section of the list and add a multiple of the section's length to each number in that section. Your goal is to make all the numbers in the list equal to zero using this operation exactly three times.  You need to describe the three operations you would perform."}]}