{"uid": "1397-A", "url": "https://codeforces.com/contest/1397/problem/A", "tags": ["greedy", " strings"], "title": "1397-A", "statement": "A. Juggling Letterstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given $$$n$$$ strings $$$s_1, s_2, \\\\ldots, s_n$$$ consisting of lowercase Latin letters.In one operation you can remove a character from a string $$$s_i$$$ and insert it to an arbitrary position in a string $$$s_j$$$ ($$$j$$$ may be equal to $$$i$$$). You may perform this operation any number of times. Is it possible to make all $$$n$$$ strings equal?InputThe first line contains $$$t$$$ ($$$1 \\\\le t \\\\le 10$$$): the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 1000$$$): the number of strings.$$$n$$$ lines follow, the $$$i$$$-th line contains $$$s_i$$$ ($$$1 \\\\le \\\\lvert s_i \\\\rvert \\\\le 1000$$$).The sum of lengths of all strings in all test cases does not exceed $$$1000$$$.OutputIf it is possible to make the strings equal, print \"YES\" (without quotes).Otherwise, print \"NO\" (without quotes).You can output each character in either lowercase or uppercase.ExampleInput4 2 caa cbb 3 cba cba cbb 4 ccab cbac bca acbcc 4 acb caf c cbafcOutputYES NO YES NONoteIn the first test case, you can do the following:Remove the third character of the first string and insert it after the second character of the second string, making the two strings \"ca\" and \"cbab\" respectively.Remove the second character of the second string and insert it after the second character of the first string, making both strings equal to \"cab\".In the second test case, it is impossible to make all $$$n$$$ strings equal.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f41e7b05", "template_md5": "35d339e4", "result": "You are given $n$ strings. You can take a character from one string and insert it into any position of another string. Can you make all the strings equal using this operation?\n\nInput:\n\n* The first line contains $t$ (the number of test cases).\n* For each test case:\n    * The first line contains $n$ (the number of strings).\n    * The next $n$ lines each contain a string.\n\nOutput:\n\n* For each test case, print \"YES\" if it's possible to make all strings equal, otherwise print \"NO\"."}, {"prompt_md5": "0cd9f102", "template_md5": "465699a0", "result": "You are given a list of words. You can take a letter from one word and put it into another word at any position. Can you make all the words the same?"}]}