{"uid": "1398-G", "url": "https://codeforces.com/contest/1398/problem/G", "tags": ["bitmasks", " fft", " math", " number theory"], "title": "1398-G", "statement": "G. Running Competitiontime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputA running competition is going to be held soon. The stadium where the competition will be held can be represented by several segments on the coordinate plane:two horizontal segments: one connecting the points $$$(0, 0)$$$ and $$$(x, 0)$$$, the other connecting the points $$$(0, y)$$$ and $$$(x, y)$$$;$$$n + 1$$$ vertical segments, numbered from $$$0$$$ to $$$n$$$. The $$$i$$$-th segment connects the points $$$(a_i, 0)$$$ and $$$(a_i, y)$$$; $$$0 = a_0 < a_1 < a_2 < \\\\dots < a_{n - 1} < a_n = x$$$.For example, here is a picture of the stadium with $$$x = 10$$$, $$$y = 5$$$, $$$n = 3$$$ and $$$a = [0, 3, 5, 10]$$$:Alapis a route that goes along the segments, starts and finishes at the same point, and never intersects itself (the only two points of a lap that coincide are its starting point and ending point). The length of a lap is a total distance travelled around it. For example, the red route in the picture representing the stadium is a lap of length $$$24$$$.The competition will be held in $$$q$$$ stages. The $$$i$$$-th stage has length $$$l_i$$$, and the organizers want to choose a lap for each stage such that the length of the lap is adivisor of $$$l_i$$$. The organizers don't want to choose short laps for the stages, so for each stage, they want to find the maximum possible length of a suitable lap.Help the organizers to calculate the maximum possible lengths of the laps for the stages! In other words, for every $$$l_i$$$, find the maximum possible integer $$$L$$$ such that $$$l_i \\\\bmod L = 0$$$, and there exists a lap of lengthexactly$$$L$$$.If it is impossible to choose such a lap then print $$$-1$$$.InputThe first line contains three integers $$$n$$$, $$$x$$$ and $$$y$$$ ($$$1 \\\\le n, x, y \\\\le 2 \\\\cdot 10^5$$$, $$$n \\\\le x$$$).The second line contains $$$n + 1$$$ integers $$$a_0$$$, $$$a_1$$$, ..., $$$a_n$$$ ($$$0 = a_0 < a_1 < a_2 < \\\\dots < a_{n - 1} < a_n = x$$$).The third line contains one integer $$$q$$$ ($$$1 \\\\le q \\\\le 2 \\\\cdot 10^5$$$) — the number of stages.The fourth line contains $$$q$$$evenintegers $$$l_1$$$, $$$l_2$$$, ..., $$$l_q$$$ ($$$4 \\\\le l_i \\\\le 10^6$$$) — the lengths of the stages.OutputPrint $$$q$$$ numbers. The $$$i$$$-th number should be equal to the maximum possible length of a suitable lap for the $$$i$$$-th stage, or $$$-1$$$ if it is impossible to choose a lap for that stage.ExampleInput3 10 5 0 3 5 10 6 24 30 14 16 18 10Output24 30 14 16 -1 -1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b63bf339", "template_md5": "35d339e4", "result": "A stadium is represented by a rectangle with $n+1$ vertical lines inside.  The organizers of a running competition want to determine the maximum possible length of a lap (a route that starts and finishes at the same point and doesn't intersect itself) for each of $q$ stages. Each stage has a given length $l_i$. The organizers want to find the largest possible lap length $L$ that divides $l_i$ and exists within the stadium. If no such lap exists, print -1.\n\nInput:\n\n* $n$, $x$, $y$: dimensions of the rectangle\n* $a_0$, $a_1$, ..., $a_n$: positions of the vertical lines\n* $q$: number of stages\n* $l_1$, $l_2$, ..., $l_q$: lengths of the stages\n\nOutput:\n\n* For each stage $i$, print the maximum possible lap length $L$ that divides $l_i$ or -1 if no such lap exists."}, {"prompt_md5": "51f1da05", "template_md5": "465699a0", "result": "You are given a rectangular area divided into smaller sections.  You need to find the largest possible length of a path that goes around the area, starting and ending at the same point, for a given set of target path lengths. If no such path exists for a given target length, output -1."}]}