{"uid": "14-B", "url": "https://codeforces.com/contest/14/problem/B", "tags": ["implementation"], "title": "14-B", "statement": "B. Young Photographertime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutAmong other things, Bob is keen on photography. Especially he likes to take pictures of sportsmen. That was the reason why he placed himself in positionx0of a long straight racetrack and got ready to take pictures. But the problem was that not all the runners passed him. The total amount of sportsmen, training at that racetrack, equalsn. And each of them regularly runs distances within a particular segment of the racetrack, which is the same for each sportsman. For example, the first sportsman runs from positiona1to positionb1, the second — froma2tob2What is the minimum distance that Bob should move to have a chance to take pictures of each sportsman? Bob can take a picture of a sportsman, if he stands within the segment that this sportsman covers on the racetrack.InputThe first line of the input file contains integersnandx0(1 ≤n≤ 100;0 ≤x0≤ 1000). The followingnlines contain pairs of integersai,bi(0 ≤ai,bi≤ 1000;ai≠bi).OutputOutput the required minimum distance in the same units as the positions on the racetrack. If there is no such a position, output -1.ExamplesInput3 30 714 24 6Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "459a6c20", "template_md5": "35d339e4", "result": "You are given a racetrack of length 1000.  There are $n$ runners, each running between two points on the racetrack. The $i$-th runner runs between positions $a_i$ and $b_i$. You are initially standing at position $x_0$ on the racetrack. What is the minimum distance you need to move to be able to see all the runners? \n\nYou can see a runner if you are standing within the segment of the racetrack they are running on. If it is impossible to see all the runners, output -1."}, {"prompt_md5": "3e350aa9", "template_md5": "465699a0", "result": "You are standing at a position on a long track. Runners pass by you in segments of the track.  Find the minimum distance you need to move to see all the runners."}]}