{"uid": "14-E", "url": "https://codeforces.com/contest/14/problem/E", "tags": ["dp"], "title": "14-E", "statement": "E. Camelstime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutBob likes to draw camels: with a single hump, two humps, three humps, etc. He draws a camel by connecting points on a coordinate plane. Now he's drawing camels withthumps, representing them as polylines in the plane. Each polyline consists ofnvertices with coordinates(x1,y1),(x2,y2), ...,(xn,yn). The first vertex has a coordinatex1= 1, the second —x2= 2, etc. Coordinatesyimight be any, but should satisfy the following conditions:there should bethumps precisely, i.e. such indexesj(2 ≤j≤n- 1), so thatyj- 1<yj>yj+ 1,there should be preciselyt- 1such indexesj(2 ≤j≤n- 1), so thatyj- 1>yj<yj+ 1,no segment of a polyline should be parallel to theOx-axis,allyiare integers between 1 and 4.For a series of his drawings of camels withthumps Bob wants to buy a notebook, but he doesn't know how many pages he will need. Output the amount of different polylines that can be drawn to represent camels withthumps for a given numbern.InputThe first line contains a pair of integersnandt(3 ≤n≤ 20,1 ≤t≤ 10).OutputOutput the required amount of camels withthumps.ExamplesInput6 1Output6Input4 2Output0NoteIn the first sample test sequences ofy-coordinates for six camels are: 123421, 123431, 123432, 124321, 134321 и 234321 (each digit corresponds to one value ofyi).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6eac7a86", "template_md5": "35d339e4", "result": "Given two integers $n$ and $t$, find the number of different ways to arrange $n$ points on a coordinate plane to form a camel with $t$ humps. \n\nHere are the rules:\n\n* The points must form a polyline.\n* The x-coordinates of the points must be consecutive integers from 1 to $n$.\n* The polyline must have exactly $t$ humps. A hump is formed when a point has a y-coordinate that is higher than its neighbors.\n* No segment of the polyline can be parallel to the x-axis.\n* All y-coordinates must be integers between 1 and 4."}, {"prompt_md5": "8b3f7d48", "template_md5": "465699a0", "result": "Given a number of points and a number of humps, count how many different ways you can connect the points to form a shape with the specified number of humps.  The shape must have a specific pattern of increasing and decreasing y-coordinates to represent the humps."}]}