{"uid": "140-E", "url": "https://codeforces.com/contest/140/problem/E", "tags": ["combinatorics", " dp"], "title": "140-E", "statement": "E. New Year Garlandtime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAs Gerald, Alexander, Sergey and Gennady are already busy with the usual New Year chores, Edward hastily decorates the New Year Tree. And any decent New Year Tree must be decorated with a good garland. Edward has lamps ofmcolors and he wants to make a garland from them. That garland should represent a sequence whose length equalsL. Edward's tree isnlayers high and Edward plans to hang the garland so as to decorate the first layer with the firstl1lamps, the second layer — with the nextl2lamps and so on. The lastn-th layer should be decorated with the lastlnlamps,Edward adores all sorts of math puzzles, so he suddenly wondered: how many different ways to assemble the garland are there given that the both following two conditions are met:Any two lamps that follow consecutively in the same layer should have different colors.The sets of used colors in every twoneighbouringlayers must be different. We consider unordered sets (not multisets), where every color occurs no more than once. So the number of lamps of particular color does not matter.Help Edward find the answer to this nagging problem or else he won't manage to decorate the Tree by New Year. You may consider that Edward has an unlimited number of lamps of each ofmcolors and it is not obligatory to use allmcolors. The garlands are considered different if they differ in at least one position when represented as sequences. Calculate the answer modulop.InputThe first line contains three integersn,mandp(1 ≤n,m≤ 106,2 ≤p≤ 109) which are the number of the tree's layers, the number of the lamps' colors and module correspondingly. The next line containsnintegersli(1 ≤li≤ 5000,).OutputPrint the only integer — the number of garlands modulop.ExamplesInput3 2 10003 1 2Output8Input2 3 10002 2Output24Input1 1 10005Output0NoteIn the first sample the following variants are possible: 121|1|12, 121|1|21, 121|2|12, 121|2|21, 212|1|12, 212|1|21, 212|2|12, 212|2|21. In the second sample the following variants are possible: 12|13, 12|23, 12|31, 12|32 and so on.Figure for the first sample:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "00f85747", "template_md5": "35d339e4", "result": "You are given $n$ layers and $m$ colors. You need to arrange $l_1$ lamps of different colors in the first layer, $l_2$ lamps of different colors in the second layer, and so on, until the $n$th layer with $l_n$ lamps.  \n\nThe following rules apply:\n\n*  No two consecutive lamps in the same layer can have the same color.\n*  The sets of colors used in each pair of adjacent layers must be different.\n\nFind the number of ways to arrange the lamps, considering that the order of lamps within a layer doesn't matter.  The answer should be modulo $p$. \n\n\n\nLet me know if you'd like help with any specific part of the problem or need further clarification!"}, {"prompt_md5": "4acaa2c4", "template_md5": "465699a0", "result": "You have a tree with a certain number of layers. You need to decorate each layer with a sequence of colored objects, following these rules:\n\n* Objects on the same layer must have different colors.\n* Objects on adjacent layers must have different sets of colors.\n\nFind the number of ways to decorate the tree, considering that you have a limited number of colors and can use each color multiple times.  The answer should be calculated modulo a given number."}]}