{"uid": "140-F", "url": "https://codeforces.com/contest/140/problem/F", "tags": ["geometry", " sortings"], "title": "140-F", "statement": "F. New Year Snowflaketime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAs Gerald ..., in other words, on a New Year Eve Constantine prepared an unusual present for the Beautiful Lady. The present is the magic New Year snowflake that can make any dream come true.The New Year snowflake consists of tiny ice crystals, which can be approximately regarded as points on the plane. The beauty of the New Year snowflake is that it has a center of symmetry. This is a point such that for each crystal of the snowflake exists another crystal, symmetrical to it relative to that point. One of the crystals can be placed directly in the center of symmetry.While Constantine was choosing a snowflake among millions of other snowflakes, no less symmetrical and no less magical, then endured a difficult path through the drifts to the house of his mistress, while he was waiting with bated breath for a few long moments before the Beautiful Lady opens the door, some of the snowflake crystals melted and naturally disappeared. Constantine is sure that there were no more thankof such crystals, because he handled the snowflake very carefully. Now he is ready to demonstrate to the Beautiful Lady all the power of nanotechnology and restore the symmetry of snowflakes.You are given the coordinates of the surviving snowflake crystals, given in nanometers. Your task is to identify all possible positions of the original center of symmetry.InputThe first line contains two integersnandk(1 ≤n≤ 200 000,0 ≤k≤ 10) — the number of the surviving snowflake crystals and the maximum number of melted crystals, correspondingly. Nextnlines contain the coordinates of the crystals that are left in the following form: \"xiyi\". The coordinates are integers and do not exceed5·108in absolute value. All given points are different.OutputThe first line contains an integerc— the number of possible symmetry centers. Nextclines should contain the centers' descriptions. Each symmetry center is described by a couple of coordinates \"xy\", separated by a space. Print the coordinates with absolute error not exceeding10- 6. You are allowed to print the symmetry centers in any order. All printed points should be different. If there exist an infinite number of possible symmetry centers, print the single number \"-1\".ExamplesInput4 00 00 11 01 1Output10.5 0.5Input4 20 00 11 01 1Output50.0 0.50.5 0.00.5 0.50.5 1.01.0 0.5Input4 40 00 11 01 1Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "323cfb39", "template_md5": "35d339e4", "result": "You are given the coordinates of some points on a plane. These points represent the surviving crystals of a snowflake.  The snowflake originally had a center of symmetry, meaning that for each crystal, there was a corresponding crystal on the opposite side of the center. Some crystals have melted away, and you need to find all possible locations for the original center of symmetry.\n\nInput:\n\n* The first line contains two integers, $n$ and $k$, where $n$ is the number of surviving crystals and $k$ is the maximum number of melted crystals.\n* The next $n$ lines each contain two integers, $x_i$ and $y_i$, representing the coordinates of the $i$-th surviving crystal.\n\nOutput:\n\n* The first line contains an integer $c$, the number of possible symmetry centers.\n* The next $c$ lines each contain two integers, $x$ and $y$, representing the coordinates of a possible symmetry center. \n* If there are infinitely many possible symmetry centers, print \"-1\"."}, {"prompt_md5": "ce30689a", "template_md5": "465699a0", "result": "You are given a set of points representing the remaining parts of a symmetrical shape. Find all possible locations of the center of symmetry for the original shape."}]}