{"uid": "1400-F", "url": "https://codeforces.com/contest/1400/problem/F", "tags": ["brute force", " dfs and similar", " dp", " string suffix structures", " strings"], "title": "1400-F", "statement": "F. x-prime Substringstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an integer value $$$x$$$ and a string $$$s$$$ consisting of digits from $$$1$$$ to $$$9$$$ inclusive.A substring of a string is a contiguous subsequence of that string.Let $$$f(l, r)$$$ be the sum of digits of a substring $$$s[l..r]$$$.Let's call substring $$$s[l_1..r_1]$$$$$$x$$$-primeif$$$f(l_1, r_1) = x$$$;there are no values $$$l_2, r_2$$$ such that$$$l_1 \\\\le l_2 \\\\le r_2 \\\\le r_1$$$;$$$f(l_2, r_2) \\\\neq x$$$;$$$x$$$ is divisible by $$$f(l_2, r_2)$$$.You are allowed to erase some characters from the string. If you erase a character, the two resulting parts of the string are concatenated without changing their order.What is the minimum number of characters you should erase from the string so that there are no$$$x$$$-primesubstrings in it? If there are no$$$x$$$-primesubstrings in the given string $$$s$$$, then print $$$0$$$.InputThe first line contains a string $$$s$$$ ($$$1 \\\\le |s| \\\\le 1000$$$). $$$s$$$ contains only digits from $$$1$$$ to $$$9$$$ inclusive.The second line contains an integer $$$x$$$ ($$$1 \\\\le x \\\\le 20$$$).OutputPrint a single integer — the minimum number of characters you should erase from the string so that there are no$$$x$$$-primesubstrings in it. If there are no$$$x$$$-primesubstrings in the given string $$$s$$$, then print $$$0$$$.ExamplesInput116285317 8Output2Input314159265359 1Output2Input13 13Output0Input3434343434 7Output5NoteIn the first example there are two $$$8$$$-prime substrings \"8\" and \"53\". You can erase these characters to get rid of both: \"116285317\". The resulting string \"1162317\" contains no $$$8$$$-prime substrings. Removing these characters is also a valid answer: \"116285317\".In the second example you just have to erase both ones.In the third example there are no $$$13$$$-prime substrings. There are no substrings with the sum of digits equal to $$$13$$$ at all.In the fourth example you can have neither \"34\", nor \"43\" in a string. Thus, you have to erase either all threes or all fours. There are $$$5$$$ of each of them, so it doesn't matter which.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5d6ffc6a", "template_md5": "35d339e4", "result": "You are given a string of digits from 1 to 9 and an integer $x$.  \n\nA substring of the string is a continuous sequence of digits within the string.  \n\nThe function $f(l, r)$ represents the sum of the digits in the substring from index $l$ to index $r$ of the string.\n\nA substring is called an \"$x$-prime\" substring if:\n\n* The sum of its digits ($f(l, r)$) is equal to $x$.\n* There are no other substrings within this substring whose sum of digits is also equal to $x$.\n\nYou can remove some digits from the string.  \n\nWhat is the minimum number of digits you need to remove so that there are no \"$x$-prime\" substrings left in the string? If there are no \"$x$-prime\" substrings to begin with, print 0."}, {"prompt_md5": "e6544d6c", "template_md5": "465699a0", "result": "You are given a string of digits and a number. Find the fewest digits you must remove from the string so that no subsequence of digits in the remaining string sums to the given number."}]}