{"uid": "141-D", "url": "https://codeforces.com/contest/141/problem/D", "tags": ["graphs", " shortest paths"], "title": "141-D", "statement": "D. Take-off Rampstime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya participates in a ski race along theXaxis. The start is at point0, and the finish is atL, that is, at a distanceLmeters from the start in the positive direction of the axis. Vasya has been training so hard that he can run one meter in exactly one second.Besides, there arentake-off ramps on the track, each ramp is characterized by four numbers:xirepresents the ramp's coordinatedirepresents from how many meters Vasya will land if he goes down this ramptirepresents the flight time in secondspiis the number, indicating for how many meters Vasya should gather speed to get ready and fly off the ramp. As Vasya gathers speed, he should ski on the snow (that is, he should not be flying), but his speed still equals one meter per second.Vasya is allowed to move inany directionon theXaxis, but he is prohibited to cross the start line, that is go to the negative semiaxis. Vasya himself chooses which take-off ramps he will use and in what order, that is, he is not obliged to take off from all the ramps he encounters. Specifically, Vasya can skip the ramp. It is guaranteed thatxi+di≤L, that is, Vasya cannot cross the finish line in flight.Vasya can jump from the ramp only in the positive direction ofXaxis. More formally, when using thei-th ramp, Vasya starts gathering speed at pointxi-pi, jumps at pointxi, and lands at pointxi+di. He cannot use the ramp in opposite direction.Your task is to find the minimum time that Vasya will spend to cover the distance.InputThe first line contains two integersnandL(0 ≤n≤ 105,1 ≤L≤ 109). Thennlines contain the descriptions of the ramps, each description is on a single line. Each description is a group of four non-negative integersxi,di,ti,pi(0 ≤xi≤L,1 ≤di,ti,pi≤ 109,xi+di≤L).OutputPrint in the first line the minimum time in seconds Vasya needs to complete the track. Print in the second linek— the number of take-off ramps that Vasya needs to use, and print on the third line of outputknumbers the number the take-off ramps Vasya used in the order in which he used them. Print each number exactly once, separate the numbers with a space. The ramps are numbered starting from 1 in the order in which they are given in the input.ExamplesInput2 205 10 5 54 16 1 7Output1511Input2 209 8 12 615 5 1 1Output1612NoteIn the first sample, Vasya cannot use ramp 2, because then he will need to gather speed starting from point-3, which is not permitted by the statement. The optimal option is using ramp 1, the resulting time is: moving to the point of gathering speed + gathering speed until reaching the takeoff ramp + flight time + moving to the finish line= 0 + 5 + 5 + 5 = 15.In the second sample using ramp 1 is not optimal for Vasya ast1>d1. The optimal option is using ramp 2, the resulting time is: moving to the point of gathering speed + gathering speed until reaching the takeoff ramp + flight time + moving to the finish line= 14 + 1 + 1 + 0 = 16.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "37b9f984", "template_md5": "35d339e4", "result": "There is a race track of length $L$ meters.  A runner can use ramps to jump across sections of the track. Each ramp has the following properties:\n\n* $x$: the location of the ramp on the track\n* $d$: the distance the runner will travel in the air\n* $t$: the time the runner spends in the air\n* $p$: the distance the runner must ski before using the ramp\n\nThe runner starts at position 0 and must reach the end of the track at position $L$. The runner can only move forward and cannot go back past the starting line.\n\nThe runner can choose which ramps to use and in what order.  \n\nFind the minimum time it takes the runner to complete the race. \n\n**Output:**\n\n* The minimum time\n* The number of ramps used\n* The order in which the ramps were used"}, {"prompt_md5": "b78a91d1", "template_md5": "465699a0", "result": "You are given a track of length L. There are ramps along the track. Each ramp has a location, a distance it launches you, a flight time, and a distance you need to ski to build up speed. You can choose which ramps to use and in what order. Your goal is to find the shortest time to travel the entire track, starting at 0 and ending at L. You can only move forward and cannot go back."}]}