{"uid": "141-C", "url": "https://codeforces.com/contest/141/problem/C", "tags": ["constructive algorithms", " greedy", " sortings"], "title": "141-C", "statement": "C. Queuetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn the Main Berland Banknpeople stand in a queue at the cashier, everyone knows his/her heighthi, and the heights of the other people in the queue. Each of them keeps in mind numberai— how many people who are taller than him/her and stand in queue in front of him.After a while the cashier has a lunch break and the people in the queue seat on the chairs in the waiting room in a random order.When the lunch break was over, it turned out that nobody can remember the exact order of the people in the queue, but everyone remembers his numberai.Your task is to restore the order in which the people stood in the queue if it is possible. There may be several acceptable orders, but you need to find any of them. Also, you need to print a possible set of numbershi— the heights of people in the queue, so that the numbersaiare correct.InputThe first input line contains integern— the number of people in the queue (1 ≤n≤ 3000). Thennlines contain descriptions of the people as \"nameiai\" (one description on one line), wherenameiis a non-empty string consisting of lowercase Latin letters whose length does not exceed10characters (thei-th person's name),aiis an integer (0 ≤ai≤n- 1), that represents the number of people who are higher and stand in the queue in front of personi. It is guaranteed that all names are different.OutputIf there's no acceptable order of the people in the queue, print the single line containing \"-1\" without the quotes. Otherwise, print innlines the people as \"nameihi\", wherehiis the integer from1to109(inclusive), the possible height of a man whose name isnamei. Print the people in the order in which they stand in the queue, starting from the head of the queue and moving to its tail. Numbershiare not necessarily unique.ExamplesInput4a 0b 2c 0d 0Outputa 150c 170d 180b 160Input4vasya 0petya 1manya 3dunay 3Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "31a734ee", "template_md5": "35d339e4", "result": "You are given a list of $n$ people, each with a known value $a_i$ representing the number of people taller than them who are in front of them in a queue.  The people have been shuffled randomly, and you need to determine a possible order for the queue given this information. \n\nIf a valid order can be found, output the names of the people in the queue along with a possible height for each person. If no valid order exists, output \"-1\"."}, {"prompt_md5": "3a451707", "template_md5": "465699a0", "result": "You are given a list of people and for each person, you know how many people in front of them are taller.  Can you figure out the original order of the people in the line?"}]}