{"uid": "141-B", "url": "https://codeforces.com/contest/141/problem/B", "tags": ["geometry", " math"], "title": "141-B", "statement": "B. Hopscotchtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSo nearly half of the winter is over and Maria is dreaming about summer. She's fed up with skates and sleds, she was dreaming about Hopscotch all night long. It's a very popular children's game. The game field, the court, looks as is shown in the figure (all blocks are square and are numbered from bottom to top, blocks in the same row are numbered from left to right). Let us describe the hopscotch with numbers that denote the number of squares in the row, staring from the lowest one: 1-1-2-1-2-1-2-(1-2)..., where then the period is repeated (1-2).The coordinate system is defined as shown in the figure. Side of all the squares are equal and have lengtha.Maria is a very smart and clever girl, and she is concerned with quite serious issues: if she throws a stone into a point with coordinates(x,y), then will she hit some square? If the answer is positive, you are also required to determine the number of the square.It is believed that the stone has fallen into the square if it is locatedstrictlyinside it. In other words a stone that has fallen on the square border is not considered a to hit a square.InputThe only input line contains three integers:a,x,y, wherea(1 ≤a≤ 100) is the side of the square,xandy(- 106≤x≤ 106, 0 ≤y≤ 106) are coordinates of the stone.OutputPrint the number of the square, inside which the stone fell. If the stone is on a border of some stone or outside the court, print \"-1\" without the quotes.ExamplesInput1 0 0Output-1Input3 1 1Output1Input3 0 10Output5Input3 0 7Output-1Input3 4 0Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2da1b7c3", "template_md5": "35d339e4", "result": "A hopscotch court is made up of squares arranged in a repeating pattern. The pattern is: 1-1-2-1-2-1-2-(1-2)...\n\nYou are given the side length of each square ($a$), and the coordinates ($x$, $y$) of a point. \n\nDetermine the number of the square that the point falls inside, if it does. If the point is on the border of a square or outside the court, print -1."}, {"prompt_md5": "36339e19", "template_md5": "465699a0", "result": "Given the size of a square and the coordinates of a point, determine which square the point falls inside. If the point is on the border or outside the court, print -1."}]}