{"uid": "141-E", "url": "https://codeforces.com/contest/141/problem/E", "tags": ["constructive algorithms", " dp", " dsu", " graphs"], "title": "141-E", "statement": "E. Clearing Uptime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAfter Santa Claus and his assistant Elf delivered all the presents and made all the wishes come true, they returned to the North Pole and found out that it is all covered with snow. Both of them were quite tired and they decided only to remove the snow from the roads connecting huts. The North Pole hasnhuts connected withmroads. One can go along the roads in both directions.The Elf offered to split: Santa Claus will clear up the wide roads and the Elf will tread out the narrow roads. For each road they decided who will clear it: Santa Claus or the Elf. To minimize the efforts they decided to clear the road so as to fulfill both those conditions:between any two huts should existexactly one simple pathalong the cleared roads;Santa Claus and the Elf should clear the same number of roads.At this point Santa Claus and his assistant Elf wondered which roads should they clear up?InputThe first input line contains two positive integersnandm(1 ≤n≤ 103,1 ≤m≤ 105) — the number of huts and the number of roads. Then followmlines, each of them contains a road description: the numbers of huts it connects —xandy(1 ≤x,y≤n) and the person responsible for clearing out this road (\"S\" — for the Elf or \"M\" for Santa Claus). It is possible to go on each road in both directions. Note that there can be more than one road between two huts and a road can begin and end in the same hut.OutputPrint \"-1\" without the quotes if it is impossible to choose the roads that will be cleared by the given rule. Otherwise print in the first line how many roads should be cleared and in the second line print the numbers of those roads (the roads are numbered from1in the order of occurrence in the input). It is allowed to print the numbers of the roads in any order. Each number should be printed exactly once. As you print the numbers, separate them with spaces.ExamplesInput1 21 1 S1 1 MOutput0Input3 31 2 S1 3 M2 3 SOutput22 1Input5 61 1 S1 2 M1 3 S1 4 M1 5 M2 2 SOutput-1NoteA path is called simple if all huts on it are pairwise different.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "04fb1808", "template_md5": "35d339e4", "result": "There are $n$ huts and $m$ roads connecting them. Each road connects two huts and can be traveled in both directions.  \n\nYou are given a list of roads, each described by the two huts it connects and which person is responsible for clearing it (\"S\" for one person and \"M\" for the other).\n\nThe goal is to determine the minimum number of roads that need to be cleared to satisfy these conditions:\n\n* There must be exactly one path between any two huts using only the cleared roads.\n* Both people must clear the same number of roads.\n\nIf it is impossible to meet these conditions, output \"-1\". Otherwise, output the minimum number of roads to clear followed by a list of those roads."}, {"prompt_md5": "cf12869b", "template_md5": "465699a0", "result": "You are given a network of connections.  Each connection has a designated person responsible for clearing it.  The goal is to determine the minimum number of connections to clear so that:\n\n1. Every pair of points in the network is connected by a single path.\n2. Both people clear the same number of connections.\n\nIf this is impossible, output -1. Otherwise, output the number of connections to clear and a list of those connections."}]}