{"uid": "1411-G", "url": "https://codeforces.com/contest/1411/problem/G", "tags": ["bitmasks", " games", " math", " matrices"], "title": "1411-G", "statement": "G. No Game No Lifetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's consider the following game of Alice and Bob on a directed acyclic graph. Each vertex may contain an arbitrary number of chips. Alice and Bob make turns alternating. Alice goes first. In one turn player can move exactly one chip along any edge outgoing from the vertex that contains this chip to the end of this edge. The one who cannot make a turn loses. Both players play optimally.Consider the following process that takes place every second on a given graph with $$$n$$$ vertices:An integer $$$v$$$ is chosen equiprobably from $$$[1, n + 1]$$$.If $$$v \\\\leq n$$$, we add a chip to the $$$v$$$-th vertex and go back to step 1.If $$$v = n + 1$$$, Alice and Bob play the game with the current arrangement of chips and the winner is determined. After that, the process is terminated.Find the probability that Alice will win the game. It can be shown that the answer can be represented as $$$\\\\frac{P}{Q}$$$, where $$$P$$$ and $$$Q$$$ are coprime integers and $$$Q \\\\not\\\\equiv 0 \\\\pmod{998\\\\,244\\\\,353}$$$. Print the value of $$$P \\\\cdot Q^{-1} \\\\bmod 998\\\\,244\\\\,353$$$.InputThe first line contains two integers $$$n$$$ and $$$m$$$ — the number of vertices and edges of the graph ($$$1 \\\\leq n \\\\leq 10^5$$$, $$$0 \\\\leq m \\\\leq 10^5$$$).The following $$$m$$$ lines contain edges description. The $$$i$$$-th of them contains two integers $$$u_i$$$ and $$$v_i$$$ — the beginning and the end vertices of the $$$i$$$-th edge ($$$1 \\\\leq u_i, v_i \\\\leq n$$$). It's guaranteed that the graph is acyclic.OutputOutput a single integer — the probability of Alice victory modulo $$$998\\\\,244\\\\,353$$$.ExamplesInput1 0Output0Input2 1 1 2Output332748118Input5 5 1 4 5 2 4 3 1 5 5 4Output931694730", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a20f89ec", "template_md5": "35d339e4", "result": "You are given a directed acyclic graph with $n$ vertices and $m$ edges.  \n\n**Game:**\n\n* Players take turns moving one chip along an outgoing edge from the vertex containing the chip.\n* The first player to be unable to make a move loses.\n* Players play optimally.\n\n**Process:**\n\n1.  A random integer $v$ is chosen from the set $[1, n+1]$.\n2.  If $v \\le n$, a chip is added to vertex $v$.\n3.  If $v = n+1$, the game is played with the current chip arrangement, and the winner is determined.\n4.  The process repeats from step 1.\n\n**Question:**\n\nWhat is the probability that Player 1 will win the game?  The answer can be expressed as a fraction $P/Q$, where $P$ and $Q$ are coprime integers and $Q \\not\\equiv 0 \\pmod{998244353}$. Output the value of $P \\cdot Q^{-1} \\pmod{998244353}$."}, {"prompt_md5": "72e7354d", "template_md5": "465699a0", "result": "You are given a graph with a certain number of nodes and edges.  Chips are randomly added to the nodes over time. When a special number is rolled, a game begins where two players take turns moving a chip along an edge connected to the node it's on. The first player unable to move loses.  What is the probability that the first player will win the game?"}]}