{"uid": "1419-D2", "url": "https://codeforces.com/contest/1419/problem/D2", "tags": ["binary search", " brute force", " constructive algorithms", " greedy", " sortings", " two pointers"], "title": "1419-D2", "statement": "D2. Sage's Birthday (hard version)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is the hard version of the problem. The difference between the versions is that in the easy version all prices $$$a_i$$$ are different. You can make hacks if and only if you solved both versions of the problem.Today is Sage's birthday, and she will go shopping to buy ice spheres. All $$$n$$$ ice spheres are placed in a row and they are numbered from $$$1$$$ to $$$n$$$ from left to right. Each ice sphere has a positive integer price. In this version, some prices can be equal.An ice sphere is cheap if it costs strictly less than two neighboring ice spheres: the nearest to the left and the nearest to the right. The leftmost and the rightmost ice spheres are not cheap. Sage will choose all cheap ice spheres and then buy only them.You can visit the shop before Sage and reorder the ice spheres as you wish. Find out the maximum number of ice spheres that Sage can buy, and show how the ice spheres should be reordered.InputThe first line contains a single integer $$$n$$$ $$$(1 \\\\le n \\\\le 10^5)$$$ — the number of ice spheres in the shop.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ $$$(1 \\\\le a_i \\\\le 10^9)$$$ — the prices of ice spheres.OutputIn the first line print the maximum number of ice spheres that Sage can buy.In the second line print the prices of ice spheres in the optimal order. If there are several correct answers, you can print any of them.ExampleInput7 1 3 2 2 4 5 4Output3 3 1 4 2 4 2 5NoteIn the sample it's not possible to place the ice spheres in any order so that Sage would buy $$$4$$$ of them. If the spheres are placed in the order $$$(3, 1, 4, 2, 4, 2, 5)$$$, then Sage will buy one sphere for $$$1$$$ and two spheres for $$$2$$$ each.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dca9a73e", "template_md5": "465699a0", "result": "You are given a list of numbers representing the prices of items.  You can rearrange the list.  An item is considered \"cheap\" if its price is less than both the item before it and the item after it.  Find the maximum number of \"cheap\" items you can have after rearranging the list."}, {"prompt_md5": "a871b6a8", "template_md5": "35d339e4", "result": "You are given an array of $n$ positive integers, where each integer represents the price of an item.  You can rearrange the order of the items.  \n\nAn item is considered \"cheap\" if its price is strictly less than the price of the item to its left and right. The first and last items cannot be cheap.\n\nFind the maximum number of \"cheap\" items that can be selected after rearranging the items, and output the rearranged order."}]}