{"uid": "142-D", "url": "https://codeforces.com/contest/142/problem/D", "tags": ["games"], "title": "142-D", "statement": "D. Help Shrek and Donkey 2time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutHaving learned (not without some help from the Codeforces participants) to play the card game from the previous round optimally, Shrek and Donkey (as you may remember, they too live now in the Kingdom of Far Far Away) have decided to quit the boring card games and play with toy soldiers.The rules of the game are as follows: there is a battlefield, its size equalsn×msquares, some squares contain the toy soldiers (the green ones belong to Shrek and the red ones belong to Donkey). Besides, each of thenlines of the area contains not more than two soldiers. During a move a players shouldselectnot less than1and not more thanksoldiers belonging to him and make them eitherattackorretreat.Anattackis moving all of the selected soldiers along the lines on which they standin the direction ofan enemy soldier, if he is in this line. If this line doesn't have an enemy soldier, then the selected soldier on this line can move in any direction during the player's move. Each selected soldier has to move at least by one cell. Different soldiers can move by a different number of cells. During the attack the soldiers are not allowed to cross the cells where other soldiers stand (or stood immediately before the attack). It is also not allowed to go beyond the battlefield or finish the attack in the cells, where other soldiers stand (or stood immediately before attack).Aretreatis moving all of the selected soldiers along the lines on which they standin the direction froman enemy soldier, if he is in this line.The other rules repeat the rules of the attack.For example, let's suppose that the original battlefield had the form (here symbols \"G\" mark Shrek's green soldiers and symbols \"R\" mark Donkey's red ones):-G-R--R-G-Let's suppose thatk= 2and Shrek moves first. If he decides toattack, then after his move the battlefield can look like that:--GR-     --GR-     -G-R--RG--     -R-G-     -RG--If in the previous example Shrek decides toretreat, then after his move the battlefield can look like that:G--R-     G--R-     -G-R--R--G     -R-G-     -R--GOn the other hand, the followings fields cannot result from Shrek's correct move:G--R-     ---RG     --GR--RG--     -R-G-     GR---Shrek starts the game. To make a move means to attack or to retreat by the rules. A player who cannot make a move loses and his opponent is the winner. Determine the winner of the given toy soldier game if Shrek and Donkey continue to be under the yellow pills from the last rounds' problem. Thus, they always play optimally (that is, they try to win if it is possible, or finish the game in a draw, by ensuring that it lasts forever, if they cannot win).InputThe first line contains space-separated integersn,mandk(1 ≤n,m,k≤ 100). Thennlines containmcharacters each. These characters belong to the set {\"-\", \"G\", \"R\"}, denoting, respectively, a battlefield's free cell, a cell occupied by Shrek's soldiers and a cell occupied by Donkey's soldiers.It is guaranteed that each line contains no more than two soldiers.OutputPrint \"First\" (without the quotes) if Shrek wins in the given Toy Soldier game. If Donkey wins, print \"Second\" (without the quotes). If the game continues forever, print \"Draw\" (also without the quotes).ExamplesInput2 3 1R-GRG-OutputFirstInput3 3 2G-RR-GG-ROutputSecondInput2 3 1-R--G-OutputDrawInput2 5 2-G-R--R-G-OutputFirst", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "73683c3b", "template_md5": "35d339e4", "result": "There is a battlefield of size $n \\times m$ squares. Some squares contain soldiers (represented by \"G\" and \"R\"). Each row has at most two soldiers.\n\nPlayers take turns. On a turn, a player can choose one or more of their soldiers and perform an action:\n\n* **Attack:** Move the selected soldiers along their rows towards an enemy soldier. If there is no enemy soldier, they can move in any direction. Soldiers must move at least one square and cannot cross other soldiers or go beyond the battlefield.\n\n* **Retreat:** Move the selected soldiers along their rows away from an enemy soldier. The rules for movement are the same as for attack.\n\nThe game ends when a player cannot make a legal move. Determine the winner of the game if both players play optimally.\n\n**Input:**\n\n* The first line contains three integers: $n$, $m$, and $k$ ($1 \\le n, m, k \\le 100$).\n* The next $n$ lines describe the battlefield, with each line containing $m$ characters (\"-\", \"G\", or \"R\").\n\n**Output:**\n\nPrint \"First\" if Player 1 (who starts) wins, \"Second\" if Player 2 wins, or \"Draw\" if the game is a draw."}, {"prompt_md5": "e3f28695", "template_md5": "465699a0", "result": "Two players take turns moving their pieces on a grid. Each turn, a player can move one or more of their pieces in a straight line, either towards or away from an opponent's piece. Pieces cannot move through other pieces, and they cannot move off the grid. The game ends when one player cannot make a legal move. Determine the winner of the game given the initial board state."}]}