{"uid": "1421-E", "url": "https://codeforces.com/contest/1421/problem/E", "tags": ["brute force", " dp", " implementation"], "title": "1421-E", "statement": "E. Swedish Heroestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhile playing yet another strategy game, Mans has recruited $$$n$$$Swedish heroes, whose powers which can be represented as an array $$$a$$$.Unfortunately, not all of those mighty heroes were created as capable as he wanted, so that he decided to do something about it. In order to accomplish his goal, he can pick two consecutive heroes, with powers $$$a_i$$$ and $$$a_{i+1}$$$, remove them and insert a hero with power $$$-(a_i+a_{i+1})$$$ back in the same position.For example if the array contains the elements $$$[5, 6, 7, 8]$$$, he can pick $$$6$$$ and $$$7$$$ and get $$$[5, -(6+7), 8] = [5, -13, 8]$$$.After he will perform this operation $$$n-1$$$ times, Mans will end up having only one hero. He wants his power to be as big as possible. What's the largest possible power he can achieve?InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 200000$$$).The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$-10^9 \\\\le a_i \\\\le 10^9$$$) — powers of the heroes.OutputPrint the largest possible power he can achieve after $$$n-1$$$ operations.ExamplesInput4 5 6 7 8Output26Input5 4 -5 9 -2 1Output15NoteSuitable list of operations for the first sample:$$$[5, 6, 7, 8] \\\\rightarrow [-11, 7, 8] \\\\rightarrow [-11, -15] \\\\rightarrow [26]$$$", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7c179987", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, $a_1, a_2, ..., a_n$.  You can repeatedly perform the following operation:\n\n1. Choose two consecutive integers in the array, $a_i$ and $a_{i+1}$.\n2. Remove $a_i$ and $a_{i+1}$ from the array.\n3. Insert the integer $-(a_i + a_{i+1})$ into the array at the position where $a_i$ was.\n\nAfter performing this operation $n-1$ times, you will be left with a single integer. What is the largest possible value of this integer?"}, {"prompt_md5": "57b75283", "template_md5": "465699a0", "result": "You are given a list of numbers. You can repeatedly take two adjacent numbers, add them together, and replace them with their negative sum. After doing this $n-1$ times, what is the largest possible number you can have left?"}]}