{"uid": "1422-A", "url": "https://codeforces.com/contest/1422/problem/A", "tags": ["geometry", " math"], "title": "1422-A", "statement": "A. Fencetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYura is tasked to build a closed fence in shape of an arbitrary non-degenerate simple quadrilateral. He's already got three straight fence segments with known lengths $$$a$$$, $$$b$$$, and $$$c$$$. Now he needs to find out some possible integer length $$$d$$$ of the fourth straight fence segment so that he can build the fence using these four segments. In other words, the fence should have a quadrilateral shape with side lengths equal to $$$a$$$, $$$b$$$, $$$c$$$, and $$$d$$$. Help Yura, find any possible length of the fourth side.A non-degenerate simple quadrilateral is such a quadrilateral that no three of its corners lie on the same line, and it does not cross itself.InputThe first line contains a single integer $$$t$$$ — the number of test cases ($$$1 \\\\le t \\\\le 1000$$$). The next $$$t$$$ lines describe the test cases.Each line contains three integers $$$a$$$, $$$b$$$, and $$$c$$$ — the lengths of the three fence segments ($$$1 \\\\le a, b, c \\\\le 10^9$$$).OutputFor each test case print a single integer $$$d$$$ — the length of the fourth fence segment that is suitable for building the fence. If there are multiple answers, print any. We can show that an answer always exists.ExampleInput2 1 2 3 12 34 56Output4 42NoteWe can build a quadrilateral with sides $$$1$$$, $$$2$$$, $$$3$$$, $$$4$$$.We can build a quadrilateral with sides $$$12$$$, $$$34$$$, $$$56$$$, $$$42$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bd38b1b2", "template_md5": "35d339e4", "result": "You are given three lengths of fence segments: $a$, $b$, and $c$.  Find an integer length $d$ that would allow you to build a closed quadrilateral (a four-sided shape) using these four segments. \n\nThe quadrilateral must not have any sides that overlap or intersect. \n\n\nInput:\n\nThe first line contains a number $t$ representing the number of test cases ($1 \\le t \\le 1000$).\n\nEach of the following $t$ lines contains three integers $a$, $b$, and $c$ representing the lengths of the fence segments ($1 \\le a, b, c \\le 10^9$).\n\nOutput:\n\nFor each test case, print a single integer $d$ representing a possible length for the fourth fence segment."}, {"prompt_md5": "9c8db445", "template_md5": "465699a0", "result": "You are given three lengths. Find a fourth length that can be used to form a closed shape with the given lengths."}]}