{"uid": "1422-D", "url": "https://codeforces.com/contest/1422/problem/D", "tags": ["graphs", " shortest paths", " sortings"], "title": "1422-D", "statement": "D. Returning Hometime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYura has been walking for some time already and is planning to return home. He needs to get home as fast as possible. To do this, Yura can use the instant-movement locations around the city.Let's represent the city as an area of $$$n \\\\times n$$$ square blocks. Yura needs to move from the block with coordinates $$$(s_x,s_y)$$$ to the block with coordinates $$$(f_x,f_y)$$$. In one minute Yura can move to any neighboring by side block; in other words, he can move in four directions. Also, there are $$$m$$$ instant-movement locations in the city. Their coordinates are known to you and Yura. Yura can move to an instant-movement location in no time if he is located in a block with the same coordinate $$$x$$$ or with the same coordinate $$$y$$$ as the location.Help Yura to find the smallest time needed to get home.InputThe first line contains two integers $$$n$$$ and $$$m$$$ — the size of the city and the number of instant-movement locations ($$$1 \\\\le n \\\\le 10^9$$$, $$$0 \\\\le m \\\\le 10^5$$$).The next line contains four integers $$$s_x$$$ $$$s_y$$$ $$$f_x$$$ $$$f_y$$$ — the coordinates of Yura's initial position and the coordinates of his home ($$$ 1 \\\\le s_x, s_y, f_x, f_y \\\\le n$$$).Each of the next $$$m$$$ lines contains two integers $$$x_i$$$ $$$y_i$$$ — coordinates of the $$$i$$$-th instant-movement location ($$$1 \\\\le x_i, y_i \\\\le n$$$).OutputIn the only line print the minimum time required to get home.ExamplesInput5 3 1 1 5 5 1 2 4 1 3 3Output5Input84 5 67 59 41 2 39 56 7 2 15 3 74 18 22 7Output42NoteIn the first example Yura needs to reach $$$(5, 5)$$$ from $$$(1, 1)$$$. He can do that in $$$5$$$ minutes by first using the second instant-movement location (because its $$$y$$$ coordinate is equal to Yura's $$$y$$$ coordinate), and then walking $$$(4, 1) \\\\to (4, 2) \\\\to (4, 3) \\\\to (5, 3) \\\\to (5, 4) \\\\to (5, 5)$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bdd7da93", "template_md5": "35d339e4", "result": "You are given a square grid of size $n \\times n$. There are $m$ special locations on the grid. You start at position $(s_x, s_y)$ and want to reach position $(f_x, f_y)$. You can move one block at a time in any of the four cardinal directions (up, down, left, right). You can also instantly teleport to any special location that shares the same x-coordinate or y-coordinate as your current position.\n\nFind the minimum time it takes to reach your destination. \n\nInput:\n\n* The first line contains two integers, $n$ and $m$, representing the grid size and the number of special locations.\n* The second line contains four integers, $s_x$, $s_y$, $f_x$, and $f_y$, representing your starting position and destination.\n* The next $m$ lines each contain two integers, $x_i$ and $y_i$, representing the coordinates of each special location.\n\nOutput:\n\n* Print a single integer representing the minimum time to reach your destination."}, {"prompt_md5": "f2085701", "template_md5": "465699a0", "result": "You are at a starting point on a grid. You need to reach a destination point on the same grid as quickly as possible. You can move one space at a time in any of the four cardinal directions, or instantly teleport to any of a set of pre-determined locations on the grid. Find the shortest time it takes to get to the destination."}]}