{"uid": "1422-B", "url": "https://codeforces.com/contest/1422/problem/B", "tags": ["greedy", " implementation", " math"], "title": "1422-B", "statement": "B. Nice Matrixtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA matrix of size $$$n \\\\times m$$$ is called nice, if all rows and columns of the matrix are palindromes. A sequence of integers $$$(a_1, a_2, \\\\dots , a_k)$$$ is a palindrome, if for any integer $$$i$$$ ($$$1 \\\\le i \\\\le k$$$) the equality $$$a_i = a_{k - i + 1}$$$ holds.Sasha owns a matrix $$$a$$$ of size $$$n \\\\times m$$$. In one operation he can increase or decrease any number in the matrix by one. Sasha wants to make the matrix nice. He is interested what is the minimum number of operations he needs.Help him!InputThe first line contains a single integer $$$t$$$ — the number of test cases ($$$1 \\\\le t \\\\le 10$$$). The $$$t$$$ tests follow.The first line of each test contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 100$$$) — the size of the matrix.Each of the next $$$n$$$ lines contains $$$m$$$ integers $$$a_{i, j}$$$ ($$$0 \\\\le a_{i, j} \\\\le 10^9$$$) — the elements of the matrix.OutputFor each test output the smallest number of operations required to make the matrix nice.ExampleInput2 4 2 4 2 2 4 4 2 2 4 3 4 1 2 3 4 5 6 7 8 9 10 11 18Output8 42NoteIn the first test case we can, for example, obtain the following nice matrix in $$$8$$$ operations:2 24 44 42 2In the second test case we can, for example, obtain the following nice matrix in $$$42$$$ operations:5 6 6 56 6 6 65 6 6 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1dc1b26b", "template_md5": "465699a0", "result": "You are given a grid of numbers.  You can change each number in the grid by adding or subtracting 1.  The goal is to change the grid so that every row and every column reads the same forwards and backwards. What is the fewest changes needed?"}, {"prompt_md5": "355cf2f2", "template_md5": "35d339e4", "result": "You are given a matrix of size $n \\times m$.  A matrix is considered \"nice\" if all of its rows and columns are palindromes. A palindrome is a sequence where the first element is the same as the last, the second is the same as the second to last, and so on.\n\nYou can change any number in the matrix by increasing or decreasing it by 1.  Find the minimum number of changes needed to make the matrix nice. \n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains two integers, $n$ and $m$, the size of the matrix.\n    * The next $n$ lines each contain $m$ integers, the elements of the matrix.\n\nOutput:\n\n* For each test case, output the minimum number of changes needed to make the matrix nice."}]}