{"uid": "1423-E", "url": "https://codeforces.com/contest/1423/problem/E", "tags": ["geometry"], "title": "1423-E", "statement": "E. 5G Antenna Towerstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter making a strategic plan with carriers for expansion of mobile network throughout the whole country, the government decided to cover rural areas with the last generation of 5G network.Since 5G antenna towers will be built in the area of mainly private properties, the government needs an easy way to find information about landowners for eachpropertypartially or fully contained in the planned building area.The planned building area is represented as a rectangle with sides $$$width$$$ and $$$height$$$.Every 5G antenna tower occupies acirclewith a center in $$$(x,y)$$$ and radius $$$r$$$.There is a database of Geodetic Institute containing information about each property. Each property is defined with itsidentification numberandpolygonrepresented as an array of $$$(x,y)$$$ points in the counter-clockwise direction.Your task is to build an IT system which can handle queries of type $$$(x, y, r)$$$ in which $$$(x,y)$$$ represents a circle center, while $$$r$$$ represents its radius. The IT system should return thetotal areaof properties that need to be acquired for the building of a tower so that the government can estimate the price. Furthermore, the system should return a list ofidentification numbersof these properties (so that the owners can be contacted for land acquisition).A property needs to be acquired if the circle of the antenna tower is intersecting or touching it.InputThe first line contains the size of the building area as double values $$$width$$$, $$$height$$$, and an integer $$$n$$$ — the number of properties in the database.Each of the next $$$n$$$ lines contains the description of a single property in the form of an integer number $$$v$$$ ($$$3 \\\\le v \\\\le 40$$$) — the number of points that define a property, as well as $$$2*v$$$ double numbers — the coordinates $$$(x,y)$$$ of each property point. Line $$$i$$$ ($$$0 \\\\le i \\\\le n-1$$$) contains the information for property with id $$$i$$$.The next line contains an integer $$$q$$$ — the number of queries.Each of the next $$$q$$$ lines contains double values $$$x$$$, $$$y$$$, $$$r$$$ — the coordinates of an antenna circle center $$$(x, y)$$$ and its radius $$$r$$$.$$$1 \\\\le n * q \\\\le 10^6$$$OutputFor each of the $$$q$$$ queries, your program should output a line containing the total area of all the properties that need to be acquired, an integer representing the number of such properties, as well as the list of ids of these properties (separated by blank characters, arbitrary order).ExampleInput10 10 3 4 2 2 3 2 3 3 2 3 3 3.5 2 4.5 2 4.5 3 4 7 8 7.5 8.5 8 8 7.5 9 5 2 3.5 0.5 3.3 2 0.4 5 2.5 0.5 7.5 8.5 0.5 3 7 0.5Output1.000000 1 0  1.500000 2 0 1  0.500000 1 1  0.250000 1 2  0.000000 0NoteYou can assume that the land not covered with properties (polygons) is under the government's ownership and therefore doesn't need to be acquired. Properties do not intersect with each other.Precision being used for solution checking is $$$10^{-4}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "37c2520b", "template_md5": "35d339e4", "result": "You are given a rectangle representing a building area with width $width$ and height $height$.  There are $n$ properties, each defined by a polygon (a list of points).  \n\nFor each query $(x, y, r)$, you need to:\n\n1. Calculate the total area of all properties that intersect or touch a circle with center $(x, y)$ and radius $r$.\n2. List the IDs of these properties.\n\n\n\nThe input will contain:\n\n*  $width$, $height$, and $n$ (the number of properties)\n*  For each property: its ID and a list of its polygon points.\n*  The number of queries $q$\n*  For each query: $(x, y, r)$\n\nThe output for each query should be:\n\n*  The total area of intersecting properties\n*  The number of intersecting properties\n*  A list of the IDs of the intersecting properties"}, {"prompt_md5": "acffbaf1", "template_md5": "465699a0", "result": "You are given a rectangular area and a list of polygons representing properties within that area.  You need to determine the total area of properties that overlap with a given circle and list the IDs of those properties.  You will be given many circles."}]}