{"uid": "1425-I", "url": "https://codeforces.com/contest/1425/problem/I", "tags": ["data structures"], "title": "1425-I", "statement": "I. Impressive Harvesting of The Orchardtime limit per test7 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMr. Chanek has an orchard structured as a rooted ternary tree with $$$N$$$ vertices numbered from $$$1$$$ to $$$N$$$. The root of the tree is vertex $$$1$$$. $$$P_i$$$ denotes the parent of vertex $$$i$$$, for $$$(2 \\\\le i \\\\le N)$$$. Interestingly, the height of the tree is not greater than $$$10$$$. Height of a tree is defined to be the largest distance from the root to a vertex in the tree.There exist a bush on each vertex of the tree. Initially, all bushes have fruits. Fruits will not grow on bushes that currently already have fruits. The bush at vertex $$$i$$$ will grow fruits after $$$A_i$$$ days since its last harvest.Mr. Chanek will visit his orchard for $$$Q$$$ days. In day $$$i$$$, he will harvest all bushes that have fruits on the subtree of vertex $$$X_i$$$. For each day, determine the sum of distances from every harvested bush to $$$X_i$$$, and the number of harvested bush that day. Harvesting a bush means collectingallfruits on the bush.For example, if Mr. Chanek harvests all fruits on subtree of vertex $$$X$$$, and harvested bushes $$$[Y_1, Y_2, \\\\dots, Y_M]$$$, the sum of distances is $$$\\\\sum_{i = 1}^M \\\\text{distance}(X, Y_i)$$$$$$\\\\text{distance}(U, V)$$$ in a tree is defined to be the number of edges on the simple path from $$$U$$$ to $$$V$$$.InputThe first line contains two integers $$$N$$$ and $$$Q$$$ $$$(1 \\\\le N,\\\\ Q,\\\\le 5 \\\\cdot 10^4)$$$, which denotes the number of vertices and the number of days Mr. Chanek visits the orchard.The second line contains $$$N$$$ integers $$$A_i$$$ $$$(1 \\\\le A_i \\\\le 5 \\\\cdot 10^4)$$$, which denotes the fruits growth speed on the bush at vertex $$$i$$$, for $$$(1 \\\\le i \\\\le N)$$$.The third line contains $$$N-1$$$ integers $$$P_i$$$ $$$(1 \\\\le P_i \\\\le N, P_i \\\\ne i)$$$, which denotes the parent of vertex $$$i$$$ in the tree, for $$$(2 \\\\le i \\\\le N)$$$. It is guaranteed that each vertex can be the parent of at most $$$3$$$ other vertices. It is also guaranteed that the height of the tree is not greater than $$$10$$$.The next $$$Q$$$ lines contain a single integer $$$X_i$$$ $$$(1 \\\\le X_i \\\\le N)$$$, which denotes the start of Mr. Chanek's visit on day $$$i$$$, for $$$(1 \\\\le i \\\\le Q)$$$.OutputOutput $$$Q$$$ lines, line $$$i$$$ gives the sum of distances from the harvested bushes to $$$X_i$$$, and the number of harvested bushes.ExamplesInput2 3 1 2 1 2 1 1Output0 1 0 1 1 2Input5 3 2 1 1 3 2 1 2 2 1 1 1 1Output6 5 3 2 4 4NoteFor the first example:On day 1, Mr. Chanek starts at vertex $$$2$$$ and can harvest the bush at vertex 2.On day 2, Mr. Chanek starts at vertex $$$1$$$ and only harvest from bush $$$1$$$ (bush 2's fruit still has not grown yet).On day 3, Mr. Chanek starts at vertex $$$1$$$ and harvests the fruits on bush $$$1$$$ and $$$2$$$. The sum of distances from every harvested bush to $$$1$$$ is $$$1$$$.For the second example, Mr. Chanek always starts at vertex $$$1$$$. The bushes which Mr. Chanek harvests on day one, two, and three are $$$[1, 2, 3, 4, 5], [2, 3], [1, 2, 3, 5]$$$, respectively.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "41a3c213", "template_md5": "35d339e4", "result": "There is a tree with $N$ vertices numbered from 1 to $N$. Each vertex has a value $A_i$ representing how many days it takes for a bush on that vertex to grow fruit after being harvested.  The tree is rooted at vertex 1.\n\nFor each of the $Q$ days, a person visits a specific vertex $X_i$ and harvests all the fruit from the subtree rooted at $X_i$.\n\nFor each day, you need to calculate:\n\n1. The sum of the distances from each harvested bush to the visited vertex $X_i$.\n2. The total number of harvested bushes.\n\n**Input:**\n\n* The first line contains two integers $N$ and $Q$.\n* The second line contains $N$ integers $A_i$.\n* The third line contains $N-1$ integers $P_i$, representing the parent of each vertex.\n* The next $Q$ lines contain a single integer $X_i$.\n\n**Output:**\n\nFor each day, output two values: the sum of distances and the number of harvested bushes."}, {"prompt_md5": "ad7a93de", "template_md5": "465699a0", "result": "You are given a tree with $N$ nodes. Each node has a value representing how many days it takes for a fruit to grow back after being harvested.  You will be given $Q$ days. On each day, you will choose a node and harvest all the fruits from its subtree. For each day, calculate the total distance from the chosen node to all harvested nodes and the number of harvested nodes."}]}