{"uid": "1430-E", "url": "https://codeforces.com/contest/1430/problem/E", "tags": ["data structures", " greedy", " strings"], "title": "1430-E", "statement": "E. String Reversaltime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$. You have to reverse it — that is, the first letter should become equal to the last letter before the reversal, the second letter should become equal to the second-to-last letter before the reversal — and so on. For example, if your goal is to reverse the string \"abddea\", you should get the string \"aeddba\". To accomplish your goal, you can swap theneighboring elements of the string.Your task is to calculate the minimum number of swaps you have to perform to reverse the given string.InputThe first line contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 200\\\\,000$$$) — the length of $$$s$$$.The second line contains $$$s$$$ — a string consisting of $$$n$$$ lowercase Latin letters.OutputPrint one integer — the minimum number of swaps of neighboring elements you have to perform to reverse the string.ExamplesInput5 aaazaOutput2Input6 cbaabcOutput0Input9 icpcsguruOutput30NoteIn the first example, you have to swap the third and the fourth elements, so the string becomes \"aazaa\". Then you have to swap the second and the third elements, so the string becomes \"azaaa\". So, it is possible to reverse the string in two swaps.Since the string in the second example is a palindrome, you don't have to do anything to reverse it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a71a1e00", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  You can swap any two adjacent letters in the string. What is the minimum number of swaps needed to reverse the string?\n\nFor example:\n\n* If the string is \"abddea\", the minimum number of swaps is 2.\n* If the string is \"cbaabc\", the minimum number of swaps is 0 (it is already reversed). \n\n\n\nLet me know if you'd like help with the algorithm to solve this!"}, {"prompt_md5": "c273c91a", "template_md5": "465699a0", "result": "You are given a string.  Determine the fewest swaps needed to reverse the string, where a swap is exchanging any two adjacent letters."}]}