{"uid": "1431-B", "url": "https://codeforces.com/contest/1431/problem/B", "tags": ["*special", " implementation", " two pointers"], "title": "1431-B", "statement": "B. Polycarp and the Language of Godstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp has just finished writing down the lecture on elvish languages. The language this week was \"VwV\" (pronounced as \"uwu\"). The writing system of this language consists of only two lowercase Latin letters: 'v' and 'w'.Unfortunately, Polycarp has written all the lecture in cursive and without any spaces, so the notes look like a neverending sequence of squiggles. To be exact, Polycarp can't tell 'w' apart from 'vv' in his notes as both of them consist of the same two squiggles.Luckily, his brother Monocarp has better writing habits, so Polycarp managed to take his notes and now wants to make his own notes more readable. To do that he can follow the notes of Monocarp and underline some letters in his own notes in such a way that there is no more ambiguity. If he underlines a 'v', then it can't be mistaken for a part of some 'w', and if the underlines a 'w', then it can't be mistaken for two adjacent letters 'v'.What is the minimum number of letters Polycarp should underline to make his notes unambiguous?InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of testcases.Each of the next $$$t$$$ lines contains a non-empty string in VwV language, which consists only of lowercase Latin letters 'v' and 'w'. The length of the string does not exceed $$$100$$$.OutputFor each testcase print a single integer: the minimum number of letters Polycarp should underline so that there is no ambiguity in his notes.ExampleInput5 vv v w vwv vwvvwvOutput1 0 1 1 3NoteIn the first testcase it's enough to underline any of the two letters 'v'.In the second testcase the letter 'v' is not ambiguous by itself already, so you don't have to underline anything.In the third testcase you have to underline 'w', so that you don't mix it up with two letters 'v'.In the fourth testcase you can underline 'w' to avoid all the ambiguity.In the fifth testcase you can underline both letters 'w' and any of the two letters 'v' between them.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f7081049", "template_md5": "35d339e4", "result": "You are given a string consisting only of lowercase letters 'v' and 'w'.  The problem is to determine the minimum number of letters you need to underline in the string so that it becomes unambiguous.  \n\nHere's the rule:\n\n* Underlining a 'v' prevents it from being mistaken for part of a 'w'.\n* Underlining a 'w' prevents it from being mistaken for two adjacent 'v's.\n\n\nFor example:\n\n* \"vvv\" needs 1 underline.\n* \"vwv\" needs 1 underline.\n* \"vwvwv\" needs 3 underlines. \n\n\n\nInput:\n\nThe first line contains the number of test cases. Each subsequent line contains a string of 'v's and 'w's.\n\nOutput:\n\nFor each test case, print the minimum number of underlines needed."}, {"prompt_md5": "49656696", "template_md5": "465699a0", "result": "You are given a string consisting only of 'v' and 'w'.  Determine the minimum number of letters you need to underline so that the string can be read unambiguously, where 'w' can be represented as 'vv'."}]}