{"uid": "1433-C", "url": "https://codeforces.com/contest/1433/problem/C", "tags": ["constructive algorithms", " greedy"], "title": "1433-C", "statement": "C. Dominant Piranhatime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ piranhas with sizes $$$a_1, a_2, \\\\ldots, a_n$$$ in the aquarium. Piranhas are numbered from left to right in order they live in the aquarium.Scientists of the Berland State University want to find if there isdominantpiranha in the aquarium. The piranha is calleddominantif it can eat all the other piranhas in the aquarium (except itself, of course). Other piranhas will do nothing while thedominantpiranha will eat them.Because the aquarium is pretty narrow and long, the piranha can eat only one of the adjacent piranhas during one move. Piranha can do as many moves as it needs (or as it can). More precisely:The piranha $$$i$$$ can eat the piranha $$$i-1$$$ if the piranha $$$i-1$$$ exists and $$$a_{i - 1} < a_i$$$.The piranha $$$i$$$ can eat the piranha $$$i+1$$$ if the piranha $$$i+1$$$ exists and $$$a_{i + 1} < a_i$$$.When the piranha $$$i$$$ eats some piranha, itssize increases by one($$$a_i$$$ becomes $$$a_i + 1$$$).Your task is to findany dominantpiranha in the aquarium or determine if there are no such piranhas.Note that you have to findany(exactly one) dominant piranha, you don't have to find all of them.For example, if $$$a = [5, 3, 4, 4, 5]$$$, then the third piranha can bedominant. Consider the sequence of its moves:The piranha eats the second piranha and $$$a$$$ becomes $$$[5, \\\\underline{5}, 4, 5]$$$ (the underlined piranha is our candidate).The piranha eats the third piranha and $$$a$$$ becomes $$$[5, \\\\underline{6}, 5]$$$.The piranha eats the first piranha and $$$a$$$ becomes $$$[\\\\underline{7}, 5]$$$.The piranha eats the second piranha and $$$a$$$ becomes $$$[\\\\underline{8}]$$$.You have to answer $$$t$$$ independent test cases.InputThe first line of the input contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 2 \\\\cdot 10^4$$$) — the number of test cases. Then $$$t$$$ test cases follow.The first line of the test case contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 3 \\\\cdot 10^5$$$) — the number of piranhas in the aquarium. The second line of the test case contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$), where $$$a_i$$$ is the size of the $$$i$$$-th piranha.It is guaranteed that the sum of $$$n$$$ does not exceed $$$3 \\\\cdot 10^5$$$ ($$$\\\\sum n \\\\le 3 \\\\cdot 10^5$$$).OutputFor each test case, print the answer:-1if there are no dominant piranhas in the aquarium orindexofanydominant piranha otherwise. If there are several answers, you can print any.ExampleInput6 5 5 3 4 4 5 3 1 1 1 5 4 4 3 4 4 5 5 5 4 3 2 3 1 1 2 5 5 4 3 5 5Output3 -1 4 3 3 1NoteThe first test case of the example is described in the problem statement.In the second test case of the example, there are no dominant piranhas in the aquarium.In the third test case of the example, the fourth piranha can firstly eat the piranha to the left and the aquarium becomes $$$[4, 4, 5, 4]$$$, then it can eat any other piranha in the aquarium.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "89e51f71", "template_md5": "35d339e4", "result": "You are given an array of integers $a$ of length $n$ representing the sizes of $n$ piranhas.  A piranha is considered dominant if it can eat all the other piranhas in the array (except itself). A piranha can only eat an adjacent piranha that is smaller than it.  When a piranha eats another, its size increases by 1.\n\nYour task is to find any dominant piranha in the array, or determine if there are no dominant piranhas. \n\nYou will be given multiple test cases. Each test case consists of:\n\n* An integer $n$ representing the number of piranhas.\n* An array of $n$ integers $a_1, a_2, ..., a_n$ representing the sizes of the piranhas.\n\n\n\nFor each test case, output:\n\n* The index of any dominant piranha, or -1 if there are no dominant piranhas."}, {"prompt_md5": "a197d1d2", "template_md5": "465699a0", "result": "You are given a list of numbers representing the sizes of fish in a tank.  Find a fish that is larger than all its neighbors and can eat all the other fish. If no such fish exists, say so."}]}