{"uid": "1436-B", "url": "https://codeforces.com/contest/1436/problem/B", "tags": ["constructive algorithms", " math"], "title": "1436-B", "statement": "B. Prime Squaretime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSasha likes investigating different math objects, for example, magic squares. But Sasha understands that magic squares have already been studied by hundreds of people, so he sees no sense of studying them further. Instead, he invented his own type of square — a prime square.A square of size $$$n \\\\times n$$$ is called prime if the following three conditions are held simultaneously:all numbers on the square are non-negative integers not exceeding $$$10^5$$$;there are no prime numbers in the square;sums of integers in each row and each column are prime numbers.Sasha has an integer $$$n$$$. He asks you to find any prime square of size $$$n \\\\times n$$$. Sasha is absolutely sure such squares exist, so just help him!InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10$$$) — the number of test cases.Each of the next $$$t$$$ lines contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 100$$$) — the required size of a square.OutputFor each test case print $$$n$$$ lines, each containing $$$n$$$ integers — the prime square you built. If there are multiple answers, print any.ExampleInput2 4 2Output4 6 8 1 4 9 9 9 4 10 10 65 1 4 4 4 1 1 1 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97504c60", "template_md5": "35d339e4", "result": "You are given a number  $n$.  You need to create a square of size $n \\times n$ that meets the following conditions:\n\n1. All the numbers in the square are non-negative integers less than or equal to $10^5$.\n2. There are no prime numbers in the square.\n3. The sum of the numbers in each row and each column is a prime number.\n\nPrint the square you created."}, {"prompt_md5": "81950cdb", "template_md5": "465699a0", "result": "Given a number n, find a square of size n x n filled with non-negative integers less than or equal to 100,000 where:\n\n* There are no prime numbers in the square.\n* The sum of numbers in each row and each column is a prime number."}]}