{"uid": "1436-C", "url": "https://codeforces.com/contest/1436/problem/C", "tags": ["binary search", " combinatorics"], "title": "1436-C", "statement": "C. Binary Searchtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAndrey thinks he is truly a successful developer, but in reality he didn't know about the binary search algorithm until recently. After reading some literature Andrey understood that this algorithm allows to quickly find a certain number $$$x$$$ in an array. For an array $$$a$$$ indexed from zero, and an integer $$$x$$$ the pseudocode of the algorithm is as follows:Note that the elements of the array are indexed from zero, and the division is done in integers (rounding down).Andrey read that the algorithm only works if the array is sorted. However, he found this statement untrue, because there certainly exist unsorted arrays for which the algorithm find $$$x$$$!Andrey wants to write a letter to the book authors, but before doing that he must consider the permutations of size $$$n$$$ such that the algorithm finds $$$x$$$ in them. A permutation of size $$$n$$$ is an array consisting of $$$n$$$ distinct integers between $$$1$$$ and $$$n$$$ in arbitrary order.Help Andrey and find the number of permutations of size $$$n$$$ which contain $$$x$$$ at position $$$pos$$$ and for which the given implementation of the binary search algorithm finds $$$x$$$ (returns true). As the result may be extremely large, print the remainder of its division by $$$10^9+7$$$.InputThe only line of input contains integers $$$n$$$, $$$x$$$ and $$$pos$$$ ($$$1 \\\\le x \\\\le n \\\\le 1000$$$, $$$0 \\\\le pos \\\\le n - 1$$$) — the required length of the permutation, the number to search, and the required position of that number, respectively.OutputPrint a single number — the remainder of the division of the number of valid permutations by $$$10^9+7$$$.ExamplesInput4 1 2Output6Input123 42 24Output824071958NoteAll possible permutations in the first test case: $$$(2, 3, 1, 4)$$$, $$$(2, 4, 1, 3)$$$, $$$(3, 2, 1, 4)$$$, $$$(3, 4, 1, 2)$$$, $$$(4, 2, 1, 3)$$$, $$$(4, 3, 1, 2)$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "682b4864", "template_md5": "35d339e4", "result": "Given an integer $n$, an integer $x$, and a position $pos$ ($0 \\le pos \\le n-1$), find the number of permutations of size $n$ that contain $x$ at position $pos$ and for which the following binary search algorithm finds $x$:\n\n* **Initialization:**\n    *  $left = 0$\n    *  $right = n - 1$\n\n* **Iteration:**\n    * While $left \\le right$:\n        * $mid = \\lfloor (left + right) / 2 \\rfloor$\n        * If $a[mid] = x$:\n            * Return `true`\n        * Else if $a[mid] < x$:\n            * $left = mid + 1$\n        * Else:\n            * $right = mid - 1$\n\n* **Return `false`**\n\nThe result may be extremely large, so print the remainder of its division by $10^9 + 7$."}, {"prompt_md5": "8bd37f75", "template_md5": "465699a0", "result": "You are given a number n, a target number x, and a position pos.  Find the number of ways to arrange n distinct numbers from 1 to n such that x is in the specified position and a specific binary search algorithm will find x.  The result should be the remainder after dividing by 10^9 + 7."}]}