{"uid": "1440-A", "url": "https://codeforces.com/contest/1440/problem/A", "tags": ["implementation", " math"], "title": "1440-A", "statement": "A. Buy the Stringtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given four integers $$$n$$$, $$$c_0$$$, $$$c_1$$$ and $$$h$$$ and a binary string $$$s$$$ of length $$$n$$$.A binary string is a string consisting of characters $$$0$$$ and $$$1$$$.You can change any character of the string $$$s$$$ (the string should be still binary after the change). You should pay $$$h$$$ coins for each change.After some changes (possibly zero) you want to buy the string. To buy the string you should buy all its characters. To buy the character $$$0$$$ you should pay $$$c_0$$$ coins, to buy the character $$$1$$$ you should pay $$$c_1$$$ coins.Find the minimum number of coins needed to buy the string.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10$$$) — the number of test cases. Next $$$2t$$$ lines contain descriptions of test cases.The first line of the description of each test case contains four integers $$$n$$$, $$$c_{0}$$$, $$$c_{1}$$$, $$$h$$$ ($$$1 \\\\leq n, c_{0}, c_{1}, h \\\\leq 1000$$$).The second line of the description of each test case contains the binary string $$$s$$$ of length $$$n$$$.OutputFor each test case print a single integer — the minimum number of coins needed to buy the string.ExampleInput6 3 1 1 1 100 5 10 100 1 01010 5 10 1 1 11111 5 1 10 1 11111 12 2 1 10 101110110101 2 100 1 10 00Output3 52 5 10 16 22NoteIn the first test case, you can buy all characters and pay $$$3$$$ coins, because both characters $$$0$$$ and $$$1$$$ costs $$$1$$$ coin.In the second test case, you can firstly change $$$2$$$-nd and $$$4$$$-th symbols of the string from $$$1$$$ to $$$0$$$ and pay $$$2$$$ coins for that. Your string will be $$$00000$$$. After that, you can buy the string and pay $$$5 \\\\cdot 10 = 50$$$ coins for that. The total number of coins paid will be $$$2 + 50 = 52$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "170380a4", "template_md5": "35d339e4", "result": "You are given a binary string of length $n$ consisting of 0s and 1s. You can change any character in the string to the other character (0 to 1 or 1 to 0). Each change costs $h$ coins.  \n\nYou want to buy the entire string. Buying a 0 costs $c_0$ coins, and buying a 1 costs $c_1$ coins.\n\nFind the minimum number of coins needed to buy the string after making any necessary changes. \n\n\nInput:\n\n* The first line contains an integer $t$ (1 ≤ $t$ ≤ 10), the number of test cases.\n* Each test case has two lines:\n    * The first line contains four integers $n$, $c_0$, $c_1$, and $h$ (1 ≤ $n$, $c_0$, $c_1$, $h$ ≤ 1000).\n    * The second line contains the binary string of length $n$.\n\nOutput:\n\nFor each test case, print the minimum number of coins needed to buy the string."}, {"prompt_md5": "9607f23c", "template_md5": "465699a0", "result": "You have a string of 0s and 1s. You can change any 0 to a 1 or vice versa for a cost.  You need to buy each character in the string for a different price depending on whether it's a 0 or a 1. Find the cheapest way to buy the entire string."}]}