{"uid": "1451-F", "url": "https://codeforces.com/contest/1451/problem/F", "tags": ["constructive algorithms", " games"], "title": "1451-F", "statement": "F. Nullify The Matrixtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJeel and Ashish play a game on an $$$n \\\\times m$$$ matrix. The rows are numbered $$$1$$$ to $$$n$$$ from top to bottom and the columns are numbered $$$1$$$ to $$$m$$$ from left to right. They play turn by turn. Ashish goesfirst.Initially, each cell of the matrix contains a non-negative integer. Each turn, a player must performallof the following actions in order.Choose a starting cell $$$(r_1, c_1)$$$ withnon-zerovalue.Choose a finishing cell $$$(r_2, c_2)$$$ such that $$$r_1 \\\\leq r_2$$$ and $$$c_1 \\\\leq c_2$$$.Decrease the value of the starting cell by some positive non-zero integer.Pick any of the shortest paths between the two cells and either increase, decrease or leave the values of cells on this path unchanged. Note that:a shortest path is one that passes through the least number of cells;all cells on this pathexcludingthe starting cell, but the finishing cell may be modified;the resulting value of each cell must be a non-negative integer;the cells are modified independently and not necessarily by the same value.If the starting and ending cells are the same, then as per the rules, the value of the cell is decreased. No other operations are performed.The game ends when all the values become zero. The player who is unable to make a move loses. It can be shown that the game will end in a finite number of moves if both players play optimally.Given the initial matrix, if both players play optimally, can you predict who will win?InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10$$$) — the number of test cases. The description of each test case is as follows.The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n, m \\\\leq 100$$$) — the dimensions of the matrix.The next $$$n$$$ lines contain $$$m$$$ space separated integers $$$a_{i,j}$$$ ($$$0 \\\\leq a_{i,j} \\\\leq 10^6$$$) — the values of each cell of the matrix.OutputFor each test case, if Ashish wins the game, print \"Ashish\", otherwise print \"Jeel\" (without the quotes).ExampleInput4 1 1 0 1 3 0 0 5 2 2 0 1 1 0 3 3 1 2 3 4 5 6 7 8 9OutputJeel Ashish Jeel AshishNoteIn the first test case, the only cell of the matrix is 0. There are no moves Ashish can make. Jeel is the winner.In the second test case, Ashish can choose $$$(r_1, c_1) = (r_2, c_2) = (1,3)$$$ and reduce the cell to $$$0$$$, leaving $$$[0, 0, 0]$$$. Jeel cannot perform any moves. Ashish wins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3c6c90a6", "template_md5": "35d339e4", "result": "Two players take turns modifying a matrix.  \n\n* The matrix is of size $n \\times m$.\n* Each cell initially contains a non-negative integer.\n* On each turn, a player must:\n    * Choose a starting cell $(r_1, c_1)$ with a non-zero value.\n    * Choose a finishing cell $(r_2, c_2)$ such that $r_1 \\le r_2$ and $c_1 \\le c_2$.\n    * Decrease the value of the starting cell by a positive integer.\n    * Choose any shortest path between the two cells (a shortest path is one that passes through the fewest cells).\n    * Modify the values of cells on this path (increase, decrease, or leave unchanged). The starting cell's value is decreased, but the ending cell can be modified.\n* The game ends when all cell values become zero. The player who cannot make a move loses.\n\nGiven the initial matrix, determine who wins if both players play optimally."}, {"prompt_md5": "e38aea2e", "template_md5": "465699a0", "result": "Two players take turns modifying a grid of numbers.  On each turn, a player chooses a starting cell and an ending cell in the grid. The player decreases the starting cell's value and can then change the values of cells along a shortest path between the starting and ending cells (they can increase, decrease, or leave the values unchanged). The game ends when all the numbers in the grid are zero. The first player unable to make a move loses. Determine which player will win if both play optimally."}]}