{"uid": "1451-D", "url": "https://codeforces.com/contest/1451/problem/D", "tags": ["games", " geometry", " math"], "title": "1451-D", "statement": "D. Circle Gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputUtkarsh is forced to play yet another one of Ashish's games. The game progresses turn by turn and as usual, Ashish movesfirst.Consider the 2D plane. There is a token which is initially at$$$(0,0)$$$. In one move a player must increase either the $$$x$$$ coordinate or the $$$y$$$ coordinate of the token byexactly$$$k$$$. In doing so, the player must ensure that the token stays within a (Euclidean) distance $$$d$$$ from $$$(0,0)$$$.In other words, if after a move the coordinates of the token are $$$(p,q)$$$, then $$$p^2 + q^2 \\\\leq d^2$$$ must hold.The game ends when a player is unable to make a move. It can be shown that the game will end in a finite number of moves. If both players play optimally, determine who will win.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$) — the number of test cases.The only line of each test case contains two space separated integers $$$d$$$ ($$$1 \\\\leq d \\\\leq 10^5$$$) and $$$k$$$ ($$$1 \\\\leq k \\\\leq d$$$).OutputFor each test case, if Ashish wins the game, print \"Ashish\", otherwise print \"Utkarsh\" (without the quotes).ExampleInput5 2 1 5 2 10 3 25 4 15441 33OutputUtkarsh Ashish Utkarsh Utkarsh AshishNoteIn the first test case, one possible sequence of moves can be$$$(0, 0) \\\\xrightarrow{\\\\text{Ashish }} (0, 1) \\\\xrightarrow{\\\\text{Utkarsh }} (0, 2)$$$.Ashish has no moves left, so Utkarsh wins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f86ce233", "template_md5": "35d339e4", "result": "There is a token on a 2D plane starting at (0,0).  Players take turns moving the token.  In one move, a player can increase either the x-coordinate or the y-coordinate of the token by a fixed value *k*.  The token must always stay within a distance *d* from the origin (0,0).  The game ends when a player cannot make a legal move. Determine which player will win if both players play optimally.\n\nInput:\n\n* The first line contains the number of test cases *t*.\n* Each test case contains two space-separated integers *d* and *k*.\n\nOutput:\n\n* For each test case, print \"Player 1\" if Player 1 wins, otherwise print \"Player 2\"."}, {"prompt_md5": "da3d9f83", "template_md5": "465699a0", "result": "Two players take turns moving a token on a grid.  Each move increases either the x or y coordinate of the token by a fixed amount. The token must always stay within a certain distance from the center of the grid. The first player who cannot make a legal move loses. Determine which player will win if both play optimally."}]}