{"uid": "1452-C", "url": "https://codeforces.com/contest/1452/problem/C", "tags": ["greedy"], "title": "1452-C", "statement": "C. Two Bracketstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$, consisting of brackets of two types: '(', ')', '[' and ']'.A string is called a regular bracket sequence (RBS) if it's of one of the following types:empty string;'(' + RBS + ')';'[' + RBS + ']';RBS + RBS.where plus is a concatenation of two strings.In one move you can choose a non-empty subsequence of the string $$$s$$$ (not necessarily consecutive) that is an RBS, remove it from the string and concatenate the remaining parts without changing the order.What is the maximum number of moves you can perform?InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of testcases.Each of the next $$$t$$$ lines contains a non-empty string, consisting only of characters '(', ')', '[' and ']'. The total length of the strings over all testcases doesn't exceed $$$2 \\\\cdot 10^5$$$.OutputFor each testcase print a single integer — the maximum number of moves you can perform on a given string $$$s$$$.ExampleInput5 () []() ([)] )]([ )[(]Output1 2 2 0 1NoteIn the first example you can just erase the whole string.In the second example you can first erase the brackets on positions $$$1$$$ and $$$2$$$: \"[]()\", then \"()\" is left. After that you can erase it whole. You could erase the whole string from the beginning but you would get one move instead of two.In the third example you can first erase the brackets on positions $$$1$$$ and $$$3$$$: \"([)]\". They form an RBS \"()\". Then \"[]\" is left, so you can erase it whole.In the fourth example there is no subsequence that is an RBS, so you can't perform a move at all.In the fifth example you can erase the brackets on positions $$$2$$$ and $$$4$$$: \")[(]\" and get \")(\" as a result. You can erase nothing from it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2ee6118a", "template_md5": "35d339e4", "result": "You are given a string consisting of parentheses and brackets:  '(', ')', '[', and ']'.\n\nA valid bracket sequence is:\n\n* An empty string\n* A string that starts with '(' followed by a valid bracket sequence and ends with ')'\n* A string that starts with '[' followed by a valid bracket sequence and ends with ']'\n* Two valid bracket sequences concatenated together.\n\nYou can remove any valid bracket sequence from the string and combine the remaining parts.\n\nWhat is the maximum number of times you can remove a valid bracket sequence from the string?"}, {"prompt_md5": "5c919c70", "template_md5": "465699a0", "result": "You are given a string of parentheses.  You can remove any valid, nested set of parentheses from the string in one move. What is the maximum number of times you can remove a set of parentheses?"}]}