{"uid": "1453-F", "url": "https://codeforces.com/contest/1453/problem/F", "tags": ["dp"], "title": "1453-F", "statement": "F. Even Hardertime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputGildong is now developing a puzzle game. The puzzle consists of $$$n$$$ platforms numbered from $$$1$$$ to $$$n$$$. The player plays the game as a character that can stand on each platform and the goal of the game is to move the character from the $$$1$$$-st platform to the $$$n$$$-th platform.The $$$i$$$-th platform is labeled with an integer $$$a_i$$$ ($$$0 \\\\le a_i \\\\le n-i$$$). When the character is standing on the $$$i$$$-th platform, the player can move the character to any of the $$$j$$$-th platforms where $$$i+1 \\\\le j \\\\le i+a_i$$$. If the character is on the $$$i$$$-th platform where $$$a_i=0$$$ and $$$i \\\\ne n$$$, the player loses the game.Since Gildong thinks the current game is not hard enough, he wants to make it even harder. He wants to change some (possibly zero) labels to $$$0$$$ so that there remains exactly one way to win. He wants to modify the game as little as possible, so he's asking you to find theminimumnumber of platforms that should have their labels changed. Two ways are different if and only if there exists a platform the character gets to in one way but not in the other way.InputEach test contains one or more test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 500$$$).Each test case contains two lines. The first line of each test case consists of an integer $$$n$$$ ($$$2 \\\\le n \\\\le 3000$$$) — the number of platforms of the game.The second line of each test case contains $$$n$$$ integers. The $$$i$$$-th integer is $$$a_i$$$ ($$$0 \\\\le a_i \\\\le n-i$$$) — the integer of the $$$i$$$-th platform.It is guaranteed that:For each test case, there is at least one way to win initially.The sum of $$$n$$$ in all test cases doesn't exceed $$$3000$$$.OutputFor each test case, print one integer — the minimum number of different labels that should be changed to $$$0$$$ so that there remains exactly one way to win.ExampleInput3 4 1 1 1 0 5 4 3 2 1 0 9 4 1 4 2 1 0 2 1 0Output0 3 2NoteIn the first case, the player can only move to the next platform until they get to the $$$4$$$-th platform. Since there is already only one way to win, the answer is zero.In the second case, Gildong can change $$$a_2$$$, $$$a_3$$$, and $$$a_4$$$ to $$$0$$$ so that the game becomes $$$4$$$ $$$0$$$ $$$0$$$ $$$0$$$ $$$0$$$. Now the only way the player can win is to move directly from the $$$1$$$-st platform to the $$$5$$$-th platform.In the third case, Gildong can change $$$a_2$$$ and $$$a_8$$$ to $$$0$$$, then the only way to win is to move in the following way: $$$1$$$ – $$$3$$$ – $$$7$$$ – $$$9$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d1a21659", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ platforms numbered from 1 to $n$. Each platform $i$ has a label $a_i$ ($0 \\le a_i \\le n-i$).  \n\nA player starts on platform 1 and wants to reach platform $n$.  From platform $i$, the player can move to any platform $j$ where $i+1 \\le j \\le i+a_i$. If the player is on platform $i$ where $a_i = 0$ and $i \\neq n$, the player loses.\n\nYour task is to find the minimum number of platforms whose labels you need to change to 0 to ensure there is only one way for the player to win the game. \n\n**Input:**\n\n* The first line contains the number of test cases $t$ ($1 \\le t \\le 500$).\n* Each test case has two lines:\n    * The first line contains $n$ ($2 \\le n \\le 3000$) - the number of platforms.\n    * The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 \\le a_i \\le n-i$).\n\n**Output:**\n\nFor each test case, print the minimum number of platforms to change."}, {"prompt_md5": "76ec4f06", "template_md5": "465699a0", "result": "You are given a sequence of numbers. Each number represents the number of steps you can take forward from a given position.  You must reach the end of the sequence.  Find the fewest numbers you need to change to 0 so that there is only one way to reach the end."}]}