{"uid": "1458-D", "url": "https://codeforces.com/contest/1458/problem/D", "tags": ["data structures", " graphs", " greedy"], "title": "1458-D", "statement": "D. Flip and Reversetime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$ of0's and1's. You are allowed to perform the following operation:choose a non-empty contiguous substring of $$$s$$$ that contains an equal number of0's and1's;flip all characters in the substring, that is, replace all0's with1's, and vice versa;reverse the substring.For example, consider $$$s$$$ =00111011, and the following operation:Choose the first six characters as the substring to act upon:00111011. Note that the number of0's and1's are equal, so this is a legal choice. Choosing substrings0,110, or the entire string would not be possible.Flip all characters in the substring:11000111.Reverse the substring:10001111.Find the lexicographically smallest string that can be obtained from $$$s$$$ after zero or more operations.InputThe first line contains a single integer $$$T$$$ ($$$1 \\\\leq T \\\\leq 5 \\\\cdot 10^5$$$) — the number of test cases. Each of the following $$$T$$$ lines contains a single non-empty string — the input string $$$s$$$ for the respective test case.All strings consist of characters0and1, and their total length does not exceed $$$5 \\\\cdot 10^5$$$.OutputFor each test case, on a separate line print the lexicographically smallest string that can be obtained from $$$s$$$ after zero or more operations.ExampleInput3 100101 1100011 10101010Output010110 0110110 10101010NoteIn the first test case a single operation should be applied to the entire string.In the second test case two operations are needed:0111001,0110110.In the third test case the string stays the same after any operation.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cd5a7432", "template_md5": "35d339e4", "result": "You are given a string consisting of 0s and 1s. You can perform the following operation any number of times:\n\n1. Choose a section of the string that has an equal number of 0s and 1s.\n2. Flip all the 0s to 1s and all the 1s to 0s in that section.\n3. Reverse the order of the characters in that section.\n\nFind the lexicographically smallest string you can create from the original string using these operations. \n\n**Input:**\n\n* The first line contains a number  *T*  (1 ≤ *T* ≤ 5 * 10^5) representing the number of test cases.\n* Each of the following *T* lines contains a string of 0s and 1s.\n\n**Output:**\n\n* For each test case, print the lexicographically smallest string you can create."}, {"prompt_md5": "36bf681f", "template_md5": "465699a0", "result": "You are given a string of 0s and 1s. You can choose any section of the string that has an equal number of 0s and 1s, flip all the 0s to 1s and 1s to 0s, and then reverse that section.  Find the smallest possible string you can make by doing this zero or more times."}]}