{"uid": "1459-B", "url": "https://codeforces.com/contest/1459/problem/B", "tags": ["dp", " math"], "title": "1459-B", "statement": "B. Move and Turntime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputA robot is standing at the origin of the infinite two-dimensional plane. Each second the robot moves exactly $$$1$$$ meter in one of the four cardinal directions: north, south, west, and east. For the first step the robotcan choose any of the four directions, but then at the end of every second ithas to turn90 degrees left or right with respect to the direction it just moved in. For example, if the robot has just moved north or south, the next step it takes has to be either west or east, and vice versa.The robot makesexactly$$$n$$$ steps from its starting position according to the rules above. How many different points can the robot arrive to at the end? The final orientation of the robot can be ignored.InputThe only line contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 1000$$$) — the number of steps the robot makes.OutputPrint a single integer — the number of different possible locations afterexactly$$$n$$$ steps.ExamplesInput1Output4Input2Output4Input3Output12NoteIn the first sample case, the robot will end up 1 meter north, south, west, or east depending on its initial direction.In the second sample case, the robot will always end up $$$\\\\sqrt{2}$$$ meters north-west, north-east, south-west, or south-east.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c7809d87", "template_md5": "35d339e4", "result": "A robot starts at the origin (0,0) on a 2D plane.  Every second, the robot moves 1 meter in a direction (north, south, east, or west).  \n\n* The robot can choose any direction for its first move.\n* After each move, the robot turns 90 degrees left or right.\n\nGiven the number of steps  *n*, how many unique coordinates can the robot reach after *n* steps?  The robot's final direction doesn't matter."}, {"prompt_md5": "710d6876", "template_md5": "465699a0", "result": "A robot moves one unit in a direction (north, south, east, west) each second. After each move, it turns 90 degrees left or right.  Given the number of steps, how many unique locations can the robot reach?"}]}