{"uid": "1469-A", "url": "https://codeforces.com/contest/1469/problem/A", "tags": ["constructive algorithms", " greedy"], "title": "1469-A", "statement": "A. Regular Bracket Sequencetime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputA bracket sequence is called regular if it is possible to obtain correct arithmetic expression by inserting characters+and1into this sequence. For example, sequences(())(),()and(()(()))are regular, while)(,(()and(()))(are not. Let's call a regular bracket sequence \"RBS\".You are given a sequence $$$s$$$ of $$$n$$$ characters(,), and/or?.There is exactly one character(and exactly one character)in this sequence.You have to replace every character?with either)or((different characters?can be replaced with different brackets).You cannot reorder the characters, remove them, insert other characters, and each?must be replaced.Determine if it is possible to obtain an RBS after these replacements.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.Each test case consists of one line containing $$$s$$$ ($$$2 \\\\le |s| \\\\le 100$$$) — a sequence of characters(,), and/or?.There is exactly one character(and exactly one character)in this sequence.OutputFor each test case, printYESif it is possible to obtain a regular bracket sequence, orNOotherwise}.You may print each letter in any case (for example,YES,Yes,yes,yEswill all be recognized as positive answer).ExampleInput5 () (?) (??) ??() )?(?OutputYES NO YES YES NONoteIn the first test case, the sequence is already an RBS.In the third test case, you can obtain an RBS as follows:()()or(()).In the fourth test case, you can obtain an RBS as follows:()().", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b281659c", "template_md5": "35d339e4", "result": "You are given a sequence of characters containing only parentheses '(', ')', and question marks '?'. Each '?' represents a missing parenthesis that can be replaced with either '(' or ')'. \n\nDetermine if it is possible to replace all the '?' characters to form a valid \"regular bracket sequence\". A regular bracket sequence is a sequence of parentheses that can be transformed into a correct arithmetic expression by inserting '+' and '1' characters.\n\n**Input:**\n\n* The first line contains the number of test cases,  *t*.\n* Each test case consists of a single line containing a sequence of characters *s* (length 2 to 100) with exactly one '?'.\n\n**Output:**\n\n* For each test case, print \"YES\" if it is possible to form a regular bracket sequence, or \"NO\" otherwise."}, {"prompt_md5": "cb36ba8d", "template_md5": "465699a0", "result": "You are given a sequence of parentheses, question marks, and possibly other characters.  The question marks can be replaced with either an opening or closing parenthesis.  Determine if it's possible to replace all the question marks so that the resulting sequence is a valid sequence of parentheses."}]}