{"uid": "1473-G", "url": "https://codeforces.com/contest/1473/problem/G", "tags": ["combinatorics", " dp", " fft", " math"], "title": "1473-G", "statement": "G. Tilestime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputConsider a road consisting of several rows. Each row is divided into several rectangular tiles, and all tiles in the same row are equal. The first row contains exactly one rectangular tile. Look at the picture below which shows how the tiles are arranged.The road is constructed as follows:the first row consists of $$$1$$$ tile;then $$$a_1$$$ rows follow; each of these rows contains $$$1$$$ tile greater than the previous row;then $$$b_1$$$ rows follow; each of these rows contains $$$1$$$ tile less than the previous row;then $$$a_2$$$ rows follow; each of these rows contains $$$1$$$ tile greater than the previous row;then $$$b_2$$$ rows follow; each of these rows contains $$$1$$$ tile less than the previous row;...then $$$a_n$$$ rows follow; each of these rows contains $$$1$$$ tile greater than the previous row;then $$$b_n$$$ rows follow; each of these rows contains $$$1$$$ tile less than the previous row.An example of the road with $$$n = 2$$$, $$$a_1 = 4$$$, $$$b_1 = 2$$$, $$$a_2 = 2$$$, $$$b_2 = 3$$$. Rows are arranged from left to right.You start from the only tile in the first row and want to reach the last row (any tile of it). From your current tile, you can move to any tile in the next row which touches your current tile.Calculate the number of different paths from the first row to the last row. Since it can be large, print it modulo $$$998244353$$$.InputThe first line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 1000$$$).Then $$$n$$$ lines follow. The $$$i$$$-th of them contains two integers $$$a_i$$$ and $$$b_i$$$ ($$$1 \\\\le a_i, b_i \\\\le 10^5$$$; $$$|a_i - b_i| \\\\le 5$$$).Additional constraint on the input: the sequence of $$$a_i$$$ and $$$b_i$$$ never results in a row with non-positive number of tiles.OutputPrint one integer — the number of paths from the first row to the last row, taken modulo $$$998244353$$$.ExamplesInput2 4 2 2 3Output850Input3 4 1 2 3 3 1Output10150Input8 328 323 867 868 715 718 721 722 439 435 868 870 834 834 797 796Output759099319", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d04c9971", "template_md5": "35d339e4", "result": "You are given a road made up of rows of rectangular tiles. The road is constructed in a specific pattern:\n\n* **Start:** The first row has one tile.\n* **Increasing:**  The next $a_1$ rows each have one more tile than the previous row.\n* **Decreasing:** The next $b_1$ rows each have one fewer tile than the previous row.\n* **Repeat:** This pattern of increasing and decreasing rows repeats $n$ times.\n\nYou start at the only tile in the first row and want to reach any tile in the last row. You can only move to a tile in the next row that touches your current tile.\n\n**Your task:** Calculate the number of different paths you can take from the first tile to any tile in the last row.  The answer may be very large, so print it modulo 998244353. \n\n\n\nLet me know if you'd like help with any part of solving this problem!"}, {"prompt_md5": "9f8d0c10", "template_md5": "465699a0", "result": "You have a road made of rows of tiles. Each row has a number of tiles that increases and decreases in a repeating pattern. You start at the first tile and want to find the number of ways to reach any tile in the last row."}]}