{"uid": "1477-F", "url": "https://codeforces.com/contest/1477/problem/F", "tags": ["combinatorics", " fft", " math", " probabilities"], "title": "1477-F", "statement": "F. Nezzar and Chocolate Barstime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputNezzar buys his favorite snack — $$$n$$$ chocolate bars with lengths $$$l_1,l_2,\\\\ldots,l_n$$$. However, chocolate bars might be too long to store them properly!In order to solve this problem, Nezzar designs an interesting process to divide them into small pieces. Firstly, Nezzar puts all his chocolate bars into a black box. Then, he will perform the following operation repeatedly until the maximum length over all chocolate bars does not exceed $$$k$$$.Nezzar picks a chocolate bar from the box with probability proportional to its length $$$x$$$.After step $$$1$$$, Nezzar uniformly picks a real number $$$r \\\\in (0,x)$$$ and divides the chosen chocolate bar into two chocolate bars with lengths $$$r$$$ and $$$x-r$$$.Lastly, he puts those two new chocolate bars into the black box.Nezzar now wonders, what is the expected number of operations he will perform to divide his chocolate bars into small pieces.It can be shown that the answer can be represented as $$$\\\\frac{P}{Q}$$$, where $$$P$$$ and $$$Q$$$ are coprime integers and $$$Q \\\\not \\\\equiv 0$$$ ($$$\\\\bmod 998\\\\,244\\\\,353$$$). Print the value of $$$P\\\\cdot Q^{-1} \\\\mod 998\\\\,244\\\\,353$$$.InputThe first line contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 50, 1 \\\\le k \\\\le 2000$$$).The second line contains $$$n$$$ integers $$$l_1, l_2, \\\\ldots, l_n$$$ ($$$1 \\\\le l_i$$$, $$$\\\\sum_{i=1}^{n} l_i \\\\le 2000$$$).OutputPrint a single integer — the expected number of operations Nezzar will perform to divide his chocolate bars into small pieces modulo $$$998\\\\,244\\\\,353$$$.ExamplesInput1 1 2Output4Input1 1 1Output0Input1 5 1234Output15630811Input2 1 2 3Output476014684Input10 33 10 20 30 40 50 60 70 80 90 100Output675105648", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fae01ed2", "template_md5": "35d339e4", "result": "You are given $n$ chocolate bars with lengths $l_1, l_2, ..., l_n$.  You want to divide these bars into pieces so that the length of each piece is less than or equal to $k$.\n\nYou can perform the following operation repeatedly:\n\n1. Choose a chocolate bar to divide. The probability of choosing a bar is proportional to its length.\n2. Choose a random number $r$ between 0 and the length of the chosen bar.\n3. Divide the chosen bar into two pieces of length $r$ and $l - r$.\n4. Put the two new pieces into a box.\n\nWhat is the expected number of operations needed to divide all the bars so that no bar has a length greater than $k$?\n\nThe answer can be expressed as a fraction $P/Q$, where $P$ and $Q$ are coprime integers and $Q$ is not divisible by 998244353.  Print the value of $P \\cdot Q^{-1} \\pmod{998244353}$."}, {"prompt_md5": "65afbd7e", "template_md5": "465699a0", "result": "You have a number of items with different lengths. You want to divide them into smaller pieces until the longest piece is less than a given limit. You repeatedly choose an item at random (longer items are more likely to be chosen) and split it into two pieces.  What is the average number of times you need to do this?"}]}