{"uid": "1481-F", "url": "https://codeforces.com/contest/1481/problem/F", "tags": ["dp", " greedy", " trees"], "title": "1481-F", "statement": "F. AB Treetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputKilani and Abd are neighbors for 3000 years, but then the day came and Kilani decided to move to another house. As a farewell gift, Kilani is going to challenge Abd with a problem written by their other neighbor with the same name Abd.The problem is:You are given a connected tree rooted at node $$$1$$$.You should assign a characteraorbto every node in the tree so that the total number ofa's is equal to $$$x$$$ and the total number ofb's is equal to $$$n - x$$$.Let's define a string for each node $$$v$$$ of the tree as follows:if $$$v$$$ is root then the string is just one character assigned to $$$v$$$:otherwise, let's take a string defined for the $$$v$$$'s parent $$$p_v$$$ and add to the end of it a character assigned to $$$v$$$.You should assign every node a character in a way thatminimizes the number of distinct stringsamong the strings of all nodes.InputThe first line contains two integers $$$n$$$ and $$$x$$$ ($$$1 \\\\leq n \\\\leq 10^5$$$; $$$0 \\\\leq x \\\\leq n$$$) — the number of vertices in the tree the number ofa's.The second line contains $$$n - 1$$$ integers $$$p_2, p_3, \\\\dots, p_{n}$$$ ($$$1 \\\\leq p_i \\\\leq n$$$; $$$p_i \\\\neq i$$$), where $$$p_i$$$ is the parent of node $$$i$$$.It is guaranteed that the input describes a connected tree.OutputIn the first line, print the minimum possible total number of distinct strings.In the second line, print $$$n$$$ characters, where all characters are eitheraorband the $$$i$$$-th character is the character assigned to the $$$i$$$-th node.Make sure that the total number ofa's is equal to $$$x$$$ and the total number ofb's is equal to $$$n - x$$$.If there is more than one answer you can print any of them.ExampleInput9 3 1 2 2 4 4 4 3 1Output4 aabbbbbbaNoteThe tree from the sample is shown below:The tree after assigning characters to every node (according to the output) is the following:Strings for all nodes are the following:string of node $$$1$$$ is:astring of node $$$2$$$ is:aastring of node $$$3$$$ is:aabstring of node $$$4$$$ is:aabstring of node $$$5$$$ is:aabbstring of node $$$6$$$ is:aabbstring of node $$$7$$$ is:aabbstring of node $$$8$$$ is:aabbstring of node $$$9$$$ is:aaThe set of unique strings is $$$\\\\{\\\\text{a}, \\\\text{aa}, \\\\text{aab}, \\\\text{aabb}\\\\}$$$, so the number of distinct strings is $$$4$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2b050667", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes.  You need to assign each node either an 'a' or a 'b'.  The total number of 'a's must be $x$, and the total number of 'b's must be $n-x$.\n\nFor each node $v$, define a string $s_v$ as follows:\n\n* If $v$ is the root node, then $s_v$ is just the character assigned to $v$.\n* Otherwise, $s_v$ is formed by taking the string $s_{p_v}$ (where $p_v$ is the parent of $v$) and appending the character assigned to $v$.\n\nFind the minimum number of distinct strings $s_v$ that can be formed for all nodes $v$.\n\nOutput:\n\n1. The minimum number of distinct strings.\n2. A sequence of $n$ characters, where the $i$-th character is the character assigned to the $i$-th node."}, {"prompt_md5": "97cb0217", "template_md5": "465699a0", "result": "You are given a tree-like structure with a certain number of nodes. You need to assign each node either an 'a' or a 'b'. The total number of 'a's must be a given number, and the total number of 'b's must be the remaining number of nodes minus that given number.  Find the smallest number of unique strings you can create by labeling the nodes in this way.  Each string is formed by reading the labels from the root node down to each child node."}]}