{"uid": "1482-G", "url": "https://codeforces.com/contest/1482/problem/G", "tags": ["binary search", " interactive"], "title": "1482-G", "statement": "G. Vabanktime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputGustaw is the chief bank manager in a huge bank. He has unlimited access to the database system of the bank, in a few clicks he can move any amount of money from the bank's reserves to his own private account. However, the bank uses some fancy AI fraud detection system that makes stealing more difficult.Gustaw knows that the anti-fraud system just detects any operation that exceeds some fixed limit $$$M$$$ euros and these operations are checked manually by a number of clerks. Thus, any fraud operation exceeding this limit is detected, while any smaller operation gets unnoticed.Gustaw doesn't know the limit $$$M$$$ and wants to find it out. In one operation, he can choose some integer $$$X$$$ and try to move $$$X$$$ euros from the bank's reserves to his own account. Then, the following happens.If $$$X \\\\le M$$$, the operation is unnoticed and Gustaw's account balance raises by $$$X$$$ euros.Otherwise, if $$$X > M$$$, the fraud is detected and cancelled. Moreover, Gustaw has to pay $$$X$$$ euros from his own account as a fine. If he has less than $$$X$$$ euros on the account, he is fired and taken to the police.Initially Gustaw has $$$1$$$ euro on his account. Help him find the exact value of $$$M$$$ in no more than $$$105$$$ operations without getting him fired.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$).For each test case, there is no input prior to your first query, but you can be sure that $$$M$$$ is integer, and $$$0 \\\\le M \\\\le 10^{14}$$$.OutputFor each test case, when you know the exact value of $$$M$$$, print a single line with format \"!$$$M$$$\". After that your program should proceed to the next test case or terminate, if it is the last one.InteractionWhen you want to make an operation, print a single line with format \"?$$$X$$$\", denoting that you try to move $$$X$$$ euros ($$$1 \\\\le X \\\\le 10^{14}$$$). As a response, read a single line that can take the following values:\"Lucky!\", if $$$X \\\\le M$$$. Your balance raises by $$$X$$$.\"Fraudster!\", if $$$X > M$$$. Your balance decreases by $$$X$$$.\"Fired!\", if $$$X > M$$$, but you can't pay $$$X$$$ euros of fine. In this case your program must terminate immediately. You also get this response if you exceed the number of queries.You can make at most $$$105$$$ such queries in each test case.After printing a query do not forget to output end of line and flush the output. Otherwise, you will getIdleness limit exceeded. To do this, use:fflush(stdout)orcout.flush()in C++;System.out.flush()in Java;flush(output)in Pascal;stdout.flush()in Python;see documentation for other languages.HacksTo make a hack, prepare an input in the following format.The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.Each test case is described with a line containing a single integer $$$M$$$ ($$$0 \\\\le M \\\\le 10^{14}$$$).ExampleInput1  Lucky!  Lucky!  Lucky!  Lucky!  Lucky!  Fraudster!Output? 1  ? 2  ? 3  ? 4  ? 5  ? 6  ! 5NoteIn the example $$$M = 5$$$, so the operation with $$$X = 6$$$ is detected. At this moment, Gustaw's balance is $$$16$$$ euros, so he just pays fine.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e962e638", "template_md5": "35d339e4", "result": "You are given a number $M$ that you don't know.  You can repeatedly choose a number $X$ and perform an operation.\n\n* If $X \\le M$, the operation succeeds, and your balance increases by $X$.\n* If $X > M$, the operation fails, and your balance decreases by $X$.\n\nYou start with a balance of $1$. Your goal is to find the value of $M$ in at most $10^5$ operations without going bankrupt (i.e., having a negative balance).\n\nYou can ask questions of the form \"? $X$\" to perform an operation. The response will be one of the following:\n\n* \"Lucky!\": The operation succeeded.\n* \"Fraudster!\": The operation failed.\n* \"Fired!\": The operation failed, and you cannot afford the fine.\n\n\nYou must output the value of $M$ once you determine it using the format \"! $M$\"."}, {"prompt_md5": "53645308", "template_md5": "465699a0", "result": "You need to find a secret number within a given range (0 to 10^14). You can make guesses, and each guess has a consequence:\n\n* If the guess is less than or equal to the secret number, you get a reward equal to the guess.\n* If the guess is greater than the secret number, you lose the amount of the guess.\n\nYou have a limited number of guesses (10^5) before you lose.  What's the strategy to find the secret number?"}]}