{"uid": "1487-E", "url": "https://codeforces.com/contest/1487/problem/E", "tags": ["brute force", " data structures", " graphs", " greedy", " implementation", " sortings", " two pointers"], "title": "1487-E", "statement": "E. Cheap Dinnertime limit per test4 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputIvan wants to have a good dinner. A good dinner should consist of a first course, a second course, a drink, and a dessert.There are $$$n_1$$$ different types of first courses Ivan can buy (the $$$i$$$-th of them costs $$$a_i$$$ coins), $$$n_2$$$ different types of second courses (the $$$i$$$-th of them costs $$$b_i$$$ coins), $$$n_3$$$ different types of drinks (the $$$i$$$-th of them costs $$$c_i$$$ coins) and $$$n_4$$$ different types of desserts (the $$$i$$$-th of them costs $$$d_i$$$ coins).Some dishes don't go well with each other. There are $$$m_1$$$ pairs of first courses and second courses that don't go well with each other, $$$m_2$$$ pairs of second courses and drinks, and $$$m_3$$$ pairs of drinks and desserts that don't go well with each other.Ivan wants to buy exactly one first course, one second course, one drink, and one dessert so that they go well with each other, and the total cost of the dinner is the minimum possible. Help him to find the cheapest dinner option!InputThe first line contains four integers $$$n_1$$$, $$$n_2$$$, $$$n_3$$$ and $$$n_4$$$ ($$$1 \\\\le n_i \\\\le 150000$$$) — the number of types of first courses, second courses, drinks and desserts, respectively.Then four lines follow. The first line contains $$$n_1$$$ integers $$$a_1, a_2, \\\\dots, a_{n_1}$$$ ($$$1 \\\\le a_i \\\\le 10^8$$$), where $$$a_i$$$ is the cost of the $$$i$$$-th type of first course. Three next lines denote the costs of second courses, drinks, and desserts in the same way ($$$1 \\\\le b_i, c_i, d_i \\\\le 10^8$$$).The next line contains one integer $$$m_1$$$ ($$$0 \\\\le m_1 \\\\le 200000$$$) — the number of pairs of first and second courses that don't go well with each other. Each of the next $$$m_1$$$ lines contains two integers $$$x_i$$$ and $$$y_i$$$ ($$$1 \\\\le x_i \\\\le n_1$$$; $$$1 \\\\le y_i \\\\le n_2$$$) denoting that the first course number $$$x_i$$$ doesn't go well with the second course number $$$y_i$$$. All these pairs are different.The block of pairs of second dishes and drinks that don't go well with each other is given in the same format. The same for pairs of drinks and desserts that don't go well with each other ($$$0 \\\\le m_2, m_3 \\\\le 200000$$$).OutputIf it's impossible to choose a first course, a second course, a drink, and a dessert so that they go well with each other, print $$$-1$$$. Otherwise, print one integer — the minimum total cost of the dinner.ExamplesInput4 3 2 1 1 2 3 4 5 6 7 8 9 10 2 1 2 1 1 2 3 1 3 2 1 1 1Output26Input1 1 1 1 1 1 1 1 1 1 1 0 0Output-1NoteThe best option in the first example is to take the first course $$$2$$$, the second course $$$1$$$, the drink $$$2$$$ and the dessert $$$1$$$.In the second example, the only pair of the first course and the second course is bad, so it's impossible to have dinner.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a7cc92aa", "template_md5": "35d339e4", "result": "There are $n_1$ types of first courses, $n_2$ types of second courses, $n_3$ types of drinks, and $n_4$ types of desserts. Each type of food has a cost: $a_i$ for the $i$-th first course, $b_i$ for the $i$-th second course, $c_i$ for the $i$-th drink, and $d_i$ for the $i$-th dessert.\n\nSome food combinations don't go well together. There are $m_1$ pairs of first courses and second courses that don't go well, $m_2$ pairs of second courses and drinks that don't go well, and $m_3$ pairs of drinks and desserts that don't go well.\n\nFind the cheapest combination of one first course, one second course, one drink, and one dessert that goes well together. If no such combination exists, output -1."}, {"prompt_md5": "13b0d5f0", "template_md5": "465699a0", "result": "You are given lists of items with prices (courses, drinks, desserts). Some item combinations are incompatible. Find the cheapest combination of one item from each list that is compatible. If no compatible combination exists, output -1."}]}