{"uid": "1488-I", "url": "https://codeforces.com/contest/1488/problem/I", "tags": ["*special", " flows"], "title": "1488-I", "statement": "I. Demonic Invasiontime limit per test8 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputDalaran is a flying city of magic. It consists of $$$n$$$ floating islands connected by $$$m$$$ bridges (each bridge can be traversed in both directions). Every island is reachable from every other along these bridges. It would be a shame if some magic experiment went horribly wrong and this magnificent city got destroyed, right?Well, just guess what happened. A portal to demons' realm was opened at the island $$$1$$$. This is the start of day $$$1$$$ of the catastrophe, and all $$$k$$$ mages have gathered at the island $$$1$$$ (they were trying to close the portal, but found out that it was impossible). At the start of day $$$2$$$, a gigantic horde of demons will emerge from the portal, capture the island $$$1$$$ and kill every mage staying at that island. During each day $$$i$$$, if the island $$$v$$$ was captured by demons by the start of the day, the horde of demons will travel across all bridges connecteddirectly to $$$v$$$, capture every island they reach, and kill every mage they meet along the way.Each bridge contains exactly one magic stone. Each mage at the start of the day can do one of the following actions:Spend one day travelling along one of the bridges connected to the island where the mage currently is. When passing through a bridge, the mage can pick up the magic stone from it (if there is any; each magic stone can be picked up by at most one mage). If the bridge is passed by the demons during the same day, or by the start of the next day, the island where the mage goes is already captured by the demonic horde (even if they arrive there at the same moment), the mage is killed.Perform a teleportation ritual to get to safety outside Dalaran. This ritual consumes two magic stones (and cannot be performed if the mage has less than two stones).Each magic stone decays in $$$2$$$ days, so if is picked up in the middle of day $$$i$$$, it decays in the middle of day $$$i + 2$$$. Decayed stones cannot be used in teleportation ritual.Calculate the maximum number of mages that can get to safety.InputThe first line contains three integers $$$n$$$, $$$m$$$ and $$$k$$$ ($$$2 \\\\le n \\\\le 10^5$$$; $$$n - 1 \\\\le m \\\\le 10^5$$$; $$$1 \\\\le k \\\\le 10^5$$$) — the number of islands, the number of bridges and the number of mages.Then $$$m$$$ lines follow, the $$$i$$$-th line contains two integers $$$x_i$$$ and $$$y_i$$$ ($$$1 \\\\le x_i, y_i \\\\le n$$$; $$$x_i \\\\ne y_i$$$) denoting a bridge between the islands $$$x_i$$$ and $$$y_i$$$.Each pair of islands has at most one bridge connecting them. Every island is reachable from every other island along the bridges.OutputPrint one integer — the maximum number of mages that can get to safety.ExamplesInput4 4 1 1 2 2 3 3 4 4 1Output1Input4 4 4 1 2 2 3 3 4 4 1Output2Input3 2 10 1 2 2 3Output1Input4 5 1 1 2 2 3 3 4 4 1 3 1Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "473ebbcb", "template_md5": "35d339e4", "result": "There are $n$ islands connected by $m$ bridges. Each bridge connects two different islands and can be crossed in both directions.  \n\nAt the start of day 1, $k$ people are on island 1. On day 2, demons attack island 1 and kill everyone there.  \n\nOn each subsequent day, if an island is captured by demons, the demons will move to all directly connected islands and capture them, killing anyone there.\n\nEach bridge has one magic stone. A person can:\n\n* Travel across a bridge to a connected island. If they cross a bridge, they can take the magic stone (if there is one). If the bridge is crossed by demons on the same day, or by the start of the next day, the person is killed.\n* Use a teleportation ritual to escape to safety. This requires two magic stones and cannot be done if the person has less than two stones.\n\nMagic stones decay after 2 days.\n\nWhat is the maximum number of people who can escape to safety?"}, {"prompt_md5": "8d6abbb6", "template_md5": "465699a0", "result": "There are islands connected by bridges. Demons start at one island and spread to others each day, killing anyone there. People can move between islands using bridges, but they can also teleport if they have two magic stones. Magic stones decay after two days.  Find the maximum number of people who can escape by teleporting."}]}