{"uid": "149-A", "url": "https://codeforces.com/contest/149/problem/A", "tags": ["greedy", " implementation", " sortings"], "title": "149-A", "statement": "A. Business triptime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutWhat joy! Petya's parents went on a business trip for the whole year and the playful kid is left all by himself. Petya got absolutely happy. He jumped on the bed and threw pillows all day long, until...Today Petya opened the cupboard and found a scary note there. His parents had left him with duties: he should water their favourite flower all year, each day, in the morning, in the afternoon and in the evening. \"Wait a second!\" — thought Petya. He know for a fact that if he fulfills the parents' task in thei-th (1 ≤i≤ 12) month of the year, then the flower will grow byaicentimeters, and if he doesn't water the flower in thei-th month, then the flower won't grow this month. Petya also knows that try as he might, his parents won't believe that he has been watering the flower if it grows strictly less than bykcentimeters.Help Petya choose the minimum number of months when he will water the flower, given that the flower should grow no less than bykcentimeters.InputThe first line contains exactly one integerk(0 ≤k≤ 100). The next line contains twelve space-separated integers: thei-th (1 ≤i≤ 12) number in the line representsai(0 ≤ai≤ 100).OutputPrint the only integer — the minimum number of months when Petya has to water the flower so that the flower grows no less than bykcentimeters. If the flower can't grow bykcentimeters in a year, print-1.ExamplesInput51 1 1 1 2 2 3 2 2 1 1 1Output2Input00 0 0 0 0 0 0 1 1 2 3 0Output0Input111 1 4 1 1 5 1 1 4 1 1 1Output3NoteLet's consider the first sample test. There it is enough to water the flower during the seventh and the ninth month. Then the flower grows by exactly five centimeters.In the second sample Petya's parents will believe him even if the flower doesn't grow at all (k= 0). So, it is possible for Petya not to water the flower at all.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b168bbf9", "template_md5": "35d339e4", "result": "You are given an integer $k$ and 12 integers $a_1, a_2, ..., a_{12}$.  Each $a_i$ represents the amount the flower grows in the $i$th month if watered. If the flower is not watered in a month, it does not grow.\n\nFind the minimum number of months you need to water the flower so that the total growth is at least $k$ centimeters. If it is impossible to reach a growth of at least $k$ centimeters, output -1."}, {"prompt_md5": "9376f00f", "template_md5": "465699a0", "result": "You are given a target growth amount and a list of growth amounts for each month.  Determine the minimum number of months you need to choose from the list so that the total growth is at least the target amount. If it's impossible to reach the target amount, output -1."}]}