{"uid": "149-C", "url": "https://codeforces.com/contest/149/problem/C", "tags": ["greedy", " math", " sortings"], "title": "149-C", "statement": "C. Division into Teamstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPetya loves football very much, especially when his parents aren't home. Each morning he comes to the yard, gathers his friends and they play all day. From time to time they have a break to have some food or do some chores (for example, water the flowers).The key in football is to divide into teams fairly before the game begins. There arenboys playing football in the yard (including Petya), each boy's football playing skill is expressed with a non-negative characteristicai(the larger it is, the better the boy plays).Let's denote the number of players in the first team asx, the number of players in the second team asy, the individual numbers of boys who play for the first team aspiand the individual numbers of boys who play for the second team asqi. Divisionnboys into two teams is considered fair if three conditions are fulfilled:Each boy plays for exactly one team (x+y=n).The sizes of teams differ in no more than one (|x-y| ≤ 1).The total football playing skills for two teams differ in no more than by the value of skill the best player in the yard has. More formally:Your task is to help guys divide into two teams fairly. It is guaranteed that a fair division into two teams always exists.InputThe first line contains the only integern(2 ≤n≤ 105) which represents the number of guys in the yard. The next line containsnpositive space-separated integers,ai(1 ≤ai≤ 104), thei-th number represents thei-th boy's playing skills.OutputOn the first line print an integerx— the number of boys playing for the first team. On the second line printxintegers — the individual numbers of boys playing for the first team. On the third line print an integery— the number of boys playing for the second team, on the fourth line printyintegers — the individual numbers of boys playing for the second team. Don't forget that you should fulfil all three conditions:x+y=n,|x-y| ≤ 1, and the condition that limits the total skills.If there are multiple ways to solve the problem, print any of them.The boys are numbered starting from one in the order in which their skills are given in the input data. You are allowed to print individual numbers of boys who belong to the same team in any order.ExamplesInput31 2 1Output21 213Input52 3 3 1 1Output34 1 325 2NoteLet's consider the first sample test. There we send the first and the second boy to the first team and the third boy to the second team. Let's check all three conditions of a fair division. The first limitation is fulfilled (all boys play), the second limitation on the sizes of groups (|2 - 1| = 1 ≤ 1) is fulfilled, the third limitation on the difference in skills ((2 + 1) - (1) = 2 ≤ 2) is fulfilled.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "70ecd3dd", "template_md5": "35d339e4", "result": "You are given $n$ integers ($2 \\le n \\le 10^5$) representing the football skills of $n$ players.  You need to divide the players into two teams, with the following rules:\n\n* **Team Sizes:** The difference in the number of players on each team must be at most 1 (i.e., $|x - y| \\le 1$, where $x$ is the number of players on the first team and $y$ is the number of players on the second team).\n* **Total Skill Difference:** The difference in the sum of the skills of the two teams must be at most the skill of the best player.\n\nOutput the size of each team and the players assigned to each team.  \n\n**Input:**\n\n* The first line contains the number of players, $n$.\n* The second line contains $n$ space-separated integers, representing the skills of each player.\n\n**Output:**\n\n* The first line contains the number of players on the first team, $x$.\n* The second line contains $x$ space-separated integers, representing the players on the first team.\n* The third line contains the number of players on the second team, $y$.\n* The fourth line contains $y$ space-separated integers, representing the players on the second team."}, {"prompt_md5": "9941a636", "template_md5": "465699a0", "result": "Divide a group of people into two teams with a maximum size difference of 1. The total skill level of each team should be within a certain range of each other.  You are given the number of people and their individual skill levels. Output the size of each team and the people assigned to each team."}]}