{"uid": "149-D", "url": "https://codeforces.com/contest/149/problem/D", "tags": ["dp"], "title": "149-D", "statement": "D. Coloring Bracketstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOnce Petya read a problem about a bracket sequence. He gave it much thought but didn't find a solution. Today you will face it.You are given strings. It represents a correct bracket sequence. A correct bracket sequence is the sequence of opening (\"(\") and closing (\")\") brackets, such that it is possible to obtain a correct mathematical expression from it, inserting numbers and operators between the brackets. For example, such sequences as \"(())()\" and \"()\" are correct bracket sequences and such sequences as \")()\" and \"(()\" are not.In a correct bracket sequence each bracket corresponds to the matching bracket (an opening bracket corresponds to the matching closing bracket and vice versa). For example, in a bracket sequence shown of the figure below, the third bracket corresponds to the matching sixth one and the fifth bracket corresponds to the fourth one.You are allowed to color some brackets in the bracket sequence so as all three conditions are fulfilled:Each bracket is either not colored any color, or is colored red, or is colored blue.For any pair of matching brackets exactly one of them is colored. In other words, for any bracket the following is true: either it or the matching bracket that corresponds to it is colored.No two neighboring colored brackets have the same color.Find the number of different ways to color the bracket sequence. The ways should meet the above-given conditions. Two ways of coloring are considered different if they differ in the color of at least one bracket. As the result can be quite large, print it modulo1000000007(109+ 7).InputThe first line contains the single strings(2 ≤ |s| ≤ 700) which represents a correct bracket sequence.OutputPrint the only number — the number of ways to color the bracket sequence that meet the above given conditions modulo1000000007(109+ 7).ExamplesInput(())Output12Input(()())Output40Input()Output4NoteLet's consider the first sample test. The bracket sequence from the sample can be colored, for example, as is shown on two figures below.The two ways of coloring shown below are incorrect.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4ce37417", "template_md5": "35d339e4", "result": "You are given a string $s$ representing a correct bracket sequence.  A correct bracket sequence is a sequence of opening \"(\" and closing \")\" brackets that can be used to form a valid mathematical expression.\n\nYou can color each bracket in the sequence either red, blue, or leave it uncolored.  The rules for coloring are:\n\n1. Each bracket must have exactly one of these colors.\n2. For any pair of matching brackets, exactly one of them must be colored.\n3. No two neighboring colored brackets can have the same color.\n\nFind the number of different ways to color the brackets according to these rules.  The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "2a4ca08b", "template_md5": "465699a0", "result": "You are given a sequence of parentheses that are correctly matched.  You need to color each parenthesis either red, blue, or leave it uncolored. The rules are:\n\n* Each pair of matching parentheses must have exactly one colored.\n* No two adjacent colored parentheses can be the same color.\n\nFind the number of ways to color the parentheses following these rules.  The answer can be very large, so give it modulo 1000000007."}]}