{"uid": "149-E", "url": "https://codeforces.com/contest/149/problem/E", "tags": ["string suffix structures", " strings"], "title": "149-E", "statement": "E. Martian Stringstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDuring the study of the Martians Petya clearly understood that the Martians are absolutely lazy. They like to sleep and don't like to wake up.Imagine a Martian who has exactlyneyes located in a row and numbered from the left to the right from1ton. When a Martian sleeps, he puts a patch on each eye (so that the Martian morning doesn't wake him up). The inner side of each patch has an uppercase Latin letter. So, when a Martian wakes up and opens all his eyes he sees a stringsconsisting of uppercase Latin letters. The string's length isn.\"Ding dong!\" — the alarm goes off. A Martian has already woken up but he hasn't opened any of his eyes. He feels that today is going to be a hard day, so he wants to open his eyes and see something good. The Martian considers onlymMartian words beautiful. Besides, it is hard for him to open all eyes at once so early in the morning. So he opens two non-overlapping segments of consecutive eyes.More formally, the Martian chooses four numbersa,b,c,d, (1 ≤a≤b<c≤d≤n) and opens all eyes with numbersisuch thata≤i≤borc≤i≤d.After the Martian opens the eyes he needs, he reads all the visible characters from the left to the right and thus, he sees some word.Let's consider all different words the Martian can see in the morning. Your task is to find out how many beautiful words are among them.InputThe first line contains a non-empty stringsconsisting of uppercase Latin letters. The strings' length isn(2 ≤n≤ 105). The second line contains an integerm(1 ≤m≤ 100) — the number of beautiful words. Nextmlines contain the beautiful wordspi, consisting of uppercase Latin letters. Their length is from1to1000. All beautiful strings are pairwise different.OutputPrint the single integer — the number of different beautiful strings the Martian can see this morning.ExamplesInputABCBABA2BAABABBAOutput1NoteLet's consider the sample test. There the Martian can get only the second beautiful string if he opens segments of eyesa= 1,b= 2andc= 4,d= 5or of he opens segments of eyesa= 1,b= 2andc= 6,d= 7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "312acea6", "template_md5": "35d339e4", "result": "You are given a string of uppercase letters.  There are also a list of beautiful words.  \n\nA person can choose two non-overlapping segments of consecutive letters in the string.  For example, if the string is \"ABCBABA\" and the segments are $a=1, b=2$ and $c=4, d=5$, the person sees the substring \"BCBA\".\n\nFind the number of beautiful words that can be formed by choosing segments in this way."}, {"prompt_md5": "9f6bd68a", "template_md5": "465699a0", "result": "You are given a string of letters.  You need to find how many different substrings of the string are also present in a list of \"beautiful\" substrings.  The substrings are formed by opening two non-overlapping segments of the string."}]}