{"uid": "1495-B", "url": "https://codeforces.com/contest/1495/problem/B", "tags": ["games", " greedy"], "title": "1495-B", "statement": "B. Let's Go Hikingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn a weekend, Qingshan suggests that she and her friend Daniel go hiking. Unfortunately, they are busy high school students, so they can only go hiking on scratch paper.A permutation $$$p$$$ is written from left to right on the paper. First Qingshan chooses an integer index $$$x$$$ ($$$1\\\\le x\\\\le n$$$) and tells it to Daniel. After that, Daniel chooses another integer index $$$y$$$ ($$$1\\\\le y\\\\le n$$$, $$$y \\\\ne x$$$).The game progresses turn by turn and as usual, Qingshan moves first. The rules follow:If it is Qingshan's turn, Qingshan must change $$$x$$$ to such an index $$$x'$$$ that $$$1\\\\le x'\\\\le n$$$, $$$|x'-x|=1$$$, $$$x'\\\\ne y$$$, and $$$p_{x'}<p_x$$$ at the same time.If it is Daniel's turn, Daniel must change $$$y$$$ to such an index $$$y'$$$ that $$$1\\\\le y'\\\\le n$$$, $$$|y'-y|=1$$$, $$$y'\\\\ne x$$$, and $$$p_{y'}>p_y$$$ at the same time.The person who can't make her or his move loses, and the other wins. You, as Qingshan's fan, are asked to calculate the number of possible $$$x$$$ to make Qingshan win in the case both players play optimally.InputThe first line contains a single integer $$$n$$$ ($$$2\\\\le n\\\\le 10^5$$$) — the length of the permutation.The second line contains $$$n$$$ distinct integers $$$p_1,p_2,\\\\dots,p_n$$$ ($$$1\\\\le p_i\\\\le n$$$) — the permutation.OutputPrint the number of possible values of $$$x$$$ that Qingshan can choose to make her win.ExamplesInput5 1 2 5 4 3Output1Input7 1 2 4 6 5 3 7Output0NoteIn the first test case, Qingshan can only choose $$$x=3$$$ to win, so the answer is $$$1$$$.In the second test case, if Qingshan will choose $$$x=4$$$, Daniel can choose $$$y=1$$$. In the first turn (Qingshan's) Qingshan chooses $$$x'=3$$$ and changes $$$x$$$ to $$$3$$$. In the second turn (Daniel's) Daniel chooses $$$y'=2$$$ and changes $$$y$$$ to $$$2$$$. Qingshan can't choose $$$x'=2$$$ because $$$y=2$$$ at this time. Then Qingshan loses.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9b759e03", "template_md5": "35d339e4", "result": "You are given a permutation of integers from 1 to $n$. Two players take turns choosing an index $x$ and $y$ in the permutation, where $1 \\le x, y \\le n$ and $x \\neq y$.  \n\nOn each turn, the player must choose a new index $x'$ or $y'$ such that:\n\n* $1 \\le x' \\le n$ or $1 \\le y' \\le n$\n* $|x'-x|=1$ or $|y'-y|=1$\n* $x' \\neq y$ or $y' \\neq x$\n* $p_{x'} < p_x$ or $p_{y'} > p_y$\n\nThe first player to be unable to make a valid move loses.  \n\nDetermine the number of possible values for $x$ that guarantee a win for the first player if both players play optimally."}, {"prompt_md5": "d8105c07", "template_md5": "465699a0", "result": "Two players take turns changing a number within a list of numbers.  Each change must be to an adjacent number that is smaller. The player who cannot make a valid move loses.  Find the number of starting positions that guarantee a win for the first player."}]}