{"uid": "1499-C", "url": "https://codeforces.com/contest/1499/problem/C", "tags": ["brute force", " data structures", " greedy", " math"], "title": "1499-C", "statement": "C. Minimum Grid Pathtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's say you are standing on the $$$XY$$$-plane at point $$$(0, 0)$$$ and you want to reach point $$$(n, n)$$$.You can move only in two directions:to theright, i. e. horizontally and in the direction that increase your $$$x$$$ coordinate,orup, i. e. vertically and in the direction that increase your $$$y$$$ coordinate.In other words, your path will have the following structure:initially, you choose to go to the right or up;then you go somepositive integerdistance in the chosen direction (distances can be chosen independently);after that you change your direction (from right to up, or from up to right) and repeat the process.You don't like to change your direction too much, so you will make no more than $$$n - 1$$$ direction changes.As a result, your path will be a polygonal chain from $$$(0, 0)$$$ to $$$(n, n)$$$, consisting ofat most$$$n$$$ line segments where each segment has positive integer length and vertical and horizontal segments alternate.Not all paths are equal. You have $$$n$$$ integers $$$c_1, c_2, \\\\dots, c_n$$$ where $$$c_i$$$ is the cost of the $$$i$$$-th segment.Using these costs we can define thecost of the pathas the sum of lengths of the segments of this path multiplied by their cost, i. e. if the path consists of $$$k$$$ segments ($$$k \\\\le n$$$), then the cost of the path is equal to $$$\\\\sum\\\\limits_{i=1}^{k}{c_i \\\\cdot length_i}$$$ (segments are numbered from $$$1$$$ to $$$k$$$ in the order they are in the path).Find the path of the minimum cost and print its cost.InputThe first line contains the single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.The first line of each test case contains the single integer $$$n$$$ ($$$2 \\\\le n \\\\le 10^5$$$).The second line of each test case contains $$$n$$$ integers $$$c_1, c_2, \\\\dots, c_n$$$ ($$$1 \\\\le c_i \\\\le 10^9$$$) — the costs of each segment.It's guaranteed that the total sum of $$$n$$$ doesn't exceed $$$10^5$$$.OutputFor each test case, print the minimum possible cost of the path from $$$(0, 0)$$$ to $$$(n, n)$$$ consisting of at most $$$n$$$ alternating segments.ExampleInput3 2 13 88 3 2 3 1 5 4 3 2 1 4Output202 13 19NoteIn the first test case, to reach $$$(2, 2)$$$ you need to make at least one turn, so your path will consist of exactly $$$2$$$ segments: one horizontal of length $$$2$$$ and one vertical of length $$$2$$$. The cost of the path will be equal to $$$2 \\\\cdot c_1 + 2 \\\\cdot c_2 = 26 + 176 = 202$$$.In the second test case, one of the optimal paths consists of $$$3$$$ segments: the first segment of length $$$1$$$, the second segment of length $$$3$$$ and the third segment of length $$$2$$$.The cost of the path is $$$1 \\\\cdot 2 + 3 \\\\cdot 3 + 2 \\\\cdot 1 = 13$$$.In the third test case, one of the optimal paths consists of $$$4$$$ segments: the first segment of length $$$1$$$, the second one — $$$1$$$, the third one — $$$4$$$, the fourth one — $$$4$$$. The cost of the path is $$$1 \\\\cdot 4 + 1 \\\\cdot 3 + 4 \\\\cdot 2 + 4 \\\\cdot 1 = 19$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "42eca38a", "template_md5": "35d339e4", "result": "You are at point $(0,0)$ and want to reach point $(n,n)$. You can only move right (increasing the x-coordinate) or up (increasing the y-coordinate).  \n\nYour path must consist of alternating horizontal and vertical segments.  You can make at most $n-1$ direction changes.\n\nEach segment has a cost associated with it ($c_1, c_2, ..., c_n$). The total cost of a path is the sum of the lengths of each segment multiplied by its cost.\n\nFind the path with the minimum total cost.\n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the integer $n$.\n    * The second line contains $n$ integers, $c_1, c_2, ..., c_n$.\n\nOutput:\n\nFor each test case, print the minimum cost of a valid path."}, {"prompt_md5": "fbf4e4d9", "template_md5": "465699a0", "result": "You need to travel from (0,0) to (n,n) by moving only right or up.  You can change directions at most n-1 times. Each move has a cost. Find the path with the lowest total cost."}]}