{"uid": "15-C", "url": "https://codeforces.com/contest/15/problem/C", "tags": ["games"], "title": "15-C", "statement": "C. Industrial Nimtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutThere arenstone quarries in Petrograd.Each quarry ownsmidumpers (1 ≤i≤n). It is known that the first dumper of thei-th quarry hasxistones in it, the second dumper hasxi+ 1stones in it, the third hasxi+ 2, and themi-th dumper (the last for thei-th quarry) hasxi+mi- 1stones in it.Two oligarchs play a well-known game Nim. Players take turns removing stones from dumpers. On each turn, a player can select any dumper and remove any non-zero amount of stones from it. The player who cannot take a stone loses.Your task is to find out which oligarch will win, provided that both of them play optimally. The oligarchs asked you not to reveal their names. So, let's call the one who takes the first stone «tolik» and the other one «bolik».InputThe first line of the input contains one integer numbern(1 ≤n≤ 105) — the amount of quarries. Then there follownlines, each of them contains two space-separated integersxiandmi(1 ≤xi,mi≤ 1016) — the amount of stones in the first dumper of thei-th quarry and the number of dumpers at thei-th quarry.OutputOutput «tolik» if the oligarch who takes a stone first wins, and «bolik» otherwise.ExamplesInput22 13 2OutputtolikInput41 11 11 11 1Outputbolik", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1a287e62", "template_md5": "35d339e4", "result": "There are $n$ quarries. Each quarry has $m_i$ dumpers. The $j$-th dumper in the $i$-th quarry has $x_i + j - 1$ stones. \n\nTwo players take turns removing stones from the dumpers. On each turn, a player can choose any dumper and remove any number of stones from it (as long as it's not zero). The player who cannot remove any stones loses.\n\nDetermine which player will win if both players play optimally."}, {"prompt_md5": "fa17df8a", "template_md5": "465699a0", "result": "Two players take turns removing stones from a set of containers. Each container has a specific number of stones. The player who cannot remove any stones loses. Determine which player will win if both play optimally."}]}