{"uid": "15-D", "url": "https://codeforces.com/contest/15/problem/D", "tags": ["data structures", " implementation", " sortings"], "title": "15-D", "statement": "D. Maptime limit per test2 secondsmemory limit per test128 megabytesinputstdinoutputstdoutThere is an area map that is a rectangular matrixn×m, each cell of the matrix contains the average height of a corresponding area part. Peter works for a company that has to build several cities within this area, each of the cities will occupy a rectanglea×bcells on the map. To start construction works in a particular place Peter needs to remove excess ground from the construction site where a new city will be built. To do so he chooses a cell of the minimum height within this site, and removes excess ground from other cells of the site down to this minimum level. Let's consider that to lower the ground level fromh2toh1(h1≤h2) they need to removeh2-h1ground units.Let's call a site's position optimal, if the amount of the ground removed from this site is minimal compared to other possible positions. Peter constructs cities according to the following algorithm: from all the optimum site's positions he chooses the uppermost one. If this position is not unique, he chooses the leftmost one. Then he builds a city on this site. Peter repeats this process untill he can build at least one more city. For sure, he cannot carry out construction works on the occupied cells. Would you, please, help Peter place cities according to the algorithm?InputThe first line contains four space-separated integers: map sizesn,mand city sizesa,b(1 ≤a≤n≤ 1000,1 ≤b≤m≤ 1000). Then there follownlines, each containsmnon-negative space-separated numbers, describing the height matrix. Each number doesn't exceed109.OutputIn the first line outputk— the amount of constructed cities. In each of the followingklines output 3 space-separated numbers — the row number and the column number of the upper-left corner of a subsequent construction site, and the amount of the ground to remove from it. Output the sites in the order of their building up.ExamplesInput2 2 1 21 23 5Output21 1 12 1 2Input4 4 2 21 5 3 42 7 6 11 1 2 22 2 1 2Output33 1 23 3 31 2 9", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "887d4bd6", "template_md5": "35d339e4", "result": "You are given a rectangular map represented by a matrix of size $n \\times m$. Each cell in the matrix contains a non-negative integer representing the average height of the area. \n\nYou need to build cities on this map. Each city occupies a rectangular area of size $a \\times b$ cells.  \n\nTo build a city, you need to lower the ground level of the chosen area to the minimum height within that area. The amount of ground removed from a cell is the difference between its original height and the minimum height.\n\nYou need to find the optimal positions to build the cities following these rules:\n\n1.  For each possible city location, find the position that requires the least amount of ground removal.\n2.  If there are multiple optimal positions, choose the one that is highest and, if still tied, the one that is furthest to the left.\n\nRepeat this process until you can no longer build any more cities.\n\nOutput the number of cities built, followed by the row and column coordinates of the top-left corner of each city, and the amount of ground removed for each city."}, {"prompt_md5": "52e4a9b0", "template_md5": "465699a0", "result": "You are given a grid representing a map with heights at each point. You need to build cities of a given size on this map.  Each city must be built on a spot with the minimum height within its area.  You need to find the best spots to build the cities, minimizing the amount of ground that needs to be removed.  Output the number of cities built and the location and amount of ground removed for each city."}]}