{"uid": "150-E", "url": "https://codeforces.com/contest/150/problem/E", "tags": ["binary search", " data structures", " divide and conquer", " trees"], "title": "150-E", "statement": "E. Freezing with Styletime limit per test7 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThis winter is so... well, you've got the idea :-) The Nvodsk road system can be represented asnjunctions connected withn- 1bidirectional roads so that there is a path between any two junctions. The organizers of some event want to choose a place to accommodate the participants (junctionv), and the place to set up the contests (junctionu). Besides, at the one hand, they want the participants to walk about the city and see the neighbourhood (that's why the distance betweenvandushould be no less thanl). On the other hand, they don't want the participants to freeze (so the distance betweenvandushould be no more thanr). Besides, for every street we know its beauty — some integer from0to109. Your task is to choose the path that fits in the length limits and has the largest average beauty. We shall define the average beauty as a median of sequence of the beauties of all roads along the path.We can put it more formally like that: let there be a path with the lengthk. Letaibe a non-decreasing sequence that contains exactlykelements. Each number occurs there exactly the number of times a road with such beauty occurs along on path. We will represent the path median as numbera⌊k/ 2⌋, assuming thatindexation starting from zerois used.⌊x⌋— is numberх, rounded down to the nearest integer.For example, ifa= {0, 5, 12}, then the median equals to5, and ifa= {0, 5, 7, 12}, then the median is number7.It is guaranteed that there will be at least one path with the suitable quantity of roads.InputThe first line contains three integersn,l,r(1 ≤l≤r<n≤ 105).Nextn- 1lines contain descriptions of roads of the Nvodsk, each line contains three integersai,bi,ci(1 ≤ai,bi≤n,0 ≤ci≤ 109,ai≠bi) — junctionsaiandbiare connected with a street whose beauty equalsci.OutputPrint two integers — numbers of the junctions, where to accommodate the participants and set up the contests, correspondingly. If there are multiple optimal variants, print any of them.ExamplesInput6 3 41 2 12 3 13 4 14 5 15 6 1Output4 1Input6 3 41 2 12 3 13 4 14 5 25 6 2Output6 3Input5 1 41 2 11 3 43 4 73 5 2Output4 3Input8 3 61 2 92 3 73 4 74 5 85 8 23 6 32 7 4Output5 1NoteIn the first sample all roads have the same beauty. That means that all paths of the positive length have the same median. Thus, any path with length from3to4, inclusive will be valid for us.In the second sample the city looks like that: 1 - 2 - 3 - 4 - 5 - 6. Two last roads are more valuable and we should choose any path that contains both of them and has the suitable length. It is either the path between2and6or the path between3and6.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8189cbd7", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ junctions and $n-1$ bidirectional roads. Each road has a beauty value between 0 and $10^9$. \n\nYou need to find two junctions, $u$ and $v$,  that satisfy the following conditions:\n\n* The distance between $u$ and $v$ (the number of roads along the shortest path between them) is between $l$ and $r$ inclusive.\n* The average beauty of the roads along the path between $u$ and $v$ is maximized.\n\nThe average beauty is defined as the median of the beauty values of the roads along the path.\n\nOutput the two junctions $u$ and $v$. If there are multiple solutions, output any one."}, {"prompt_md5": "05f544b9", "template_md5": "465699a0", "result": "You are given a network of connected cities.  You need to choose two cities to place a participant housing and a contest location. The distance between these two cities must be within a given range.  You want to find the path between these two cities with the highest average \"beauty\" score, where beauty is determined by the median of the beauty scores of the roads along the path."}]}