{"uid": "1505-E", "url": "https://codeforces.com/contest/1505/problem/E", "tags": ["*special", " greedy", " implementation", " shortest paths"], "title": "1505-E", "statement": "E. Cakewalktime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA mouse encountered a nice big cake and decided to take a walk across it, eating the berries on top of the cake on its way. The cake is rectangular, neatly divided into squares; some of the squares have a berry in them, and some don't.The mouse is in a bit of a hurry, though, so once she enters the cake from its northwest corner (the top left cell in the input data), she will only go east (right) or south (down), until she reaches the southeast corner (the bottom right cell). She will eat every berry in the squares she passes through, but not in the other squares.The mouse tries to choose her path so as to maximize the number of berries consumed. However, her haste and hunger might be clouding her judgement, leading her to suboptimal decisions...InputThe first line of input contains two integers $$$H$$$ and $$$W$$$ ($$$1 \\\\le H, W \\\\le 5$$$), separated by a space, — the height and the width of the cake.The next $$$H$$$ lines contain a string of $$$W$$$ characters each, representing the squares of the cake in that row: '.' represents an empty square, and '*' represents a square with a berry.OutputOutput the number of berries the mouse will eat following her strategy.ExamplesInput4 3 *.. .*. ..* ...Output3Input4 4 .*.. *... ...* ..*.Output2Input3 4 ..** *... ....Output1Input5 5 ..*.. ..... **... **... **...Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8e208326", "template_md5": "35d339e4", "result": "A rectangular cake is divided into squares. Some squares contain a berry ('*'), and some are empty ('.').  A mouse starts at the top left corner and must travel to the bottom right corner, only moving right or down. The mouse eats all berries in the squares it passes through.  \n\nGiven the layout of the cake, determine the maximum number of berries the mouse can eat."}, {"prompt_md5": "8d3faeab", "template_md5": "465699a0", "result": "A rectangular grid has some squares with berries and some without.  You start at the top left corner and can only move right or down to reach the bottom right corner. Count the number of berries you eat along the way."}]}