{"uid": "1510-C", "url": "https://codeforces.com/contest/1510/problem/C", "tags": ["dfs and similar", " graph matchings", " graphs"], "title": "1510-C", "statement": "C. Cactus Not Enoughtime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere was no problem about a cactus at the NERC 2020 online round. That's a bad mistake, so judges decided to fix it. You shall not pass to the World Finals 2021 without solving a problem about a cactus!Acactusis a connected undirected graph in which every edge lies on at most one simple cycle. Intuitively, a cactus is a generalization of a tree where some cycles are allowed. Multiedges (multiple edges between a pair of vertices) and loops (edges that connect a vertex to itself) are not allowed in a cactus.Cher has got a cactus. She calls cactusstrongif it is impossible to add an edge to it in such a way that it still remains a cactus. But Cher thinks her cactus is not strong enough. She wants to add the smallest possible number of edges to it to make it strong, i. e. to create a new cactus with the same vertices, so that the original cactus is a subgraph of the new one, and it is impossible to add another edge to it so that the graph remains a cactus. Cher hired you to do this job for her. So... it's on you!InputThe input consists of one or more independent test cases.The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 10^5$$$, $$$0 \\\\le m \\\\le 10^5$$$), where $$$n$$$ is the number of vertices in the graph. Vertices are numbered from $$$1$$$ to $$$n$$$. Edges of the graph are represented by a set of edge-distinct paths, where $$$m$$$ is the number of such paths.Each of the following $$$m$$$ lines contains a path in the graph. A path starts with an integer number $$$s_i$$$ ($$$2 \\\\le s_i \\\\le 1000$$$) followed by $$$s_i$$$ integers from $$$1$$$ to $$$n$$$. These $$$s_i$$$ integers represent vertices of a path. Adjacent vertices in a path are distinct. The path can go through the same vertex multiple times, but every edge is traversed exactly once in the whole test case. There are no multiedges in the graph (there is at most one edge between any two vertices).The last line of the input after all test cases always contains two zeros. It doesnotdefine a test case. It just marks the end of the input and does not require any output.All graphs in the input are cacti. The total sum of all values of $$$n$$$ and the total sum of all values of $$$m$$$ throughout the input both do not exceed $$$10^5$$$.OutputFor each test case, first output the line with the minimal possible number of additional edges $$$A$$$. Then output $$$A$$$ lines, each describing one edge as $$$u_i$$$ $$$v_i$$$, where $$$u_i$$$ and $$$v_i$$$ are the numbers of vertices to connect. After adding these edges, the resulting graph must be a strong cactus.ExampleInput6 1 7 1 2 5 6 2 3 4 3 1 4 1 2 3 1 5 2 3 1 3 5 3 1 2 4 7 2 6 1 2 3 4 5 3 3 6 5 7 0 0Output1 1 4 0 1 5 4 2 1 3 6 7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "21b66018", "template_md5": "35d339e4", "result": "You are given a cactus (a connected undirected graph where every edge is in at most one cycle).  \n\nYour task is to determine the minimum number of edges you need to add to the cactus to make it \"strong\". A cactus is considered strong if it's impossible to add another edge to it while still maintaining the property of being a cactus.\n\n**Input:**\n\n* The first line of each test case contains two integers,  $n$ and $m$, representing the number of vertices and edges in the cactus, respectively.\n* The following $m$ lines each describe an edge in the cactus as a path of vertices.\n\n**Output:**\n\n* For each test case, output the minimum number of edges needed to make the cactus strong.\n* Then, output a list of $A$ edges, where $A$ is the minimum number of edges, that, when added, will make the cactus strong. Each edge is represented by two integers, $u_i$ and $v_i$, representing the vertices to be connected."}, {"prompt_md5": "cd04c529", "template_md5": "465699a0", "result": "You are given a collection of connected paths.  Find the fewest edges you need to add to make the collection of paths a \"strong cactus\". A strong cactus is a collection of paths where you cannot add any more edges without breaking the structure. Output the minimum number of edges needed and a list of those edges."}]}