{"uid": "1511-E", "url": "https://codeforces.com/contest/1511/problem/E", "tags": ["combinatorics", " dp", " greedy", " math"], "title": "1511-E", "statement": "E. Colorings and Dominoestime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou have a large rectangular board which is divided into $$$n \\\\times m$$$ cells (the board has $$$n$$$ rows and $$$m$$$ columns). Each cell is either white or black.You paint each white cell either red or blue. Obviously, the number of different ways to paint them is $$$2^w$$$, where $$$w$$$ is the number of white cells.After painting the white cells of the board, you want to place the maximum number of dominoes on it, according to the following rules:each domino covers two adjacent cells;each cell is covered by at most one domino;if a domino is placed horizontally (it covers two adjacent cells in one of the rows), it should cover only red cells;if a domino is placed vertically (it covers two adjacent cells in one of the columns), it should cover only blue cells.Let thevalueof the board be the maximum number of dominoes you can place. Calculate the sum ofvaluesof the board over all $$$2^w$$$ possible ways to paint it. Since it can be huge, print it modulo $$$998\\\\,244\\\\,353$$$.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 3 \\\\cdot 10^5$$$; $$$nm \\\\le 3 \\\\cdot 10^5$$$) — the number of rows and columns, respectively.Then $$$n$$$ lines follow, each line contains a string of $$$m$$$ characters. The $$$j$$$-th character in the $$$i$$$-th string is*if the $$$j$$$-th cell in the $$$i$$$-th row is black; otherwise, that character iso.OutputPrint one integer — the sum ofvaluesof the board over all $$$2^w$$$ possible ways to paint it, taken modulo $$$998\\\\,244\\\\,353$$$.ExamplesInput3 4 **oo oo*o **ooOutput144Input3 4 **oo oo** **ooOutput48Input2 2 oo o*Output4Input1 4 ooooOutput9", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "29f7cf58", "template_md5": "35d339e4", "result": "You have a rectangular board with $n$ rows and $m$ columns. Each cell is either black or white. You can paint each white cell either red or blue.\n\nYou want to place as many dominoes as possible on the board, following these rules:\n\n* Each domino covers two adjacent cells.\n* Each cell can be covered by at most one domino.\n* A horizontal domino (covering two cells in the same row) must cover two red cells.\n* A vertical domino (covering two cells in the same column) must cover two blue cells.\n\nCalculate the total number of dominoes you can place on the board for all possible ways to paint the white cells, and print the result modulo 998244353."}, {"prompt_md5": "af9fa5a2", "template_md5": "465699a0", "result": "You have a rectangular grid of cells that are either black or white. You can color each white cell red or blue.  You want to place as many dominoes as possible on the grid, following these rules:\n\n* Each domino covers two adjacent cells.\n* A horizontal domino can only cover two red cells.\n* A vertical domino can only cover two blue cells.\n\nCalculate the total number of dominoes you can place across all possible color combinations, and print the result modulo 998244353."}]}