{"uid": "1512-B", "url": "https://codeforces.com/contest/1512/problem/B", "tags": ["implementation"], "title": "1512-B", "statement": "B. Almost Rectangletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is a square field of size $$$n \\\\times n$$$ in which two cells are marked. These cells can be in the same row or column.You are to mark two more cells so that they are the corners of a rectangle with sides parallel to the coordinate axes.For example, if $$$n=4$$$ and a rectangular field looks like this (there are asterisks in the marked cells):$$$$$$ \\\\begin{matrix} . & . & * & . \\\\\\\\ . & . & . & . \\\\\\\\ * & . & . & . \\\\\\\\ . & . & . & . \\\\\\\\ \\\\end{matrix} $$$$$$Then you can mark two more cells as follows$$$$$$ \\\\begin{matrix} * & . & * & . \\\\\\\\ . & . & . & . \\\\\\\\ * & . & * & . \\\\\\\\ . & . & . & . \\\\\\\\ \\\\end{matrix} $$$$$$If there are several possible solutions, then print any of them.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 400$$$). Then $$$t$$$ test cases follow.The first row of each test case contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 400$$$) — the number of rows and columns in the table.The following $$$n$$$ lines each contain $$$n$$$ characters '.' or '*' denoting empty and marked cells, respectively.It is guaranteed that the sums of $$$n$$$ for all test cases do not exceed $$$400$$$.It is guaranteed that there are exactly two asterisks on the field. They can be in the same row/column.It is guaranteed that the solution exists.OutputFor each test case, output $$$n$$$ rows of $$$n$$$ characters — a field with four asterisks marked corresponding to the statements. If there multiple correct answers, print any of them.ExampleInput6 4 ..*. .... *... .... 2 *. .* 2 .* .* 3 *.* ... ... 5 ..... ..*.. ..... .*... ..... 4 .... .... *... *...Output*.*. .... *.*. .... ** ** ** ** *.* *.* ... ..... .**.. ..... .**.. ..... .... .... **.. **..", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a0da2cf7", "template_md5": "35d339e4", "result": "You are given a square grid of size $n \\times n$. Two cells in the grid are already marked with an asterisk (*).  Your task is to mark two more cells so that they form a rectangle with the existing marked cells, where the sides of the rectangle are parallel to the grid lines. \n\nThe input will consist of multiple test cases. Each test case will specify the size of the grid ($n$) and the positions of the two existing marked cells. You need to output the grid with all four marked cells forming a rectangle."}, {"prompt_md5": "a5a6eb29", "template_md5": "465699a0", "result": "You are given a square grid of cells. Two cells are already marked.  You need to mark two more cells to form a rectangle with the existing marked cells. Print the grid with all four marked cells."}]}