{"uid": "1515-E", "url": "https://codeforces.com/contest/1515/problem/E", "tags": ["combinatorics", " dp", " math"], "title": "1515-E", "statement": "E. Phoenix and Computerstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ computers in a row, all originally off, and Phoenix wants to turn all of them on. He will manually turn on computers one at a time. At any point, if computer $$$i-1$$$ and computer $$$i+1$$$ are both on, computer $$$i$$$ $$$(2 \\\\le i \\\\le n-1)$$$ will turn on automatically if it is not already on. Note that Phoenix cannot manually turn on a computer that already turned on automatically.If we only consider the sequence of computers that Phoenix turns on manually, how many ways can he turn on all the computers? Two sequences are distinct if either the set of computers turned on manually is distinct, or the order of computers turned on manually is distinct. Since this number may be large, please print it modulo $$$M$$$.InputThe first line contains two integers $$$n$$$ and $$$M$$$ ($$$3 \\\\le n \\\\le 400$$$; $$$10^8 \\\\le M \\\\le 10^9$$$) — the number of computers and the modulo. It is guaranteed that $$$M$$$ is prime.OutputPrint one integer — the number of ways to turn on the computers modulo $$$M$$$.ExamplesInput3 100000007Output6Input4 100000007Output20Input400 234567899Output20914007NoteIn the first example, these are the $$$6$$$ orders in which Phoenix can turn on all computers:$$$[1,3]$$$. Turn on computer $$$1$$$, then $$$3$$$. Note that computer $$$2$$$ turns on automatically after computer $$$3$$$ is turned on manually, but we only consider the sequence of computers that are turned on manually.$$$[3,1]$$$. Turn on computer $$$3$$$, then $$$1$$$.$$$[1,2,3]$$$. Turn on computer $$$1$$$, $$$2$$$, then $$$3$$$.$$$[2,1,3]$$$$$$[2,3,1]$$$$$$[3,2,1]$$$", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b418ab7e", "template_md5": "35d339e4", "result": "There are $n$ computers in a row.  You can turn on any computer manually. If two adjacent computers are on, the computer in between will turn on automatically. You can't turn on a computer that has already turned on automatically.  \n\nWhat is the number of different ways to turn on all the computers by manually turning on some of them?  The answer may be large, so give the answer modulo $M$."}, {"prompt_md5": "dd130b94", "template_md5": "465699a0", "result": "You have a line of computers. You can turn on any computer manually. If two adjacent computers are on, the computer in between turns on automatically.  What are the different orders you can turn on the computers manually to get all of them on?"}]}