{"uid": "152-B", "url": "https://codeforces.com/contest/152/problem/B", "tags": ["binary search", " implementation"], "title": "152-B", "statement": "B. Stepstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day Vasya went out for a walk in the yard but there weren't any of his friends outside and he had no one to play touch and run. But the boy didn't lose the high spirits and decided to play touch and run with himself. You may ask: \"How did he do that?\" The answer is simple.Vasya noticed that the yard is a rectangularn×mfield. The squares have coordinates(x,y)(1 ≤x≤n, 1 ≤y≤m), wherexis the index of the row andyis the index of the column.Initially Vasya stands in the square with coordinates (xc,yc). To play, he has got a list ofkvectors(dxi,dyi)of non-zero length. The game goes like this. The boy considers all vectors in the order from1tok, and consecutively chooses each vector as the current one. After the boy has chosen a current vector, he makes the maximally possible number of valid steps in the vector's direction (it is possible that he makes zero steps).Astepis defined as one movement from the square where the boy is standing now, in the direction of the current vector. That is, if Vasya is positioned in square(x,y), and the current vector is(dx,dy), one step moves Vasya to square(x+dx,y+dy). A step is consideredvalid, if the boy does not go out of the yard if he performs the step.Vasya stepped on and on, on and on until he ran out of vectors in his list. Ha had been stepping for so long that he completely forgot how many steps he had made. Help the boy and count how many steps he had made.InputThe first input line contains two integersnandm(1 ≤n,m≤ 109) — the yard's sizes. The second line contains integersxcandyc— the initial square's coordinates (1 ≤xc≤n, 1 ≤yc≤m).The third line contains an integerk(1 ≤k≤ 104) — the number of vectors. Then followklines, each of them contains two integersdxianddyi(|dxi|, |dyi| ≤ 109, |dx| + |dy| ≥ 1).OutputPrint the single number — the number of steps Vasya had made.Please do not use the%lldspecificator to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecificator.ExamplesInput4 51 131 11 10 -2Output4Input10 101 21-1 0Output0NoteIn the first sample Vasya is initially positioned at square(1, 1)and makes3steps by the first vector(1, 1). So, he consecutively visits the squares(2, 2), (3, 3), (4, 4). Then he makes0steps by the second vector(1, 1). He makes1more step by the third vector(0,  - 2)and he ends up in square(4, 2). Overall, Vasya makes4steps.In the second sample Vasya is initially positioned in square(1, 2)and makes0steps by vector( - 1, 0), as the square with coordinates(0, 2)is located outside the yard.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d110816e", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$. A person starts at a specific square $(x_c, y_c)$ on the grid. They have a list of $k$ vectors, each represented as $(dx_i, dy_i)$.  \n\nThe person repeatedly chooses a vector from the list and moves as many times as possible in that direction, staying within the grid boundaries. A move consists of moving one square in the direction of the vector.\n\nDetermine the total number of steps the person takes.\n\n**Input:**\n\n* Two integers $n$ and $m$ (the dimensions of the grid).\n* Two integers $x_c$ and $y_c$ (the starting coordinates).\n* An integer $k$ (the number of vectors).\n* $k$ lines, each containing two integers $dx_i$ and $dy_i$ (the components of each vector).\n\n**Output:**\n\n* A single integer representing the total number of steps taken."}, {"prompt_md5": "c1ac1e92", "template_md5": "465699a0", "result": "A person starts at a given point in a rectangular grid. They have a list of directions to move in.  Each direction can be followed for as many steps as possible without going out of bounds.  Count the total number of steps taken."}]}