{"uid": "152-C", "url": "https://codeforces.com/contest/152/problem/C", "tags": ["combinatorics"], "title": "152-C", "statement": "C. Pocket Booktime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day little Vasya found mom's pocket book. The book hadnnames of her friends and unusually enough, each name was exactlymletters long. Let's number the names from1tonin the order in which they are written.As mom wasn't home, Vasya decided to play with names: he chose three integersi,j,k(1 ≤i<j≤n,1 ≤k≤m), then he took names numberiandjand swapped their prefixes of lengthk. For example, if we take names \"CBDAD\" and \"AABRD\" and swap their prefixes with the length of3, the result will be names \"AABAD\" and \"CBDRD\".You wonder how many different names Vasya can write instead of name number1, if Vasya is allowed to perform any number of the described actions. As Vasya performs each action, he chooses numbersi,j,kindependently from the previous moves and his choice is based entirely on his will. The sought number can be very large, so you should only find it modulo1000000007(109+ 7).InputThe first input line contains two integersnandm(1 ≤n,m≤ 100) — the number of names and the length of each name, correspondingly. Thennlines contain names, each name consists of exactlymuppercase Latin letters.OutputPrint the single number — the number of different names that could end up in position number1in the pocket book after the applying the procedures described above. Print the number modulo1000000007(109+ 7).ExamplesInput2 3AABBAAOutput4Input4 5ABABABCGDGAAAAAYABSAOutput216NoteIn the first sample Vasya can get the following names in the position number1: \"AAB\", \"AAA\", \"BAA\" and \"BAB\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8f2c91db", "template_md5": "35d339e4", "result": "You are given a list of $n$ names, each with $m$ letters.  \n\nVasya can perform the following operation any number of times:\n\n* Choose three integers $i$, $j$, and $k$ where $1 \\le i < j \\le n$ and $1 \\le k \\le m$.\n* Swap the first $k$ letters of the $i$th name with the first $k$ letters of the $j$th name.\n\nWhat is the total number of distinct names that can end up in the first position after any number of these operations?  The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "c5774d96", "template_md5": "465699a0", "result": "You are given a list of words of the same length.  You can swap the first 'k' letters of any two words in the list.  What is the total number of unique words that could end up in the first position of the list after performing any number of these swaps?"}]}