{"uid": "1520-A", "url": "https://codeforces.com/contest/1520/problem/A", "tags": ["brute force", " implementation"], "title": "1520-A", "statement": "A. Do Not Be Distracted!time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp has $$$26$$$ tasks. Each task is designated by a capital letter of the Latin alphabet.The teacher asked Polycarp to solve tasks in the following way: if Polycarp began to solve some task, then he must solve it to the end, without being distracted by another task. After switching to another task, Polycarp cannot return to the previous task.Polycarp can only solve one task during the day. Every day he wrote down what task he solved. Now the teacher wants to know if Polycarp followed his advice.For example, if Polycarp solved tasks in the following order: \"DDBBCCCBBEZ\", then the teacher will see that on the third day Polycarp began to solve the task 'B', then on the fifth day he got distracted and began to solve the task 'C', on the eighth day Polycarp returned to the task 'B'. Other examples of when the teacher is suspicious: \"BAB\", \"AABBCCDDEEBZZ\" and \"AAAAZAAAAA\".If Polycarp solved the tasks as follows: \"FFGZZZY\", then the teacher cannot have any suspicions. Please note that Polycarp is not obligated to solve all tasks. Other examples of when the teacher doesn't have any suspicious: \"BA\", \"AFFFCC\" and \"YYYYY\".Help Polycarp find out if his teacher might be suspicious.InputThe first line contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$). Then $$$t$$$ test cases follow.The first line of each test case contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 50$$$) — the number of days during which Polycarp solved tasks.The second line contains a string of length $$$n$$$, consisting of uppercase Latin letters, which is the order in which Polycarp solved the tasks.OutputFor each test case output:\"YES\", if the teachercannot be suspicious;\"NO\", otherwise.You may print every letter in any case you want (so, for example, the stringsyEs,yes,YesandYESare all recognized as positive answer).ExampleInput5 3 ABA 11 DDBBCCCBBEZ 7 FFGZZZY 1 Z 2 ABOutputNO NO YES YES YES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f8d81483", "template_md5": "35d339e4", "result": "You are given a sequence of $t$ test cases. Each test case consists of:\n\n* An integer $n$ representing the number of days.\n* A string of length $n$ containing uppercase letters, representing the order in which tasks were completed each day.\n\nDetermine if, for each test case, there is a sequence of tasks where a task is started but not finished before moving on to a different task.  \n\nIf such a sequence exists, output \"NO\". Otherwise, output \"YES\"."}, {"prompt_md5": "fee88fd2", "template_md5": "465699a0", "result": "Given a sequence of characters, determine if there are any instances where a character is started and then later revisited."}]}