{"uid": "1525-A", "url": "https://codeforces.com/contest/1525/problem/A", "tags": ["math", " number theory"], "title": "1525-A", "statement": "A. Potion-makingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have an initially empty cauldron, and you want to brew a potion in it. The potion consists of two ingredients: magic essence and water. The potion you want to brew should contain exactly $$$k\\\\ \\\\%$$$ magic essence and $$$(100 - k)\\\\ \\\\%$$$ water.In one step, you can pour either one liter of magic essence or one liter of water into the cauldron. What is the minimum number of steps to brew a potion? You don't care about the total volume of the potion, only about the ratio between magic essence and water in it.A small reminder: if you pour $$$e$$$ liters of essence and $$$w$$$ liters of water ($$$e + w > 0$$$) into the cauldron, then it contains $$$\\\\frac{e}{e + w} \\\\cdot 100\\\\ \\\\%$$$ (without rounding) magic essence and $$$\\\\frac{w}{e + w} \\\\cdot 100\\\\ \\\\%$$$ water.InputThe first line contains the single $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of test cases.The first and only line of each test case contains a single integer $$$k$$$ ($$$1 \\\\le k \\\\le 100$$$) — the percentage of essence in a good potion.OutputFor each test case, print the minimum number of steps to brew a good potion. It can be proved that it's always possible to achieve it in a finite number of steps.ExampleInput3 3 100 25Output100 1 4NoteIn the first test case, you should pour $$$3$$$ liters of magic essence and $$$97$$$ liters of water into the cauldron to get a potion with $$$3\\\\ \\\\%$$$ of magic essence.In the second test case, you can pour only $$$1$$$ liter of essence to get a potion with $$$100\\\\ \\\\%$$$ of magic essence.In the third test case, you can pour $$$1$$$ liter of magic essence and $$$3$$$ liters of water.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "354d527c", "template_md5": "35d339e4", "result": "You have an empty container. You want to make a potion that is $k\\%$ magic essence and $(100-k)\\%$ water. You can only add 1 liter of magic essence or 1 liter of water at a time. What is the fewest steps it takes to make the potion? \n\nThe total volume of the potion doesn't matter, only the ratio of magic essence to water. \n\nInput:\n\nThe first line contains the number of test cases, $t$.\n\nEach test case has a line with an integer $k$ representing the desired percentage of magic essence in the potion.\n\nOutput:\n\nFor each test case, print the minimum number of steps to make the potion."}, {"prompt_md5": "a09ecb27", "template_md5": "465699a0", "result": "You have an empty container. You can add either 1 unit of ingredient A or 1 unit of ingredient B. You need to make a mixture that is a specific percentage ingredient A. What is the fewest additions needed to make the mixture?"}]}