{"uid": "1528-B", "url": "https://codeforces.com/contest/1528/problem/B", "tags": ["combinatorics", " dp", " math"], "title": "1528-B", "statement": "B. Kavi on Pairing Dutytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputKavi has $$$2n$$$ points lying on the $$$OX$$$ axis, $$$i$$$-th of which is located at $$$x = i$$$.Kavi considers all ways to split these $$$2n$$$ points into $$$n$$$ pairs. Among those, he is interested ingoodpairings, which are defined as follows:Consider $$$n$$$ segments with ends at the points in correspondent pairs. The pairing is called good, if for every $$$2$$$ different segments $$$A$$$ and $$$B$$$ among those, at least one of the following holds:One of the segments $$$A$$$ and $$$B$$$ lies completely inside the other.$$$A$$$ and $$$B$$$ have the same length.Consider the following example:$$$A$$$ is a good pairing since the red segment lies completely inside the blue segment.$$$B$$$ is a good pairing since the red and the blue segment have the same length.$$$C$$$ is not a good pairing since none of the red or blue segments lies inside the other, neither do they have the same size.Kavi is interested in the number of good pairings, so he wants you to find it for him. As the result can be large, find this number modulo $$$998244353$$$.Two pairings are called different, if some two points are in one pair in some pairing and in different pairs in another.InputThe single line of the input contains a single integer $$$n$$$ $$$(1\\\\le n \\\\le 10^6)$$$.OutputPrint the number of good pairings modulo $$$998244353$$$.ExamplesInput1Output1Input2Output3Input3Output6Input100Output688750769NoteThe good pairings for the second example are:In the third example, the good pairings are:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0933db65", "template_md5": "35d339e4", "result": "You are given an integer $n$.  You need to find the number of ways to pair up $2n$ points on the number line, where the points are located at $x=1, 2, 3, ..., 2n$.  \n\nA pairing is considered \"good\" if for any two pairs of points, at least one of the following is true:\n\n* One pair of points is completely contained within the other pair.\n* The two pairs of points have the same length.\n\nThe answer should be given modulo 998244353."}, {"prompt_md5": "f5f6e78c", "template_md5": "465699a0", "result": "You are given an even number of points on a line.  You need to pair up the points.  A pairing is good if for any two pairs, either one pair is completely inside the other or the pairs have the same length.  Find the number of good pairings.  The answer may be large, so find it modulo 998244353."}]}