{"uid": "1531-C", "url": "https://codeforces.com/contest/1531/problem/C", "tags": ["*special", " constructive algorithms", " dp"], "title": "1531-C", "statement": "C. Симметричный амфитеатрограничение по времени на тест2 секундыограничение по памяти на тест512 мегабайтвводстандартный вводвыводстандартный выводВсе готовятся к VK Fest 2021! Для того, чтобы зрителям была лучше видна главная сцена, планируется построить амфитеатр. В этой задаче мы будем рассматривать его сбоку — схематично он будет иметь форму лестницы из $$$n$$$ одинаковых квадратов. Лестница — это одна или более башен квадратов, выстроенных в ряд, где высоты башен невозрастают слева направо.На следующем рисунке можно видеть три разные фигуры из $$$12$$$ квадратов. Первые две фигуры — лестницы, а третья — нет.Из эстетических соображений было решено, что амфитеатр должен быть симметричным. Формально, амфитеатр называется симметричным, если при отражении его схемы относительно прямой $$$x = y$$$ получается тот же самый рисунок (где ось $$$x$$$ направлена слева направо, а ось $$$y$$$ — снизу вверх). Например, первая лестница на рисунке выше — симметричная, а вторая — нет.Кроме того, амфитеатр должен быть максимально компактным — а именно, сторона минимального квадрата, внутрь которого можно его поместить, должна быть как можно меньше.По заданному числу $$$n$$$ нарисуйте схему амфитеатра из ровно $$$n$$$ квадратов, удовлетворяющую всем условиям.Входные данныеВ единственной строке задано одно целое число $$$n$$$ ($$$1 \\\\le n \\\\le 100$$$) — число квадратов, из которых нужно составить схему амфитеатра.Выходные данныеЕсли не существует схемы амфитеатра из $$$n$$$ квадратов, выведите единственное число $$$-1$$$.Иначе в первой строке выведите целое число $$$m$$$ — минимальное возможное число строк и столбцов в схеме амфитеатра. Далее выведите $$$m$$$ строк, описывающих схему. Каждая строка должна содержать ровно $$$m$$$ символов 'o' (строчная латинская буква) или '.', где 'o' описывает построенный квадрат, а '.' — пустое место. Схема амфитеатра должна состоять ровно из $$$n$$$ символов 'o'. Ячейка в левом нижнем углу должна содержать квадрат. Если возможных ответов с минимальным $$$m$$$ несколько, выведите любой из них.ПримерыВходные данные3Выходные данные2 o. ooВходные данные17Выходные данные5 o.... ooo.. oooo. oooo. ooooo", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a41ec1d0", "template_md5": "35d339e4", "result": "You are given a number $n$. You need to construct a symmetrical amphitheater using exactly $n$ squares. The amphitheater should be symmetrical across the line $x=y$.  The amphitheater should also be as compact as possible, meaning the side length of the smallest square that can contain the amphitheater should be minimized.\n\nOutput:\n\n* If it's impossible to construct a valid amphitheater, output $-1$.\n* Otherwise, output two integers:\n    * $m$: the minimum number of rows and columns required for the amphitheater.\n    * $m$ rows, each containing $m$ characters.  'o' represents a square, and '.' represents an empty space. The amphitheater should contain exactly $n$ 'o' characters. The bottom left corner should contain a square.\n\nIf there are multiple valid solutions with the minimum $m$, output any one of them."}, {"prompt_md5": "fe5a50c7", "template_md5": "465699a0", "result": "You are given a number of squares.  You need to arrange them into a symmetrical shape that resembles a staircase. The staircase must be as compact as possible. Output the dimensions of the shape and a representation of the staircase. If no such shape can be made, output -1."}]}