{"uid": "1531-B1", "url": "https://codeforces.com/contest/1531/problem/B1", "tags": ["*special", " *special"], "title": "1531-B1", "statement": "B1. Мониторингограничение по времени на тест2 секундыограничение по памяти на тест512 мегабайтвводстандартный вводвыводстандартный выводВКонтакте открыла второй штаб в Санкт-Петербурге! Вы не преминули возможностью сменить обстановку и решили переехать из офиса в Доме Зингера в офис на Красном мосту.Для комфортной работы вам потребуются два монитора с одинаковой высотой, чтобы изображение на них выглядело единым целым. На складе офиса на Красном мосту есть $$$n$$$ мониторов, $$$i$$$-й из них имеет ширину $$$w_i$$$ и высоту $$$h_i$$$. Любой монитор можно повернуть на 90 градусов, и тогда он будет иметь ширину $$$h_i$$$ и высоту $$$w_i$$$.Назовём неупорядоченную пару из двух различных мониторов подходящей, если можно их повернуть так, чтобы они имели одинаковую высоту. Любой из мониторов в паре можно как повернуть относительно исходной ориентации, так и не поворачивать.Подсчитайте подходящие пары мониторов.Входные данныеВ первой строке задано одно целое число $$$n$$$ — число мониторов на складе.В каждой из следующих $$$n$$$ строк заданы два целых числа $$$w_i$$$ и $$$h_i$$$ ($$$1 \\\\le w_i, h_i \\\\le 10^9$$$) — ширина и высота $$$i$$$-го монитора. Обратите внимание, что мониторы могут быть квадратными ($$$w_i = h_i$$$), а размеры разных мониторов могут совпадать.В этой версии задачи$$$2 \\\\le n \\\\le 10^3$$$.Выходные данныеВыведите число подходящих пар мониторов.ПримерыВходные данные5 3 2 2 2 5 5 3 5 4 3Выходные данные5Входные данные7 10 10 10 20 20 10 10 20 10 20 10 10 20 10Выходные данные21ПримечаниеВ первом примере подходящими являются пары мониторов с номерами $$$(1, 2)$$$, $$$(1, 4)$$$, $$$(1, 5)$$$, $$$(3, 4)$$$, $$$(4, 5)$$$.Во втором примере все пары мониторов — подходящие.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4adb11df", "template_md5": "35d339e4", "result": "You are given $n$ monitors, where the $i$-th monitor has a width of $w_i$ and a height of $h_i$.  You can rotate each monitor by 90 degrees.\n\nTwo monitors form a \"suitable pair\" if you can rotate them so that they have the same height.  \n\nCount the number of suitable pairs of monitors. \n\n\nInput:\n\nThe first line contains an integer $n$ representing the number of monitors.\n\nThe next $n$ lines each contain two integers $w_i$ and $h_i$ representing the width and height of the $i$-th monitor.\n\nOutput:\n\nPrint the number of suitable pairs of monitors."}, {"prompt_md5": "22197920", "template_md5": "465699a0", "result": "You have a list of items, each with a width and a height.  Determine how many pairs of items can be arranged so that they have the same height, regardless of whether they are rotated."}]}