{"uid": "1531-D", "url": "https://codeforces.com/contest/1531/problem/D", "tags": ["*special", " *special"], "title": "1531-D", "statement": "D. Редактируем Зингер | colorограничение по времени на тест2 секундыограничение по памяти на тест512 мегабайтвводстандартный вводвыводстандартный выводНемногие знают, что сотрудники ВКонтакте могут менять цвет подсветки в куполе знаменитого Дома Зингера, где расположена штаб-квартира ВКонтакте. Для этого нужно всего лишь отправить сообщение с цветом в специальный чат «Зингер | color», а бот его распознает и сменит подсветку. При этом на время городских мероприятий смена цвета блокируется.Формально, бот обрабатывает три типа сообщений:lock: заблокировать изменение цвета. Если оно и так заблокировано на данный момент, сообщение игнорируется.unlock: разблокировать изменение цвета. Если оно и так разблокировано на данный момент, сообщение игнорируется.red/orange/yellow/green/blue/indigo/violet: изменить цвет купола на заданный, если изменение цвета на данный момент не заблокировано.Вам дана история сообщений, полученных ботом, в хронологическом порядке. Считайте, что перед получением первого сообщения купол подсвечивается голубым (blue), а изменение цвета не заблокировано.В качестве эксперимента было решено поддержать в боте эффективную обработку редактирования сообщений. Вам дана последовательность пар вида $$$(i, msg)$$$, означающих, что $$$i$$$-е в хронологическом порядке сообщение было отредактировано и теперь имеет вид $$$msg$$$. Обратите внимание, что редактироваться может любое сообщение, и при редактировании сообщения бот должен обработать всю историю сообщений заново (в частности, перед обработкой первого сообщения цвет купола голубой, а изменение цвета не заблокировано).Определите, какой цвет будет у купола Дома Зингера до первой операции редактирования, а также после каждой операции редактирования.Входные данныеВ первой строке задано одно целое число $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$) — число сообщений, полученных ботом.В следующих $$$n$$$ строках заданы сообщения, полученные ботом, в хронологическом порядке, по одному сообщению в строке. Каждое сообщение — строка из следующего набора:lock,unlock,red,orange,yellow,green,blue,indigo,violet. Сообщения пронумерованы от $$$1$$$ до $$$n$$$.В следующей строке задано одно целое число $$$t$$$ ($$$1 \\\\le t \\\\le 10^5$$$) — число операций редактирования сообщений.В следующих $$$t$$$ строках заданы операции редактирования в хронологическом порядке, по одной в строке. Каждая операция — пара из номера сообщения $$$i$$$ ($$$1 \\\\le i \\\\le n$$$) и его нового содержимого $$$msg$$$, также принадлежащего наборуlock,unlock,red,orange,yellow,green,blue,indigo,violet.Выходные данныеВыведите $$$t+1$$$ строку: цвет купола до первой операции редактирования, а также после каждой операции редактирования в хронологическом порядке.ПримерыВходные данные7 red violet unlock red orange lock indigo 6 5 green 6 lock 6 yellow 4 lock 1 lock 5 unlockВыходные данныеorange green green indigo violet blue indigoВходные данные1 red 8 1 lock 1 unlock 1 blue 1 unlock 1 unlock 1 lock 1 yellow 1 lockВыходные данныеred blue blue blue blue blue blue yellow blue", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "93630145", "template_md5": "35d339e4", "result": "You are given a sequence of messages, each of which can be one of the following:\n\n* `lock`: Locks the ability to change the color.\n* `unlock`: Unlocks the ability to change the color.\n* `red`, `orange`, `yellow`, `green`, `blue`, `indigo`, `violet`: Changes the color to the specified color, if the color changing is not locked.\n\nInitially, the color is `blue` and the color changing is unlocked.\n\nYou are also given a sequence of operations, each of which modifies a message in the original sequence.\n\nFor each operation, you need to process the entire sequence of messages again, taking into account the modified message, and determine the color of the object after each operation.\n\nOutput the color of the object before the first operation and after each operation."}, {"prompt_md5": "51b4c493", "template_md5": "465699a0", "result": "A system processes messages that can be either \"lock\", \"unlock\", or one of seven colors.  \"lock\" and \"unlock\" control whether color changes are allowed.  If allowed, a color message changes the system's color. The system starts with the color \"blue\" and color changes are allowed.  You are given a list of messages and a list of edits to those messages.  For each edit, determine the system's color after the edit is applied."}]}