{"uid": "1532-F", "url": "https://codeforces.com/contest/1532/problem/F", "tags": ["*special", " strings"], "title": "1532-F", "statement": "F. Prefixes and Suffixestime limit per test2 smemory limit per test512 MBinputstandard inputoutputstandard outputIvan wants to play a game with you. He picked some string $$$s$$$ of length $$$n$$$ consisting only of lowercase Latin letters.You don't know this string. Ivan has informed you about all its improper prefixes and suffixes (i.e. prefixes and suffixes of lengths from $$$1$$$ to $$$n-1$$$), but he didn't tell you which strings are prefixes and which are suffixes.Ivan wants you to guess which of the given $$$2n-2$$$ strings are prefixes of the given string and which are suffixes. It may be impossible to guess the string Ivan picked (since multiple strings may give the same set of suffixes and prefixes), but Ivan will accept your answer if there is at least one string that is consistent with it. Let the game begin!InputThe first line of the input contains one integer number $$$n$$$ ($$$2 \\\\le n \\\\le 100$$$) — the length of the guessed string $$$s$$$.The next $$$2n-2$$$ lines are contain prefixes and suffixes, one per line. Each of them is the string of length from $$$1$$$ to $$$n-1$$$ consisting only of lowercase Latin letters. They can be given in arbitrary order.It is guaranteed that there are exactly $$$2$$$ strings of each length from $$$1$$$ to $$$n-1$$$. It is also guaranteed that these strings are prefixes and suffixes of some existing string of length $$$n$$$.OutputPrint one string of length $$$2n-2$$$ — the string consisting only of characters 'P' and 'S'. The number of characters 'P' should be equal to the number of characters 'S'. The $$$i$$$-th character of this string should be 'P' if the $$$i$$$-th of the input strings is the prefix and 'S' otherwise.If there are several possible answers, you can printany.ExamplesInput5 ba a abab a aba baba ab abaOutputSPPSPSPSInput3 a aa aa aOutputPPSSInput2 a cOutputPSNoteThe only string which Ivan can guess in the first example is \"ababa\".The only string which Ivan can guess in the second example is \"aaa\". Answers \"SPSP\", \"SSPP\" and \"PSPS\" are also acceptable.In the third example Ivan can guess the string \"ac\" or the string \"ca\". The answer \"SP\" is also acceptable.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "16f0d80d", "template_md5": "35d339e4", "result": "You are given $2n-2$ strings, each of length from 1 to $n-1$.  You don't know the original string, but you know that these strings are either prefixes or suffixes of some string of length $n$.  \n\nYour task is to determine which of these strings are prefixes and which are suffixes. You can output a string of length $2n-2$ where each character is either 'P' (for prefix) or 'S' (for suffix).  \n\nThere may be multiple possible solutions."}, {"prompt_md5": "9f54ef3d", "template_md5": "465699a0", "result": "You are given a list of strings. Some of these strings are prefixes of a secret unknown string, and some are suffixes.  You need to determine which strings are prefixes and which are suffixes, outputting 'P' for prefix and 'S' for suffix for each string."}]}