{"uid": "1533-H", "url": "https://codeforces.com/contest/1533/problem/H", "tags": ["*special", " bitmasks", " data structures", " dp"], "title": "1533-H", "statement": "H. Submatricestime limit per test3.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given matrix $$$s$$$ that contains $$$n$$$ rows and $$$m$$$ columns. Each element of a matrix is one of the $$$5$$$ first Latin letters (in upper case).For each $$$k$$$ ($$$1 \\\\le k \\\\le 5$$$) calculate the number of submatrices that contain exactly $$$k$$$ different letters. Recall that a submatrix of matrix $$$s$$$ is a matrix that can be obtained from $$$s$$$ after removing several (possibly zero) first rows, several (possibly zero) last rows, several (possibly zero) first columns, and several (possibly zero) last columns. If some submatrix can be obtained from $$$s$$$ in two or more ways, you have to count this submatrix the corresponding number of times.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 800$$$).Then $$$n$$$ lines follow, each containing the string $$$s_i$$$ ($$$|s_i| = m$$$) — $$$i$$$-th row of the matrix.OutputFor each $$$k$$$ ($$$1 \\\\le k \\\\le 5$$$) print one integer — the number of submatrices that contain exactly $$$k$$$ different letters.ExamplesInput2 3 ABB ABAOutput9 9 0 0 0Input6 6 EDCECE EDDCEB ACCECC BAEEDC DDDDEC DDAEADOutput56 94 131 103 57Input3 10 AEAAEEEEEC CEEAAEEEEE CEEEEAACAAOutput78 153 99 0 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "35539138", "template_md5": "35d339e4", "result": "You are given a matrix of characters. Each character is one of the first 5 capital letters (A-E).  \n\nFor each number $k$ from 1 to 5, count the number of submatrices in the matrix that contain exactly $k$ different characters. \n\nA submatrix is formed by removing some (or no) rows and columns from the original matrix.  If a submatrix can be formed in multiple ways, count it each time.\n\nOutput the count for each $k$."}, {"prompt_md5": "72dd30e6", "template_md5": "465699a0", "result": "You are given a grid of letters.  For each number from 1 to 5, count how many smaller grids (subgrids) within the larger grid contain that exact number of unique letters."}]}