{"uid": "1533-C", "url": "https://codeforces.com/contest/1533/problem/C", "tags": ["*special", " data structures", " implementation"], "title": "1533-C", "statement": "C. Sweetstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAnya came to her friend's birthday party. There are $$$n$$$ delicious sweets on a circle table (for convenience, we will number them from $$$1$$$ to $$$n$$$ in clockwise direction). For each of the sweets, it is known whether Anya likes it or not. Anya decided that she should eat all the sweets that are on the table, and she likes them.However, eating all the sweets in some random order is too boring. Therefore, Anya came up with a game that will make the process of eating sweets more interesting.The game is played according to the following rules:if there are no sweets that Anya likes left on the table, then the game ends;at the very beginning of the game, if there is at least one sweet on the table that Anya wants to eat, she eats the sweet number $$$1$$$;after Anya has eaten some sweet, she counts $$$k$$$ sweets clockwise, starting from the next sweet in the circle, and eats the $$$k$$$-th sweet in the count (if there are less than $$$k$$$ sweets in the circle, some sweets can participate in the count more than once, and the last sweet in the count is picked). Obviously, the sweets that have already been eaten do not participate in the count.For example, let $$$6$$$ sweets be arranged in a circle, Anya likes sweets $$$4$$$, $$$5$$$ and $$$6$$$, $$$k = 4$$$. Then the game goes as follows:initially there are sweets $$$[1, 2, 3, 4, 5, 6]$$$ on the table, Anya chooses the sweet number $$$1$$$.Anya eats the sweet number $$$1$$$, after that, there are sweets $$$[2, 3, 4, 5, 6]$$$ on the table. Anya counts $$$4$$$ sweets, starting with the $$$2$$$-nd sweet, and stops at the $$$5$$$-th sweet.Anya eats the $$$5$$$-th sweet, after that, there are sweets $$$[2, 3, 4, 6]$$$ on the table. Anya counts $$$4$$$ sweets, starting with the $$$6$$$-th sweet, and stops at the $$$4$$$-th sweet.Anya eats the sweet number $$$4$$$, after that, there are sweets $$$[2, 3, 6]$$$ on the table. Anya counts $$$4$$$ sweets, starting with the $$$6$$$-th sweet, and stops at the $$$6$$$-th sweet.Anya eats the sweet number $$$6$$$, after that, there are sweets $$$[2, 3]$$$ on the table. There are no sweets that Anya likes on the table, so the game ends.Your task is to calculate the number of sweets that Anya will eat.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 5000$$$) — the number of test cases.The first line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 5000$$$) — the number of sweets and the parameter $$$k$$$.The next line contains the string $$$s$$$, where $$$s_i = 1$$$ if Anya likes $$$i$$$-th sweet, and $$$s_i = 0$$$ otherwise.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$5000$$$.OutputFor each test case, print one integer — the number of sweets that Anya will eat.ExampleInput4 6 4 000111 7 3 0000100 3 2 000 5 1 10011Output4 4 0 5NoteThe first test case of the example is described in the statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "11eb6559", "template_md5": "35d339e4", "result": "You are given a circle with $n$ sweets numbered from 1 to $n$.  For each sweet, you know if it is liked or not.  \n\nA game is played as follows:\n\n1. If there are no more liked sweets, the game ends.\n2. At the start, the player eats sweet number 1 if there is a liked sweet.\n3. After eating a sweet, the player counts $k$ sweets clockwise from the next sweet and eats the $k$th sweet. If there are fewer than $k$ sweets remaining, some sweets may be counted multiple times.\n\nDetermine the total number of sweets the player will eat.\n\n**Input:**\n\n* $t$ - the number of test cases\n* For each test case:\n    * $n$ - the number of sweets\n    * $k$ - the counting value\n    * $s$ - a string of 0s and 1s, where 1 represents a liked sweet\n\n**Output:**\n\n* For each test case, print the number of sweets eaten."}, {"prompt_md5": "382fb8f2", "template_md5": "465699a0", "result": "You are given a circular arrangement of items. Some items are desirable. You start by taking the first item. Then, you take every kth item, moving clockwise, until there are no more desirable items left.  Count how many items you take in total."}]}