{"uid": "1534-A", "url": "https://codeforces.com/contest/1534/problem/A", "tags": ["brute force", " implementation"], "title": "1534-A", "statement": "A. Colour the Flagtime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputToday we will be playing a red and white colouring game (no, this is not the Russian Civil War; these are just the colours of the Canadian flag).You are given an $$$n \\\\times m$$$ grid of \"R\", \"W\", and \".\" characters. \"R\" is red, \"W\" is white and \".\" is blank. The neighbours of a cell are those that share an edge with it (those that only share a corner do not count).Your job is to colour the blank cells red or white so that every red cell only has white neighbours (and no red ones) and every white cell only has red neighbours (and no white ones). You are not allowed to recolour already coloured cells.InputThe first line contains $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$), the number of test cases.In each test case, the first line will contain $$$n$$$ ($$$1 \\\\le n \\\\le 50$$$) and $$$m$$$ ($$$1 \\\\le m \\\\le 50$$$), the height and width of the grid respectively.The next $$$n$$$ lines will contain the grid. Each character of the grid is either 'R', 'W', or '.'.OutputFor each test case, output \"YES\" if there is a valid grid or \"NO\" if there is not.If there is, output the grid on the next $$$n$$$ lines. If there are multiple answers, print any.In the output, the \"YES\"s and \"NO\"s are case-insensitive, meaning that outputs such as \"yEs\" and \"nO\" are valid. However,the grid is case-sensitive.ExampleInput3 4 6 .R.... ...... ...... .W.... 4 4 .R.W .... .... .... 5 1 R W R W ROutputYES WRWRWR RWRWRW WRWRWR RWRWRW NO YES R W R W RNoteThe answer for the first example case is given in the example output, and it can be proven that no grid exists that satisfies the requirements of the second example case. In the third example all cells are initially coloured, and the colouring is valid.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c2387eb6", "template_md5": "35d339e4", "result": "You are given a grid of characters: 'R' (red), 'W' (white), and '.' (blank).  \n\nYour task is to color all the blank cells either red or white, following these rules:\n\n* Every red cell must have only white cells as its neighbors.\n* Every white cell must have only red cells as its neighbors.\n\nNeighbors are cells that share an edge (not just a corner).\n\nFor each test case, determine if it's possible to color the grid according to the rules. If it's possible, output the colored grid. If not, output \"NO\"."}, {"prompt_md5": "7d8cf817", "template_md5": "465699a0", "result": "You are given a grid of red, white, and blank spaces.  You must color the blank spaces red or white so that every red space is surrounded by white spaces, and every white space is surrounded by red spaces.  Determine if this is possible and, if so, output the colored grid."}]}