{"uid": "1535-C", "url": "https://codeforces.com/contest/1535/problem/C", "tags": ["binary search", " dp", " greedy", " implementation", " strings", " two pointers"], "title": "1535-C", "statement": "C. Unstable Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$ consisting of the characters0,1, and?.Let's call a stringunstableif it consists of the characters0and1and any two adjacent characters are different (i. e. it has the form010101...or101010...).Let's call a stringbeautifulif it consists of the characters0,1, and?, and you can replace the characters?to0or1(for each character, the choice is independent), so that the string becomesunstable.For example, the strings0??10,0, and???are beautiful, and the strings00and?1??1are not.Calculate the number of beautiful contiguous substrings of the string $$$s$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — number of test cases.The first and only line of each test case contains the string $$$s$$$ ($$$1 \\\\le |s| \\\\le 2 \\\\cdot 10^5$$$) consisting of characters0,1, and?.It is guaranteed that the sum of the string lengths over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, output a single integer — the number ofbeautifulsubstrings of the string $$$s$$$.ExampleInput3 0?10 ??? ?10??1100Output8 6 25", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e30a9de0", "template_md5": "35d339e4", "result": "You are given a string consisting of the characters 0, 1, and ?.  \n\nA string is considered \"unstable\" if it only contains 0s and 1s, and no two adjacent characters are the same (for example, \"010101\" or \"101010\").\n\nA string is considered \"beautiful\" if it contains 0s, 1s, and ?s, and you can replace all the ?s with either 0 or 1 in a way that makes the resulting string \"unstable\".\n\nFor each test case, count the number of \"beautiful\" substrings within the given string.\n\n**Input:**\n\n* The first line contains the number of test cases, *t*.\n* Each test case consists of a single line containing a string *s*.\n\n**Output:**\n\n* For each test case, output the number of \"beautiful\" substrings in the string *s*."}, {"prompt_md5": "2961cffb", "template_md5": "465699a0", "result": "You are given a string of 0s, 1s, and ?.  A string is \"unstable\" if it has alternating 0s and 1s. A string is \"beautiful\" if you can replace the ?s with 0s or 1s to make it unstable. Count the number of beautiful substrings within the given string."}]}