{"uid": "1536-E", "url": "https://codeforces.com/contest/1536/problem/E", "tags": ["combinatorics", " graphs", " math", " shortest paths"], "title": "1536-E", "statement": "E. Omkar and Foresttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOmkar's most recent follower, Ajit, has entered the Holy Forest. Ajit realizes that Omkar's forest is an $$$n$$$ by $$$m$$$ grid ($$$1 \\\\leq n, m \\\\leq 2000$$$) of some non-negative integers. Since the forest is blessed by Omkar, it satisfies some special conditions:For any two adjacent (sharing a side) cells, the absolute value of the difference of numbers in them is at most $$$1$$$.If the number in some cell is strictly larger than $$$0$$$, it should be strictly greater than the number inat least oneof the cells adjacent to it.Unfortunately, Ajit is not fully worthy of Omkar's powers yet. He sees each cell as a \"0\" or a \"#\". If a cell is labeled as \"0\", then the number in it must equal $$$0$$$. Otherwise, the number in it can be any nonnegative integer.Determine how many different assignments of elements exist such that these special conditions are satisfied. Two assignments are considered different if there exists at least one cell such that the numbers written in it in these assignments are different. Since the answer may be enormous, find the answer modulo $$$10^9+7$$$.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$). Description of the test cases follows.The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n, m \\\\leq 2000, nm \\\\geq 2$$$) – the dimensions of the forest.$$$n$$$ lines follow, each consisting of one string of $$$m$$$ characters. Each of these characters is either a \"0\" or a \"#\".It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2000$$$ and the sum of $$$m$$$ over all test cases does not exceed $$$2000$$$.OutputFor each test case, print one integer: the number of valid configurations modulo $$$10^9+7$$$.ExampleInput4 3 4 0000 00#0 0000 2 1 # # 1 2 ## 6 29 ############################# #000##0###0##0#0####0####000# #0#0##00#00##00####0#0###0#0# #0#0##0#0#0##00###00000##00## #000##0###0##0#0##0###0##0#0# #############################Output2 3 3 319908071NoteFor the first test case, the two valid assignments are$$$0000\\\\\\\\ 0000\\\\\\\\ 0000$$$and$$$0000\\\\\\\\ 0010\\\\\\\\ 0000$$$", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fbeb38a9", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$ ($1 \\leq n, m \\leq 2000$). Each cell in the grid can be either a \"0\" or a \"#\". \n\nIf a cell is \"0\", the value in that cell must be 0. \n\nIf a cell is \"#\", the value in that cell can be any non-negative integer.\n\nThe grid must follow these rules:\n\n* For any two adjacent cells (sharing a side), the absolute difference between their values must be at most 1.\n* If a cell has a value strictly greater than 0, it must have a strictly greater value than at least one of its adjacent cells.\n\nFind the number of different possible valid assignments of values to the cells in the grid, modulo $10^9 + 7$."}, {"prompt_md5": "c1334d45", "template_md5": "465699a0", "result": "You are given a grid of cells. Some cells are marked with a \"0\", and the rest are marked with a \"#\".  A \"0\" cell must have a value of 0.  A \"#\" cell can have any non-negative integer value.  The values in adjacent cells (sharing a side) must differ by at most 1.  If a cell has a value greater than 0, it must be greater than at least one of its adjacent cells.  Count the number of different ways to assign values to the cells that satisfy these rules.  The answer may be very large, so give the result modulo 10^9+7."}]}