{"uid": "154-C", "url": "https://codeforces.com/contest/154/problem/C", "tags": ["graphs", " hashing", " sortings"], "title": "154-C", "statement": "C. Double Profilestime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou have been offered a job in a company developing a large social network. Your first task is connected with searching profiles that most probably belong to the same user.The social network containsnregistered profiles, numbered from1ton. Some pairs there are friends (the \"friendship\" relationship is mutual, that is, ifiis friends withj, thenjis also friends withi). Let's say that profilesiandj(i≠j) aredoubles, if for any profilek(k≠i,k≠j) one of the two statements is true: eitherkis friends withiandj, orkisn't friends with either of them. Also,iandjcan be friends or not be friends.Your task is to count the number of different unordered pairs (i,j), such that the profilesiandjare doubles. Note that the pairs are unordered, that is, pairs (a,b) and (b,a) are considered identical.InputThe first line contains two space-separated integersnandm(1 ≤n≤ 106,0 ≤m≤ 106), — the number of profiles and the number of pairs of friends, correspondingly.Nextmlines contains descriptions of pairs of friends in the format \"vu\", wherevandu(1 ≤v,u≤n,v≠u) are numbers of profiles that are friends with each other. It is guaranteed that each unordered pair of friends occurs no more than once and no profile is friends with itself.OutputPrint the single integer — the number of unordered pairs of profiles that are doubles.Please do not use the%lldspecificator to read or write 64-bit integers in С++. It is preferred to use the%I64dspecificator.ExamplesInput3 31 22 31 3Output3Input3 0Output3Input4 11 3Output2NoteIn the first and second sample any two profiles are doubles.In the third sample the doubles are pairs of profiles(1, 3)and(2, 4).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8e76aade", "template_md5": "35d339e4", "result": "You are given a social network with $n$ users.  There are $m$ friendships between users.  Two users are considered \"doubles\" if for every other user $k$, either $k$ is friends with both of them, or $k$ is not friends with either of them.\n\nYour task is to count the number of pairs of users that are doubles.  Note that the order of the pair does not matter (user 1 and user 2 are the same pair as user 2 and user 1). \n\n\n\nInput:\n\n* The first line contains two integers, $n$ and $m$, the number of users and the number of friendships.\n* The next $m$ lines each contain two integers, $v$ and $u$, representing a friendship between users $v$ and $u$.\n\nOutput:\n\n* Print a single integer, the number of double pairs of users."}, {"prompt_md5": "d64b3a7e", "template_md5": "465699a0", "result": "You are given a list of people and their friendships.  Determine how many pairs of people are \"doubles\" - meaning that for any other person, either they are friends with both people in the pair, or they are not friends with either."}]}