{"uid": "1547-B", "url": "https://codeforces.com/contest/1547/problem/B", "tags": ["greedy", " implementation", " strings"], "title": "1547-B", "statement": "B. Alphabetical Stringstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputA string $$$s$$$ of length $$$n$$$ ($$$1 \\\\le n \\\\le 26$$$) is calledalphabeticalif it can be obtained using the following algorithm:first, write an empty string to $$$s$$$ (i.e. perform the assignment $$$s$$$:= \"\");then perform the next step $$$n$$$ times;at the $$$i$$$-th step take $$$i$$$-th lowercase letter of the Latin alphabet and write it either to the left of the string $$$s$$$ or to the right of the string $$$s$$$ (i.e. perform the assignment $$$s$$$:=$$$c+s$$$ or $$$s$$$:=$$$s+c$$$, where $$$c$$$ is the $$$i$$$-th letter of the Latin alphabet).In other words, iterate over the $$$n$$$ first letters of the Latin alphabet starting from 'a' and etc. Each time we prepend a letter to the left of the string $$$s$$$ or append a letter to the right of the string $$$s$$$. Strings that can be obtained in that way are alphabetical.For example, the following strings are alphabetical: \"a\", \"ba\", \"ab\", \"bac\" and \"ihfcbadeg\". The following stringsare notalphabetical: \"z\", \"aa\", \"ca\", \"acb\", \"xyz\" and \"ddcba\".From the given string, determine if it is alphabetical.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Then $$$t$$$ test cases follow.Each test case is written on a separate line that contains one string $$$s$$$. String $$$s$$$ consists of lowercase letters of the Latin alphabet and has a length between $$$1$$$ and $$$26$$$, inclusive.OutputOutput $$$t$$$ lines, each of them must contain the answer to the corresponding test case. OutputYESif the given string $$$s$$$ is alphabetical andNOotherwise.You can outputYESandNOin any case (for example, stringsyEs,yes,YesandYESwill be recognized as a positive answer).ExampleInput11 a ba ab bac ihfcbadeg z aa ca acb xyz ddcbaOutputYES YES YES YES YES NO NO NO NO NO NONoteThe example contains test cases from the main part of the condition.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c8b99b1e", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  Determine if the string can be created by following these rules:\n\n1. Start with an empty string.\n2. Repeat the following  $n$ times, where $n$ is the length of the input string:\n   - Take the $i$th lowercase letter of the alphabet (a, b, c, ... z).\n   - Append this letter to either the beginning or the end of the current string.\n\nIf the input string can be created this way, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "4c6f27e1", "template_md5": "465699a0", "result": "Given a string, determine if it can be built by repeatedly adding letters of the alphabet to either the beginning or end of the string, one letter at a time."}]}