{"uid": "1548-D2", "url": "https://codeforces.com/contest/1548/problem/D2", "tags": ["brute force", " geometry", " math", " number theory"], "title": "1548-D2", "statement": "D2. Gregor and the Odd Cows (Hard)time limit per test6 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is the hard version of the problem. The only difference from the easy version is that in this version the coordinates can bebothodd and even.There are $$$n$$$ fence-posts at distinct coordinates on a plane. It is guaranteed that no three fence posts lie on the same line.There are an infinite number of cows on the plane, one at every point with integer coordinates.Gregor is a member of the Illuminati, and wants to build a triangular fence, connecting $$$3$$$ distinct existing fence posts. A cowstrictlyinside the fence is said to beenclosed. If there are anoddnumber of enclosed cows and the area of the fence is aninteger, the fence is said to beinteresting.Find the number of interesting fences.InputThe first line contains the integer $$$n$$$ ($$$3 \\\\le n \\\\le 6000$$$), the number of fence posts which Gregor can choose to form the vertices of a fence.Each of the next $$$n$$$ line contains two integers $$$x$$$ and $$$y$$$ ($$$0 \\\\le x,y \\\\le 10^7$$$, where $$$(x,y)$$$ is the coordinate of a fence post. All fence posts lie at distinct coordinates. No three fence posts are on the same line.OutputPrint a single integer, the number of interesting fences. Two fences are considered different if they are constructed with a different set of three fence posts.ExamplesInput3 0 0 2 0 0 4Output1Input4 1 8 0 6 5 2 5 6Output1Input10 170 59 129 54 5 98 129 37 58 193 154 58 24 3 13 138 136 144 174 150Output29NoteIn the first example, there is only $$$1$$$ fence. That fence is interesting since its area is $$$4$$$ and there is $$$1$$$ enclosed cow, marked in red.In the second example, there are $$$4$$$ possible fences. Only one of them is interesting however. That fence has an area of $$$8$$$ and $$$5$$$ enclosed cows.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3d65c23b", "template_md5": "35d339e4", "result": "There are $n$ fence posts at distinct points on a plane. Each point has integer coordinates ($x$, $y$).  No three fence posts lie on the same line.\n\nYou need to find the number of triangles you can form using three of these fence posts that meet the following conditions:\n\n* The area of the triangle must be an integer.\n* The number of cows inside the triangle (cows are located at all integer coordinate points) must be odd. \n\nTwo triangles are considered different if they are formed using a different set of three fence posts. \n\n\n\nLet me know if you'd like help with any specific part of the problem or need further clarification!"}, {"prompt_md5": "e71eb73f", "template_md5": "465699a0", "result": "You are given a set of points on a grid.  Find the number of triangles you can make using 3 of these points where the area of the triangle is a whole number and the number of points inside the triangle is odd."}]}