{"uid": "1548-C", "url": "https://codeforces.com/contest/1548/problem/C", "tags": ["combinatorics", " dp", " fft", " math"], "title": "1548-C", "statement": "C. The Three Little Pigstime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputThree little pigs from all over the world are meeting for a convention! Every minute, a triple of 3 new pigs arrives on the convention floor. After the $$$n$$$-th minute, the convention ends.The big bad wolf has learned about this convention, and he has an attack plan. At some minute in the convention, he will arrive and eat exactly $$$x$$$ pigs. Then he will get away.The wolf wants Gregor to help him figure out the number of possible attack plans that involve eating exactly $$$x$$$ pigs for various values of $$$x$$$ ($$$1 \\\\le x \\\\le 3n$$$). Two attack plans are considered different, if they occur at different times or if the sets of little pigs to eat are different.Note that all queries are independent, that is, the wolf does not eat the little pigs, he only makes plans!InputThe first line of input contains two integers $$$n$$$ and $$$q$$$ ($$$1 \\\\le n \\\\le 10^6$$$, $$$1 \\\\le q \\\\le 2\\\\cdot 10^5$$$), the number of minutes the convention lasts and the number of queries the wolf asks.Each of the next $$$q$$$ lines contains a single integer $$$x_i$$$ ($$$1 \\\\le x_i \\\\le 3n$$$), the number of pigs the wolf will eat in the $$$i$$$-th query.OutputYou should print $$$q$$$ lines, with line $$$i$$$ representing the number of attack plans if the wolf wants to eat $$$x_i$$$ pigs. Since each query answer can be large, output each answer modulo $$$10^9+7$$$.ExamplesInput2 3 1 5 6Output9 6 1Input5 4 2 4 6 8Output225 2001 6014 6939NoteIn the example test, $$$n=2$$$. Thus, there are $$$3$$$ pigs at minute $$$1$$$, and $$$6$$$ pigs at minute $$$2$$$. There are three queries: $$$x=1$$$, $$$x=5$$$, and $$$x=6$$$.If the wolf wants to eat $$$1$$$ pig, he can do so in $$$3+6=9$$$ possible attack plans, depending on whether he arrives at minute $$$1$$$ or $$$2$$$.If the wolf wants to eat $$$5$$$ pigs, the wolf cannot arrive at minute $$$1$$$, since there aren't enough pigs at that time. Therefore, the wolf has to arrive at minute $$$2$$$, and there are $$$6$$$ possible attack plans.If the wolf wants to eat $$$6$$$ pigs, his only plan is to arrive at the end of the convention and devour everybody.Remember to output your answers modulo $$$10^9+7$$$!", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a1462ead", "template_md5": "35d339e4", "result": "A convention lasts for $n$ minutes. Every minute, 3 new people arrive.  \n\nYou need to determine the number of ways the wolf can eat $x$ people at some point during the convention, for each value of $x$ from 1 to $3n$.  \n\nTwo ways are different if they happen at different times or if the wolf eats a different set of people.\n\n**Input:**\n\n* The first line contains two integers, $n$ (the number of minutes the convention lasts) and $q$ (the number of queries).\n* The next $q$ lines each contain an integer $x_i$ (the number of people the wolf wants to eat in the $i$-th query).\n\n**Output:**\n\n* For each query, print the number of ways the wolf can eat $x_i$ people, modulo $10^9 + 7$."}, {"prompt_md5": "08d80448", "template_md5": "465699a0", "result": "A convention lasts for a given number of minutes.  Every minute, a fixed number of new attendees arrive.  \n\nYou need to find the number of ways the wolf can arrive at some point during the convention and eat a specific number of attendees.  The wolf can only eat attendees at a single point in time."}]}