{"uid": "155-A", "url": "https://codeforces.com/contest/155/problem/A", "tags": ["brute force"], "title": "155-A", "statement": "A. I_love_%username%time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya adores sport programming. He can't write programs but he loves to watch the contests' progress. Vasya even has a favorite coder and Vasya pays special attention to him.One day Vasya decided to collect the results of all contests where his favorite coder participated and track the progress of his coolness. For each contest where this coder participated, he wrote out a single non-negative number — the number of points his favorite coder earned in the contest. Vasya wrote out the points for the contest in the order, in which the contests run (naturally, no two contests ran simultaneously).Vasya considers a coder's performance in a contestamazingin two situations: he can break either his best or his worst performance record. First, it is amazing if during the contest the coder earns strictlymorepoints that he earned on each past contest. Second, it is amazing if during the contest the coder earns strictlylesspoints that he earned on each past contest. A coder's first contest isn't considered amazing. Now he wants to count the number of amazing performances the coder had throughout his whole history of participating in contests. But the list of earned points turned out long and Vasya can't code... That's why he asks you to help him.InputThe first line contains the single integern(1 ≤n≤ 1000) — the number of contests where the coder participated.The next line containsnspace-separated non-negative integer numbers — they are the points which the coder has earned. The points are given in the chronological order. All points do not exceed10000.OutputPrint the single number — the number of amazing performances the coder has had during his whole history of participating in the contests.ExamplesInput5100 50 200 150 200Output2Input104664 6496 5814 7010 5762 5736 6944 4850 3698 7242Output4NoteIn the first sample the performances number 2 and 3 are amazing.In the second sample the performances number 2, 4, 9 and 10 are amazing.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d88a77f9", "template_md5": "35d339e4", "result": "You are given a list of non-negative integers representing the points earned by a coder in each of $n$ contests.  Determine the number of contests where the coder's performance was \"amazing\". A performance is amazing if it is either strictly higher or strictly lower than the points earned in all previous contests. The first contest is not considered amazing."}, {"prompt_md5": "6795c8d9", "template_md5": "465699a0", "result": "Given a list of scores from contests, count how many times a score is either the highest or lowest score seen so far.  The first score is not considered."}]}