{"uid": "155-B", "url": "https://codeforces.com/contest/155/problem/B", "tags": ["greedy", " sortings"], "title": "155-B", "statement": "B. Combinationtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIlya plays a card game by the following rules.A player has several cards. Each card contains two non-negative integers inscribed, one at the top of the card and one at the bottom. At the beginning of the round the player chooses one of his cards to play it. If the top of the card contains numberai, and the bottom contains numberbi, then when the player is playing the card, he getsaipoints and also gets the opportunity to play additionalbicards. After the playing the card is discarded.More formally: let's say that there is a counter of the cards that can be played. At the beginning of the round the counter equals one. When a card is played, the counter decreases by one for the played card and increases by the numberbi, which is written at the bottom of the card. Then the played card is discarded. If after that the counter is not equal to zero, the player gets the opportunity to play another card from the remaining cards. The round ends when the counter reaches zero or the player runs out of cards.Of course, Ilya wants to get as many points as possible. Can you determine the maximum number of points he can score provided that you know his cards?InputThe first line contains a single integern(1 ≤n≤ 1000) — the number of cards Ilya has.Each of the nextnlines contains two non-negative space-separated integers —aiandbi(0 ≤ai,bi≤ 104) — the numbers, written at the top and the bottom of thei-th card correspondingly.OutputPrint the single number — the maximum number of points you can score in one round by the described rules.ExamplesInput21 02 0Output2Input31 02 00 2Output3NoteIn the first sample none of two cards brings extra moves, so you should play the one that will bring more points.In the second sample you should first play the third card that doesn't bring any points but lets you play both remaining cards.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "30b5b681", "template_md5": "35d339e4", "result": "You are given a set of $n$ cards. Each card has two numbers on it: a top number ($a_i$) and a bottom number ($b_i$). \n\nYou play one card at a time. When you play a card:\n\n* You get $a_i$ points.\n* You get to play an additional $b_i$ cards.\n\nYou can keep playing cards as long as you have cards left and the card counter is greater than 0. The card counter starts at 1 and decreases by 1 when you play a card, and increases by $b_i$ when you play a card with a bottom number of $b_i$.\n\nWhat is the maximum number of points you can get in one round?"}, {"prompt_md5": "52689cc7", "template_md5": "465699a0", "result": "You have a set of cards, each with two numbers on it.  You can play one card at a time.  When you play a card, you get points equal to the top number and can then play additional cards equal to the bottom number.  Find the maximum number of points you can get in a single round."}]}