{"uid": "1550-B", "url": "https://codeforces.com/contest/1550/problem/B", "tags": ["greedy", " math"], "title": "1550-B", "statement": "B. Maximum Cost Deletiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$ of length $$$n$$$ consisting only of the characters0and1.You perform the following operation until the string becomes empty: choose someconsecutivesubstring ofequalcharacters, erase it from the string and glue the remaining two parts together (any of them can be empty) in the same order. For example, if you erase the substring111from the string111110, you will get the string110. When you delete a substring of length $$$l$$$, you get $$$a \\\\cdot l + b$$$ points.Your task is to calculate the maximum number of points that you can score in total, if you have to make the given string empty.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 2000$$$) — the number of testcases.The first line of each testcase contains three integers $$$n$$$, $$$a$$$ and $$$b$$$ ($$$1 \\\\le n \\\\le 100; -100 \\\\le a, b \\\\le 100$$$) — the length of the string $$$s$$$ and the parameters $$$a$$$ and $$$b$$$.The second line contains the string $$$s$$$. The string $$$s$$$ consists only of the characters0and1.OutputFor each testcase, print a single integer — the maximum number of points that you can score.ExampleInput3 3 2 0 000 5 -2 5 11001 6 1 -4 100111Output6 15 -2NoteIn the first example, it is enough to delete the entire string, then we will get $$$2 \\\\cdot 3 + 0 = 6$$$ points.In the second example, if we delete characters one by one, then for each deleted character we will get $$$(-2) \\\\cdot 1 + 5 = 3$$$ points, i. e. $$$15$$$ points in total.In the third example, we can delete the substring00from the string100111, we get $$$1 \\\\cdot 2 + (-4) = -2$$$ points, and the string will be equal to1111, removing it entirely we get $$$1 \\\\cdot 4 + (-4) = 0$$$ points. In total, we got $$$-2$$$ points for $$$2$$$ operations.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0e1e178d", "template_md5": "35d339e4", "result": "You are given a string of 0s and 1s. You can repeatedly delete a consecutive substring of the same character (either all 0s or all 1s) and get points based on the length of the deleted substring.  The points are calculated as  $a \\cdot l + b$ where $l$ is the length of the deleted substring and $a$ and $b$ are given constants.\n\nYour goal is to find the maximum number of points you can get by deleting substrings until the string becomes empty. \n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains three integers: $n$ (the length of the string), $a$, and $b$.\n    * The second line contains the string of 0s and 1s.\n\nOutput:\n\n* For each test case, print the maximum number of points you can get."}, {"prompt_md5": "6b02503f", "template_md5": "465699a0", "result": "You have a string of 0s and 1s. You can delete consecutive groups of the same character and get points based on the length of the group and two given numbers.  Find the maximum number of points you can get by deleting the entire string."}]}