{"uid": "1551-D1", "url": "https://codeforces.com/contest/1551/problem/D1", "tags": ["constructive algorithms", " math"], "title": "1551-D1", "statement": "D1. Domino (easy version)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe only difference between this problem and D2 is that you don't have to provide the way to construct the answer in this problem, but you have to do it in D2.There's a table of $$$n \\\\times m$$$ cells ($$$n$$$ rows and $$$m$$$ columns). The value of $$$n \\\\cdot m$$$ is even.A domino is a figure that consists of two cells having a common side. It may be horizontal (one of the cells is to the right of the other) or vertical (one of the cells is above the other).You need to find out whether it is possible to place $$$\\\\frac{nm}{2}$$$ dominoes on the table so that exactly $$$k$$$ of them are horizontal and all the other dominoes are vertical. The dominoes cannot overlap and must fill the whole table.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10$$$) — the number of test cases. Then $$$t$$$ test cases follow.Each test case consists of a single line. The line contains three integers $$$n$$$, $$$m$$$, $$$k$$$ ($$$1 \\\\le n,m \\\\le 100$$$, $$$0 \\\\le k \\\\le \\\\frac{nm}{2}$$$, $$$n \\\\cdot m$$$ is even) — the number of rows, columns and horizontal dominoes, respectively.OutputFor each test case output \"YES\", if it is possible to place dominoes in the desired way, or \"NO\" otherwise.You may print each letter in any case (YES,yes,Yeswill all be recognized as positive answer,NO,noandnOwill all be recognized as negative answer).ExampleInput8 4 4 2 2 3 0 3 2 3 1 2 0 2 4 2 5 2 2 2 17 16 2 1 1OutputYES YES YES NO YES NO YES NO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ee42ab0d", "template_md5": "35d339e4", "result": "You are given a rectangular table with $n$ rows and $m$ columns. The total number of cells in the table is even ($n \\cdot m$ is even).\n\nA domino is a shape made of two connected cells. It can be horizontal (two cells side-by-side) or vertical (two cells on top of each other).\n\nYou need to determine if it's possible to cover the entire table with $\\frac{nm}{2}$ dominoes, where exactly $k$ of them are horizontal. The dominoes cannot overlap.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* Each test case has a line with three integers: $n$, $m$, and $k$.\n\n**Output:**\n\n* For each test case, print \"YES\" if it's possible to place the dominoes as described, and \"NO\" otherwise."}, {"prompt_md5": "a83af4ae", "template_md5": "465699a0", "result": "You are given a rectangular grid of cells.  You need to determine if you can cover the entire grid with dominoes, where each domino takes up two cells, and a specific number of the dominoes must be placed horizontally."}]}