{"uid": "1556-G", "url": "https://codeforces.com/contest/1556/problem/G", "tags": ["bitmasks", " data structures", " dsu", " two pointers"], "title": "1556-G", "statement": "G. Gates to Another Worldtime limit per test4 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputAs mentioned previously William really likes playing video games. In one of his favorite games, the player character is in a universe where every planet is designated by a binary number from $$$0$$$ to $$$2^n - 1$$$. On each planet, there are gates that allow the player to move from planet $$$i$$$ to planet $$$j$$$ if the binary representations of $$$i$$$ and $$$j$$$ differ in exactly one bit.William wants to test you and see how you can handle processing the following queries in this game universe:Destroy planets with numbers from $$$l$$$ to $$$r$$$ inclusively. These planets cannot be moved to anymore.Figure out if it is possible to reach planet $$$b$$$ from planet $$$a$$$ using some number of planetary gates. It is guaranteed that the planets $$$a$$$ and $$$b$$$ are not destroyed.InputThe first line contains two integers $$$n$$$, $$$m$$$ ($$$1 \\\\leq n \\\\leq 50$$$, $$$1 \\\\leq m \\\\leq 5 \\\\cdot 10^4$$$), which are the number of bits in binary representation of each planets' designation and the number of queries, respectively.Each of the next $$$m$$$ lines contains a query of two types:block l r— query for destruction of planets with numbers from $$$l$$$ to $$$r$$$ inclusively ($$$0 \\\\le l \\\\le r < 2^n$$$). It's guaranteed that no planet will be destroyed twice.ask a b— query for reachability between planets $$$a$$$ and $$$b$$$ ($$$0 \\\\le a, b < 2^n$$$). It's guaranteed that planets $$$a$$$ and $$$b$$$ hasn't been destroyed yet.OutputFor each query of typeaskyou must output \"1\" in a new line, if it is possible to reach planet $$$b$$$ from planet $$$a$$$ and \"0\" otherwise (without quotation marks).ExamplesInput3 3 ask 0 7 block 3 6 ask 0 7Output1 0Input6 10 block 12 26 ask 44 63 block 32 46 ask 1 54 block 27 30 ask 10 31 ask 11 31 ask 49 31 block 31 31 ask 2 51Output1 1 0 0 1 0NoteThe first example test can be visualized in the following way:Response to a queryask 0 7is positive.Next after queryblock 3 6the graph will look the following way (destroyed vertices are highlighted):Response to a queryask 0 7is negative, since any path from vertex $$$0$$$ to vertex $$$7$$$ must go through one of the destroyed vertices.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "854eae30", "template_md5": "465699a0", "result": "You are given a set of numbers. Some numbers will be removed from the set.  You need to determine if a given pair of numbers can be connected by a series of steps, where each step involves moving to a number that differs from the current number by only one digit."}, {"prompt_md5": "7a438b33", "template_md5": "35d339e4", "result": "You are given a set of planets numbered from $0$ to $2^n - 1$.  Each planet can be connected to another planet if their binary representations differ in exactly one bit.\n\nYou will be given queries of two types:\n\n* **block l r:** Destroy all planets from $l$ to $r$ (inclusive). These planets can no longer be connected to other planets.\n* **ask a b:** Determine if it is possible to travel from planet $a$ to planet $b$ using only the remaining connected planets.\n\nOutput \"1\" if it is possible to travel from planet $a$ to planet $b$, and \"0\" otherwise."}]}