{"uid": "156-E", "url": "https://codeforces.com/contest/156/problem/E", "tags": ["brute force", " dp"], "title": "156-E", "statement": "E. Mrs. Hudson's Pancakestime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutMrs. Hudson hasn't made her famous pancakes for quite a while and finally she decided to make them again. She has learnedmnew recipes recently and she can't wait to try them. Those recipes are based onnspecial spices. Mrs. Hudson has these spices in the kitchen lying in jarsnumberedwith integers from0ton- 1(each spice lies in an individual jar). Each jar also has thepriceof the corresponding spice inscribed — some integerai.We know three values for thei-th pancake recipe:di,si,ci. Herediandciare integers, andsiis thepatternof some integer written in the numeral system with radixdi. The pattern contains digits, Latin letters (to denote digits larger than nine) and question marks. Numberxin thedi-base numeral systemmatches the patternsi, if we can replace question marks in the pattern with digits and letters so that we obtain numberx(leading zeroes aren't taken into consideration when performing the comparison). More formally: each question mark should be replaced by exactly one digit or exactly one letter. If after we replace all question marks we get a number with leading zeroes, we can delete these zeroes. For example, number40A9875in the11-base numeral system matches the pattern \"??4??987?\", and number4A9875does not.To make the pancakes by thei-th recipe, Mrs. Hudson should take all jars withnumberswhose representation in thedi-base numeral system matches the patternsi. Thecontrol numberof the recipe (zi) is defined as the sum of numberciand the product ofpricesof all taken jars. More formally:(wherejis all such numbers whose representation in thedi-base numeral system matches the patternsi).Mrs. Hudson isn't as interested in the control numbers as she is in their minimum prime divisors. Your task is: for each recipeifind the minimum prime divisor of numberzi. If this divisor exceeds100, then you do not have to find it, print -1.InputThe first line contains the single integern(1 ≤n≤ 104). The second line contains space-separated prices of the spicesa0,a1, ...,an- 1, whereaiis an integer (1 ≤ai≤ 1018).The third line contains the single integerm(1 ≤m≤ 3·104) — the number of recipes Mrs. Hudson has learned.Nextmlines describe the recipes, one per line. First you are given an integerdi, written in the decimal numeral system (2 ≤di≤ 16). Then after a space follows thesipattern — a string from1to30in length, inclusive, consisting of digits from \"0\" to \"9\", letters from \"A\" to \"F\" and signs \"?\". Letters from \"A\" to \"F\" should be considered as digits from10to15correspondingly. It is guaranteed that all digits of the pattern (including the digits that are represented by letters) are strictly less thandi. Then after a space follows an integerci, written in the decimal numeral system (1 ≤ci≤ 1018).Please do not use the%lldspecificator to read or write 64-bit integers in С++, in is preferred to usecin,cout, strings or the%I64dspecificator instead.OutputFor each recipe count by what minimum prime number the control number is divided and print this prime number on the single line. If this number turns out larger than100, print -1.ExamplesInput1112 ? 1Output2Input42 3 5 742 ?0 112 ?1 132 0? 172 1? 19Output32232Input11000000000000000000116 ?????????????? 1Output-1NoteIn the first test any one-digit number in the binary system matches. The jar is only one and its price is equal to1, the numbercis also equal to1, the control number equals2. The minimal prime divisor of2is2.In the second test there are4jars with numbers from0to3, and the prices are equal2,3,5and7correspondingly — the first four prime numbers. In all recipes numbers should be two-digit. In the first recipe the second digit always is0, in the second recipe the second digit always is1, in the third recipe the first digit must be0, in the fourth recipe the first digit always is1. Consequently, the control numbers ​​are as follows: in the first recipe2 × 5 + 11 = 21(the minimum prime divisor is3), in the second recipe3 × 7 + 13 = 44(the minimum prime divisor is2), in the third recipe2 × 3 + 17 = 23(the minimum prime divisor is23) and, finally, in the fourth recipe5 × 7 + 19 = 54(the minimum prime divisor is2).In the third test, the number should consist of fourteen digits and be recorded in a sixteen-base numeral system. Number0(the number of the single bottles) matches, the control number will be equal to1018+ 1. The minimum prime divisor of this number is equal to101and you should print -1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "142c83b1", "template_md5": "35d339e4", "result": "You are given a list of spices, each with a price. There are also recipes, each with a base, a pattern, and a control number.\n\n* **Base:** An integer $d$ (2 to 16) representing the numeral system.\n* **Pattern:** A string of digits (0-9), letters (A-F), and question marks.  \n    * Letters represent digits 10 to 15.\n    * Question marks can be replaced with digits or letters less than $d$.\n* **Control Number:**  \n    * Find all spices whose representation in base $d$ matches the pattern.\n    * The control number is the sum of $c$ and the product of the prices of the selected spices.\n\nFor each recipe, find the smallest prime divisor of the control number. If the divisor is greater than 100, print -1."}, {"prompt_md5": "8d28f3a9", "template_md5": "465699a0", "result": "You are given a list of items with prices and a set of recipes. Each recipe has a pattern and a target value.  To make a recipe, you must select items whose numerical representation matches the pattern. The recipe's value is the sum of the target value and the product of the selected items' prices. Find the smallest prime number that divides each recipe's value. If the smallest prime number is greater than 100, output -1."}]}