{"uid": "1562-B", "url": "https://codeforces.com/contest/1562/problem/B", "tags": ["brute force", " constructive algorithms", " implementation", " math", " number theory"], "title": "1562-B", "statement": "B. Scenes From a Memorytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputDuring the hypnosis session, Nicholas suddenly remembered a positive integer $$$n$$$, whichdoesn't contain zeros in decimal notation.Soon, when he returned home, he got curious: what is the maximum number of digits that can be removed from the number so that the number becomesnot prime, that is, either composite or equal to one?For some numbers doing so is impossible: for example, for number $$$53$$$ it's impossible to delete some of its digits to obtain a not prime integer. However,for all $$$n$$$ in the test cases of this problem, it's guaranteed that it's possible to delete some of their digits to obtain a not prime number.Note that you cannot remove all the digits from the number.A prime number is a number that has no divisors except one and itself. A composite is a number that has more than two divisors. $$$1$$$ is neither a prime nor a composite number.InputEach test contains multiple test cases.The first line contains one positive integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^3$$$), denoting the number of test cases. Description of the test cases follows.The first line of each test case contains one positive integer $$$k$$$ ($$$1 \\\\le k \\\\le 50$$$) — the number of digits in the number.The second line of each test case contains a positive integer $$$n$$$, which doesn't contain zeros in decimal notation ($$$10^{k-1} \\\\le n < 10^{k}$$$). It is guaranteed that it is always possible to remove less than $$$k$$$ digits to make the number not prime.It is guaranteed that the sum of $$$k$$$ over all test cases does not exceed $$$10^4$$$.OutputFor every test case, print two numbers in two lines. In the first line print the number of digits, that youhave leftin the number. In the second line print the digits left after all delitions.If there are multiple solutions, print any.ExampleInput7 3 237 5 44444 3 221 2 35 3 773 1 4 30 626221626221626221626221626221Output2 27 1 4 1 1 2 35 2 77 1 4 1 6NoteIn the first test case, you can't delete $$$2$$$ digits from the number $$$237$$$, as all the numbers $$$2$$$, $$$3$$$, and $$$7$$$ are prime. However, you can delete $$$1$$$ digit, obtaining a number $$$27 = 3^3$$$.In the second test case, you can delete all digits except one, as $$$4 = 2^2$$$ is a composite number.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "955d9600", "template_md5": "35d339e4", "result": "You are given a positive integer $n$ that does not contain the digit zero.  Find the maximum number of digits you can remove from $n$ to create a number that is not prime (i.e., it is either composite or equal to 1).  \n\n**Input:**\n\n* The first line contains an integer $t$ representing the number of test cases.\n* For each test case:\n    * The first line contains an integer $k$ representing the number of digits in the integer $n$.\n    * The second line contains the integer $n$ ($10^{k-1} \\le n < 10^k$).\n\n**Output:**\n\n* For each test case, print two lines:\n    * The first line contains the number of digits remaining after the removals.\n    * The second line contains the remaining digits. \n\n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "8b1ab8aa", "template_md5": "465699a0", "result": "You are given a positive integer.  Find the largest number of digits you can remove from it to make the remaining number not a prime number.  A prime number is a whole number greater than 1 that has only two divisors: 1 and itself."}]}