{"uid": "1567-F", "url": "https://codeforces.com/contest/1567/problem/F", "tags": ["2-sat", " constructive algorithms", " dfs and similar", " dsu", " graphs", " implementation"], "title": "1567-F", "statement": "F. One-Four Overloadtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice has an empty grid with $$$n$$$ rows and $$$m$$$ columns. Some of the cells are marked, andno marked cells are adjacent to the edge of the grid. (Two squares areadjacentif they share a side.)Alice wants to fill each cell with a number such that the following statements are true:everyunmarkedcell contains either the number $$$1$$$ or $$$4$$$;everymarkedcell contains the sum of the numbers in allunmarkedcells adjacent to it (if a marked cell is not adjacent to any unmarked cell, this sum is $$$0$$$);everymarkedcell contains a multiple of $$$5$$$.Alice couldn't figure it out, so she asks Bob to help her. Help Bob find any such grid, or state that no such grid exists.InputThe first line of input contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n, m \\\\leq 500$$$) — the number of rows and the number of columns in the grid, respectively.Then $$$n$$$ lines follow, each containing $$$m$$$ characters. Each of these characters is either '.' or 'X' — an unmarked and a marked cell, respectively.No marked cells are adjacent to the edge of the grid.OutputOutput \"'NO\" if no suitable grid exists. Otherwise, output \"'YES\"'. Then output $$$n$$$ lines of $$$m$$$ space-separated integers — the integers in the grid.ExamplesInput5 5 ..... .XXX. .X.X. .XXX. .....OutputYES 4 1 4 4 1 4 5 5 5 1 4 5 1 5 4 1 5 5 5 4 1 4 4 1 4Input5 5 ..... .XXX. .XXX. .XXX. .....OutputNOInput3 2 .. .. ..OutputYES 4 1 4 1 1 4Input9 9 ......... .XXXXX.X. .X...X... .X.XXXXX. .X.X.X.X. .X.XXX.X. .X.....X. .XXXXXXX. .........OutputYES 4 4 4 1 4 1 4 1 4 1 5 5 5 5 5 4 10 1 4 5 1 4 1 5 4 4 4 4 5 1 5 5 0 5 5 1 4 5 1 5 4 5 1 5 4 4 5 1 5 5 5 4 5 1 1 5 4 4 1 1 4 5 1 4 5 5 5 5 5 5 5 4 1 1 1 1 4 4 1 1 4NoteIt can be shown that no such grid exists for the second test.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cc72c87e", "template_md5": "35d339e4", "result": "You are given a grid of $n$ rows and $m$ columns. Some cells in the grid are marked with an 'X' and the rest are unmarked with a '.'. No marked cells are on the edge of the grid.\n\nYou need to fill each cell with a number, following these rules:\n\n* Unmarked cells must contain either a 1 or a 4.\n* Marked cells must contain the sum of all the numbers in the unmarked cells directly next to it (including diagonals). If a marked cell has no unmarked neighbors, it must contain 0.\n* Every marked cell must contain a multiple of 5.\n\nDetermine if it is possible to fill the grid according to these rules. If it is possible, output \"YES\" and the filled grid. Otherwise, output \"NO\"."}, {"prompt_md5": "26377696", "template_md5": "465699a0", "result": "Fill a grid with 1s and 4s.  Marked cells must have a value that is a multiple of 5 and equal to the sum of the numbers in the unmarked cells next to it.  If a marked cell has no unmarked neighbors, its value is 0.  Determine if such a grid is possible."}]}