{"uid": "1567-A", "url": "https://codeforces.com/contest/1567/problem/A", "tags": ["implementation", " strings"], "title": "1567-A", "statement": "A. Domino Disastertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice has a grid with $$$2$$$ rows and $$$n$$$ columns. She fully covers the grid using $$$n$$$ dominoes of size $$$1 \\\\times 2$$$ — Alice may place them vertically or horizontally, and each cell should be covered by exactly one domino.Now, she decided to show one row of the grid to Bob. Help Bob and figure out what the other row of the grid looks like!InputThe input consists of multiple test cases. The first line contains an integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 5000$$$) — the number of test cases. The description of the test cases follows.The first line of each test case contains an integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 100$$$) — the width of the grid.The second line of each test case contains a string $$$s$$$ consisting of $$$n$$$ characters, each of which is eitherL,R,U, orD, representing the left, right, top, or bottom half of a domino, respectively (see notes for better understanding). This string represents one of the rows of the grid.Additional constraint on the input:each input corresponds to at least one valid tiling.OutputFor each test case, output one string — the other row of the grid, using the same format as the input string. If there are multiple answers, print any.ExampleInput4 1 U 2 LR 5 LRDLR 6 UUUUUUOutputD LR LRULR DDDDDDNoteIn the first test case, Alice shows Bob thetoprow, the whole grid may look like:In the second test case, Alice shows Bob thebottomrow, the whole grid may look like:In the third test case, Alice shows Bob thebottomrow, the whole grid may look like:In the fourth test case, Alice shows Bob thetoprow, the whole grid may look like:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c9f0da66", "template_md5": "35d339e4", "result": "You are given a grid of size $2 \\times n$.  The grid is completely covered by $n$ dominoes of size $1 \\times 2$. You are shown one row of the grid.  Determine what the other row of the grid looks like.\n\nThe input consists of multiple test cases. Each test case has the following format:\n\n* The first line contains an integer $n$ ($1 \\le n \\le 100$) representing the width of the grid.\n* The second line contains a string of length $n$ where each character is either 'L', 'R', 'U', or 'D'.  These characters represent the left, right, top, or bottom half of a domino, respectively. This string represents one row of the grid.\n\nFor each test case, output a string of length $n$ representing the other row of the grid using the same format as the input."}, {"prompt_md5": "4fed864f", "template_md5": "465699a0", "result": "You are given a string representing half of a grid of dominoes.  The other half of the grid must be reconstructed.  Each domino is 1 unit wide and 2 units tall.  The string uses the letters L, R, U, and D to represent the left, right, top, and bottom half of a domino respectively."}]}