{"uid": "1578-A", "url": "https://codeforces.com/contest/1578/problem/A", "tags": ["constructive algorithms", " graphs", " shortest paths"], "title": "1578-A", "statement": "A. Anti-Tetristime limit per test2 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputLet us consider the game \"Sticky Tetris\". In this game, there is a field of $$$n \\\\times m$$$ squares. Tiles appear on the field and the player can move the tiles.Each tile is a $$$4$$$-connected set of at most $$$7$$$ squares.Each new tile appears in any position that fits inside the field, does not intersect any other tile, and the top cell of the tile is at the top row of the field. The player can move the tile left, right, and down, and at any moment the tile must still entirely fit inside the field and must not intersect other tiles. The player can stop the tile at any position at any time. After that, it cannot be moved. Since this is \"Sticky Tetris,\" the tile will not fall once stopped.You are given a final configuration of a \"Sticky Tetris\" game. You need to restore a sequence of steps that leads to that configuration if it exists.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 50$$$) — the size of the playing field.The next $$$n$$$ lines contain a string of $$$m$$$ characters each. Each character could be either a '.', or lowercase English letter. Connected components of the same letter correspond to a single tile. Each tile consists of at most $$$7$$$ squares.OutputIf there is no solution, print $$$-1$$$.Otherwise, print $$$k$$$ — the number of different tiles that are placed on the field.On the next $$$k$$$ lines print the sequence of steps for each of the tiles in the order they are placed.Each line consists of a number $$$x$$$ followed by a string with steps. $$$x$$$ ($$$1 \\\\le x \\\\le m$$$) is the starting column of the leftmost square in the top row of the tile. The string consists of characters 'L' (for left), 'R' (for right), and 'D' (for down), describing the path of that tile, ending with a single character 'S' (for stop). The final position of the tile determines which tile is being placed. The string with steps can have at most $$$n \\\\cdot m + 1$$$ characters.ExamplesInput3 2 aa ab aaOutput2 2 DS 1 SInput5 6 ....dd .ccccd .cbbdd .aab.a aabbaaOutput5 2 DDDS 4 DDLS 6 DDDS 2 DS 5 SInput5 3 ... aab abb aab .bbOutput-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2d3f4ff9", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$. The grid contains tiles, where each tile is a connected group of at most 7 squares.  \n\nThe tiles are made up of lowercase letters, and each letter represents a unique tile.  \n\nYour task is to determine the order in which the tiles were placed on the grid, given the final arrangement.  \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the dimensions of the grid.\n* The following $n$ lines each contain a string of $m$ characters, representing the grid.\n\n**Output:**\n\n* If there is no valid sequence of tile placements, print \"-1\".\n* Otherwise, print the number of tiles, $k$.\n* For each tile, print a line containing:\n    * An integer $x$ representing the starting column of the tile's leftmost square in the top row.\n    * A string of characters 'L' (left), 'R' (right), 'D' (down), and 'S' (stop) representing the sequence of moves made to place the tile.\n\n**Constraints:**\n\n* $1 \\le n, m \\le 50$\n\n\n\nLet me know if you'd like me to elaborate on any aspect of the problem!"}, {"prompt_md5": "d4b09b4d", "template_md5": "465699a0", "result": "You are given a grid representing a game board.  Some squares are filled with letters, forming connected shapes.  \n\nYour task is to determine the order in which these shapes were placed on the board, and the sequence of moves (left, right, down) made to position each shape. \n\nIf it's impossible to determine the order and moves, output -1."}]}