{"uid": "1578-G", "url": "https://codeforces.com/contest/1578/problem/G", "tags": ["math", " probabilities"], "title": "1578-G", "statement": "G. Game of Chancetime limit per test6 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputThe King wants to marry off his daughter, and he wants her husband to have the greatest innate luckiness possible. To find such a person he decided to hold a heads-or-tails tournament.If person $$$A$$$ withluckiness$$$x$$$ and person $$$B$$$ withluckiness$$$y$$$ play heads-or-tails against each other, person $$$A$$$ wins with probability $$$x/(x+y)$$$.The tournament has several rounds. Each round some participants are split into pairs. Each pair plays against each other, and the loser leaves the tournament.The participants are numbered from $$$1$$$ to $$$n$$$. During the first round, a number $$$k$$$ ($$$1 \\\\le k \\\\le n$$$) is selected such that $$$n-k/2$$$ is a power of $$$2$$$ (such $$$k$$$ always exists and is unique). Only participants numbered from $$$1$$$ to $$$k$$$ take part in the first round. It ensures that in all other rounds the number of participants is the power of $$$2$$$.During other rounds, all the participants who still have not left the tournament take part. If during some round, participants numbered $$$p_1 < \\\\ldots < p_{2m}$$$ take part, then they are split into pairs in the following manner: participant $$$p_{2i-1}$$$ plays against participant $$$p_{2i}$$$ for each $$$i$$$ from $$$1$$$ to $$$m$$$.The rounds are held until only one participant is left. He is declared the winner of the tournament and he will marry the King's daughter. The princess can't wait to find out who is her future husband. She asked every participant to tell her his luckiness. Assuming they did not lie, she wants to know the probability of each participant winning the tournament. As you are the best friend of the princess, she asks you to help her.InputThe first line of the input contains the number of participants, $$$n$$$ ($$$2 \\\\le n \\\\le 3 \\\\cdot 10^5$$$). The second line of the input contains $$$n$$$ integer numbers, $$$a_1, \\\\ldots, a_{n}$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$). The luckiness of the $$$i$$$-th participant equals to $$$a_i$$$.OutputPrint $$$n$$$ numbers $$$p_i$$$. The $$$i$$$-th number should be the probability of the $$$i$$$-th participant winning the tournament. The absolute error of your answer must not exceed $$$10^{-9}$$$.ExampleInput5 1 4 1 1 4Output0.026 0.3584 0.0676 0.0616 0.4864NoteHere is an example of a tournament bracket, showing the winning probability in each pair.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "032db180", "template_md5": "35d339e4", "result": "You are given $n$ integers, $a_1, a_2, ..., a_n$, representing the luckiness of $n$ participants.  \n\nThese participants will compete in a tournament where:\n\n* In each round, participants are paired up.\n* The probability of participant $i$ winning against participant $j$ is $\\frac{a_i}{a_i + a_j}$.\n* The loser of each match is eliminated.\n* The tournament continues until only one participant remains.\n\nYour task is to calculate the probability that each participant will win the tournament. \n\n**Additional Rules:**\n\n* The first round involves $k$ participants, where $n-k/2$ is a power of 2.  \n* In subsequent rounds, the remaining participants are paired up in a similar fashion.\n\n\n\nLet me know if you'd like help with any specific part of the problem or need further clarification!"}, {"prompt_md5": "be6b8411", "template_md5": "465699a0", "result": "You are given a list of numbers representing the \"luckiness\" of  people.  They will compete in a tournament where pairs are randomly matched. The winner of each match advances. The tournament continues until only one person remains.  Calculate the probability that each person will win the tournament."}]}