{"uid": "158-A", "url": "https://codeforces.com/contest/158/problem/A", "tags": ["*special", " implementation"], "title": "158-A", "statement": "A. Next Roundtime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdout\"Contestant who earns a score equal to or greater than thek-th place finisher's score will advance to the next round, as long as the contestant earns a positive score...\" — an excerpt from contest rules.A total ofnparticipants took part in the contest (n≥k), and you already know their scores. Calculate how many participants will advance to the next round.InputThe first line of the input contains two integersnandk(1 ≤k≤n≤ 50) separated by a single space.The second line containsnspace-separated integersa1,a2, ...,an(0 ≤ai≤ 100), whereaiis the score earned by the participant who got thei-th place. The given sequence is non-increasing (that is, for allifrom1ton- 1the following condition is fulfilled:ai≥ai+ 1).OutputOutput the number of participants who advance to the next round.ExamplesInput8 510 9 8 7 7 7 5 5Output6Input4 20 0 0 0Output0NoteIn the first example the participant on the 5th place earned 7 points. As the participant on the 6th place also earned 7 points, there are 6 advancers.In the second example nobody got a positive score.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ed28110a", "template_md5": "35d339e4", "result": "You are given a list of $n$ scores, where $n$ is greater than or equal to $k$. The $k$-th highest score is the cutoff score.  Count how many scores in the list are greater than or equal to the cutoff score. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$.\n* The second line contains $n$ space-separated integers, representing the scores. The scores are listed in non-increasing order (meaning the highest score is first).\n\n**Output:**\n\n* Output a single integer representing the number of scores greater than or equal to the cutoff score."}, {"prompt_md5": "1d178b6e", "template_md5": "465699a0", "result": "You are given a list of scores from a competition.  Find out how many people scored at least as well as the person in the kth place."}]}