{"uid": "1582-A", "url": "https://codeforces.com/contest/1582/problem/A", "tags": ["math"], "title": "1582-A", "statement": "A. Luntik and Concertstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLuntik has decided to try singing. He has $$$a$$$ one-minute songs, $$$b$$$ two-minute songs and $$$c$$$ three-minute songs. He wants to distribute all songs into two concerts such that every song should be included to exactly one concert.He wants to make the absolute difference of durations of the concerts as small as possible. The duration of the concert is the sum of durations of all songs in that concert.Please help Luntik and find the minimal possible difference in minutes between the concerts durations.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.Each test case consists of one line containing three integers $$$a, b, c$$$ $$$(1 \\\\le a, b, c \\\\le 10^9)$$$ — the number of one-minute, two-minute and three-minute songs.OutputFor each test case print the minimal possible difference in minutes between the concerts durations.ExampleInput4 1 1 1 2 1 3 5 5 5 1 1 2Output0 1 0 1NoteIn the first test case, Luntik can include a one-minute song and a two-minute song into the first concert, and a three-minute song into the second concert. Then the difference will be equal to $$$0$$$.In the second test case, Luntik can include two one-minute songs and a two-minute song and a three-minute song into the first concert, and two three-minute songs into the second concert. The duration of the first concert will be $$$1 + 1 + 2 + 3 = 7$$$, the duration of the second concert will be $$$6$$$. The difference of them is $$$|7-6| = 1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2b4ba41c", "template_md5": "35d339e4", "result": "You are given three numbers: $a$, $b$, and $c$. These represent the number of songs that are 1 minute long, 2 minutes long, and 3 minutes long, respectively.\n\nYou need to divide these songs into two groups (concerts) so that:\n\n* Each song is in exactly one group.\n* The difference in total length between the two groups is as small as possible.\n\nFind the smallest possible difference in minutes between the lengths of the two concerts."}, {"prompt_md5": "d5ea0feb", "template_md5": "465699a0", "result": "You have a number of songs that are 1 minute, 2 minutes, and 3 minutes long.  You need to divide the songs into two groups so that each song is in only one group.  Find the smallest possible difference in the total length of the two groups."}]}