{"uid": "1585-G", "url": "https://codeforces.com/contest/1585/problem/G", "tags": ["dp", " games", " graphs", " trees"], "title": "1585-G", "statement": "G. Poacherstime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob are two poachers who cut trees in a forest.A forest is a set of zero or more trees. A tree is a connected graph without cycles. A rooted tree has a special vertex called the root. The parent of a node $$$v$$$ is the next vertex on the shortest path from $$$v$$$ to the root. Children of vertex $$$v$$$ are all nodes for which $$$v$$$ is the parent. A vertex is a leaf if it has no children.In this problem we define thedepthof vertex as number of vertices on the simple path from this vertex to the root. Therankof a tree is the minimum depth among its leaves.Initially there is a forest of rooted trees. Alice and Bob play a game on this forest. They play alternating turns with Alice going first. At the beginning of their turn, the player chooses a tree from the forest. Then the player chooses a positivecutting depth, which shouldnot exceed the rankof the chosen tree. Then the player removes all vertices of that tree whose depth is less that or equal to the cutting depth. All other vertices of the tree form a set of rooted trees with root being the vertex with the smallest depth before the cut. All these trees are included in the game forest and the game continues.A player loses if the forest is empty at the beginning of his move.You are to determine whether Alice wins the game if both players play optimally.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\leq t \\\\leq 5 \\\\cdot 10^5$$$). Description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 5 \\\\cdot 10^5$$$) — total number of vertices in the initial forest.The second line contains $$$n$$$ integers $$$p_1, p_2, \\\\ldots, p_n$$$ ($$$0 \\\\leq p_i \\\\leq n$$$) — description of the forest. If $$$p_i = 0$$$, then the $$$i$$$-th vertex is the root of a tree, otherwise $$$p_i$$$ is the parent of the vertex $$$i$$$. It's guaranteed that $$$p$$$ defines a correct forest of rooted trees.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$5 \\\\cdot 10^5$$$.OutputFor each test case, print \"YES\" (without quotes) if Alice wins, otherwise print \"NO\" (without quotes). You can print each letter in any case (upper or lower).ExampleInput4 4 0 1 0 3 7 0 1 2 0 4 5 6 4 0 1 1 2 7 0 1 1 2 2 3 3OutputNO YES NO YESNoteIn the first test case Bob has a symmetric strategy, so Alice cannot win.In the second test case Alice can choose the second tree and cutting depth $$$1$$$ to get a forest on which she has a symmetric strategy.In third test case the rank of the only tree is $$$2$$$ and both possible moves for Alice result in a loss. Bob either can make the forest with a symmetric strategy for himself, or clear the forest.In the fourth test case all leafs have the same depth, so Alice can clear the forest in one move.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ff2d3e49", "template_md5": "35d339e4", "result": "You are given a forest of rooted trees.  Each tree has a root and a depth for each node, which is the number of edges on the path from the node to the root. The rank of a tree is the minimum depth of its leaves.\n\nTwo players take turns. On their turn, a player chooses a tree and a cutting depth (an integer less than or equal to the tree's rank). They then remove all nodes in the tree with a depth less than or equal to the cutting depth. The remaining nodes form new trees, and the game continues.\n\nA player loses if there are no trees left.\n\nDetermine if Player 1 can always win if both players play optimally.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of nodes, $n$.\n    * The second line contains $n$ integers, $p_1, p_2, ..., p_n$.  $p_i$ is the parent of node $i$ (0 means node $i$ is the root).\n\n**Output:**\n\nFor each test case, print \"YES\" if Player 1 can win, \"NO\" otherwise."}, {"prompt_md5": "c35d30ce", "template_md5": "465699a0", "result": "Two players take turns removing parts of a tree.  Each turn, a player chooses a tree and a depth. They remove all parts of the tree that are at or below that depth. The first player to be unable to make a move loses. Determine if the first player can always win if both players play optimally."}]}