{"uid": "159-B", "url": "https://codeforces.com/contest/159/problem/B", "tags": ["*special", " greedy", " sortings"], "title": "159-B", "statement": "B. Matchmakertime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPolycarpus hasnmarkers andmmarker caps. Each marker is described by two numbers:xiis the color andyiis the diameter. Correspondingly, each cap is described by two numbers:ajis the color andbjis the diameter. Cap(aj,bj)can close marker(xi,yi)only if their diameters match, that is,bj=yi. Besides, a marker is considered to bebeautifully closed, if the cap color and the marker color match, that is,aj=xi.Find the way to close the maximum number of markers. If there are several such ways, then choose the one that has the maximum number ofbeautifully closedmarkers.InputThe first input line contains two space-separated integersnandm(1 ≤n,m≤ 105) — the number of markers and the number of caps, correspondingly.Nextnlines describe the markers. Thei-th line contains two space-separated integersxi,yi(1 ≤xi,yi≤ 1000) — thei-th marker's color and diameter, correspondingly.Nextmlines describe the caps. Thej-th line contains two space-separated integersaj,bj(1 ≤aj,bj≤ 1000) — the color and diameter of thej-th cap, correspondingly.OutputPrint two space-separated integersu,v, whereuis the number of closed markers andvis the number ofbeautifully closedmarkers in the sought optimal way. Remember that you have to find the way to close the maximum number of markers, and if there are several such ways, you should choose the one where the number ofbeautifully closedmarkers is maximum.ExamplesInput3 41 23 42 45 42 41 11 2Output3 2Input2 21 22 13 45 1Output1 0NoteIn the first test sample the first marker should be closed by the fourth cap, the second marker should be closed by the first cap and the third marker should be closed by the second cap. Thus, three markers will be closed, and two of them will bebeautifully closed— the first and the third markers.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "61391665", "template_md5": "35d339e4", "result": "You are given $n$ markers and $m$ caps. Each marker is described by a color ($x_i$) and a diameter ($y_i$). Each cap is described by a color ($a_j$) and a diameter ($b_j$). \n\nA cap can only close a marker if their diameters match ($b_j = y_i$). A marker is considered \"beautifully closed\" if the cap color and marker color match ($a_j = x_i$).\n\nFind the way to close the maximum number of markers. If there are multiple ways to close the maximum number of markers, choose the way that has the maximum number of \"beautifully closed\" markers.\n\nOutput two numbers:\n\n* The number of closed markers.\n* The number of \"beautifully closed\" markers."}, {"prompt_md5": "4e7fb1c6", "template_md5": "465699a0", "result": "You have a set of items (markers) and a set of containers (caps). Each item has a color and a size. Each container has a color and a size.  A container can only be used to close an item if their sizes match.  You want to close as many items as possible, prioritizing closing items with matching colors. How many items can you close, and how many of those will have matching colors?"}]}