{"uid": "1593-D2", "url": "https://codeforces.com/contest/1593/problem/D2", "tags": ["brute force", " math", " number theory"], "title": "1593-D2", "statement": "D2. Half of Sametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis problem is a complicated version of D1, but it has significant differences, so read the whole statement.Polycarp has an array of $$$n$$$ ($$$n$$$ is even) integers $$$a_1, a_2, \\\\dots, a_n$$$. Polycarp conceived of a positive integer $$$k$$$. After that, Polycarp began performing the following operations on the array: take an index $$$i$$$ ($$$1 \\\\le i \\\\le n$$$) and reduce the number $$$a_i$$$ by $$$k$$$.After Polycarp performed some (possibly zero) number of such operations, it turned out thatat least halfof the numbers in the array became the same. Find the maximum $$$k$$$ at which such a situation is possible, or print $$$-1$$$ if such a number can be arbitrarily large.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10$$$) — the number of test cases. Then $$$t$$$ test cases follow.Each test case consists of two lines. The first line contains an even integer $$$n$$$ ($$$4 \\\\le n \\\\le 40$$$) ($$$n$$$ is even). The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots a_n$$$ ($$$-10^6 \\\\le a_i \\\\le 10^6$$$).It is guaranteed that the sum of all $$$n$$$ specified in the given test cases does not exceed $$$100$$$.OutputFor each test case output on a separate line an integer $$$k$$$ ($$$k \\\\ge 1$$$) — the maximum possible number that Polycarp used in operations on the array, or $$$-1$$$, if such a number can be arbitrarily large.ExampleInput4 6 48 13 22 -15 16 35 8 -1 0 1 -1 0 1 -1 0 4 100 -1000 -1000 -1000 4 1 1 1 1Output13 2 -1 -1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8ff4ec67", "template_md5": "35d339e4", "result": "You are given an array of $n$ even integers.  You can repeatedly perform the following operation on the array: choose an index $i$ and decrease the value at that index by a positive integer $k$.\n\nFind the largest possible value of $k$ such that after performing some number of these operations, at least half of the numbers in the array become equal. If there is no limit on how large $k$ can be, output $-1$.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the size of the array, $n$.\n    * The second line contains the $n$ integers in the array.\n\n**Output:**\n\nFor each test case, output the largest possible value of $k$ on a separate line. If there is no limit, output $-1$."}, {"prompt_md5": "b0d218e6", "template_md5": "465699a0", "result": "You are given an array of even length with integers. You can repeatedly decrease any element in the array by a positive integer 'k'. Find the largest 'k' such that after some operations, at least half the elements in the array become equal. If 'k' can be arbitrarily large, output -1."}]}