{"uid": "1594-C", "url": "https://codeforces.com/contest/1594/problem/C", "tags": ["brute force", " greedy", " math", " strings"], "title": "1594-C", "statement": "C. Make Them Equaltime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTheofanis has a string $$$s_1 s_2 \\\\dots s_n$$$ and a character $$$c$$$. He wants to make all characters of the string equal to $$$c$$$ using the minimum number of operations.In one operation he can choose a number $$$x$$$ ($$$1 \\\\le x \\\\le n$$$) andfor every position $$$i$$$, where $$$i$$$ isnotdivisible by $$$x$$$, replace $$$s_i$$$ with $$$c$$$.Find the minimum number of operations required to make all the characters equal to $$$c$$$ and the $$$x$$$-s that he should use in his operations.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains the integer $$$n$$$ ($$$3 \\\\le n \\\\le 3 \\\\cdot 10^5$$$) and a lowercase Latin letter $$$c$$$ — the length of the string $$$s$$$ and the character the resulting string should consist of.The second line of each test case contains a string $$$s$$$ of lowercase Latin letters — the initial string.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$3 \\\\cdot 10^5$$$.OutputFor each test case, firstly print one integer $$$m$$$ — the minimum number of operations required to make all the characters equal to $$$c$$$.Next, print $$$m$$$ integers $$$x_1, x_2, \\\\dots, x_m$$$ ($$$1 \\\\le x_j \\\\le n$$$) — the $$$x$$$-s that should be used in the order they are given.It can be proved that under given constraints, an answer always exists. If there are multiple answers, print any.ExampleInput3 4 a aaaa 4 a baaa 4 b bzyxOutput0 1 2 2  2 3NoteLet's describe what happens in the third test case:$$$x_1 = 2$$$: we choose all positions that are not divisible by $$$2$$$ and replace them, i. e.bzyx$$$\\\\rightarrow$$$bzbx;$$$x_2 = 3$$$: we choose all positions that are not divisible by $$$3$$$ and replace them, i. e.bzbx$$$\\\\rightarrow$$$bbbb.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "48888208", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters and a target letter. You can perform operations to change the string. In one operation, you choose a number $x$ and change all letters at positions that are not divisible by $x$ to the target letter. Find the minimum number of operations needed to make the entire string equal to the target letter, and list the values of $x$ used in each operation. \n\nInput:\n\n* The first line contains the number of test cases $t$.\n* For each test case:\n    * The first line contains the length of the string $n$ and the target letter $c$.\n    * The second line contains the string $s$.\n\nOutput:\n\n* For each test case:\n    * The minimum number of operations $m$.\n    * $m$ integers $x_1, x_2, ..., x_m$."}, {"prompt_md5": "5a4873c1", "template_md5": "465699a0", "result": "You are given a string and a character. You can repeatedly choose a number and change all characters at positions not divisible by that number to the target character. Find the fewest changes needed and the numbers you should choose."}]}