{"uid": "1599-G", "url": "https://codeforces.com/contest/1599/problem/G", "tags": ["brute force", " geometry", " math", " shortest paths"], "title": "1599-G", "statement": "G. Shortest pathtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given $$$N$$$ points on an infinite plane with the Cartesian coordinate system on it. $$$N-1$$$ points lay on one line, and one point isn't on that line. You are on point $$$K$$$ at the start, and the goal is to visit every point. You can move between any two points in a straight line, and you can revisit points. What is the minimum length of the path?InputThe first line contains two integers: $$$N$$$ ($$$3 \\\\leq N \\\\leq 2*10^5$$$) - the number of points, and $$$K$$$ ($$$1 \\\\leq K \\\\leq N$$$) - the index of the starting point.Each of the next $$$N$$$ lines contain two integers, $$$A_i$$$, $$$B_i$$$ ($$$-10^6 \\\\leq A_i, B_i \\\\leq 10^6$$$) - coordinates of the $$$i-th$$$ point.OutputThe output contains one number - the shortest path to visit all given points starting from point $$$K$$$. The absolute difference between your solution and the main solution shouldn't exceed $$$10^-6$$$;ExampleInput5 2 0 0 -1 1 2 -2 0 1 -2 2Output7.478709NoteThe shortest path consists of these moves:2 -> 55 -> 44 -> 11 -> 3There isn't any shorter path possible.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9316c39e", "template_md5": "465699a0", "result": "You have a set of points on a plane.  Most of the points lie on a straight line, but one point is off the line. You start at a specific point and need to visit every point exactly once.  What is the shortest total distance you need to travel to do this?"}, {"prompt_md5": "0287aabc", "template_md5": "35d339e4", "result": "You are given $N$ points on a plane. $N-1$ of these points lie on a straight line, and one point is not on that line. You start at point $K$. You want to visit every point exactly once. You can move between any two points in a straight line, and you can revisit points. What is the shortest total distance you need to travel to visit all the points?\n\nInput:\n\n* The first line contains two integers: $N$ (the number of points) and $K$ (the starting point index).\n* The next $N$ lines each contain two integers, $A_i$ and $B_i$, representing the coordinates of the $i$-th point.\n\nOutput:\n\n* A single number representing the shortest total distance to visit all points."}]}