{"uid": "1599-F", "url": "https://codeforces.com/contest/1599/problem/F", "tags": ["hashing"], "title": "1599-F", "statement": "F. Marstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn the year 2420 humans have finally built a colony on Mars thanks to the work of Elon Tusk. There are $$$10^9+7$$$ cities arranged in a circle in this colony and none of them are connected yet. Elon Tusk wants to connect some of those cities using only roads of the same size in order to lower the production cost of those roads. Because of that he gave a list on N cites where some cites can appear more than once and Q queries that you need to answer. For the query you need to determine if it is possible to connect all the cities from $$$L_{i}$$$ to $$$R_{i}$$$ on that list using only roads of length $$$D_{i}$$$.InputThe first line contains two integers $$$N$$$ and $$$Q$$$ ($$$1 \\\\leq N, Q \\\\leq 2\\\\cdot10^5$$$ ) — the length of the array of cities and the number of queries you need to answer.The second lines contains $$$N$$$ integers representing the array of cites. Next Q lines contain three integers $$$L, R$$$ and $$$D$$$ ($$$1 \\\\leq L_{i}, R_{i} \\\\leq N$$$, $$$0 \\\\leq D_{i} \\\\leq 10^9+6$$$) — the range of cities that needs to be connected and the length of the road that you can use.OutputThe output contains Q lines. If it is possible to connect all the cities from the i-th query can be connected with roads of length $$$D_{i}$$$ the i-th line should contain the word \"Yes\", otherwise it should contain the word \"No\".ExamplesInput9 8 17 0 12 6 10 8 2 4 5 2 3 12 2 3 6 2 4 6 4 6 2 2 8 2 1 2 17 1 8 2 9 9 14OutputYes No Yes Yes Yes Yes No YesInput4 1 7 21 14 0 1 4 1000000000OutputYesNoteIn the $$$5^{th}$$$ query of the first test case we can connect cities in this order 0-2-4-6-8-10-12 this way distance between any two connected cities is 2. In the second test case we can connect cities in this order 21-14-7-0 this way distance between any two connected cities is $$$10^9$$$ module $$$10^9+7$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "053a4d8b", "template_md5": "35d339e4", "result": "You are given an array of $N$ cities.  You need to answer $Q$ queries. Each query consists of three integers: $L$, $R$, and $D$.  For each query, determine if it is possible to connect all the cities from index $L$ to $R$ (inclusive) in the array using roads of length $D$.  \n\n**Input:**\n\n* The first line contains two integers $N$ and $Q$ ($1 \\leq N, Q \\leq 2 \\cdot 10^5$) representing the number of cities and the number of queries.\n* The second line contains $N$ integers representing the array of cities.\n* Each of the next $Q$ lines contains three integers $L$, $R$, and $D$ ($1 \\leq L_i, R_i \\leq N$, $0 \\leq D_i \\leq 10^9 + 6$) representing the range of cities and the road length for the query.\n\n**Output:**\n\n* For each query, print \"Yes\" if it is possible to connect the cities, and \"No\" otherwise."}, {"prompt_md5": "ae135e5c", "template_md5": "465699a0", "result": "You are given a list of cities and a set of queries. Each query asks if you can connect a range of cities using roads of a specific length.  You need to determine if this is possible for each query."}]}