{"uid": "1599-A", "url": "https://codeforces.com/contest/1599/problem/A", "tags": ["constructive algorithms", " greedy", " two pointers"], "title": "1599-A", "statement": "A. Weightstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array $$$A$$$ of length $$$N$$$ weights of masses $$$A_1$$$, $$$A_2$$$...$$$A_N$$$. No two weights have the same mass. You can put every weight on one side of the balance (left or right). You don't have to put weights in order $$$A_1$$$,...,$$$A_N$$$. There is also a string $$$S$$$ consisting of characters \"L\" and \"R\", meaning that after putting the $$$i-th$$$ weight (not $$$A_i$$$, but $$$i-th$$$ weight of your choice) left or right side of the balance should be heavier. Find the order of putting the weights on the balance such that rules of string $$$S$$$ are satisfied.InputThe first line contains one integer $$$N$$$ ($$$1 \\\\leq N \\\\leq 2*10^5$$$) - the length of the array $$$A$$$ The second line contains $$$N$$$ distinct integers: $$$A_1$$$, $$$A_2$$$,...,$$$A_N$$$ ($$$1 \\\\leq A_i \\\\leq 10^9$$$) - the weights given The third line contains string $$$S$$$ of length $$$N$$$ consisting only of letters \"L\" and \"R\" - string determining which side of the balance should be heavier after putting the $$$i-th$$$ weight of your choiceOutputThe output contains $$$N$$$ lines. In every line, you should print one integer and one letter - integer representing the weight you are putting on the balance in that move and the letter representing the side of the balance where you are putting the weight. If there is no solution, print $$$-1$$$.ExampleInput5 3 8 2 13 7 LLRLLOutput3 L 2 R 8 R 13 L 7 LNoteExplanation for the test case:after the 1st weight: 3 L (left side is heavier)after the 2nd weight: 2 R (left side is heavier)after the 3rd weight: 8 R (right side is heavier)after the 4th weight: 13 L (left side is heavier)after the 5th weight: 7 L (left side is heavier)So, the rules given by string $$$S$$$ are fulfilled and our order of putting the weights is correct.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d3169f2e", "template_md5": "35d339e4", "result": "You are given an array of $N$ distinct positive integers, representing the weights of $N$ objects. You need to arrange these weights on a balance scale in a specific order, following a given string $S$ of length $N$. \n\nThe string $S$ contains characters \"L\" and \"R\", where:\n\n* \"L\" indicates that the left side of the balance should be heavier after placing the corresponding weight.\n* \"R\" indicates that the right side of the balance should be heavier after placing the corresponding weight.\n\nFind a valid order to place the weights on the balance that satisfies the rules defined by the string $S$. If no such order exists, output -1."}, {"prompt_md5": "2f87fcde", "template_md5": "465699a0", "result": "You are given a list of distinct weights and a string of \"L\"s and \"R\"s.  Each \"L\" means the left side of a balance scale should be heavier, and each \"R\" means the right side should be heavier.  \n\nYou need to figure out the order to place the weights on the scale to satisfy the string's instructions. If it's impossible, say so."}]}