{"uid": "1599-D", "url": "https://codeforces.com/contest/1599/problem/D", "tags": [], "title": "1599-D", "statement": "D. Bubble Poppingtime limit per test2.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$N$$$ bubbles in a coordinate plane. Bubbles are so tiny that it can be assumed that each bubble is a point $$$(X_i, Y_i)$$$.$$$Q$$$ Bubble Cup finalists plan to play with the bubbles. Each finalist would link to use infinitely long Bubble Cup stick to pop some bubbles. The $$$i$$$-th finalist would like to place the stick in the direction of vector $$$(dxi, dyi)$$$, and plays the following game until $$$K_i$$$ bubbles are popped. The game starts with finalist placing the stick in the direction of vector $$$(dx_i, dy_i)$$$, and sweeping it from the infinity to the left until it hits some bubble, which is immediately popped. It is guaranteed that only one bubble will be hit in this step. After that the finalist starts rotating the stick in the counter clockwise direction with the center of rotation in point where the previous bubble was popped. When the next bubble is hit, it is immediately popped and becomes the new center of rotation. The process continues until $$$K_i$$$ bubbles have been popped. It is guaranteed that the stick won't hit two bubbles simultaneously in this process.For each finalist find which bubble would be popped the last. Note that each game starts with the configuration of all $$$N$$$ bubbles, so the games don't depend on the previous games.InputThe first line contains one integer $$$N$$$ — the number of bubbles. ($$$1 \\\\leq N \\\\leq 10^5$$$)Each of the next $$$N$$$ lines contains two integers. The $$$i$$$-th line contains integers $$$X_i$$$ and $$$Y_i$$$ — the coordinates of the $$$i$$$-th bubble. ($$$-10^9 \\\\leq X_i, Y_i \\\\leq 10^9$$$, $$$(X_i, Y_i) \\\\neq (X_j, Y_j)$$$ for $$$i \\\\neq j$$$)The next line contains one integer $$$Q$$$ — the number of finalists willing to play with the bubbles. ($$$1 \\\\leq Q \\\\leq 10^5$$$)Each of the next Q lines contains 3 integers. The $$$i$$$-th line contains integers $$$dx_i$$$, $$$dy_i$$$ and $$$K_i$$$. ($$$-10^9 \\\\leq dx_i, dy_i \\\\leq 10^9$$$, $$$1 \\\\leq K_i \\\\leq N$$$)OutputFor each of the $$$Q$$$ finalists, print the index of the bubble which would be popped last, in the separate line.ExamplesInput4 0 0 1 0 0 1 1 1 2 1 -1 3 -1 1 4Output4 2Input4 1 1 2 2 7 1 1 7 3 2 2 1 1 -5 4 -6 5 3Output3 2 3NoteThere are two finalists willing to play with the bubbles. If the first finalist plays with the bubbles, then the bubbles at coordinates (0, 0), (1, 0) and (1, 1) would be popped in that order. Their indexes are 1, 2 and 4, so the answer is 4. If the second finalist plays with the bubbles, then the bubbles at coordinates (1, 1), (0, 1), (0, 0) and (1, 0) would be popped in that order, so the answer is 2.Visualization:link.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c3d30302", "template_md5": "35d339e4", "result": "There are $N$ bubbles, each located at a point $(X_i, Y_i)$ in a coordinate plane.  $Q$ players want to pop bubbles. Each player has a stick that can be rotated and moves in a straight line.\n\nHere's how each player plays:\n\n1. **Start:** The player starts with the stick pointing in a direction $(dx_i, dy_i)$.\n2. **Sweep:** The player moves the stick horizontally (leftward) until it hits a bubble. The hit bubble is popped.\n3. **Rotate:** The player rotates the stick counter-clockwise around the point where the last bubble was popped.\n4. **Repeat:** The player continues sweeping and rotating until they have popped $K_i$ bubbles.\n\nFor each player, determine the index of the last bubble they pop. \n\n\n\n**Input:**\n\n* The first line contains $N$ (the number of bubbles).\n* The next $N$ lines each contain two integers, $X_i$ and $Y_i$, the coordinates of each bubble.\n* The next line contains $Q$ (the number of players).\n* Each of the next $Q$ lines contains three integers: $dx_i$, $dy_i$, and $K_i$ (the direction and number of bubbles the player wants to pop).\n\n**Output:**\n\nFor each player, print the index of the last bubble they pop."}, {"prompt_md5": "1e9d2804", "template_md5": "465699a0", "result": "You have a set of points on a plane. Each player wants to pop a certain number of points using a stick that rotates around the last popped point.  Find the last point each player will pop."}]}