{"uid": "16-A", "url": "https://codeforces.com/contest/16/problem/A", "tags": ["implementation"], "title": "16-A", "statement": "A. Flagtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutAccording to a new ISO standard, a flag of every country should have a chequered fieldn×m, each square should be of one of 10 colours, and the flag should be «striped»: each horizontal row of the flag should contain squares of the same colour, and the colours of adjacent horizontal rows should be different. Berland's government asked you to find out whether their flag meets the new ISO standard.InputThe first line of the input contains numbersnandm(1 ≤n,m≤ 100),n— the amount of rows,m— the amount of columns on the flag of Berland. Then there follows the description of the flag: each of the followingnlines containmcharacters. Each character is a digit between0and9, and stands for the colour of the corresponding square.OutputOutputYES, if the flag meets the new ISO standard, andNOotherwise.ExamplesInput3 3000111222OutputYESInput3 3000000111OutputNOInput3 3000111002OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ee0fcbca", "template_md5": "35d339e4", "result": "You are given a flag represented as a grid of $n \\times m$ squares. Each square is colored with a number from 0 to 9.  \n\nThe flag must follow these rules:\n\n* Each row must have the same color.\n* Adjacent rows must have different colors.\n\nDetermine if the given flag follows these rules. \n\n**Input:**\n\n* Two integers, $n$ and $m$, representing the number of rows and columns of the flag.\n* $n$ lines, each containing $m$ digits from 0 to 9, representing the colors of the squares.\n\n**Output:**\n\n* \"YES\" if the flag follows the rules, \"NO\" otherwise."}, {"prompt_md5": "7a52abe2", "template_md5": "465699a0", "result": "A flag is described by a grid of numbers. Each number represents a color.  The flag must follow these rules:\n\n* Each row must have the same color.\n* Each row must have a different color than the row above and below it.\n\nDetermine if the given flag follows these rules."}]}