{"uid": "1600-J", "url": "https://codeforces.com/contest/1600/problem/J", "tags": ["bitmasks", " dfs and similar"], "title": "1600-J", "statement": "J. Robot Factorytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have received data from a Bubble bot. You know your task is to make factory facilities, but before you even start, you need to know how big the factory is and how many rooms it has. When you look at the data you see that you have the dimensions of the construction, which is in rectangle shape: N x M.Then in the next N lines you have M numbers. These numbers represent factory tiles and they can go from 0 to 15. Each of these numbers should be looked in its binary form. Because from each number you know on which side the tile has walls. For example number 10 in it's binary form is 1010, which means that it has a wall from theNorthside, it doesn't have a wall from theEast, it has a wall on theSouthside and it doesn't have a wall on theWestside. So it goes North, East, South, West.It is guaranteed that the construction always has walls on it's edges. The input will be correct.Your task is to print the size of the rooms from biggest to smallest.InputThe first line has two numbers which are N and M, the size of the construction. Both are integers:$$$n$$$ ($$$1 \\\\leq n \\\\leq 10^3$$$)$$$m$$$ ($$$1 \\\\leq m \\\\leq 10^3$$$)Next N x M numbers represent each tile of construction.OutputOnce you finish processing the data your output consists of one line sorted frombiggesttosmallestroom sizes.ExampleInput4 5 9 14 11 12 13 5 15 11 6 7 5 9 14 9 14 3 2 14 3 14Output9 4 4 2 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "495ff7b1", "template_md5": "465699a0", "result": "You are given a rectangular grid of numbers. Each number represents a tile, and its binary form indicates which sides of the tile have walls.  Your task is to determine the size of each room in the grid, sorted from largest to smallest."}, {"prompt_md5": "37cbdb3f", "template_md5": "35d339e4", "result": "You are given the dimensions of a rectangular building ($N x M$).  Each cell in the building is represented by a number from 0 to 15.  The binary representation of this number tells you which walls are present on each side of the cell:\n\n* **0:** No wall\n* **1:** Wall\n\nThe binary representation is read as North, East, South, West. For example, the number 10 in binary is 1010, meaning there is a wall on the North and South sides, but not on the East or West sides.\n\nThe building always has walls on its edges.\n\nYour task is to determine the size of each room in the building and output the sizes from largest to smallest."}]}