{"uid": "1607-G", "url": "https://codeforces.com/contest/1607/problem/G", "tags": ["greedy"], "title": "1607-G", "statement": "G. Banquet Preparations 1time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA known chef has prepared $$$n$$$ dishes: the $$$i$$$-th dish consists of $$$a_i$$$ grams of fish and $$$b_i$$$ grams of meat.The banquet organizers estimate thebalanceof $$$n$$$ dishes as follows. Thebalanceis equal to the absolute value of the difference between the total mass of fish and the total mass of meat.Technically, thebalanceequals to $$$\\\\left|\\\\sum\\\\limits_{i=1}^n a_i - \\\\sum\\\\limits_{i=1}^n b_i\\\\right|$$$. The smaller thebalance, the better.In order to improve thebalance, a taster was invited. He will eatexactly$$$m$$$ grams of food from each dish. For each dish, the taster determines separately how much fish and how much meat he will eat. The only condition is that he should eat exactly $$$m$$$ grams of each dish in total.Determine how much of what type of food the taster should eat from each dish so that the value of thebalanceis as minimal as possible. If there are several correct answers, you may choose any of them.InputThe first line of input data contains an integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) — the number of the test cases.Each test case's description is preceded by a blank line. Next comes a line that contains integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n \\\\leq 2 \\\\cdot 10^5$$$; $$$0 \\\\leq m \\\\leq 10^6$$$). The next $$$n$$$ lines describe dishes, the $$$i$$$-th of them contains a pair of integers $$$a_i$$$ and $$$b_i$$$ ($$$0 \\\\leq a_i, b_i \\\\le 10^6$$$) — the masses of fish and meat in the $$$i$$$-th dish.It is guaranteed that it is possible to eat $$$m$$$ grams of food from each dish. In other words, $$$m \\\\leq a_i+b_i$$$ for all $$$i$$$ from $$$1$$$ to $$$n$$$ inclusive.The sum of all $$$n$$$ values over all test cases in the test does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, print on the first line the minimal balance value that can be achieved by eating exactly $$$m$$$ grams of food from each dish.Then print $$$n$$$ lines that describe a way to do this: the $$$i$$$-th line should contain two integers $$$x_i$$$ and $$$y_i$$$ ($$$0 \\\\leq x_i \\\\leq a_i$$$; $$$0 \\\\leq y_i \\\\leq b_i$$$; $$$x_i+y_i=m$$$), where $$$x_i$$$ is how many grams of fish taster should eat from the $$$i$$$-th meal and $$$y_i$$$ is how many grams of meat.If there are several ways to achieve a minimal balance, find any of them.ExampleInput8  1 5 3 4  1 6 3 4  2 2 1 3 4 2  2 4 1 3 1 7  3 6 1 7 1 8 1 9  3 6 1 8 1 9 30 10  3 4 3 1 3 2 4 1  5 4 0 7 6 4 0 8 4 1 5 3Output0 2 3 1 3 3 0 1 1 1 1 2 1 3 0 4 3 0 6 0 6 0 6 7 1 5 1 5 6 0 0 3 1 3 1 3 1 0 0 4 2 2 0 4 3 1 1 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "61fcee08", "template_md5": "35d339e4", "result": "You are given $n$ dishes, where the $i$-th dish has $a_i$ grams of fish and $b_i$ grams of meat.  \n\nYou want to minimize the balance, which is defined as the absolute difference between the total mass of fish and the total mass of meat.\n\nA taster will eat $m$ grams from each dish. The taster can choose how many grams of fish and meat to eat from each dish, as long as the total is $m$ grams.\n\nFind the amount of fish and meat the taster should eat from each dish to minimize the balance. If there are multiple solutions, any one will do.\n\n**Input:**\n\n* The first line contains an integer $t$ representing the number of test cases.\n* Each test case is followed by a blank line.\n* The first line of each test case contains two integers $n$ and $m$ ($1 \\le n \\le 2 \\cdot 10^5$, $0 \\le m \\le 10^6$).\n* The next $n$ lines describe the dishes, with the $i$-th line containing two integers $a_i$ and $b_i$ ($0 \\le a_i, b_i \\le 10^6$) representing the amount of fish and meat in the $i$-th dish.\n\n**Output:**\n\n* For each test case, print the minimum balance that can be achieved.\n* Print $n$ lines, where the $i$-th line contains two integers $x_i$ and $y_i$ ($0 \\le x_i \\le a_i$, $0 \\le y_i \\le b_i$, $x_i + y_i = m$) representing the amount of fish and meat the taster should eat from the $i$-th dish."}, {"prompt_md5": "7adf5bde", "template_md5": "465699a0", "result": "You are given a list of dishes, each containing a certain amount of fish and meat. You need to determine how much fish and meat to eat from each dish to minimize the difference between the total amount of fish and meat consumed.  You must eat a fixed amount from each dish."}]}