{"uid": "1608-E", "url": "https://codeforces.com/contest/1608/problem/E", "tags": ["binary search", " implementation", " sortings"], "title": "1608-E", "statement": "E. The Cells on the Papertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn an endless checkered sheet of paper, $$$n$$$ cells are chosen and colored in three colors, where $$$n$$$ is divisible by $$$3$$$. It turns out that there are exactly $$$\\\\frac{n}{3}$$$ marked cells of each of three colors!Find the largest such $$$k$$$ that it's possible to choose $$$\\\\frac{k}{3}$$$ cells of each color, remove all other marked cells, and then select three rectangles with sides parallel to the grid lines so that the following conditions hold:No two rectangles can intersect (but they can share a part of the boundary). In other words, the area of intersection of any two of these rectangles must be $$$0$$$.The $$$i$$$-th rectangle contains all the chosen cells of the $$$i$$$-th color and no chosen cells of other colors, for $$$i = 1, 2, 3$$$.InputThe first line of the input contains a single integer $$$n$$$ — the number of the marked cells ($$$3 \\\\leq n \\\\le 10^5$$$, $$$n$$$ is divisible by 3).The $$$i$$$-th of the following $$$n$$$ lines contains three integers $$$x_i$$$, $$$y_i$$$, $$$c_i$$$ ($$$|x_i|,|y_i| \\\\leq 10^9$$$; $$$1 \\\\leq c_i \\\\leq 3$$$), where $$$(x_i, y_i)$$$ are the coordinates of the $$$i$$$-th marked cell and $$$c_i$$$ is its color.It's guaranteed that all cells $$$(x_i, y_i)$$$ in the input are distinct, and that there are exactly $$$\\\\frac{n}{3}$$$ cells of each color.OutputOutput a single integer $$$k$$$ — the largest number of cells you can leave.ExamplesInput9 2 3 1 4 1 2 2 1 3 3 4 1 5 3 2 4 4 3 2 4 1 5 2 2 3 5 3Output6Input3 1 1 1 2 2 2 3 3 3Output3NoteIn the first sample, it's possible to leave $$$6$$$ cells with indexes $$$1, 5, 6, 7, 8, 9$$$.In the second sample, it's possible to leave $$$3$$$ cells with indexes $$$1, 2, 3$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9ed0e036", "template_md5": "35d339e4", "result": "You have a grid of cells, and  $n$ cells are marked with one of three colors.  $n$ is divisible by 3, and there are $\\frac{n}{3}$ cells of each color.\n\nYou want to find the largest number of cells, $k$, that you can remove, such that:\n\n*  There are $\\frac{k}{3}$ cells of each color left.\n* You can divide the remaining cells into three groups, where each group forms a rectangle with sides parallel to the grid lines.\n* No two rectangles overlap.\n\n\n\nThe input will give you the coordinates and colors of the marked cells.  Output the largest possible value of $k$."}, {"prompt_md5": "e3ae325f", "template_md5": "465699a0", "result": "You have a grid of cells, some of which are colored.  There are an equal number of each color.  You need to find the largest number of cells you can remove so that you can divide the remaining cells into three groups, each forming a rectangle with no overlap."}]}