{"uid": "1609-D", "url": "https://codeforces.com/contest/1609/problem/D", "tags": ["dsu", " graphs", " greedy", " implementation", " trees"], "title": "1609-D", "statement": "D. Social Networktime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWilliam arrived at a conference dedicated to cryptocurrencies. Networking, meeting new people, and using friends' connections are essential to stay up to date with the latest news from the world of cryptocurrencies.The conference has $$$n$$$ participants, who are initially unfamiliar with each other. William can introduce any two people, $$$a$$$ and $$$b$$$, who were not familiar before, to each other.William has $$$d$$$ conditions, $$$i$$$'th of which requires person $$$x_i$$$ to have a connection to person $$$y_i$$$. Formally, two people $$$x$$$ and $$$y$$$ have a connection if there is such a chain $$$p_1=x, p_2, p_3, \\\\dots, p_k=y$$$ for which for all $$$i$$$ from $$$1$$$ to $$$k - 1$$$ it's true that two people with numbers $$$p_i$$$ and $$$p_{i + 1}$$$ know each other.For every $$$i$$$ ($$$1 \\\\le i \\\\le d$$$) William wants you to calculate the maximal number of acquaintances one person can have, assuming that William satisfied all conditions from $$$1$$$ and up to and including $$$i$$$ and performedexactly$$$i$$$ introductions. The conditions are being checked after William performed $$$i$$$ introductions. The answer for each $$$i$$$ must be calculated independently. It means that when you compute an answer for $$$i$$$, you should assume that no two people have been introduced to each other yet.InputThe first line contains two integers $$$n$$$ and $$$d$$$ ($$$2 \\\\le n \\\\le 10^3, 1 \\\\le d \\\\le n - 1$$$), the number of people, and number of conditions, respectively.Each of the next $$$d$$$ lines each contain two integers $$$x_i$$$ and $$$y_i$$$ ($$$1 \\\\le x_i, y_i \\\\le n, x_i \\\\neq y_i$$$), the numbers of people which must have a connection according to condition $$$i$$$.OutputOutput $$$d$$$ integers. $$$i$$$th number must equal the number of acquaintances the person with the maximal possible acquaintances will have, if William performed $$$i$$$ introductions and satisfied the first $$$i$$$ conditions.ExamplesInput7 6 1 2 3 4 2 4 7 6 6 5 1 7Output1 1 3 3 3 6Input10 8 1 2 2 3 3 4 1 4 6 7 8 9 8 10 1 4Output1 2 3 4 5 5 6 8NoteThe explanation for the first test case:In this explanation, the circles and the numbers in them denote a person with the corresponding number. The line denotes that William introduced two connected people. The person marked with red has the most acquaintances. These are not the only correct ways to introduce people.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "092f21c5", "template_md5": "35d339e4", "result": "There are $n$ people at a conference.  You are given $d$ conditions, where the $i$th condition requires that person $x_i$ be connected to person $y_i$. Two people are connected if there is a path between them where each person in the path knows the next person.\n\nYou can introduce any two unconnected people to each other.  For each $i$ from 1 to $d$, determine the maximum number of acquaintances a single person can have after you have introduced people to satisfy the first $i$ conditions.  \n\n**Input:**\n\n* The first line contains two integers $n$ and $d$ ($2 \\le n \\le 10^3$, $1 \\le d \\le n-1$).\n* Each of the next $d$ lines contains two integers $x_i$ and $y_i$ ($1 \\le x_i, y_i \\le n$, $x_i \\neq y_i$).\n\n**Output:**\n\nOutput $d$ integers. The $i$th integer is the maximum number of acquaintances a person can have after satisfying the first $i$ conditions."}, {"prompt_md5": "0fdd2d76", "template_md5": "465699a0", "result": "You are given a number of people and a set of rules that require certain pairs of people to be connected. You can introduce pairs of people who don't know each other.  For each rule, find the maximum number of acquaintances a single person can have after following all the rules up to that point."}]}