{"uid": "1609-F", "url": "https://codeforces.com/contest/1609/problem/F", "tags": ["data structures", " divide and conquer", " meet-in-the-middle", " two pointers"], "title": "1609-F", "statement": "F. Interesting Sectionstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWilliam has an array of non-negative numbers $$$a_1, a_2, \\\\dots, a_n$$$. He wants you to find out how many segments $$$l \\\\le r$$$ pass the check. The check is performed in the following manner:The minimum and maximum numbers are found on the segment of the array starting at $$$l$$$ and ending at $$$r$$$.The check is considered to be passed if the binary representation of the minimum and maximum numbers have the same number of bits equal to 1.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^6$$$), the size of array $$$a$$$.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$0 \\\\le a_i \\\\le 10^{18}$$$), the contents of array $$$a$$$.OutputOutput a single number  — the total number of segments that passed the check.ExamplesInput5 1 2 3 4 5Output9Input10 0 5 7 3 9 10 1 6 13 7Output18", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1b5bc285", "template_md5": "35d339e4", "result": "You are given an array of non-negative integers.  You need to find the number of subarrays (segments) within the array that satisfy the following condition:\n\n* The minimum and maximum values within the subarray have the same number of '1' bits in their binary representation.\n\n**Input:**\n\n* The first line contains an integer  $n$ ($1 \\le n \\le 10^6$), the size of the array.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 \\le a_i \\le 10^{18}$), the elements of the array.\n\n**Output:**\n\n* Output a single integer, the total number of subarrays that pass the check."}, {"prompt_md5": "ff554151", "template_md5": "465699a0", "result": "You are given a list of numbers.  Count how many pairs of positions in the list satisfy this condition: the smallest number between those positions and the largest number between those positions have the same number of 1 bits in their binary representation."}]}