{"uid": "161-E", "url": "https://codeforces.com/contest/161/problem/E", "tags": ["brute force", " dp"], "title": "161-E", "statement": "E. Polycarpus the Safecrackertime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPolycarpus hastsafes. The password for each safe is a square matrix consisting of decimal digits '0' ... '9' (the sizes of passwords to the safes may vary). Alas, Polycarpus has forgotten all passwords, so now he has to restore them.Polycarpus enjoys prime numbers, so when he chose the matrix passwords, he wrote a prime number in each row of each matrix. To his surprise, he found that all the matrices turned out to be symmetrical (that is, they remain the same after transposition). Now, years later, Polycarp was irritated to find out that he remembers only the prime numberspi, written in the first lines of the password matrices.For each safe find the number of matrices which can be passwords to it.The number of digits inpidetermines the number of rows and columns of thei-th matrix. One prime number can occur in several rows of the password matrix or in several matrices. The prime numbers that are written not in the first row of the matrix may have leading zeros.InputThe first line of the input contains an integert(1 ≤t≤ 30) — the number of safes. Nexttlines contain integerspi(10 ≤pi≤ 99999),piis a prime number written in the first row of the password matrix for thei-th safe. Allpi's are written without leading zeros.OutputPrinttnumbers, thei-th of them should be the number of matrices that can be a password to thei-th safe. Print the numbers on separate lines.ExamplesInput4112394019001Output428612834NoteHere is a possible password matrix for the second safe:239307977Here is a possible password matrix for the fourth safe:9001000200021223", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "37428a46", "template_md5": "35d339e4", "result": "You are given a list of prime numbers. Each prime number represents the first element in the top row of a square matrix.  The matrices are symmetrical (meaning they are the same when flipped diagonally).  \n\nYour task is to determine for each prime number, how many different square matrices could have that prime number as the first element in the top row. \n\n**Input:**\n\n* The first line contains an integer *t* (1 ≤ *t* ≤ 30) representing the number of safes.\n* The next *t* lines each contain a prime number *pi* (10 ≤ *pi* ≤ 99999).\n\n**Output:**\n\n* Print *t* numbers, one for each safe. Each number represents the count of possible matrices for that safe."}, {"prompt_md5": "0a0287c5", "template_md5": "465699a0", "result": "You are given a list of prime numbers. Each prime number represents the first row of a square matrix.  The matrices are symmetrical (read the same upside down).  Find how many different matrices can be formed for each prime number."}]}