{"uid": "1611-B", "url": "https://codeforces.com/contest/1611/problem/B", "tags": ["binary search", " constructive algorithms", " math"], "title": "1611-B", "statement": "B. Team Composition: Programmers and Mathematicianstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe All-Berland Team Programming Contest will take place very soon. This year, teams of four are allowed to participate.There are $$$a$$$ programmers and $$$b$$$ mathematicians at Berland State University. How many maximum teams can be made if:each team must consist of exactly $$$4$$$ students,teams of $$$4$$$ mathematicians or $$$4$$$ programmers are unlikely to perform well, so the decision was made not to compose such teams.Thus, each team must have at least one programmerandat least one mathematician.Print the required maximum number of teams. Each person can be a member of no more than one team.InputThe first line contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) —the number of test cases.This is followed by descriptions of $$$t$$$ sets, one per line. Each set is given by two integers $$$a$$$ and $$$b$$$ ($$$0 \\\\le a,b \\\\le 10^9$$$).OutputPrint $$$t$$$ lines. Each line must contain the answer to the corresponding set of input data — the required maximum number of teams.ExampleInput6 5 5 10 1 2 3 0 0 17 2 1000000000 1000000000Output2 1 1 0 2 500000000NoteIn the first test case of the example, two teams can be composed. One way to compose two teams is to compose two teams of $$$2$$$ programmers and $$$2$$$ mathematicians.In the second test case of the example, only one team can be composed: $$$3$$$ programmers and $$$1$$$ mathematician in the team.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aed4dd64", "template_md5": "35d339e4", "result": "You are given two numbers,  $a$ and $b$, representing the number of programmers and mathematicians, respectively.  \n\nYou need to find the maximum number of teams that can be formed, given the following rules:\n\n* Each team must have exactly 4 students.\n* Each team must have at least one programmer and at least one mathematician.\n* Teams of 4 programmers or 4 mathematicians are not allowed. \n\nOutput the maximum number of teams possible."}, {"prompt_md5": "28fca335", "template_md5": "465699a0", "result": "You have a number of programmers and a number of mathematicians.  You need to form teams of 4 people, with at least one programmer and at least one mathematician on each team.  No team can be made up entirely of programmers or entirely of mathematicians.  What is the maximum number of teams you can form?"}]}