{"uid": "1615-B", "url": "https://codeforces.com/contest/1615/problem/B", "tags": ["bitmasks", " greedy", " math"], "title": "1615-B", "statement": "B. And It's Non-Zerotime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array consisting of all integers from $$$[l, r]$$$ inclusive. For example, if $$$l = 2$$$ and $$$r = 5$$$, the array would be $$$[2, 3, 4, 5]$$$. What's the minimum number of elements you can delete to make thebitwise ANDof the array non-zero?Abitwise ANDis a binary operation that takes two equal-length binary representations and performs theANDoperation on each pair of the corresponding bits.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) — the number of test cases. Then $$$t$$$ cases follow.The first line of each test case contains two integers $$$l$$$ and $$$r$$$ ($$$1 \\\\leq l \\\\leq r \\\\leq 2 \\\\cdot 10^5$$$) — the description of the array.OutputFor each test case, output a single integer — the answer to the problem.ExampleInput5 1 2 2 8 4 5 1 5 100000 200000Output1 3 0 2 31072NoteIn the first test case, the array is $$$[1, 2]$$$. Currently, thebitwise ANDis $$$0$$$, as $$$1\\\\ \\\\& \\\\ 2 = 0$$$. However, after deleting $$$1$$$ (or $$$2$$$), the array becomes $$$[2]$$$ (or $$$[1]$$$), and thebitwise ANDbecomes $$$2$$$ (or $$$1$$$). This can be proven to be the optimal, so the answer is $$$1$$$.In the second test case, the array is $$$[2, 3, 4, 5, 6, 7, 8]$$$. Currently, thebitwise ANDis $$$0$$$. However, after deleting $$$4$$$, $$$5$$$, and $$$8$$$, the array becomes $$$[2, 3, 6, 7]$$$, and thebitwise ANDbecomes $$$2$$$. This can be proven to be the optimal, so the answer is $$$3$$$. Note that there may be other ways to delete $$$3$$$ elements.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0e5be0b7", "template_md5": "465699a0", "result": "You are given a list of consecutive numbers.  Find the fewest numbers you need to remove so that the result of performing a special operation on the remaining numbers is not zero. The special operation combines pairs of corresponding digits in each number and performs a bitwise AND on them."}, {"prompt_md5": "99ace182", "template_md5": "35d339e4", "result": "You are given an array of consecutive integers from $l$ to $r$ inclusive.  Find the minimum number of elements you need to delete from the array so that the bitwise AND of the remaining elements is not zero.\n\nThe bitwise AND of two numbers is calculated by performing a bitwise AND operation on each pair of corresponding bits. For example, the bitwise AND of 5 ($101$ in binary) and 3 ($011$ in binary) is 1 ($001$ in binary). \n\n\nInput:\n\nThe first line contains the number of test cases, $t$. \nEach test case contains two integers, $l$ and $r$, representing the start and end of the array.\n\nOutput:\n\nFor each test case, output the minimum number of elements to delete to make the bitwise AND of the remaining elements non-zero."}]}