{"uid": "1616-A", "url": "https://codeforces.com/contest/1616/problem/A", "tags": ["implementation"], "title": "1616-A", "statement": "A. Integer Diversitytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$. You choose any subset of the given numbers (possibly, none or all numbers) and negate these numbers (i. e. change $$$x \\\\to (-x)$$$). What is the maximum number of different values in the array you can achieve?InputThe first line of input contains one integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$): the number of test cases.The next lines contain the description of the $$$t$$$ test cases, two lines per a test case.In the first line you are given one integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 100$$$): the number of integers in the array.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$-100 \\\\leq a_i \\\\leq 100$$$).OutputFor each test case, print one integer: the maximum number of different elements in the array that you can achieve negating numbers in the array.ExampleInput3 4 1 1 2 2 3 1 2 3 2 0 0Output4 3 1NoteIn the first example we can, for example, negate the first and the last numbers, achieving the array $$$[-1, 1, 2, -2]$$$ with four different values.In the second example all three numbers are already different.In the third example negation does not change anything.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e99d5115", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers ($a_1, a_2, ..., a_n$). You can choose any subset of these integers and change their signs (positive to negative and vice versa). What is the largest number of unique values you can get in the list after making these changes?\n\nInput:\n\n* The first line contains $t$ (the number of test cases).\n* Each test case has two lines:\n    * The first line contains $n$ (the number of integers in the list).\n    * The second line contains the $n$ integers.\n\nOutput:\n\n* For each test case, print the largest number of unique values you can achieve."}, {"prompt_md5": "a06b10b7", "template_md5": "465699a0", "result": "You are given a list of numbers. You can choose some of the numbers and change their signs (positive to negative, or negative to positive). What is the largest number of unique numbers you can get in the list after doing this?"}]}