{"uid": "1617-E", "url": "https://codeforces.com/contest/1617/problem/E", "tags": ["dfs and similar", " dp", " games", " graphs", " implementation", " math", " number theory", " shortest paths", " trees"], "title": "1617-E", "statement": "E. Christmas Chocolatestime limit per test4 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputChristmas is coming, Icy has just received a box of chocolates from her grandparents! The box contains $$$n$$$ chocolates. The $$$i$$$-th chocolate has a non-negative integer type $$$a_i$$$.Icy believes that good things come in pairs. Unfortunately, all types of chocolates are distinct (all $$$a_i$$$ aredistinct). Icy wants to make at least one pair of chocolates the same type.As a result, she asks her grandparents to perform somechocolate exchanges.Before performing any chocolate exchanges, Icy chooses two chocolates with indices $$$x$$$ and $$$y$$$ ($$$1 \\\\le x, y \\\\le n$$$, $$$x \\\\ne y$$$).In achocolate exchange, Icy's grandparents choose a non-negative integer $$$k$$$, such that $$$2^k \\\\ge a_x$$$, and change the type of the chocolate $$$x$$$ from $$$a_x$$$ to $$$2^k - a_x$$$ (that is, perform $$$a_x := 2^k - a_x$$$).The chocolate exchanges will be stopped only when $$$a_x = a_y$$$.Note that other pairs of equal chocolate types do not stop the procedure.Icy's grandparents are smart, so they would choose the sequence of chocolate exchanges thatminimizesthe number of exchanges needed. Since Icy likes causing trouble, she wants tomaximizethe minimum number of exchanges needed by choosing $$$x$$$ and $$$y$$$ appropriately. She wonders what is the optimal pair $$$(x, y)$$$ such that the minimum number of exchanges needed is maximized across all possible choices of $$$(x, y)$$$.Since Icy is not good at math, she hopes that you can help her solve the problem.InputThe first line of the input contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the number of chocolates.The second line of the input contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$0 \\\\le a_i \\\\le 10^9$$$).It is guaranteed that all $$$a_i$$$ are distinct.OutputOutput three integers $$$x$$$, $$$y$$$, and $$$m$$$.$$$x$$$ and $$$y$$$ are indices of the optimal chocolates to perform exchanges on. Your output must satisfy $$$1 \\\\le x, y \\\\le n$$$, $$$x \\\\ne y$$$.$$$m$$$ is the number of exchanges needed to obtain $$$a_x = a_y$$$. We can show that $$$m \\\\le 10^9$$$ for any pair of chocolates.If there are multiple solutions, output any.ExamplesInput5 5 6 7 8 9Output2 5 5Input2 4 8Output1 2 2NoteIn the first test case, the minimum number of exchanges needed to exchange a chocolate of type $$$6$$$ to a chocolate of type $$$9$$$ is $$$5$$$. The sequence of exchanges is as follows: $$$6 \\\\rightarrow 2 \\\\rightarrow 0 \\\\rightarrow 1 \\\\rightarrow 7 \\\\rightarrow 9$$$.In the second test case, the minimum number of exchanges needed to exchange a chocolate of type $$$4$$$ to a chocolate of type $$$8$$$ is $$$2$$$. The sequence of exchanges is as follows: $$$4 \\\\rightarrow 0 \\\\rightarrow 8$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2115eeac", "template_md5": "35d339e4", "result": "You are given an array of $n$ distinct positive integers $a_1, a_2, ..., a_n$.  You want to find two indices $x$ and $y$ ($1 \\le x, y \\le n$, $x \\neq y$) such that the minimum number of chocolate exchanges needed to make $a_x = a_y$ is maximized.\n\nIn a chocolate exchange, you can choose a non-negative integer $k$ such that $2^k \\ge a_x$, and change the type of the chocolate at index $x$ from $a_x$ to $2^k - a_x$.\n\nOutput the indices $x$ and $y$, and the minimum number of exchanges $m$ needed to make $a_x = a_y$."}, {"prompt_md5": "61aaae07", "template_md5": "465699a0", "result": "You are given a list of distinct numbers.  You need to find two numbers in the list and determine the minimum number of operations needed to make them equal.  In one operation, you can change a number to a new number that is a power of 2 minus the original number.  Find the pair of numbers that requires the maximum number of operations to make equal."}]}