{"uid": "1618-C", "url": "https://codeforces.com/contest/1618/problem/C", "tags": ["math"], "title": "1618-C", "statement": "C. Paint the Arraytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array $$$a$$$ consisting of $$$n$$$ positive integers. You have to choose a positive integer $$$d$$$ and paint all elements into two colors. All elements which are divisible by $$$d$$$ will be painted red, and all other elements will be painted blue.The coloring is called beautiful if there are no pairs of adjacent elements with the same color in the array. Your task is to find any value of $$$d$$$ which yields a beautiful coloring, or report that it is impossible.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of testcases.The first line of each testcase contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 100$$$) — the number of elements of the array.The second line of each testcase contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^{18}$$$).OutputFor each testcase print a single integer. If there is no such value of $$$d$$$ that yields a beautiful coloring, print $$$0$$$. Otherwise, print any suitable value of $$$d$$$ ($$$1 \\\\le d \\\\le 10^{18}$$$).ExampleInput5 5 1 2 3 4 5 3 10 5 15 3 100 10 200 10 9 8 2 6 6 2 8 6 5 4 2 1 3Output2 0 100 0 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fe5ff105", "template_md5": "35d339e4", "result": "You are given an array of positive integers. You need to choose a positive integer $d$.  \n\n*  All numbers in the array that are divisible by $d$ will be painted red.\n*  All other numbers in the array will be painted blue.\n\nThe coloring is considered \"beautiful\" if no two adjacent numbers in the array have the same color.\n\nYour task is to find any value of $d$ that creates a beautiful coloring. If no such value of $d$ exists, report 0."}, {"prompt_md5": "20e13cd3", "template_md5": "465699a0", "result": "You are given a list of numbers.  You need to pick a number that divides some of the numbers in the list.  You then color the numbers that are divisible by your chosen number red, and the rest blue.  The goal is to find a number that lets you color the list so that no two numbers next to each other are the same color. If this is impossible, say so."}]}