{"uid": "1619-A", "url": "https://codeforces.com/contest/1619/problem/A", "tags": ["implementation", " strings"], "title": "1619-A", "statement": "A. Square String?time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA string is calledsquareif it is some string written twice in a row. For example, the strings \"aa\", \"abcabc\", \"abab\" and \"baabaa\" are square. But the strings \"aaa\", \"abaaab\" and \"abcdabc\" are not square.For a given string $$$s$$$ determine if it is square.InputThe first line of input data contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) —the number of test cases.This is followed by $$$t$$$ lines, each containing a description of one test case. The given strings consist only of lowercase Latin letters and have lengths between $$$1$$$ and $$$100$$$ inclusive.OutputFor each test case, output on a separate line:YESif the string in the corresponding test case is square,NOotherwise.You can outputYESandNOin any case (for example, stringsyEs,yes,YesandYESwill be recognized as a positive response).ExampleInput10 a aa aaa aaaa abab abcabc abacaba xxyy xyyx xyxyOutputNO YES NO YES YES YES NO NO NO YES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3629e3cf", "template_md5": "465699a0", "result": "Given a string, determine if it is formed by repeating the same string twice."}, {"prompt_md5": "9a5faac1", "template_md5": "35d339e4", "result": "You are given a string. Determine if the string is a \"square string\". A square string is a string that can be formed by writing another string twice in a row. \n\nFor example:\n\n* \"aa\" is a square string (it's \"a\" written twice)\n* \"abcabc\" is a square string (it's \"abcabc\" written twice)\n* \"aaa\" is not a square string \n\nInput:\n\nThe first line contains the number of test cases ($t$). \nEach of the following $t$ lines contains a string.\n\nOutput:\n\nFor each test case, print \"YES\" if the string is a square string, and \"NO\" otherwise."}]}