{"uid": "1619-G", "url": "https://codeforces.com/contest/1619/problem/G", "tags": ["binary search", " dfs and similar", " dsu", " greedy", " sortings"], "title": "1619-G", "statement": "G. Unusual Minesweepertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp is very fond of playing the game Minesweeper. Recently he found a similar game and there are such rules.There are mines on the field, for each the coordinates of its location are known ($$$x_i, y_i$$$). Each mine has a lifetime in seconds, after which it will explode. After the explosion, the mine also detonates all mines vertically and horizontally at a distance of $$$k$$$ (two perpendicular lines). As a result, we get an explosion on the field in the form of a \"plus\" symbol ('+'). Thus, one explosion can cause new explosions, and so on.Also, Polycarp can detonate anyone mine every second, starting from zero seconds. After that, a chain reaction of explosions also takes place. Mines explodeinstantlyand alsoinstantlydetonate other mines according to the rules described above.Polycarp wants to set a new record and asks you to help him calculate in what minimum number of seconds all mines can be detonated.InputThe first line of the input contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases in the test.An empty line is written in front of each test suite.Next comes a line that contains integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$0 \\\\le k \\\\le 10^9$$$) — the number of mines and the distance that hit by mines during the explosion, respectively.Then $$$n$$$ lines follow, the $$$i$$$-th of which describes the $$$x$$$ and $$$y$$$ coordinates of the $$$i$$$-th mine and the time until its explosion ($$$-10^9 \\\\le x, y \\\\le 10^9$$$, $$$0 \\\\le timer \\\\le 10^9$$$). It is guaranteed that all mines have different coordinates.It is guaranteed that the sum of the values $$$n$$$ over all test cases in the test does not exceed $$$2 \\\\cdot 10^5$$$.OutputPrint $$$t$$$ lines, each of the lines must contain the answer to the corresponding set of input data  — the minimum number of seconds it takes to explode all the mines.ExampleInput3  5 0 0 0 1 0 1 4 1 0 2 1 1 3 2 2 9  5 2 0 0 1 0 1 4 1 0 2 1 1 3 2 2 9  6 1 1 -1 3 0 -1 9 0 1 7 -1 0 1 -1 1 9 -1 -1 7Output2 1 0NotePicture from examplesFirst example:$$$0$$$ second: we explode a mine at the cell $$$(2, 2)$$$, it does not detonate any other mine since $$$k=0$$$.$$$1$$$ second: we explode the mine at the cell $$$(0, 1)$$$, and the mine at the cell $$$(0, 0)$$$ explodes itself.$$$2$$$ second: we explode the mine at the cell $$$(1, 1)$$$, and the mine at the cell $$$(1, 0)$$$ explodes itself.Second example:$$$0$$$ second: we explode a mine at the cell $$$(2, 2)$$$ we get:$$$1$$$ second: the mine at coordinate $$$(0, 0)$$$ explodes and since $$$k=2$$$ the explosion detonates mines at the cells $$$(0, 1)$$$ and $$$(1, 0)$$$, and their explosions detonate the mine at the cell $$$(1, 1)$$$ and there are no mines left on the field.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "937c985a", "template_md5": "35d339e4", "result": "There is a field with mines placed at different coordinates. Each mine has a timer. When a mine explodes, it detonates all mines horizontally and vertically within a distance  'k' from it.  \n\nYou can detonate any mine at any time.  \n\nGiven the coordinates of the mines and their timers, find the minimum time it takes to detonate all the mines. \n\n\n**Input:**\n\n* The first line contains the number of test cases 't'.\n* For each test case:\n    * The first line contains two integers 'n' (number of mines) and 'k' (detonation distance).\n    * The next 'n' lines each contain three integers: the x-coordinate, y-coordinate, and timer of a mine.\n\n**Output:**\n\n* For each test case, print the minimum time to detonate all mines."}, {"prompt_md5": "92b4a0ba", "template_md5": "465699a0", "result": "You are given a grid with mines that explode after a certain amount of time. When a mine explodes, it also detonates all mines horizontally and vertically within a certain distance.  You can detonate any mine at any time.  Find the minimum time it takes to detonate all the mines."}]}