{"uid": "1620-F", "url": "https://codeforces.com/contest/1620/problem/F", "tags": ["dp", " greedy"], "title": "1620-F", "statement": "F. Bipartite Arraytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a permutation $$$p$$$ consisting of $$$n$$$ integers $$$1, 2, \\\\dots, n$$$ (a permutation is an array where each element from $$$1$$$ to $$$n$$$ occurs exactly once).Let's call an array $$$a$$$bipartiteif the following undirected graph is bipartite:the graph consists of $$$n$$$ vertices;two vertices $$$i$$$ and $$$j$$$ are connected by an edge if $$$i < j$$$ and $$$a_i > a_j$$$.Your task is to find abipartitearray of integers $$$a$$$ of size $$$n$$$, such that $$$a_i = p_i$$$ or $$$a_i = -p_i$$$, or report that no such array exists. If there are multiple answers, print any of them.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 2 \\\\cdot 10^5$$$) — the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^6$$$) — the size of the permutation.The second line contains $$$n$$$ integers $$$p_1, p_2, \\\\dots, p_n$$$.The sum of $$$n$$$ over all test cases doesn't exceed $$$10^6$$$.OutputFor each test case, print the answer in the following format. If such an array $$$a$$$ does not exist, print \"NO\" in a single line. Otherwise, print \"YES\" in the first line and $$$n$$$ integers — array $$$a$$$ in the second line.ExampleInput4 3 1 2 3 6 1 3 2 6 5 4 4 4 1 3 2 8 3 2 1 6 7 8 5 4OutputYES 1 2 3 NO YES -4 -1 -3 -2 YES -3 -2 1 6 7 -8 -5 -4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2503e115", "template_md5": "35d339e4", "result": "You are given a permutation of integers from 1 to $n$. A permutation is an arrangement where each number appears exactly once.\n\nYou need to create a new array of the same size, where each element is either equal to the corresponding element in the input permutation or its negative.  \n\nThe new array is considered \"bipartite\" if you can draw a graph where:\n\n* Each number in the array is a vertex (a point).\n* Two vertices are connected by an edge if the number at the first index is greater than the number at the second index and the first index is less than the second index.\n\nYour task is to find a bipartite array that meets these conditions. If no such array exists, report \"NO\". Otherwise, print \"YES\" followed by the elements of the bipartite array."}, {"prompt_md5": "05748c81", "template_md5": "465699a0", "result": "You are given a list of numbers.  You need to create a new list of the same length where each number is either the same as the original number or its opposite (positive becomes negative, negative becomes positive).  The new list must be arranged so that if the first number in the new list is larger than the second number, then the second number is larger than the third number, and so on.  If you can create such a list, output \"YES\" followed by the list. If you can't, output \"NO\"."}]}