{"uid": "1620-B", "url": "https://codeforces.com/contest/1620/problem/B", "tags": ["geometry", " greedy", " math"], "title": "1620-B", "statement": "B. Triangles on a Rectangletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA rectangle with its opposite corners in $$$(0, 0)$$$ and $$$(w, h)$$$ and sides parallel to the axes is drawn on a plane.You are given a list of lattice points such that each point lies on a side of a rectangle but not in its corner. Also, there are at least two points on every side of a rectangle.Your task is to choose three points in such a way that:exactly two of them belong to the same side of a rectangle;the area of a triangle formed by them is maximum possible.Print the doubled area of this triangle. It can be shown that the doubled area of any triangle formed by lattice points is always an integer.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of testcases.The first line of each testcase contains two integers $$$w$$$ and $$$h$$$ ($$$3 \\\\le w, h \\\\le 10^6$$$) — the coordinates of the corner of a rectangle.The next two lines contain the description of the points on two horizontal sides. First, an integer $$$k$$$ ($$$2 \\\\le k \\\\le 2 \\\\cdot 10^5$$$) — the number of points. Then, $$$k$$$ integers $$$x_1 < x_2 < \\\\dots < x_k$$$ ($$$0 < x_i < w$$$) — the $$$x$$$ coordinates of the points in the ascending order. The $$$y$$$ coordinate for the first line is $$$0$$$ and for the second line is $$$h$$$.The next two lines contain the description of the points on two vertical sides. First, an integer $$$k$$$ ($$$2 \\\\le k \\\\le 2 \\\\cdot 10^5$$$) — the number of points. Then, $$$k$$$ integers $$$y_1 < y_2 < \\\\dots < y_k$$$ ($$$0 < y_i < h$$$) — the $$$y$$$ coordinates of the points in the ascending order. The $$$x$$$ coordinate for the first line is $$$0$$$ and for the second line is $$$w$$$.The total number of points on all sides in all testcases doesn't exceed $$$2 \\\\cdot 10^5$$$.OutputFor each testcase print a single integer — the doubled maximum area of a triangle formed by such three points that exactly two of them belong to the same side.ExampleInput3 5 8 2 1 2 3 2 3 4 3 1 4 6 2 4 5 10 7 2 3 9 2 1 7 3 1 3 4 3 4 5 6 11 5 3 1 6 8 3 3 6 8 3 1 3 4 2 2 4Output25 42 35NoteThe points in the first testcase of the example:$$$(1, 0)$$$, $$$(2, 0)$$$;$$$(2, 8)$$$, $$$(3, 8)$$$, $$$(4, 8)$$$;$$$(0, 1)$$$, $$$(0, 4)$$$, $$$(0, 6)$$$;$$$(5, 4)$$$, $$$(5, 5)$$$.The largest triangle is formed by points $$$(0, 1)$$$, $$$(0, 6)$$$ and $$$(5, 4)$$$ — its area is $$$\\\\frac{25}{2}$$$. Thus, the doubled area is $$$25$$$. Two points that are on the same side are: $$$(0, 1)$$$ and $$$(0, 6)$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "40c06497", "template_md5": "35d339e4", "result": "You are given a rectangle with opposite corners at $(0,0)$ and $(w,h)$.  There are points on each side of the rectangle, but not at the corners.  \n\nYour task is to choose three points, where exactly two of them are on the same side of the rectangle, and find the triangle with the largest possible area formed by these three points.  Print twice the area of this triangle. \n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the width $w$ and height $h$ of the rectangle.\n    * The next two lines describe the points on the horizontal sides. The first line contains the number of points $k$, followed by $k$ integers representing the $x$-coordinates of the points in ascending order. The $y$-coordinate for the first horizontal side is 0, and for the second is $h$.\n    * The next two lines describe the points on the vertical sides in the same format as the horizontal sides, but with $y$-coordinates.\n\n**Output:**\n\n* For each test case, print the doubled area of the triangle with the largest possible area."}, {"prompt_md5": "7f10f8b0", "template_md5": "465699a0", "result": "You are given a rectangle and a set of points on its sides.  Find three points, where exactly two points are on the same side of the rectangle, that form a triangle with the largest possible area. Output twice the area of this triangle."}]}