{"uid": "1622-A", "url": "https://codeforces.com/contest/1622/problem/A", "tags": ["geometry", " math"], "title": "1622-A", "statement": "A. Construct a Rectangletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are three sticks with integer lengths $$$l_1, l_2$$$ and $$$l_3$$$.You are asked to break exactly one of them into two pieces in such a way that:both pieces have positive (strictly greater than $$$0$$$)integerlength;the total length of the pieces is equal to the original length of the stick;it's possible to construct a rectangle from the resulting four sticks such that each stick is used as exactly one of its sides.A square is also considered a rectangle.Determine if it's possible to do that.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of testcases.The only line of each testcase contains three integers $$$l_1, l_2, l_3$$$ ($$$1 \\\\le l_i \\\\le 10^8$$$) — the lengths of the sticks.OutputFor each testcase, print \"YES\" if it's possible to break one of the sticks into two pieces with positive integer length in such a way that it's possible to construct a rectangle from the resulting four sticks. Otherwise, print \"NO\".You may print every letter in any case you want (so, for example, the stringsyEs,yes,YesandYESare all recognized as a positive answer).ExampleInput4 6 1 5 2 5 2 2 4 2 5 5 4OutputYES NO YES YESNoteIn the first testcase, the first stick can be broken into parts of length $$$1$$$ and $$$5$$$. We can construct a rectangle with opposite sides of length $$$1$$$ and $$$5$$$.In the second testcase, breaking the stick of length $$$2$$$ can only result in sticks of lengths $$$1, 1, 2, 5$$$, which can't be made into a rectangle. Breaking the stick of length $$$5$$$ can produce results $$$2, 3$$$ or $$$1, 4$$$ but neither of them can't be put into a rectangle.In the third testcase, the second stick can be broken into parts of length $$$2$$$ and $$$2$$$. The resulting rectangle has opposite sides $$$2$$$ and $$$2$$$ (which is a square).In the fourth testcase, the third stick can be broken into parts of length $$$2$$$ and $$$2$$$. The resulting rectangle has opposite sides $$$2$$$ and $$$5$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cac56f1c", "template_md5": "465699a0", "result": "You are given three stick lengths.  You can break one stick into two smaller sticks of positive length that add up to the original length.  Can you arrange all four sticks to form a rectangle?"}, {"prompt_md5": "110a798a", "template_md5": "35d339e4", "result": "You are given three sticks with lengths $l_1$, $l_2$, and $l_3$.  You can break one of the sticks into two pieces, where both pieces have positive integer lengths and add up to the original length of the stick.  \n\nDetermine if it's possible to break a stick this way so that you can use all four pieces to form a rectangle (a square is also a rectangle).\n\nOutput \"YES\" if it's possible, and \"NO\" if it's not."}]}