{"uid": "1624-G", "url": "https://codeforces.com/contest/1624/problem/G", "tags": ["bitmasks", " dfs and similar", " dsu", " graphs", " greedy"], "title": "1624-G", "statement": "G. MinOr Treetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently, Vlad has been carried away by spanning trees, so his friends, without hesitation, gave him a connected weighted undirected graph of $$$n$$$ vertices and $$$m$$$ edges for his birthday.Vlad defined theorityof a spanning tree as thebitwise ORof all its weights, and now he is interested in what is the minimum possibleoritythat can be achieved by choosing a certain spanning tree. A spanning tree is a connected subgraph of a given graph that does not contain cycles.In other words, you want to keep $$$n-1$$$ edges so that the graph remains connected and the bitwise OR weights of the edges are as small as possible. You have to find the minimum bitwise OR itself.InputThe first line of the input contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases in the input.An empty line is written in front of each test case.This is followed by two numbers $$$n$$$ and $$$m$$$ ($$$3 \\\\le n \\\\le 2 \\\\cdot 10^5, n - 1 \\\\le m \\\\le 2 \\\\cdot 10^5$$$) — the number of vertices and edges of the graph, respectively.The next $$$m$$$ lines contain the description of the edges. Line $$$i$$$ contains three numbers $$$v_i$$$, $$$u_i$$$ and $$$w_i$$$ ($$$1 \\\\le v_i, u_i \\\\le n$$$, $$$1 \\\\le w_i \\\\le 10^9$$$, $$$v_i \\\\neq u_i$$$) — the vertices that the edge connects and its weight.It is guaranteed that the sum $$$m$$$ and the sum $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$ and each test case contains a connected graph.OutputPrint $$$t$$$ lines, each of which contains the answer to the corresponding set of input data — the minimum possible spanning treeority.ExampleInput33 31 2 12 3 21 3 25 74 2 72 5 83 4 23 2 12 4 24 1 21 2 23 41 2 12 3 21 3 33 1 4Output2 10 3NoteGraph from the first test case.Orityof this tree equals to2 or 2 = 2and it's minimal.Without excluding edge with weight $$$1$$$orityis1 or 2 = 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97eee38d", "template_md5": "35d339e4", "result": "You are given a connected weighted undirected graph with $n$ vertices and $m$ edges.  Find the minimum possible bitwise OR of the weights of all edges in a spanning tree of the graph.\n\nA spanning tree is a subgraph that includes all $n$ vertices and has $n-1$ edges, with no cycles. \n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 10^4$) representing the number of test cases.\n* Each test case is preceded by an empty line.\n* The next line contains two integers $n$ and $m$ ($3 \\le n \\le 2 \\cdot 10^5$, $n-1 \\le m \\le 2 \\cdot 10^5$) representing the number of vertices and edges, respectively.\n* The following $m$ lines describe the edges, each line containing three integers $v_i$, $u_i$, and $w_i$ ($1 \\le v_i, u_i \\le n$, $1 \\le w_i \\le 10^9$, $v_i \\neq u_i$) representing the vertices connected by the edge and the weight of the edge.\n\nOutput:\n\n* Print $t$ lines, each containing the minimum possible bitwise OR of edge weights for a spanning tree in the corresponding test case."}, {"prompt_md5": "ce6e6ae9", "template_md5": "465699a0", "result": "You are given a connected graph with weighted edges. Find the smallest possible sum of the weights of edges in a spanning tree of the graph.  A spanning tree is a subset of the edges that connects all the vertices without any cycles."}]}