{"uid": "1626-A", "url": "https://codeforces.com/contest/1626/problem/A", "tags": ["constructive algorithms", " sortings"], "title": "1626-A", "statement": "A. Equidistant Letterstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$, consisting of lowercase Latin letters. Every letter appears in it no more than twice.Your task is to rearrange the letters in the string in such a way that for each pair of letters that appear exactly twice, the distance between the letters in the pair is the same. You are not allowed to add or remove letters.It can be shown that the answer always exists. If there are multiple answers, print any of them.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^3$$$) — the number of testcases.Each testcase consists of a non-empty string $$$s$$$, consisting of lowercase Latin letters. Every letter appears in the string no more than twice. The length of the string doesn't exceed $$$52$$$.OutputFor each testcase, print a single string. Every letter should appear in it the same number of times as it appears in string $$$s$$$. For each pair of letters that appear exactly twice, the distance between the letters in the pair should be the same.If there are multiple answers, print any of them.ExampleInput3oelhlabcdcbaacOutputhello ababcdc acNoteIn the first testcase of the example, the only letter that appears exactly twice is letter 'l'. You can rearrange the letters arbitrarily, since there are no distances to compare.In the second testcase of the example, the letters that appear exactly twice are 'a', 'b' and 'c'. Initially, letters 'a' are distance $$$6$$$ apart, letters 'b' are distance $$$4$$$ apart and letters 'c' are distance $$$2$$$ apart. They are not the same, so we have to rearrange the letters. After rearrangement, letters 'a' are distance $$$2$$$ apart, letters 'b' are distance $$$2$$$ apart and letters 'c' are distance $$$2$$$ apart. They are all the same, so the answer is valid.In the third testcase of the example, there are no letters that appear exactly twice. Thus, any rearrangement is valid. Including not changing the string at all.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "58276b43", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters. Each letter appears no more than twice.  \n\nYour task is to rearrange the letters so that for any pair of letters that appear exactly twice, the distance between them in the rearranged string is the same. \n\nYou cannot add or remove any letters. \n\nFor example:\n\nInput:  \"oelhlabcdcbaac\"\n\nOutput: \"hello ababcdc ac\" \n\n\n\nLet me know if you'd like help with any part of solving this problem!"}, {"prompt_md5": "94257c24", "template_md5": "465699a0", "result": "Rearrange a string of lowercase letters so that for each pair of letters that appear twice, the distance between them in the rearranged string is the same."}]}