{"uid": "163-D", "url": "https://codeforces.com/contest/163/problem/D", "tags": ["brute force"], "title": "163-D", "statement": "D. Large Refrigeratortime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya wants to buy a new refrigerator. He believes that a refrigerator should be a rectangular parallelepiped with integer edge lengths. Vasya calculated that for daily use he will need a refrigerator with volume of at leastV. Moreover, Vasya is a minimalist by nature, so the volume should be no more thanV, either — why take up extra space in the apartment? Having made up his mind about the volume of the refrigerator, Vasya faced a new challenge — for a fixed volume ofVthe refrigerator must have the minimum surface area so that it is easier to clean.The volume and the surface area of a refrigerator with edgesa,b,care equal toV=abcandS= 2(ab+bc+ca), correspondingly.Given the volumeV, help Vasya find the integer lengths for the refrigerator's edgesa,b,cso that the refrigerator's volume equalsVand its surface areaSis minimized.InputThe first line contains a single integert(1 ≤t≤ 500) — the number of data sets.The description oftdata sets follows. Each set consists of a single integerV(2 ≤V≤ 1018), given by its factorization as follows.LetV=p1a1p2a2...pkak, wherepiare different prime numbers andaiare positive integer powers.Then the first line describing a data set contains a single positive integerk— the number of different prime divisors ofV. Nextklines contain prime numberspiand their powersai, separated by spaces. Allpiare different, allai> 0.OutputPrinttlines, on thei-th line print the answer to thei-th data set as four space-separated integers: the minimum possible surface areaSand the corresponding edge lengthsa,b,c. If there are multiple variants of the lengths of edges that give the minimum area, you are allowed to print any of them. You can print the lengths of the fridge's edges in any order.ExamplesInput312 3117 133 12 35 1Output24 2 2 270 1 1 17148 4 6 5NoteIn the first data set of the sample the fridge's volumeV= 23= 8, and the minimum surface area will be produced by the edges of equal length.In the second data set the volumeV= 17, and it can be produced by only one set of integer lengths.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a4ecc38b", "template_md5": "35d339e4", "result": "Given a volume $V$, find three positive integers $a$, $b$, and $c$ such that:\n\n* $a \\cdot b \\cdot c = V$ \n* The surface area $2(ab + bc + ca)$ is minimized.\n\nThe input will be given as the prime factorization of $V$.  Output the minimum surface area and the three integers. If there are multiple solutions, any one is acceptable."}, {"prompt_md5": "2c4242f4", "template_md5": "465699a0", "result": "Given a target volume, find the smallest possible surface area of a rectangular box with integer side lengths."}]}