{"uid": "163-E", "url": "https://codeforces.com/contest/163/problem/E", "tags": ["data structures", " dfs and similar", " dp", " strings", " trees"], "title": "163-E", "statement": "E. e-Governmenttime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe best programmers of Embezzland compete to develop a part of the project called \"e-Government\" — the system of automated statistic collecting and press analysis.We know that any of thekcitizens can become a member of the Embezzland government. The citizens' surnames area1,a2, ...,ak. All surnames are different. Initially allkcitizens from this list are members of the government. The system should support the following options:Include citizenaito the government.Exclude citizenaifrom the government.Given a newspaper article text, calculate how politicized it is. To do this, for every active government member the system counts the number of times his surname occurs in the text as a substring. All occurrences are taken into consideration, including the intersecting ones. The degree of politicization of a text is defined as the sum of these values for all active government members.Implement this system.InputThe first line contains space-separated integersnandk(1 ≤n,k≤ 105) — the number of queries to the system and the number of potential government members.Nextklines contain the surnamesa1,a2, ...,ak, one per line. All surnames are pairwise different.Nextnlines contain queries to the system, one per line. Each query consists of a character that determines an operation and the operation argument, written consecutively without a space.Operation \"include in the government\" corresponds to the character \"+\", operation \"exclude\" corresponds to \"-\". An argument of those operations is an integer between1andk— the index of the citizen involved in the operation. Any citizen can be included and excluded from the government an arbitrary number of times in any order. Including in the government a citizen who is already there or excluding the citizen who isn't there changes nothing.The operation \"calculate politicization\" corresponds to character \"?\". Its argument is a text.All strings — surnames and texts — are non-empty sequences of lowercase Latin letters. The total length of all surnames doesn't exceed106, the total length of all texts doesn't exceed106.OutputFor any \"calculate politicization\" operation print on a separate line the degree of the politicization of the given text. Print nothing for other operations.ExamplesInput7 3aaaab?aaab-2?aaab-3?aaab+2?aabbaaOutput6436", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e67c46f1", "template_md5": "35d339e4", "result": "You are given a list of $k$ names.  Initially, all $k$ names are considered members of a government.  You will be given a series of operations:\n\n* **+ i:** Add name $i$ to the government.\n* **- i:** Remove name $i$ from the government.\n* **? text:** Calculate the \"politicization\" of the text.  \n\nThe politicization of a text is calculated as follows:\n\n1. For each name currently in the government, count how many times that name appears as a substring within the text.\n2. Sum up these counts for all names in the government.\n\nOutput the politicization value for each \"? text\" operation. \n\n\n\nLet me know if you'd like me to clarify any part of this!"}, {"prompt_md5": "95b588d7", "template_md5": "465699a0", "result": "You are given a list of names and a series of commands. Some commands add or remove names from a list. Other commands give you a text and ask you to calculate how many times each name in the active list appears in the text. The result is the sum of these counts."}]}