{"uid": "163-A", "url": "https://codeforces.com/contest/163/problem/A", "tags": ["dp"], "title": "163-A", "statement": "A. Substring and Subsequencetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day Polycarpus got hold of two non-empty stringssandt, consisting of lowercase Latin letters. Polycarpus is quite good with strings, so he immediately wondered, how many different pairs of \"xy\" are there, such thatxis a substring of strings,yis a subsequence of stringt, and the content ofxandyis the same. Two pairs are considered different, if they contain different substrings of stringsor different subsequences of stringt. Read the whole statement to understand the definition of different substrings and subsequences.Thelengthof stringsis the number of characters in it. If we denote the length of the stringsas|s|, we can write the string ass=s1s2...s|s|.Asubstringofsis a non-empty stringx=s[a...b] =sasa+ 1...sb(1 ≤a≤b≤ |s|). For example, \"code\" and \"force\" are substrings or \"codeforces\", while \"coders\" is not. Two substringss[a...b]ands[c...d]are considered to bedifferentifa≠corb≠d. For example, ifs=\"codeforces\",s[2...2]ands[6...6]are different, though their content is the same.Asubsequenceofsis a non-empty stringy=s[p1p2...p|y|] =sp1sp2...sp|y|(1 ≤p1<p2< ... <p|y|≤ |s|). For example, \"coders\" is a subsequence of \"codeforces\". Two subsequencesu=s[p1p2...p|u|]andv=s[q1q2...q|v|]are considereddifferentif the sequencespandqare different.InputThe input consists of two lines. The first of them containss(1 ≤ |s| ≤ 5000), and the second one containst(1 ≤ |t| ≤ 5000). Both strings consist of lowercase Latin letters.OutputPrint a single number — the number of different pairs \"xy\" such thatxis a substring of strings,yis a subsequence of stringt, and the content ofxandyis the same. As the answer can be rather large, print it modulo1000000007(109+ 7).ExamplesInputaaaaOutput5InputcodeforcesforceofcodeOutput60NoteLet's write down all pairs \"xy\" that form the answer in the first sample: \"s[1...1]t[1]\", \"s[2...2]t[1]\", \"s[1...1]t[2]\",\"s[2...2]t[2]\", \"s[1...2]t[1 2]\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cb0ed9f5", "template_md5": "35d339e4", "result": "You are given two strings,  $s$ and $t$.  Find the number of pairs of substrings  $x$ of $s$ and subsequences $y$ of $t$ such that $x$ and $y$ have the same characters. \n\n**Definitions:**\n\n* **Substring:** A substring of a string is a continuous sequence of characters within that string. For example, \"code\" and \"force\" are substrings of \"codeforces\".\n* **Subsequence:** A subsequence of a string is a sequence of characters that appears in the same order as in the original string, but not necessarily consecutively. For example, \"coders\" is a subsequence of \"codeforces\".\n\n**Input:**\n\n* The first line contains string $s$.\n* The second line contains string $t$.\n\n**Output:**\n\n* Print the number of valid pairs of substrings and subsequences modulo 1000000007."}, {"prompt_md5": "4bb377c8", "template_md5": "465699a0", "result": "Given two strings, find the number of pairs where one string is a substring of the first and the other is a subsequence of the second, and the content of the two strings is the same."}]}