{"uid": "1630-F", "url": "https://codeforces.com/contest/1630/problem/F", "tags": ["flows", " graph matchings", " graphs", " number theory"], "title": "1630-F", "statement": "F. Making It Bipartitetime limit per test4 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given an undirected graph of $$$n$$$ vertices indexed from $$$1$$$ to $$$n$$$, where vertex $$$i$$$ has a value $$$a_i$$$ assigned to it and all values $$$a_i$$$ aredifferent. There is an edge between two vertices $$$u$$$ and $$$v$$$ if either $$$a_u$$$ divides $$$a_v$$$ or $$$a_v$$$ divides $$$a_u$$$.Find the minimum number of vertices to remove such that the remaining graph is bipartite, when you remove a vertex you remove all the edges incident to it.InputThe input consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 5\\\\cdot10^4$$$) — the number of vertices in the graph.The second line of each test case contains $$$n$$$ integers, the $$$i$$$-th of them is the value $$$a_i$$$ ($$$1 \\\\le a_i \\\\le 5\\\\cdot10^4$$$) assigned to the $$$i$$$-th vertex, all values $$$a_i$$$ aredifferent.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$5\\\\cdot10^4$$$.OutputFor each test case print a single integer — the minimum number of vertices to remove such that the remaining graph is bipartite.ExampleInput448 4 2 1430 2 3 5512 4 6 2 31085 195 5 39 3 13 266 154 14 2Output2 0 1 2NoteIn the first test case if we remove the vertices with values $$$1$$$ and $$$2$$$ we will obtain a bipartite graph, so the answer is $$$2$$$, it is impossible to remove less than $$$2$$$ vertices and still obtain a bipartite graph.BeforeAftertest case #1In the second test case we do not have to remove any vertex because the graph is already bipartite, so the answer is $$$0$$$.BeforeAftertest case #2In the third test case we only have to remove the vertex with value $$$12$$$, so the answer is $$$1$$$.BeforeAftertest case #3In the fourth test case we remove the vertices with values $$$2$$$ and $$$195$$$, so the answer is $$$2$$$.BeforeAftertest case #4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bd43bfe2", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices, where each vertex has a unique value $a_i$ assigned to it. There is an edge between two vertices $u$ and $v$ if either $a_u$ divides $a_v$ or $a_v$ divides $a_u$.\n\nFind the minimum number of vertices you need to remove so that the remaining graph is bipartite. Removing a vertex also removes all edges connected to it.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of vertices, $n$.\n    * The second line contains $n$ integers, the values $a_i$ for each vertex.\n\n**Output:**\n\nFor each test case, print the minimum number of vertices to remove to make the graph bipartite."}, {"prompt_md5": "f1547f09", "template_md5": "465699a0", "result": "You are given a graph where each node has a unique number. Two nodes are connected if one number divides the other. Find the fewest nodes you must remove so that the remaining graph can be divided into two groups where no two connected nodes are in the same group."}]}