{"uid": "1634-B", "url": "https://codeforces.com/contest/1634/problem/B", "tags": ["bitmasks", " math"], "title": "1634-B", "statement": "B. Fortune Tellingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputHaha, try to solve this, SelectorUnlimited!— antontrygubO_oYour friends Alice and Bob practice fortune telling.Fortune telling is performed as follows. There is a well-known array $$$a$$$ of $$$n$$$ non-negative integers indexed from $$$1$$$ to $$$n$$$. The tellee starts with some non-negative number $$$d$$$ and performs one of the two operations for each $$$i = 1, 2, \\\\ldots, n$$$,in the increasing order of $$$i$$$. The possible operations are:replace their current number $$$d$$$ with $$$d + a_i$$$replace their current number $$$d$$$ with $$$d \\\\oplus a_i$$$ (hereinafter $$$\\\\oplus$$$ denotes thebitwise XOR operation)Notice that the chosen operation may be different for different $$$i$$$ and for different tellees.One time, Alice decided to start with $$$d = x$$$ and Bob started with $$$d = x + 3$$$. Each of them performed fortune telling and got a particular number in the end. Notice that the friends chose operations independently of each other, that is, they could apply different operations for the same $$$i$$$.You learnt that either Alice or Bob ended up with number $$$y$$$ in the end, but you don't know whose of the two it was. Given the numbers Alice and Bob started with and $$$y$$$, find out who (Alice or Bob) could get the number $$$y$$$ after performing the operations. It is guaranteed that on the jury tests,exactly oneof your friends could have actually gotten that number.HacksYou cannot make hacks in this problem.InputOn the first line of the input, you are given one number $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. The following $$$2 \\\\cdot t$$$ lines contain test cases.The first line of each test case contains three numbers $$$n$$$, $$$x$$$, $$$y$$$ ($$$1 \\\\le n \\\\le 10^5$$$, $$$0 \\\\le x \\\\le 10^9$$$, $$$0 \\\\le y \\\\le 10^{15}$$$) — the length of array $$$a$$$, Alice's initial number (Bob's initial number is therefore $$$x+3$$$), and the number that one of the two friends got in the end.The second line of each test case contains $$$n$$$ numbers — the array $$$a$$$ ($$$0 \\\\le a_i \\\\le 10^9$$$).It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case, print the name of the friend who could get the number $$$y$$$: \"Alice\" or \"Bob\".ExampleInput41 7 922 0 21 34 0 11 2 3 42 1000000000 30000000001000000000 1000000000OutputAlice Alice Bob AliceNoteIn the first test case, Alice could get $$$9$$$ using the following operations: $$$7 + 2 = 9$$$.In the second test case, Alice could get $$$2$$$ using this operations: $$$(0 + 1) \\\\oplus 3 = 2$$$.In the third test case, Bob started with $$$x+3 = 0+3=3$$$ and could get $$$1$$$ this way: $$$(((3 + 1) + 2) \\\\oplus 3) \\\\oplus 4 = 1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "88b4ef89", "template_md5": "35d339e4", "result": "You are given an array of non-negative integers $a$ of length $n$. Two people start with different numbers, one with $x$ and the other with $x+3$.  They each perform operations on their starting number, one at a time, using the following rules:\n\n* **Operation 1:** Add the current number to the next element in the array $a$.\n* **Operation 2:** Perform a bitwise XOR operation between the current number and the next element in the array $a$.\n\nThey can choose a different operation for each element in the array.\n\nYou know that one of the two people ended up with a final number $y$.  Determine which person could have reached that number.\n\n**Input:**\n\n* $t$: The number of test cases.\n* For each test case:\n    * $n$: The length of the array $a$.\n    * $x$: The starting number of the first person.\n    * $y$: The final number one of the people reached.\n    * $a$: The array of non-negative integers.\n\n**Output:**\n\nFor each test case, print \"Alice\" or \"Bob\" indicating which person could have reached the final number $y$."}, {"prompt_md5": "0d798463", "template_md5": "465699a0", "result": "You are given two starting numbers and a target number. There is an array of numbers. You can either add or use the bitwise XOR operation with each number in the array.  Determine which of the two starting numbers could result in the target number after performing these operations."}]}