{"uid": "1634-E", "url": "https://codeforces.com/contest/1634/problem/E", "tags": ["constructive algorithms", " data structures", " dfs and similar", " graph matchings", " graphs"], "title": "1634-E", "statement": "E. Fair Sharetime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEven a cat has things it can do that AI cannot.— Fei-Fei LiYou are given $$$m$$$ arrays of positive integers. Each array is of even length.You need to split all these integers into twoequalmultisets $$$L$$$ and $$$R$$$, that is, each element of each array should go into one of two multisets (but not both). Additionally, for each of the $$$m$$$ arrays,exactly halfof its elements should go into $$$L$$$, and the rest should go into $$$R$$$.Give an example of such a division or determine that no such division exists.InputThe first line contains an integer $$$m$$$ ($$$1 \\\\le m \\\\le 10 ^ 5$$$) — the number of arrays.The next $$$2 \\\\cdot m$$$ lines contain descriptions of the arrays.For each array, the first line contains an even integer $$$n$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10 ^ 5$$$) — the length of the array. The second line consists of $$$n$$$ space-separated integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10 ^ 9$$$) — array elements.It is guaranteed that the sum of $$$n$$$ over all arrays does not exceed $$$2 \\\\cdot 10^5$$$.OutputIf the answer exists, print \"YES\", and then print $$$m$$$ lines.On each line, for each element, print the letter \"L\" or \"R\" (capitalized, without spaces), depending on which multiset the element should go into.If there is no answer, print \"NO\" on the only line.ExampleInput3 2 1 2 4 1 2 3 3 6 1 1 2 2 3 3OutputYES RL LRLR RLLRRLNoteIn the first array, we add the first element to $$$R$$$ and the second to $$$L$$$. Now $$$L = \\\\{2\\\\}$$$, and $$$R = \\\\{1\\\\}$$$.In the second array, we add the first and third elements to $$$L$$$ and the rest to $$$R$$$. Now $$$L = \\\\{1, 2, 3\\\\}$$$ and $$$R = \\\\{1, 2, 3\\\\}$$$.In the third array, we add elements 2, 3, and 6 to $$$L$$$, and others — to $$$R$$$. As a result, $$$L = R = \\\\{1, 1, 2, 2, 3, 3\\\\}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0fe5aa30", "template_md5": "35d339e4", "result": "You are given $m$ arrays of positive integers. Each array has an even number of elements. \n\nYou need to split all the integers into two sets, $L$ and $R$, so that:\n\n* Each element from each array goes into either set $L$ or set $R$ (not both).\n* For each array, exactly half of its elements go into set $L$ and the other half go into set $R$.\n\nDetermine if such a division is possible. If it is, print \"YES\" and list which set each element goes into (L or R). If it's not possible, print \"NO\"."}, {"prompt_md5": "3fe576e2", "template_md5": "465699a0", "result": "You are given several lists of numbers. Each list has an even number of elements.  You need to divide the numbers into two groups, so that each list has exactly half its numbers in each group.  Is this possible? If so, show how to divide the numbers. If not, say it's not possible."}]}