{"uid": "1635-E", "url": "https://codeforces.com/contest/1635/problem/E", "tags": ["2-sat", " constructive algorithms", " dfs and similar", " dsu", " graphs", " greedy", " sortings"], "title": "1635-E", "statement": "E. Carstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ cars on a coordinate axis $$$OX$$$. Each car is located at an integer point initially and no two cars are located at the same point. Also, each car is oriented either left or right, and they can move at any constant positive speed in that direction at any moment.More formally, we can describe the $$$i$$$-th car with a letter and an integer: its orientation $$$ori_i$$$ and its location $$$x_i$$$. If $$$ori_i = L$$$, then $$$x_i$$$ is decreasing at a constant rate with respect to time. Similarly, if $$$ori_i = R$$$, then $$$x_i$$$ is increasing at a constant rate with respect to time.We call two carsirrelevantif they never end up in the same point regardless of their speed. In other words, they won't share the same coordinate at any moment.We call two carsdestinedif they always end up in the same point regardless of their speed. In other words, they must share the same coordinate at some moment.Unfortunately, we lost all information about our cars, but we do remember $$$m$$$ relationships. There are two types of relationships:$$$1$$$ $$$i$$$ $$$j$$$ —$$$i$$$-th car and $$$j$$$-th car areirrelevant.$$$2$$$ $$$i$$$ $$$j$$$ —$$$i$$$-th car and $$$j$$$-th car aredestined.Restore the orientations and the locations of the cars satisfying the relationships, or report that it is impossible. If there are multiple solutions, you can output any.Note that if two cars share the same coordinate, they will intersect, but at the same moment they will continue their movement in their directions.InputThe first line contains two integers, $$$n$$$ and $$$m$$$ $$$(2 \\\\leq n \\\\leq 2 \\\\cdot 10^5; 1 \\\\leq m \\\\leq min(2 \\\\cdot 10^5, \\\\frac{n(n-1)}{2})$$$ — the number of cars and the number of restrictions respectively.Each of the next $$$m$$$ lines contains three integers, $$$type$$$, $$$i$$$, and $$$j$$$ $$$(1 \\\\leq type \\\\leq 2; 1 \\\\leq i,j \\\\leq n; i≠j)$$$.If $$$type$$$ = $$$1$$$, $$$i$$$-th car and $$$j$$$-th car areirrelevant. Otherwise, $$$i$$$-th car and $$$j$$$-th car aredestined.It is guaranteed that for each pair of cars, there are at most $$$1$$$ relationship between.OutputIn the first line, print either \"YES\" or \"NO\" (in any case), whether it is possible to restore the orientations and the locations of the cars satisfying the relationships.If the answer is \"YES\", print $$$n$$$ lines each containing a symbol and an integer: $$$ori_i$$$ and $$$x_i$$$ $$$(ori_i \\\\in \\\\{L, R\\\\}; -10^9 \\\\leq x_i \\\\leq 10^9)$$$ — representing the information of the $$$i$$$-th car.If the orientation is left, then $$$ori_i$$$ = $$$L$$$. Otherwise $$$ori_i$$$ = $$$R$$$.$$$x_i$$$ is the where the $$$i$$$-th car is located. Note that all $$$x_i$$$ should bedistinct.We can prove that if there exists a solution, then there must be a solution satisfying the constraints on $$$x_i$$$.ExamplesInput4 4 1 1 2 1 2 3 2 3 4 2 4 1OutputYES R 0 L -3 R 5 L 6Input3 3 1 1 2 1 2 3 1 1 3OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "69a70e1f", "template_md5": "35d339e4", "result": "You are given $n$ cars on a number line. Each car can move either left or right at a constant speed. You know that some pairs of cars are always destined to meet (their positions will eventually be the same) and some pairs are always irrelevant (they will never meet). \n\nYour task is to determine if it's possible to figure out the initial positions and directions of all the cars given this information. If it's possible, output the initial positions and directions of all the cars. If it's not possible, output \"NO\". \n\n**Input:**\n\n* The first line contains two integers, $n$ (the number of cars) and $m$ (the number of relationships).\n* Each of the next $m$ lines contains three integers:\n    * `1`  $i$ $j$ : Cars $i$ and $j$ are irrelevant.\n    * `2`  $i$ $j$ : Cars $i$ and $j$ are destined.\n\n**Output:**\n\n* If it's possible to determine the car positions and directions, output \"YES\" followed by $n$ lines, each containing the direction (L for left, R for right) and the initial position of a car.\n* If it's not possible, output \"NO\"."}, {"prompt_md5": "6c36b7fc", "template_md5": "465699a0", "result": "You are given a number of cars and information about which pairs of cars will always meet and which pairs will never meet.  Determine if it's possible to assign each car a direction (left or right) and a starting position so that the given relationships hold true. If possible, list the direction and starting position for each car."}]}