{"uid": "1638-F", "url": "https://codeforces.com/contest/1638/problem/F", "tags": ["brute force", " data structures", " greedy", " two pointers"], "title": "1638-F", "statement": "F. Two Posterstime limit per test2 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputYou want to advertise your new business, so you are going to place two posters on a billboard in the city center. The billboard consists of $$$n$$$ vertical panels of width $$$1$$$ and varying integer heights, held together by a horizontal bar. The $$$i$$$-th of the $$$n$$$ panels has height $$$h_i$$$.Initially, all panels hang down from the bar (their top edges lie on it), but before placing the two posters, you are allowed to move each panel up by any integer length, as long as it is still connected to the bar (its bottom edge lies below or on it).After the moves are done, you will place two posters: one below the bar and one above it. They are not allowed to go over the bar and they must be positioned completely inside of the panels.What is the maximum total area the two posters can cover together if you make the optimal moves?Note that you can also place a poster of $$$0$$$ area. This case is equivalent to placing a single poster.InputThe first line of input contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^4$$$) — the number of vertical panels.The second line of input contains $$$n$$$ integers $$$h_1, h_2, ..., h_n$$$ ($$$1 \\\\le h_i \\\\le 10^{12}$$$) — the heights of the $$$n$$$ vertical panels.OutputPrint a single integer — the maximum total area the two posters can cover together.ExamplesInput6 2 2 3 5 4 5Output18Input1 1Output1NoteIn the first sample test, we can choose an upper poster with area $$$12$$$ and a lower poster of area $$$6$$$ as in the image below.In the second sample test, we can cover the whole billboard using a single poster.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "04ec86d9", "template_md5": "35d339e4", "result": "You have a billboard made up of $n$ vertical panels of width 1. Each panel has a different height, $h_1, h_2, ..., h_n$. You can move each panel up by any integer amount, as long as the bottom of the panel stays on or below the horizontal bar at the top.  \n\nYou want to place two posters on the billboard: one above the bar and one below. The posters can't go over the bar and must fit entirely within the panels. What is the largest total area the two posters can cover?"}, {"prompt_md5": "6d0b169f", "template_md5": "465699a0", "result": "You have a series of vertical panels of different heights. You can move each panel up a certain amount. Then you want to place two rectangles, one above and one below a horizontal bar connecting the panels, to cover as much area as possible. What is the maximum area you can cover?"}]}