{"uid": "1638-B", "url": "https://codeforces.com/contest/1638/problem/B", "tags": ["data structures", " math", " sortings"], "title": "1638-B", "statement": "B. Odd Swap Sorttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array $$$a_1, a_2, \\\\dots, a_n$$$. You can perform operations on the array. In each operation you can choose an integer $$$i$$$ ($$$1 \\\\le i < n$$$), and swap elements $$$a_i$$$ and $$$a_{i+1}$$$ of the array, if $$$a_i + a_{i+1}$$$ is odd.Determine whether it can be sorted in non-decreasing order using this operation any number of times.InputEach test contains multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^5$$$) — the number of test cases. Description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$) — the length of the array.The second line of each test case contains $$$n$$$ integers $$$a_1,a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — the elements of the array.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, print\"Yes\"or\"No\"depending on whether you can or can not sort the given array.You may print each letter in any case (for example,\"YES\",\"Yes\",\"yes\",\"yEs\"will all be recognized as positive answer).ExampleInput441 6 31 1424 252 9 6 7 1036 6 6OutputYes No No YesNoteIn the first test case, we can simply swap $$$31$$$ and $$$14$$$ ($$$31 + 14 = 45$$$ which is odd) and obtain the non-decreasing array $$$[1,6,14,31]$$$.In the second test case, the only way we could sort the array is by swapping $$$4$$$ and $$$2$$$, but this is impossible, since their sum $$$4 + 2 = 6$$$ is even.In the third test case, there is no way to make the array non-decreasing.In the fourth test case, the array is already non-decreasing.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9690d90d", "template_md5": "35d339e4", "result": "You are given an array of integers. You can swap any two adjacent elements in the array if the sum of those two elements is odd.  Determine if it is possible to sort the array in non-decreasing order using this operation any number of times.\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the length of the array, $n$.\n    * The second line contains $n$ integers, the elements of the array.\n\nOutput:\n\n* For each test case, print \"Yes\" if the array can be sorted, and \"No\" otherwise."}, {"prompt_md5": "d372e2fe", "template_md5": "465699a0", "result": "You are given a list of numbers. You can swap any two adjacent numbers in the list if the sum of those two numbers is odd.  Can you sort the list in increasing order using this operation?"}]}