{"uid": "164-D", "url": "https://codeforces.com/contest/164/problem/D", "tags": ["binary search", " brute force"], "title": "164-D", "statement": "D. Minimum Diametertime limit per test1.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are givennpoints on the plane. You need to delete exactlykof them(k<n)so that the diameter of the set of the remainingn-kpoints were as small as possible. The diameter of a set of points is the maximum pairwise distance between the points of the set. The diameter of a one point set equals zero.InputThe first input line contains a pair of integersn,k(2 ≤n≤ 1000,1 ≤k≤ 30,k<n) — the numbers of points on the plane and the number of points to delete, correspondingly.Nextnlines describe the points, one per line. Each description consists of a pair of integersxi,yi(0 ≤xi,yi≤ 32000) — the coordinates of thei-th point. The given points can coincide.OutputPrintkdifferent space-separated integers from1ton— the numbers of points to delete. The points are numbered in the order, in which they are given in the input from1ton. You can print the numbers in any order. If there are multiple solutions, print any of them.ExamplesInput5 21 20 02 21 13 3Output5 2Input4 10 00 01 11 1Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "74f8bc1a", "template_md5": "35d339e4", "result": "You are given $n$ points on a plane. You need to remove exactly $k$ of these points ($k < n$) so that the largest distance between any two of the remaining points is as small as possible.  The largest distance between two points is called the diameter.\n\nInput:\n\n* The first line contains two numbers: $n$ (the number of points) and $k$ (the number of points to remove).\n* The next $n$ lines each contain two numbers: $x$ and $y$, representing the coordinates of a point.\n\nOutput:\n\n* Print $k$ different numbers from 1 to $n$. Each number represents the index of a point to remove. \n\n\n\nLet me know if you'd like help with any part of solving this problem!"}, {"prompt_md5": "17ab5732", "template_md5": "465699a0", "result": "You are given a set of points on a plane. You must remove some points from the set to minimize the largest distance between any two remaining points.  What points should you remove?"}]}