{"uid": "1644-A", "url": "https://codeforces.com/contest/1644/problem/A", "tags": ["implementation"], "title": "1644-A", "statement": "A. Doors and Keystime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe knight is standing in front of a long and narrow hallway. A princess is waiting at the end of it.In a hallway there are three doors: a red door, a green door and a blue door. The doors are placed one after another, however, possibly in a different order. To proceed to the next door, the knight must first open the door before.Each door can be only opened with a key of the corresponding color. So three keys: a red key, a green key and a blue key — are also placed somewhere in the hallway. To open the door, the knight should first pick up the key of its color.The knight has a map of the hallway. It can be transcribed as a string, consisting of six characters:R,G,B— denoting red, green and blue doors, respectively;r,g,b— denoting red, green and blue keys, respectively.Each of these six characters appears in the string exactly once.The knight is standing at the beginning of the hallway — on the left on the map.Given a map of the hallway, determine if the knight can open all doors and meet the princess at the end of the hallway.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 720$$$) — the number of testcases.Each testcase consists of a single string. Each character is one ofR,G,B(for the doors),r,g,b(for the keys), and each of them appears exactly once.OutputFor each testcase, printYESif the knight can open all doors. Otherwise, printNO.ExampleInput4rgbBRGRgbrBGbBrRgGrgRGBbOutputYES NO YES NONoteIn the first testcase, the knight first collects all keys, then opens all doors with them.In the second testcase, there is a red door right in front of the knight, but he doesn't have a key for it.In the third testcase, the key to each door is in front of each respective door, so the knight collects the key and uses it immediately three times.In the fourth testcase, the knight can't open the blue door.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ae4a90fe", "template_md5": "35d339e4", "result": "You are given a string of 6 characters representing a hallway. The characters are:\n\n* R, G, B: represent doors (red, green, blue)\n* r, g, b: represent keys (red, green, blue)\n\nThe goal is to determine if it is possible to open all the doors in the hallway.  \n\n**Rules:**\n\n* Each door can only be opened with its corresponding key.\n* The knight starts at the beginning of the hallway.\n* Each character appears only once in the string.\n\n\n**Input:**\n\n* A number *t* representing the number of test cases.\n* For each test case, a string of 6 characters representing the hallway.\n\n**Output:**\n\n* For each test case, print \"YES\" if it is possible to open all the doors, otherwise print \"NO\"."}, {"prompt_md5": "c9cd68bc", "template_md5": "465699a0", "result": "You are given a sequence of 6 characters representing a hallway with doors and keys.  Each door has a corresponding key of the same color. Determine if it is possible to open all the doors in the hallway."}]}