{"uid": "1656-B", "url": "https://codeforces.com/contest/1656/problem/B", "tags": ["data structures", " greedy", " math", " two pointers"], "title": "1656-B", "statement": "B. Subtract Operationtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a list of $$$n$$$ integers. You can perform the following operation: you choose an element $$$x$$$ from the list, erase $$$x$$$ from the list, and subtract the value of $$$x$$$ from all the remaining elements. Thus, in one operation, the length of the list is decreased by exactly $$$1$$$.Given an integer $$$k$$$ ($$$k>0$$$), find if there is some sequence of $$$n-1$$$ operations such that, after applying the operations, the only remaining element of the list is equal to $$$k$$$.InputThe input consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) — the number of test cases. Description of the test cases follows.The first line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$2 \\\\leq n \\\\leq 2\\\\cdot 10^5$$$, $$$1 \\\\leq k \\\\leq 10^9$$$), the number of integers in the list, and the target value, respectively.The second line of each test case contains the $$$n$$$ integers of the list $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$-10^9 \\\\leq a_i \\\\leq 10^9$$$).It is guaranteed that the sum of $$$n$$$ over all test cases is not greater that $$$2 \\\\cdot 10^5$$$.OutputFor each test case, printYESif you can achieve $$$k$$$ with a sequence of $$$n-1$$$ operations. Otherwise, printNO.You may print each letter in any case (for example, \"YES\", \"Yes\", \"yes\", \"yEs\" will all be recognized as a positive answer).ExampleInput44 54 2 2 75 41 9 1 3 42 1717 02 1718 18OutputYES NO YES NONoteIn the first example we have the list $$$\\\\{4, 2, 2, 7\\\\}$$$, and we have the target $$$k = 5$$$. One way to achieve it is the following: first we choose the third element, obtaining the list $$$\\\\{2, 0, 5\\\\}$$$. Next we choose the first element, obtaining the list $$$\\\\{-2, 3\\\\}$$$. Finally, we choose the first element, obtaining the list $$$\\\\{5\\\\}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b9b72715", "template_md5": "465699a0", "result": "You are given a list of numbers. You can repeatedly remove a number from the list and subtract that number from all the remaining numbers.  Can you make the list contain only one number, which is a target number?"}, {"prompt_md5": "626f837e", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers. You can repeatedly remove an integer from the list and subtract that integer from all the remaining integers.  \n\nYour goal is to determine if you can perform $n-1$ of these operations to make the only remaining integer equal to a target value $k$.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains two integers, $n$ (the number of integers in the list) and $k$ (the target value).\n    * The second line contains the $n$ integers in the list.\n\n**Output:**\n\nFor each test case, print \"YES\" if you can achieve the target value $k$ with the given operations, otherwise print \"NO\"."}]}