{"uid": "1659-A", "url": "https://codeforces.com/contest/1659/problem/A", "tags": ["constructive algorithms", " greedy", " implementation", " math"], "title": "1659-A", "statement": "A. Red Versus Bluetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputTeam Red and Team Blue competed in a competitive FPS. Their match was streamed around the world. They played a series of $$$n$$$ matches.In the end, it turned out Team Red won $$$r$$$ times and Team Blue won $$$b$$$ times. Team Blue was less skilled than Team Red, so $$$b$$$ wasstrictly lessthan $$$r$$$.You missed the stream since you overslept, but you think that the match must have been neck and neck since so many people watched it. So you imagine a string of length $$$n$$$ where the $$$i$$$-th character denotes who won the $$$i$$$-th match  — it isRif Team Red won orBif Team Blue won. You imagine the string was such that themaximumnumber of times a teamwon in a rowwasas small as possible. For example, in the series of matchesRBBRRRB, Team Red won $$$3$$$ times in a row, which is the maximum.You must find a string satisfying the above conditions. If there are multiple answers, print any.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$)  — the number of test cases.Each test case has a single line containing three integers $$$n$$$, $$$r$$$, and $$$b$$$ ($$$3 \\\\leq n \\\\leq 100$$$; $$$1 \\\\leq b < r \\\\leq n$$$, $$$r+b=n$$$).OutputFor each test case, output a single line containing a string satisfying the given conditions. If there are multiple answers, print any.ExamplesInput37 4 36 5 119 13 6OutputRBRBRBR RRRBRR RRBRRBRRBRRBRRBRRBRInput63 2 110 6 411 6 510 9 110 8 211 9 2OutputRBR RRBRBRBRBR RBRBRBRBRBR RRRRRBRRRR RRRBRRRBRR RRRBRRRBRRRNoteThe first test case of the first example gives the optimal answer for the example in the statement. The maximum number of times a team wins in a row inRBRBRBRis $$$1$$$. We cannot minimize it any further.The answer for the second test case of the second example isRRBRBRBRBR. The maximum number of times a team wins in a row is $$$2$$$, given byRRat the beginning. We cannot minimize the answer any further.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8a4b2101", "template_md5": "35d339e4", "result": "You are given three integers $n$, $r$, and $b$ ($3 \\le n \\le 100$; $1 \\le b < r \\le n$, $r+b=n$). \n\nYou need to find a string of length $n$ where:\n\n*  'R' represents a win for Team Red.\n*  'B' represents a win for Team Blue.\n\nThe string should satisfy these conditions:\n\n* Team Red wins $r$ times.\n* Team Blue wins $b$ times.\n* The maximum number of consecutive wins for either team is as small as possible.\n\nPrint any such string."}, {"prompt_md5": "e0a6cfcd", "template_md5": "465699a0", "result": "You are given two numbers,  'r' and 'b'.  You need to create a string of length 'r+b' where 'r' characters are 'R' and 'b' characters are 'B'. The string should have the minimum possible number of consecutive 'R's or 'B's. Print one such string."}]}