{"uid": "166-D", "url": "https://codeforces.com/contest/166/problem/D", "tags": ["dp", " graph matchings", " greedy", " sortings", " two pointers"], "title": "166-D", "statement": "D. Shoe Storetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe warehouse in your shop hasnshoe pairs. Each pair is characterized by two integers: its priceciand its sizesi. We know that on this very day all numberssiare different, that is, there is no more than one pair of each size.The shop hasmcustomers who came at the same time. The customer numberihasdimoney and the size of his feet equalsli. The customer numberican buy the pair numberj, ifcj≤di, and also ifli=sjorli=sj- 1; that is, it is necessary that he has enough money to pay for the shoes. It is also necessary that the size of his feet equals to or is less by1than the size of the shoes he chooses.Your task is to sell some customers pairs of shoes (a pair per person) so as to maximize the sum of the sold pairscjthat is, the profit. It is guaranteed that each customer buys no more than one pair and each pair will be bought by no more than one customer.InputThe first input line contains the only integern(1 ≤n≤ 105) — the number of shoe pairs in the warehouse. Thennlines contain the descriptions of pairs of shoes as two integersciandsi(1 ≤ci,si≤ 109), the numbers are separated by a space. It is guaranteed that all numberssiare different.The next line contains an integerm(1 ≤m≤ 105) — the number of customers in the shop. Nextmlines contain the customers' descriptions as two integersdiandli(1 ≤di,li≤ 109), the numbers are separated by a space.OutputIn the first line print the only integer — the maximum profit you can get from selling shoes. In the second line print an integerk— the number of shoe pairs you will sell. In the followingklines print the descriptions of the sold pairs — two space-separated integers where the first number is the customer's number and the second number is the number of the shoes the customer will buy.You can print pairs of numbers \"the customer's number and the shoes' number\" in any order, the customers and the pairs of shoes are numbered starting from1in the order in which they are given in the input. If there are several optimal answers, you are allowed to print any of them.Please do not use the %lld specificator to read or write 64-bit numbers in С++. It is preferred to use thecin,coutstreams or the %I64d specificator instead.ExamplesInput310 130 220 3220 120 2Output3022 31 1Input310 420 530 6270 450 5Output5022 31 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fd11f94f", "template_md5": "35d339e4", "result": "You have $n$ pairs of shoes for sale, each with a price $c_i$ and a size $s_i$.  There are $m$ customers, each with a budget $d_i$ and a foot size $l_i$.  A customer can buy a pair of shoes if:\n\n* They have enough money ($d_i \\ge c_i$)\n* Their foot size is either equal to the shoe size ($l_i = s_i$) or one size smaller ($l_i = s_i - 1$).\n\nYour goal is to sell as many pairs of shoes as possible to maximize the total revenue. Each customer can buy only one pair, and each pair can be bought by only one customer.\n\nOutput the maximum revenue you can achieve and list the pairs of shoes sold (customer number and shoe number)."}, {"prompt_md5": "22e2c154", "template_md5": "465699a0", "result": "You have a warehouse with many items, each with a price and a size. Customers arrive with money and a desired size.  A customer can buy an item if they have enough money and the item's size is either their desired size or one size smaller.  \n\nYour goal is to sell as many items as possible to maximize the total price of the sold items.  You can only sell each item to one customer, and each customer can only buy one item."}]}