{"uid": "166-E", "url": "https://codeforces.com/contest/166/problem/E", "tags": ["dp", " math", " matrices"], "title": "166-E", "statement": "E. Tetrahedrontime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are given a tetrahedron. Let's mark its vertices with lettersA,B,CandDcorrespondingly.An ant is standing in the vertexDof the tetrahedron. The ant is quite active and he wouldn't stay idle. At each moment of time he makes a step from one vertex to another one along some edge of the tetrahedron. The ant just can't stand on one place.You do not have to do much to solve the problem: your task is to count the number of ways in which the ant can go from the initial vertexDto itself in exactlynsteps. In other words, you are asked to find out the number of different cyclic paths with the length ofnfrom vertexDto itself. As the number can be quite large, you should print it modulo1000000007(109+ 7).InputThe first line contains the only integern(1 ≤n≤ 107) — the required length of the cyclic path.OutputPrint the only integer — the required number of ways modulo1000000007(109+ 7).ExamplesInput2Output3Input4Output21NoteThe required paths in the first sample are:D-A-DD-B-DD-C-D", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fb1f6a2f", "template_md5": "35d339e4", "result": "You are given a tetrahedron (a 3-dimensional shape with four triangular faces).  An ant starts at one of the corners (vertices) of the tetrahedron. The ant can move from one corner to another corner along an edge of the tetrahedron. The ant cannot stay in the same corner.\n\nYour task is to find the number of ways the ant can move from its starting corner back to the same corner in exactly $n$ steps, where $n$ is a given positive integer.  Since the number of ways can be very large, you should find the answer modulo 1000000007 (10^9 + 7)."}, {"prompt_md5": "9668be13", "template_md5": "465699a0", "result": "You are given a four-sided pyramid.  An object moves between the four corners of the pyramid, always moving to a different corner each time.  How many ways are there for the object to return to its starting corner after taking a specific number of steps?  The answer should be a number less than 1,000,000,007."}]}