{"uid": "1672-C", "url": "https://codeforces.com/contest/1672/problem/C", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "1672-C", "statement": "C. Unequal Arraytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array $$$a$$$ of length $$$n$$$. We define theequalityof the array as the number of indices $$$1 \\\\le i \\\\le n - 1$$$ such that $$$a_i = a_{i + 1}$$$. We are allowed to do the following operation:Select two integers $$$i$$$ and $$$x$$$ such that $$$1 \\\\le i \\\\le n - 1$$$ and $$$1 \\\\le x \\\\le 10^9$$$. Then, set $$$a_i$$$ and $$$a_{i + 1}$$$ to be equal to $$$x$$$.Find the minimum number of operations needed such that the equality of the array is less than or equal to $$$1$$$.InputEach test contains multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) — the number of test cases. The description of the test cases follows.The first line of each test case contains an integer $$$n$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10 ^ 5$$$) — the length of array $$$a$$$.The second line of each test case contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — elements of the array.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10 ^ 5$$$OutputFor each test case, print the minimum number of operations needed.ExampleInput451 1 1 1 152 1 1 1 261 1 2 3 3 461 2 1 4 5 4Output2 1 2 0NoteIn the first test case, we can select $$$i=2$$$ and $$$x=2$$$ to form $$$[1, 2, 2, 1, 1]$$$. Then, we can select $$$i=3$$$ and $$$x=3$$$ to form $$$[1, 2, 3, 3, 1]$$$.In the second test case, we can select $$$i=3$$$ and $$$x=100$$$ to form $$$[2, 1, 100, 100, 2]$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0087e970", "template_md5": "35d339e4", "result": "You are given an array of numbers.  The \"equality\" of the array is the number of times two consecutive numbers in the array are the same. You can change two consecutive numbers in the array to be the same number. Find the fewest changes needed so that the equality of the array is less than or equal to 1.\n\n**Input:**\n\n* The first line contains the number of test cases.\n* Each test case starts with the length of the array.\n* The next line contains the numbers in the array.\n\n**Output:**\n\n* For each test case, print the fewest changes needed."}, {"prompt_md5": "fcaafb20", "template_md5": "465699a0", "result": "You are given a list of numbers. You can change any two adjacent numbers in the list to the same value. What is the fewest changes needed so that no two numbers in a row are the same?"}]}