{"uid": "1672-A", "url": "https://codeforces.com/contest/1672/problem/A", "tags": ["games", " implementation", " math"], "title": "1672-A", "statement": "A. Log Choppingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ logs, the $$$i$$$-th log has a length of $$$a_i$$$ meters. Since chopping logs is tiring work, errorgorn and maomao90 have decided to play a game.errorgorn and maomao90 will take turns chopping the logs witherrorgorn chopping first. On his turn, the player will pick a log and chop it into $$$2$$$ pieces. If the length of the chosen log is $$$x$$$, and the lengths of the resulting pieces are $$$y$$$ and $$$z$$$, then $$$y$$$ and $$$z$$$ have to bepositive integers, and $$$x=y+z$$$ must hold. For example, you can chop a log of length $$$3$$$ into logs of lengths $$$2$$$ and $$$1$$$, but not into logs of lengths $$$3$$$ and $$$0$$$, $$$2$$$ and $$$2$$$, or $$$1.5$$$ and $$$1.5$$$.The player who is unable to make a chop will be the loser. Assuming that both errorgorn and maomao90 play optimally, who will be the winner?InputEach test contains multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$)  — the number of test cases. The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 50$$$)  — the number of logs.The second line of each test case contains $$$n$$$ integers $$$a_1,a_2, \\\\ldots, a_n$$$ ($$$1 \\\\leq a_i \\\\leq 50$$$)  — the lengths of the logs.Note that there is no bound on the sum of $$$n$$$ over all test cases.OutputFor each test case, print \"errorgorn\" if errorgorn wins or \"maomao90\" if maomao90 wins. (Output without quotes).ExampleInput242 4 2 111Outputerrorgorn maomao90NoteIn the first test case, errorgorn will be the winner. An optimal move is to chop the log of length $$$4$$$ into $$$2$$$ logs of length $$$2$$$. After this there will only be $$$4$$$ logs of length $$$2$$$ and $$$1$$$ log of length $$$1$$$.After this, the only move any player can do is to chop any log of length $$$2$$$ into $$$2$$$ logs of length $$$1$$$. After $$$4$$$ moves, it will be maomao90's turn and he will not be able to make a move. Therefore errorgorn will be the winner.In the second test case, errorgorn will not be able to make a move on his first turn and will immediately lose, making maomao90 the winner.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9633bc3d", "template_md5": "465699a0", "result": "You are given a list of log lengths. Two players take turns chopping logs. On each turn, a player must split a log into two smaller positive integer lengths that add up to the original log's length. The first player unable to make a valid chop loses. Determine the winner if both players play optimally."}, {"prompt_md5": "c07f24e1", "template_md5": "35d339e4", "result": "You are given a list of $n$ logs, each with a length $a_i$ meters. Two players take turns chopping the logs. On each turn, a player chooses a log and divides it into two smaller logs, where the lengths of the two smaller logs must be positive integers and their sum equals the original log's length. The player who cannot make a valid chop loses.  Determine which player will win if both play optimally. \n\nInput:\n\n* The first line contains $t$ (the number of test cases).\n* For each test case:\n    * The first line contains $n$ (the number of logs).\n    * The second line contains $n$ integers $a_1, a_2, ..., a_n$ (the lengths of the logs).\n\nOutput:\n\nFor each test case, print \"Player 1\" if Player 1 wins, or \"Player 2\" if Player 2 wins."}]}