{"uid": "1674-E", "url": "https://codeforces.com/contest/1674/problem/E", "tags": ["binary search", " brute force", " constructive algorithms", " greedy", " math"], "title": "1674-E", "statement": "E. Breaking the Walltime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMonocarp plays \"Rage of Empires II: Definitive Edition\" — a strategic computer game. Right now he's planning to attack his opponent in the game, but Monocarp's forces cannot enter the opponent's territory since the opponent has built a wall.The wall consists of $$$n$$$ sections, aligned in a row. The $$$i$$$-th section initially has durability $$$a_i$$$. If durability of some section becomes $$$0$$$ or less, this section is considered broken.To attack the opponent, Monocarp needs to break at least two sections of the wall (any two sections: possibly adjacent, possibly not). To do this, he plans to use an onager — a special siege weapon. The onager can be used to shoot any section of the wall; the shot deals $$$2$$$ damage to the target section and $$$1$$$ damage to adjacent sections. In other words, if the onager shoots at the section $$$x$$$, then the durability of the section $$$x$$$ decreases by $$$2$$$, and the durability of the sections $$$x - 1$$$ and $$$x + 1$$$ (if they exist) decreases by $$$1$$$ each.Monocarp can shoot at any sections any number of times,he can even shoot at broken sections.Monocarp wants to calculate the minimum number of onager shots needed to break at least two sections. Help him!InputThe first line contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the number of sections.The second line contains the sequence of integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^6$$$), where $$$a_i$$$ is the initial durability of the $$$i$$$-th section.OutputPrint one integer — the minimum number of onager shots needed to break at least two sections of the wall.ExamplesInput5 20 10 30 10 20Output10Input3 1 8 1Output1Input6 7 6 6 8 5 8Output4Input6 14 3 8 10 15 4Output4Input4 1 100 100 1Output2Input3 40 10 10Output7NoteIn the first example, it is possible to break the $$$2$$$-nd and the $$$4$$$-th section in $$$10$$$ shots, for example, by shooting the third section $$$10$$$ times. After that, the durabilities become $$$[20, 0, 10, 0, 20]$$$. Another way of doing it is firing $$$5$$$ shots at the $$$2$$$-nd section, and another $$$5$$$ shots at the $$$4$$$-th section. After that, the durabilities become $$$[15, 0, 20, 0, 15]$$$.In the second example, it is enough to shoot the $$$2$$$-nd section once. Then the $$$1$$$-st and the $$$3$$$-rd section will be broken.In the third example, it is enough to shoot the $$$2$$$-nd section twice (then the durabilities become $$$[5, 2, 4, 8, 5, 8]$$$), and then shoot the $$$3$$$-rd section twice (then the durabilities become $$$[5, 0, 0, 6, 5, 8]$$$). So, four shots are enough to break the $$$2$$$-nd and the $$$3$$$-rd section.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5d05f3a1", "template_md5": "35d339e4", "result": "You are given a wall with $n$ sections. Each section has a durability value $a_i$.  \n\nYou have a weapon that can shoot at a section, dealing $2$ damage to the target section and $1$ damage to the adjacent sections (if they exist).\n\nYour goal is to break at least two sections of the wall. Find the minimum number of shots needed to achieve this."}, {"prompt_md5": "67db4f2d", "template_md5": "465699a0", "result": "You have a line of objects with different durability levels. You can attack an object, damaging it and its neighbors.  What is the minimum number of attacks needed to break at least two objects?"}]}