{"uid": "1675-G", "url": "https://codeforces.com/contest/1675/problem/G", "tags": ["dp"], "title": "1675-G", "statement": "G. Sorting Pancakestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputNastya baked $$$m$$$ pancakes and spread them on $$$n$$$ dishes. The dishes are in a row and numbered from left to right. She put $$$a_i$$$ pancakes on the dish with the index $$$i$$$.Seeing the dishes, Vlad decided to bring order to the stacks and move some pancakes. In one move, he can shift one pancake from any dish to the closest one, that is, select the dish $$$i$$$ ($$$a_i > 0$$$) and do one of the following:if $$$i > 1$$$, put the pancake on a dish with the previous index, after this move $$$a_i = a_i - 1$$$ and $$$a_{i - 1} = a_{i - 1} + 1$$$;if $$$i < n$$$, put the pancake on a dish with the following index, after this move $$$a_i = a_i - 1$$$ and $$$a_{i + 1} = a_{i + 1} + 1$$$.Vlad wants to make the array $$$a$$$non-increasing, after moving as few pancakes as possible. Help him find the minimum number of moves needed for this.The array $$$a=[a_1, a_2,\\\\dots,a_n]$$$ is called non-increasing if $$$a_i \\\\ge a_{i+1}$$$ for all $$$i$$$ from $$$1$$$ to $$$n-1$$$.InputThe first line of the input contains two numbers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 250$$$) — the number of dishes and the number of pancakes, respectively.The second line contains $$$n$$$ numbers $$$a_i$$$ ($$$0 \\\\le a_i \\\\le m$$$), the sum of all $$$a_i$$$ is equal to $$$m$$$.OutputPrint a single number: the minimum number of moves required to make the array $$$a$$$ non-increasing.ExamplesInput6 19 5 3 2 3 3 3Output2Input3 6 3 2 1Output0Input3 6 2 1 3Output1Input6 19 3 4 3 3 5 1Output3Input10 1 0 0 0 0 0 0 0 0 0 1Output9NoteIn the first example, you first need to move the pancake from the dish $$$1$$$, after which $$$a = [4, 4, 2, 3, 3, 3]$$$. After that, you need to move the pancake from the dish $$$2$$$ to the dish $$$3$$$ and the array will become non-growing $$$a = [4, 3, 3, 3, 3, 3]$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2269a3a2", "template_md5": "35d339e4", "result": "You are given an array $a$ of length $n$ representing the number of pancakes on each of $n$ dishes. The sum of all elements in the array is $m$.  You can perform the following operation:\n\n* Take a pancake from dish $i$ ($a_i > 0$) and move it to either the dish to its left ($i-1$) or the dish to its right ($i+1$).\n\nThe goal is to make the array non-increasing (i.e., $a_i \\ge a_{i+1}$ for all $i$ from 1 to $n-1$) using the minimum number of moves. Find this minimum number of moves."}, {"prompt_md5": "15c29890", "template_md5": "465699a0", "result": "You are given a row of containers, each holding a number of items. You can move one item from a container to its immediate neighbor.  Find the fewest moves needed to arrange the items so that each container has at least as many items as the one next to it."}]}