{"uid": "1675-F", "url": "https://codeforces.com/contest/1675/problem/F", "tags": ["dfs and similar", " dp", " greedy", " trees"], "title": "1675-F", "statement": "F. Vlad and Unfinished Businesstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVlad and Nastya live in a city consisting of $$$n$$$ houses and $$$n-1$$$ road. From each house, you can get to the other by moving only along the roads. That is, the city is a tree.Vlad lives in a house with index $$$x$$$, and Nastya lives in a house with index $$$y$$$. Vlad decided to visit Nastya. However, he remembered that he had postponed for later $$$k$$$ things that he has to do before coming to Nastya. To do the $$$i$$$-th thing, he needs to come to the $$$a_i$$$-th house, things can be done in any order. In $$$1$$$ minute, he can walk from one house to another if they are connected by a road.Vlad does not really like walking, so he is interested what is the minimum number of minutes he has to spend on the road to do all things and then come to Nastya. Houses $$$a_1, a_2, \\\\dots, a_k$$$ he can visit in any order. He can visit any house multiple times (if he wants).InputThe first line of input contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of input test cases. There is an empty line before each test case.The first line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 2\\\\cdot 10^5$$$) — the number of houses and things, respectively.The second line of each test case contains two integers $$$x$$$ and $$$y$$$ ($$$1 \\\\le x, y \\\\le n$$$) — indices of the houses where Vlad and Nastya live, respectively.The third line of each test case contains $$$k$$$ integers $$$a_1, a_2, \\\\dots, a_k$$$ ($$$1 \\\\le a_i \\\\le n$$$) — indices of houses Vlad need to come to do things.The following $$$n-1$$$ lines contain description of city, each line contains two integers $$$v_j$$$ and $$$u_j$$$ ($$$1 \\\\le u_j, v_j \\\\le n$$$) — indices of houses connected by road $$$j$$$.It is guaranteed that the sum of $$$n$$$ for all cases does not exceed $$$2\\\\cdot10^5$$$.OutputOutput $$$t$$$ lines, each of which contains the answer to the corresponding test case of input. As an answer output single integer — the minimum number of minutes Vlad needs on the road to do all the things and come to Nastya.ExampleInput33 11 321 31 26 43 51 6 2 11 33 43 55 65 26 23 25 31 33 43 55 65 2Output3 7 2NoteTree and best path for the first test case:$$$1 \\\\rightarrow 2 \\\\rightarrow 1 \\\\rightarrow 3$$$Tree and best path for the second test case:$$$3 \\\\rightarrow 1 \\\\rightarrow 3 \\\\rightarrow 5 \\\\rightarrow 2 \\\\rightarrow 5 \\\\rightarrow 6 \\\\rightarrow 5$$$Tree and best path for the third test case:$$$3 \\\\rightarrow 5 \\\\rightarrow 2$$$", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3ecc4745", "template_md5": "35d339e4", "result": "You are given a tree with $n$ houses numbered from 1 to $n$. There are $n-1$ roads connecting these houses.  \n\nYou need to find the minimum time it takes to visit $k$ specific houses ($a_1, a_2, ..., a_k$) and then reach house $y$ starting from house $x$. You can visit the houses in any order.  The time it takes to travel between two connected houses is 1 minute. \n\n\nInput:\n\n* The first line contains the number of test cases $t$.\n* For each test case:\n    * The first line contains two integers $n$ and $k$.\n    * The second line contains two integers $x$ and $y$.\n    * The third line contains $k$ integers $a_1, a_2, ..., a_k$.\n    * The next $n-1$ lines each contain two integers $v_j$ and $u_j$, representing a road between houses $v_j$ and $u_j$.\n\nOutput:\n\n* For each test case, output a single integer representing the minimum time required."}, {"prompt_md5": "dabc5711", "template_md5": "465699a0", "result": "You are given a tree (a connected graph with no cycles) and a list of houses to visit. You need to find the shortest path that starts at one house, visits all the houses on the list, and ends at another specified house.  You can visit houses in any order."}]}