{"uid": "168-A", "url": "https://codeforces.com/contest/168/problem/A", "tags": ["implementation", " math"], "title": "168-A", "statement": "A. Wizards and Demonstrationtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSome country is populated by wizards. They want to organize a demonstration.There arenpeople living in the city,xof them are the wizards who will surely go to the demonstration. Other city people (n-xpeople) do not support the wizards and aren't going to go to the demonstration. We know that the city administration will react only to the demonstration involving at leastypercent of the city people. Having considered the matter, the wizards decided to create clone puppets which can substitute the city people on the demonstration.So all in all, the demonstration will involve only the wizards and their puppets. The city administration cannot tell the difference between a puppet and a person, so, as they calculate the percentage, the administration will consider the city to be consisting of onlynpeople and not containing any clone puppets.Help the wizards and find the minimum number of clones to create to that the demonstration had no less thanypercent of the city people.InputThe first line contains three space-separated integers,n,x,y(1 ≤n,x,y≤ 104,x≤n) — the number of citizens in the city, the number of wizards and the percentage the administration needs, correspondingly.Please note thatycan exceed 100 percent, that is, the administration wants to see on a demonstration more people that actually live in the city (>n).OutputPrint a single integer — the answer to the problem, the minimum number of clones to create, so that the demonstration involved no less thanypercent ofn(the real total city population).ExamplesInput10 1 14Output1Input20 10 50Output0Input1000 352 146Output1108NoteIn the first sample it is necessary that at least 14% of 10 people came to the demonstration. As the number of people should be integer, then at least two people should come. There is only one wizard living in the city and he is going to come. That isn't enough, so he needs to create one clone.In the second sample 10 people should come to the demonstration. The city has 10 wizards. They will all come to the demonstration, so nobody has to create any clones.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9b79a3da", "template_md5": "35d339e4", "result": "There are $n$ people in a city. $x$ of them are wizards who will attend a demonstration. The city administration will only react if at least $y\\%$ of the city's population attends the demonstration.\n\nThe wizards can create clones to make up the difference.  The administration cannot tell the difference between a clone and a real person.\n\nFind the minimum number of clones the wizards need to create so that at least $y\\%$ of the city's population attends the demonstration."}, {"prompt_md5": "48a7c6b4", "template_md5": "465699a0", "result": "You have a group of people and a target percentage.  You need to figure out the minimum number of additional people you need to add to reach that target percentage."}]}