{"uid": "1680-F", "url": "https://codeforces.com/contest/1680/problem/F", "tags": ["dfs and similar", " divide and conquer", " dsu", " graphs", " trees"], "title": "1680-F", "statement": "F. Lenient Vertex Covertime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given a simple connected undirected graph, consisting of $$$n$$$ vertices and $$$m$$$ edges. The vertices are numbered from $$$1$$$ to $$$n$$$.A vertex cover of a graph is a set of vertices such that each edge has at least one of its endpoints in the set.Let's call alenientvertex cover such a vertex cover thatat most oneedge in it has both endpoints in the set.Find alenientvertex cover of a graph or report that there is none. If there are multiple answers, then print any of them.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of testcases.The first line of each testcase contains two integers $$$n$$$ and $$$m$$$ ($$$2 \\\\le n \\\\le 10^6$$$; $$$n - 1 \\\\le m \\\\le \\\\min(10^6, \\\\frac{n \\\\cdot (n - 1)}{2})$$$) — the number of vertices and the number of edges of the graph.Each of the next $$$m$$$ lines contains two integers $$$v$$$ and $$$u$$$ ($$$1 \\\\le v, u \\\\le n$$$; $$$v \\\\neq u$$$) — the descriptions of the edges.For each testcase, the graph is connected and doesn't have multiple edges. The sum of $$$n$$$ over all testcases doesn't exceed $$$10^6$$$. The sum of $$$m$$$ over all testcases doesn't exceed $$$10^6$$$.OutputFor each testcase, the first line should containYESif alenientvertex cover exists, andNOotherwise. If it exists, the second line should contain a binary string $$$s$$$ of length $$$n$$$, where $$$s_i = 1$$$ means that vertex $$$i$$$ is in the vertex cover, and $$$s_i = 0$$$ means that vertex $$$i$$$ isn't.If there are multiple answers, then print any of them.ExamplesInput46 51 32 43 43 54 64 61 22 33 41 41 32 48 111 32 43 54 65 76 81 23 45 67 87 24 51 22 33 41 32 4OutputYES 001100 NO YES 01100110 YES 0110Input110 159 43 46 41 28 28 37 29 57 85 101 42 105 35 72 9OutputYES 0101100100Input110 197 95 33 41 69 41 410 57 19 28 37 310 92 109 83 21 510 79 51 2OutputYES 1010000011NoteHere are the graphs from the first example. The vertices in thelenientvertex covers are marked red.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c4425ba2", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ vertices and $m$ edges.  A vertex cover is a set of vertices where every edge has at least one endpoint in the set.\n\nFind a vertex cover where at most one edge has both endpoints in the set. If such a vertex cover exists, output \"YES\" followed by a binary string of length $n$ where a \"1\" indicates the vertex is in the cover and a \"0\" indicates it is not. If no such vertex cover exists, output \"NO\"."}, {"prompt_md5": "6626bdfd", "template_md5": "465699a0", "result": "You are given a connected network of points.  Some points are connected by lines.  Find a set of points such that every line has at least one of its endpoints in the set.  The set must also have at most one line where both endpoints are in the set.  If such a set exists, output \"YES\" and list the points in the set. Otherwise, output \"NO\"."}]}