{"uid": "1680-C", "url": "https://codeforces.com/contest/1680/problem/C", "tags": ["binary search", " greedy", " strings", " two pointers"], "title": "1680-C", "statement": "C. Binary Stringtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$ consisting of characters0and/or1.You have to remove several (possibly zero) characters from the beginning of the string, and then several (possibly zero) characters from the end of the string.The string may become empty after the removals. The cost of the removal is themaximumof the following two values:the number of characters0left in the string;the number of characters1removed from the string.What is theminimumcost of removal you can achieve?InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Each test case consists of one line containing the string $$$s$$$ ($$$1 \\\\le |s| \\\\le 2 \\\\cdot 10^5$$$), consisting of characters0and/or1.The total length of strings $$$s$$$ in all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, print one integer — the minimum cost of removal you can achieve.ExampleInput510111011010010010010010000111111000001111Output1 3 0 0 0NoteConsider the test cases of the example:in the first test case, it's possible to remove two characters from the beginning and one character from the end. Only one1is deleted, only one0remains, so the cost is $$$1$$$;in the second test case, it's possible to remove three characters from the beginning and six characters from the end. Two characters0remain, three characters1are deleted, so the cost is $$$3$$$;in the third test case, it's optimal to remove four characters from the beginning;in the fourth test case, it's optimal to remove the whole string;in the fifth test case, it's optimal to leave the string as it is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3907009c", "template_md5": "35d339e4", "result": "You are given a string consisting of 0s and 1s. You can remove characters from the beginning and end of the string. The cost of removing characters is the maximum of:\n\n* The number of 0s remaining in the string.\n* The number of 1s removed from the string.\n\nWhat is the minimum cost you can achieve?"}, {"prompt_md5": "ec89a910", "template_md5": "465699a0", "result": "You are given a string of 0s and 1s.  You can remove characters from the beginning and end of the string. The cost of removing characters is the maximum of the number of 0s left in the string and the number of 1s removed. What is the lowest cost you can achieve?"}]}