{"uid": "1682-D", "url": "https://codeforces.com/contest/1682/problem/D", "tags": ["constructive algorithms", " implementation", " trees"], "title": "1682-D", "statement": "D. Circular Spanning Treetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ nodes arranged in a circle numbered from $$$1$$$ to $$$n$$$ in the clockwise order. You are also given a binary string $$$s$$$ of length $$$n$$$.Your task is to construct a tree on the given $$$n$$$ nodes satisfying the two conditions below or report that there such tree does not exist:For each node $$$i$$$ $$$(1 \\\\le i \\\\le n)$$$, the degree of node is even if $$$s_i = 0$$$ and odd if $$$s_i = 1$$$.No two edges of the tree intersect internally in the circle. The edges are allowed to intersect on the circumference.Note that all edges are drawn as straight line segments. For example, edge $$$(u, v)$$$ in the tree is drawn as a line segment connecting $$$u$$$ and $$$v$$$ on the circle.A tree on $$$n$$$ nodes is a connected graph with $$$n - 1$$$ edges.InputThe input consists of multiple test cases. The first line contains a single integer $$$t$$$ $$$(1 \\\\leq t \\\\leq 2\\\\cdot 10^4)$$$  — the number of test cases. Description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ $$$(2 \\\\leq n \\\\leq 2\\\\cdot 10^5)$$$  — the number of nodes.The second line of each test case contains a binary string $$$s$$$ of length $$$n$$$.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2\\\\cdot 10^5$$$.OutputFor each test case, if there does not exist a tree that satisfies the given conditions, then output \"NO\" (without quotes), otherwise output \"YES\" followed by the description of tree.You can output each letter in any case (for example, \"YES\", \"Yes\", \"yes\", \"yEs\", \"yEs\" will be recognized as a positive answer).If there exists a tree, then output $$$n - 1$$$ lines, each containing two integers $$$u$$$ and $$$v$$$ $$$(1 \\\\leq u,v \\\\leq n, u \\\\neq v)$$$ denoting an edge between $$$u$$$ and $$$v$$$ in the tree. If there are multiple possible answers, output any.ExampleInput3401102106110110OutputYES 2 1 3 4 1 4 NO YES 2 3 1 2 5 6 6 2 3 4NoteIn the first test case, the tree looks as follows:In the second test case, there is only one possible tree with an edge between $$$1$$$ and $$$2$$$, and it does not satisfy the degree constraints.In the third test case,The tree on the left satisfies the degree constraints but the edges intersect internally, therefore it is not a valid tree, while the tree on the right is valid.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8773d8ce", "template_md5": "35d339e4", "result": "You are given a circle with $n$ points numbered from 1 to $n$. Each point has a binary value (0 or 1) associated with it.\n\nYou need to build a tree on these points following these rules:\n\n* **Degree Rule:**\n    * If the binary value at a point is 0, the point must have an even number of connections (edges) to other points in the tree.\n    * If the binary value at a point is 1, the point must have an odd number of connections.\n\n* **No Internal Intersection:** The lines connecting the points in the tree cannot cross each other inside the circle. They can intersect only at the points themselves (on the circumference).\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of points, $n$.\n    * The second line contains a binary string of length $n$, where each character represents the binary value of a point.\n\n**Output:**\n\n* For each test case:\n    * If it's impossible to build a tree following the rules, output \"NO\".\n    * If it's possible, output \"YES\" followed by $n-1$ lines. Each line should contain two numbers, representing an edge between two points in the tree.\n\n\n\nLet me know if you have any other questions."}, {"prompt_md5": "2a53d458", "template_md5": "465699a0", "result": "You are given a circle with numbered points. Each point has a binary value (0 or 1). You need to connect the points with lines to form a tree, where:\n\n*  Points with value 0 must have an even number of connecting lines.\n*  Points with value 1 must have an odd number of connecting lines.\n*  No two lines can cross inside the circle.\n\nDetermine if such a tree can be built. If yes, show one possible arrangement of the lines."}]}