{"uid": "1684-A", "url": "https://codeforces.com/contest/1684/problem/A", "tags": ["constructive algorithms", " games", " math", " strings"], "title": "1684-A", "statement": "A. Digit Minimizationtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is an integer $$$n$$$without zerosin its decimal representation. Alice and Bob are playing a game with this integer. Alice starts first. They play the game in turns.On her turn, Alicemustswap any two digits of the integer that are on different positions. Bob on his turn always removes the last digit of the integer. The game ends when there is only one digit left.You have to find the smallest integer Alice can get in the end, if she plays optimally.InputThe input consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Description of the test cases follows.The first and the only line of each test case contains the integer $$$n$$$ ($$$10 \\\\le n \\\\le 10^9$$$) — the integer for the game. $$$n$$$ does not have zeros in its decimal representation.OutputFor each test case output a single integer — the smallest integer Alice can get in the end of the game.ExampleInput312132487456398Output2 1 3NoteIn the first test case Alice has to swap $$$1$$$ and $$$2$$$. After that Bob removes the last digit, $$$1$$$, so the answer is $$$2$$$.In the second test case Alice can swap $$$3$$$ and $$$1$$$: $$$312$$$. After that Bob deletes the last digit: $$$31$$$. Then Alice swaps $$$3$$$ and $$$1$$$: $$$13$$$ and Bob deletes $$$3$$$, so the answer is $$$1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "90bc2740", "template_md5": "465699a0", "result": "Two players take turns modifying a positive integer. The first player can swap any two digits in the number. The second player removes the last digit of the number. The game ends when only one digit remains. What is the smallest possible remaining digit the first player can achieve by playing optimally?"}, {"prompt_md5": "38eccc66", "template_md5": "35d339e4", "result": "You are given a positive integer $n$ without any zero digits. Two players take turns modifying the number. \n\n* Player 1 can swap any two digits of the number that are not in the same position.\n* Player 2 always removes the last digit of the number.\n\nThe game ends when only one digit remains.  Find the smallest possible value of the remaining digit that Player 1 can achieve by playing optimally."}]}