{"uid": "1686-A", "url": "https://codeforces.com/contest/1686/problem/A", "tags": ["greedy"], "title": "1686-A", "statement": "A. Everything Everywhere All But Onetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array of $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$. After you watched the amazing film \"Everything Everywhere All At Once\", you came up with the following operation.In one operation, you choose $$$n-1$$$ elements of the array and replace each of them with their arithmetic mean (which doesn't have to be an integer). For example, from the array $$$[1, 2, 3, 1]$$$ we can get the array $$$[2, 2, 2, 1]$$$, if we choose the first three elements, or we can get the array $$$[\\\\frac{4}{3}, \\\\frac{4}{3}, 3, \\\\frac{4}{3}]$$$, if we choose all elements except the third.Is it possible to make all elements of the array equal by performing a finite number of such operations?InputThe first line of the input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 200$$$)  — the number of test cases. The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$3 \\\\le n \\\\le 50$$$)  — the number of integers.The second line of each test case contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$0 \\\\le a_i \\\\le 100$$$).OutputFor each test case, if it is possible to make all elements equal after some number of operations, output $$$\\\\texttt{YES}$$$. Otherwise, output $$$\\\\texttt{NO}$$$.You can output $$$\\\\texttt{YES}$$$ and $$$\\\\texttt{NO}$$$ in any case (for example, strings $$$\\\\texttt{yEs}$$$, $$$\\\\texttt{yes}$$$, $$$\\\\texttt{Yes}$$$ will be recognized as a positive response).ExampleInput4342 42 4251 2 3 4 544 3 2 1324 2 22OutputYES YES NO NONoteIn the first test case, all elements are already equal.In the second test case, you can choose all elements except the third, their average is $$$\\\\frac{1 + 2 + 4 + 5}{4} = 3$$$, so the array will become $$$[3, 3, 3, 3, 3]$$$.It's possible to show that it's impossible to make all elements equal in the third and fourth test cases.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "285a2dbd", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers $a_1, a_2, ..., a_n$.  You can perform the following operation any number of times:\n\n1. Choose $n-1$ elements from the array.\n2. Calculate the average of those $n-1$ elements.\n3. Replace the $n-1$ chosen elements with the calculated average.\n\nDetermine if it is possible to make all elements of the array equal by performing this operation a finite number of times. \n\nInput:\n\n* The first line contains $t$ (the number of test cases).\n* For each test case:\n    * The first line contains $n$ (the number of integers in the array).\n    * The second line contains $n$ integers $a_1, a_2, ..., a_n$.\n\nOutput:\n\nFor each test case, output \"YES\" if it is possible to make all elements equal, and \"NO\" otherwise."}, {"prompt_md5": "00d74cfb", "template_md5": "465699a0", "result": "You are given a list of numbers. You can repeatedly choose some (but not all) of the numbers, calculate their average, and replace those numbers with the average.  Can you make all the numbers in the list the same using this operation?"}]}