{"uid": "1690-A", "url": "https://codeforces.com/contest/1690/problem/A", "tags": ["constructive algorithms", " greedy"], "title": "1690-A", "statement": "A. Print a Pedestal (Codeforces logo?)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputGiven the integer $$$n$$$ — the number of available blocks. You must useallblocks to build apedestal.Thepedestalconsists of $$$3$$$ platforms for $$$2$$$-nd, $$$1$$$-st and $$$3$$$-rd places respectively. The platform for the $$$1$$$-st place must bestrictlyhigher than for the $$$2$$$-nd place, and the platform for the $$$2$$$-nd place must bestrictlyhigher than for the $$$3$$$-rd place. Also, the height of each platform must be greater than zero (that is, each platform must contain at least one block).Example pedestal of $$$n=11$$$ blocks: second place height equals $$$4$$$ blocks, first place height equals $$$5$$$ blocks, third place height equals $$$2$$$ blocks.Among all possible pedestals of $$$n$$$ blocks, deduce one such that the platform height for the $$$1$$$-st placeminimumas possible. If there are several of them, output any of them.InputThe first line of input data contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Each test case contains a single integer $$$n$$$ ($$$6 \\\\le n \\\\le 10^5$$$) — the total number of blocks for the pedestal. All $$$n$$$ blocks must be used.It is guaranteed that the sum of $$$n$$$ values over all test cases does not exceed $$$10^6$$$.OutputFor each test case, output $$$3$$$ numbers $$$h_2, h_1, h_3$$$ — the platform heights for $$$2$$$-nd, $$$1$$$-st and $$$3$$$-rd places on a pedestal consisting of $$$n$$$ blocks ($$$h_1+h_2+h_3=n$$$, $$$0 < h_3 < h_2 < h_1$$$).Among all possible pedestals, output the one for which the value of $$$h_1$$$minimal. If there are several of them, output any of them.ExampleInput61161010000078Output4 5 2 2 3 1 4 5 1 33334 33335 33331 2 4 1 3 4 1NoteIn the first test case we can not get the height of the platform for the first place less than $$$5$$$, because if the height of the platform for the first place is not more than $$$4$$$, then we can use at most $$$4 + 3 + 2 = 9$$$ blocks. And we should use $$$11 = 4 + 5 + 2$$$ blocks. Therefore, the answer4 5 2fits.In the second set, the only suitable answer is:2 3 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "59a98a64", "template_md5": "35d339e4", "result": "You are given an integer $n$ representing the number of blocks you have. You need to build a pedestal with three platforms for 2nd, 1st, and 3rd place. \n\nHere are the rules:\n\n* The platform for 1st place must be strictly higher than the 2nd place platform.\n* The platform for 2nd place must be strictly higher than the 3rd place platform.\n* Each platform must have at least one block.\n\nFind the smallest possible height for the 1st place platform while using all $n$ blocks. If there are multiple solutions, output any one. \n\n\n\nLet me know if you'd like help with the code!"}, {"prompt_md5": "7d5556c3", "template_md5": "465699a0", "result": "You are given a number of blocks. You need to build a structure with three levels, where each level must be taller than the one below it.  The levels must use all the blocks. Find the smallest possible height for the top level."}]}