{"uid": "1692-D", "url": "https://codeforces.com/contest/1692/problem/D", "tags": ["brute force", " implementation"], "title": "1692-D", "statement": "D. The Clocktime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVictor has a24-hour clockthat shows the time in the format \"HH:MM\" (00$$$\\\\le$$$HH$$$\\\\le$$$23,00$$$\\\\le$$$MM$$$\\\\le$$$59). He looks at the clock every $$$x$$$ minutes, and the clock is currently showing time $$$s$$$.How manydifferentpalindromes will Victor see in total after looking at the clock every $$$x$$$ minutes, the first time being at time $$$s$$$?For example, if the clock starts out as03:12and Victor looks at the clock every $$$360$$$ minutes (i.e. every $$$6$$$ hours), then he will see the times03:12,09:12,15:12,21:12,03:12, and the times will continue to repeat. Here the time21:12is the only palindrome he will ever see, so the answer is $$$1$$$.A palindrome is a string that reads the same backward as forward. For example, the times12:21,05:50,11:11are palindromes but13:13,22:10,02:22are not.InputThe first line of the input contains an integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$) — the number of test cases. The description of each test case follows.The only line of each test case contains a string $$$s$$$ of length $$$5$$$ with the format \"HH:MM\" where \"HH\" is from \"00\" to \"23\" and \"MM\" is from \"00\" to \"59\" (both \"HH\" and \"MM\" have exactly two digits) and an integer $$$x$$$ ($$$1 \\\\leq x \\\\leq 1440$$$) — the number of minutes Victor takes to look again at the clock.OutputFor each test case, output a single integer — the number of different palindromes Victor will see if he looks at the clock every $$$x$$$ minutes starting from time $$$s$$$.ExampleInput603:12 36000:00 113:22 215:15 1011:11 144022:30 27Output1 16 10 0 1 1NoteThe first test case is explained in the statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8d02b0e9", "template_md5": "35d339e4", "result": "Given a starting time in the format \"HH:MM\" (where HH is the hour and MM is the minutes, both between 00 and 59) and an interval in minutes (x), determine how many different palindromic times will be seen if the time is checked every x minutes, starting from the given time.\n\nA palindrome is a time that reads the same backward as forward (e.g., 12:21, 05:50). \n\n\nInput:\n\nThe first line contains the number of test cases (t). Each test case has two lines:\n* The first line contains the starting time in the format \"HH:MM\".\n* The second line contains the interval in minutes (x).\n\nOutput:\n\nFor each test case, output the number of different palindromic times that will be seen."}, {"prompt_md5": "1f8370aa", "template_md5": "465699a0", "result": "Given a starting time and an interval, determine how many palindromic times will be seen if the time is checked at regular intervals."}]}