{"uid": "1695-E", "url": "https://codeforces.com/contest/1695/problem/E", "tags": ["constructive algorithms", " dfs and similar", " graphs"], "title": "1695-E", "statement": "E. Ambiguous Dominoestime limit per test8 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp and Monocarp are both solving the same puzzle with dominoes. They are given the same set of $$$n$$$ dominoes, the $$$i$$$-th of which contains two numbers $$$x_i$$$ and $$$y_i$$$. They are also both given the same $$$m$$$ by $$$k$$$ grid of values $$$a_{ij}$$$ such that $$$m\\\\cdot k = 2n$$$.The puzzle asks them to place the $$$n$$$ dominoes on the grid in such a way that none of them overlap, and the values on each domino match the $$$a_{ij}$$$ values that domino covers. Dominoes can be rotated arbitrarily before being placed on the grid, so the domino $$$(x_i, y_i)$$$ is equivalent to the domino $$$(y_i, x_i)$$$.They have both solved the puzzle, and compared their answers, but noticed that not only did their solutions not match, but none of the $$$n$$$ dominoes were in the same location in both solutions! Formally, if two squares were covered by the same domino in Polycarp's solution, they were covered by different dominoes in Monocarp's solution. The diagram below shows one potential $$$a$$$ grid, along with the two players' solutions.Polycarp and Monocarp remember the set of dominoes they started with, but they have lost the grid $$$a$$$. Help them reconstruct one possible grid $$$a$$$, along with both of their solutions, or determine that no such grid exists.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 3\\\\cdot 10^5$$$).The $$$i$$$-th of the next $$$n$$$ lines contains two integers $$$x_i$$$ and $$$y_i$$$ ($$$1 \\\\le x_i, y_i \\\\le 2n$$$).OutputIf there is no solution, print a single integer $$$-1$$$.Otherwise, print $$$m$$$ and $$$k$$$, the height and width of the puzzle grid, on the first line of output. These should satisfy $$$m\\\\cdot k = 2n$$$.The $$$i$$$-th of the next $$$m$$$ lines should contain $$$k$$$ integers, the $$$j$$$-th of which is $$$a_{ij}$$$.The next $$$m$$$ lines describe Polycarp's solution. Print $$$m$$$ lines of $$$k$$$ characters each. For each square, if it is covered by the upper half of a domino in Polycarp's solution, it should contain a \"U\". Similarly, if it is covered by the bottom, left, or right half of a domino, it should contain \"D\", \"L\", or \"R\", respectively.The next $$$m$$$ lines should describe Monocarp's solution, in the same format as Polycarp's solution.If there are multiple answers, print any.ExamplesInput1 1 2Output-1Input2 1 1 1 2Output2 2  2 1 1 1  LR LR  UU DDInput10 1 3 1 1 2 1 3 4 1 5 1 5 3 1 2 4 3 3 4 1Output4 5  1 2 5 1 5 3 4 1 3 1 1 2 4 4 1 1 3 3 3 1  LRULR LRDLR ULRLR DLRLR  UULRU DDUUD LRDDU LRLRDNoteExtra blank lines are added to the output for clarity, but are not required.The third sample case corresponds to the image from the statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e382507c", "template_md5": "35d339e4", "result": "You are given $n$ dominoes, where each domino has two numbers on it, $x_i$ and $y_i$. You are also given that $m \\cdot k = 2n$.\n\nTwo players have solved a puzzle using these dominoes on a grid of size $m \\times k$.  The puzzle requires placing the dominoes on the grid so that:\n\n* No dominoes overlap.\n* The numbers on each domino match the corresponding values on the grid.\n* Dominoes can be rotated.\n\nThe players' solutions are different, and no dominoes are in the same location in both solutions.\n\n**Input:**\n\n* The first line contains the number of dominoes, $n$.\n* The next $n$ lines each contain two integers, $x_i$ and $y_i$, representing the numbers on each domino.\n\n**Output:**\n\n* If no such grid exists, print $-1$.\n* Otherwise, print the height ($m$) and width ($k$) of the grid on the first line.\n* The next $m$ lines should contain $k$ integers each, representing the grid values $a_{ij}$.\n* The next $m$ lines should describe the first player's solution, where each square is marked with \"U\", \"D\", \"L\", or \"R\" to indicate which half of a domino covers it.\n* The next $m$ lines should describe the second player's solution in the same format."}, {"prompt_md5": "7f0b8036", "template_md5": "465699a0", "result": "Two people are given a set of tiles and a grid. They must place the tiles on the grid so that each tile covers a specific area and no tiles overlap. The people solved the puzzle differently, and no tiles were in the same location in both solutions.  \n\nGiven the set of tiles, find one possible grid and the placement of the tiles for each person. If no such grid exists, say so."}]}