{"uid": "1697-A", "url": "https://codeforces.com/contest/1697/problem/A", "tags": ["greedy", " implementation"], "title": "1697-A", "statement": "A. Parkway Walktime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are walking through a parkway near your house. The parkway has $$$n+1$$$ benches in a row numbered from $$$1$$$ to $$$n+1$$$ from left to right. The distance between the bench $$$i$$$ and $$$i+1$$$ is $$$a_i$$$ meters.Initially, you have $$$m$$$ units of energy. To walk $$$1$$$ meter of distance, you spend $$$1$$$ unit of your energy. You can't walk if you have no energy. Also, you can restore your energy bysitting on benches(and this is the only way to restore the energy). When you are sitting, you can restore any integer amount of energy you want (if you sit longer, you restore more energy). Note that the amount of your energycan exceed$$$m$$$.Your task is to find theminimumamount of energy you have torestore(by sitting on benches) to reach the bench $$$n+1$$$ from the bench $$$1$$$ (and end your walk).You have to answer $$$t$$$ independent test cases.InputThe first line of the input contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of test cases. Then $$$t$$$ test cases follow.The first line of the test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 100$$$; $$$1 \\\\le m \\\\le 10^4$$$).The second line of the test case contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 100$$$), where $$$a_i$$$ is the distance between benches $$$i$$$ and $$$i+1$$$.OutputFor each test case, print one integer — theminimumamount of energy you have torestore(by sitting on benches) to reach the bench $$$n+1$$$ from the bench $$$1$$$ (and end your walk) in the corresponding test case.ExampleInput33 11 2 14 53 3 5 25 161 2 3 4 5Output3 8 0NoteIn the first test case of the example, you can walk to the bench $$$2$$$, spending $$$1$$$ unit of energy, then restore $$$2$$$ units of energy on the second bench, walk to the bench $$$3$$$, spending $$$2$$$ units of energy, restore $$$1$$$ unit of energy and go to the bench $$$4$$$.In the third test case of the example, you have enough energy to just go to the bench $$$6$$$ without sitting at all.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a5c264fd", "template_md5": "35d339e4", "result": "You are walking along a path with $n+1$ benches numbered from 1 to $n+1$. The distance between bench $i$ and bench $i+1$ is $a_i$ meters. You start with $m$ units of energy. Walking 1 meter costs 1 unit of energy. You can restore your energy by sitting on benches.  \n\nYou need to find the minimum amount of energy you need to restore by sitting on benches to reach the last bench ($n+1$) from the first bench (1). \n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains two integers, $n$ and $m$.\n    * The second line contains $n$ integers, $a_1, a_2, ..., a_n$.\n\n**Output:**\n\nFor each test case, print the minimum energy you need to restore."}, {"prompt_md5": "d8b2a7ee", "template_md5": "465699a0", "result": "You are walking a path with a set number of stops. Each stop is a certain distance from the previous one. You start with a certain amount of energy. Walking costs energy, and you can regain energy by stopping at a bench. Find the minimum amount of energy you need to regain to reach the last stop."}]}