{"uid": "1699-B", "url": "https://codeforces.com/contest/1699/problem/B", "tags": ["bitmasks", " constructive algorithms", " matrices"], "title": "1699-B", "statement": "B. Almost Ternary Matrixtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given twoevenintegers $$$n$$$ and $$$m$$$. Your task is to findanybinary matrix $$$a$$$ with $$$n$$$ rows and $$$m$$$ columns where every cell $$$(i,j)$$$ hasexactlytwo neighbours with a different value than $$$a_{i,j}$$$.Two cells in the matrix are considered neighbours if and only if they share a side. More formally, the neighbours of cell $$$(x,y)$$$ are: $$$(x-1,y)$$$, $$$(x,y+1)$$$, $$$(x+1,y)$$$ and $$$(x,y-1)$$$.It can be proven that under the given constraints, an answer always exists.InputEach test contains multiple test cases. The first line of input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of test cases. The following lines contain the descriptions of the test cases.The only line of each test case contains twoevenintegers $$$n$$$ and $$$m$$$ ($$$2 \\\\le n,m \\\\le 50$$$) — the height and width of the binary matrix, respectively.OutputFor each test case, print $$$n$$$ lines, each of which contains $$$m$$$ numbers, equal to $$$0$$$ or $$$1$$$ — any binary matrix which satisfies the constraints described in the statement.It can be proven that under the given constraints, an answer always exists.ExampleInput32 42 24 4Output1 0 0 1 0 1 1 0 1 0 0 1 1 0 1 0 0 0 1 1 1 1 0 0 0 1 0 1NoteWhite means $$$0$$$, black means $$$1$$$.The binary matrix from the first test caseThe binary matrix from the second test caseThe binary matrix from the third test case", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0b7d5264", "template_md5": "35d339e4", "result": "You are given two even numbers $n$ and $m$.  Your task is to create a grid (matrix) of $n$ rows and $m$ columns filled with 0s and 1s.  \n\nEach cell in the grid must have exactly two neighboring cells that have a different value (either a 0 or a 1).  \n\nNeighbors are defined as the cells directly above, below, to the left, and to the right of a given cell.\n\nFor example, the neighbors of cell $(x,y)$ are $(x-1,y)$, $(x,y+1)$, $(x+1,y)$, and $(x,y-1)$.\n\nCan you create such a grid?"}, {"prompt_md5": "3a25c5c7", "template_md5": "465699a0", "result": "You are given two even numbers, n and m. Create a grid of n rows and m columns filled with 0s and 1s.  Each cell must have exactly two neighboring cells (sharing a side) that have a different value."}]}