{"uid": "17-A", "url": "https://codeforces.com/contest/17/problem/A", "tags": ["brute force", " math", " number theory"], "title": "17-A", "statement": "A. Noldbach problemtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutNick is interested in prime numbers. Once he read aboutGoldbach problem. It states that every even integer greater than2can be expressed as the sum of two primes. That got Nick's attention and he decided to invent a problem of his own and call itNoldbach problem. Since Nick is interested only in prime numbers, Noldbach problem states that at leastkprime numbers from2toninclusively can be expressed as the sum of three integer numbers: two neighboring prime numbers and1. For example,19=7+11+1, or13=5+7+1.Two prime numbers are called neighboring if there are no other prime numbers between them.You are to help Nick, and find out if he is right or wrong.InputThe first line of the input contains two integersn(2 ≤n≤ 1000) andk(0 ≤k≤ 1000).OutputOutputYESif at leastkprime numbers from2toninclusively can be expressed as it was described above. Otherwise outputNO.ExamplesInput27 2OutputYESInput45 7OutputNONoteIn the first sample the answer isYESsince at least two numbers can be expressed as it was described (for example, 13 and 19). In the second sample the answer isNOsince it is impossible to express 7 prime numbers from 2 to 45 in the desired form.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b5d88114", "template_md5": "35d339e4", "result": "Given a positive integer $n$ ($2 \\le n \\le 1000$) and a positive integer $k$ ($0 \\le k \\le 1000$), determine if at least $k$ prime numbers from 2 to $n$ inclusive can be expressed as the sum of two neighboring prime numbers and 1. \n\nTwo prime numbers are considered neighboring if there are no other prime numbers between them. \n\nOutput \"YES\" if the condition is met, otherwise output \"NO\"."}, {"prompt_md5": "4b6ef516", "template_md5": "465699a0", "result": "Determine if at least k numbers between 2 and n (inclusive) can be written as the sum of two consecutive prime numbers and 1."}]}