{"uid": "17-C", "url": "https://codeforces.com/contest/17/problem/C", "tags": ["dp"], "title": "17-C", "statement": "C. Balancetime limit per test3 secondsmemory limit per test128 megabytesinputstdinoutputstdoutNick likes strings very much, he likes to rotate them, sort them, rearrange characters within a string... Once he wrote a random string of charactersa,b,con a piece of paper and began to perform the following operations:to take two adjacent characters and replace the second character with the first one,to take two adjacent characters and replace the first character with the second oneTo understand these actions better, let's take a look at a string «abc». All of the following strings can be obtained by performing one of the described operations on «abc»: «bbc», «abb», «acc». Let's denote thefrequency of a characterfor each of the charactersa,bandcas the number of occurrences of this character in the string. For example, for string «abc»: |a| = 1, |b| = 1, |c| = 1, and for string «bbc»: |a| = 0, |b| = 2, |c| = 1.While performing the described operations, Nick sometimes gotbalanced strings. Let's say that a string is balanced, if the frequencies of each character differ by at most 1. That is- 1 ≤ |a| - |b| ≤ 1,- 1 ≤ |a| - |c| ≤ 1и- 1 ≤ |b| - |c| ≤ 1.Would you help Nick find the number of different balanced strings that can be obtained by performing the operations described above, perhaps multiple times, on the given strings. This number should be calculated modulo51123987.InputThe first line contains integern(1 ≤n≤ 150) — the length of the given strings. Next line contains the given strings. The initial string can be balanced as well, in this case it should be counted too. The given stringsconsists only of charactersa,bandc.OutputOutput the only number — the number of different balanced strings that can be obtained by performing the described operations, perhaps multiple times, on the given strings, modulo51123987.ExamplesInput4abcaOutput7Input4abbcOutput3Input2abOutput1NoteIn the first sample it is possible to get51different strings through the described operations, but only7of them are balanced: «abca», «bbca», «bcca», «bcaa», «abcc», «abbc», «aabc». In the second sample: «abbc», «aabc», «abcc». In the third sample there is only one balanced string — «ab» itself.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3f38da5f", "template_md5": "35d339e4", "result": "You are given a string of characters consisting only of 'a', 'b', and 'c'.  You can perform the following operations on the string:\n\n1. Swap any two adjacent characters.\n\nDetermine the number of unique strings that can be created by repeatedly performing these operations, where a \"balanced\" string is defined as one where the frequency of each character ('a', 'b', and 'c') differs by at most 1.  \n\nFor example, the string \"abc\" is balanced because the frequency of each character is 1. The string \"bbc\" is also balanced because the frequency of 'a' is 0, 'b' is 2, and 'c' is 1 (the difference between any two frequencies is at most 1).\n\nCalculate the number of balanced strings that can be formed and output the result modulo 51123987."}, {"prompt_md5": "8e28a7b8", "template_md5": "465699a0", "result": "Given a string of characters 'a', 'b', and 'c', find the number of different strings you can create by swapping adjacent characters, where the count of each character in a string differs by at most one from each other.  The answer should be given modulo 51123987."}]}