{"uid": "17-D", "url": "https://codeforces.com/contest/17/problem/D", "tags": ["number theory"], "title": "17-D", "statement": "D. Notepadtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutNick is attracted by everything unconventional. He doesn't like decimal number system any more, and he decided to study other number systems. A number system with basebcaught his attention. Before he starts studying it, he wants to write in his notepad all the numbers of lengthnwithout leading zeros in this number system. Each page in Nick's notepad has enough space forcnumbers exactly. Nick writes every suitable number only once, starting with the first clean page and leaving no clean spaces. Nick never writes number0as he has unpleasant memories about zero divide.Would you help Nick find out how many numbers will be written on the last page.InputThe only input line contains three space-separated integersb,nandc(2 ≤b< 10106,1 ≤n< 10106,1 ≤c≤ 109). You may consider that Nick has infinite patience, endless amount of paper and representations of digits as characters. The numbers doesn't contain leading zeros.OutputIn the only line output the amount of numbers written on the same page as the last number.ExamplesInput2 3 3Output1Input2 3 4Output4NoteIn both samples there are exactly4numbers of length3in binary number system. In the first sample Nick writes3numbers on the first page and1on the second page. In the second sample all the4numbers can be written on the first page.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2dc985fd", "template_md5": "35d339e4", "result": "Given a base $b$ ($2 \\le b < 10^{10}$), a length $n$ ($1 \\le n < 10^{10}$), and a page capacity $c$ ($1 \\le c \\le 10^9$), find the number of numbers of length $n$ in base $b$ (without leading zeros) that will be written on the last page. \n\n\nAssume there is an infinite supply of paper."}, {"prompt_md5": "1c6ced88", "template_md5": "465699a0", "result": "Given a base for a number system, a number length, and the number of numbers that fit on a page, find how many numbers of that length will be written on the last page."}]}