{"uid": "1701-F", "url": "https://codeforces.com/contest/1701/problem/F", "tags": ["combinatorics", " data structures", " implementation", " math", " matrices"], "title": "1701-F", "statement": "F. Pointstime limit per test6.5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputA triple of points $$$i$$$, $$$j$$$ and $$$k$$$ on a coordinate line is calledbeautifulif $$$i < j < k$$$ and $$$k - i \\\\le d$$$.You are given a set of points on a coordinate line, initially empty. You have to process queries of three types:add a point;remove a point;calculate the number of beautiful triples consisting of points belonging to the set.InputThe first line contains two integers $$$q$$$ and $$$d$$$ ($$$1 \\\\le q, d \\\\le 2 \\\\cdot 10^5$$$) — the number of queries and the parameter for defining if a triple is beautiful, respectively.The second line contains $$$q$$$ integers $$$a_1, a_2, \\\\dots, a_q$$$ ($$$1 \\\\le a_i \\\\le 2 \\\\cdot 10^5$$$) denoting the queries. The integer $$$a_i$$$ denotes the $$$i$$$-th query in the following way:if the point $$$a_i$$$ belongs to the set, remove it; otherwise, add it;after adding or removing the point, print the number of beautiful triples.OutputFor each query, print one integer — the number of beautiful triples after processing the respective query.ExampleInput7 5 8 5 3 2 1 5 6Output0 0 1 2 5 1 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d236b213", "template_md5": "35d339e4", "result": "You are given a set of points on a number line. You will be given queries to either add a point to the set or remove a point from the set. After each query, you need to calculate the number of \"beautiful\" triples of points in the set.\n\nA triple of points ($i$, $j$, $k$) is considered beautiful if:\n\n* $i < j < k$ \n* $k - i \\le d$\n\nwhere $d$ is a given constant.\n\n**Input:**\n\n* The first line contains two integers, $q$ and $d$ ($1 \\le q, d \\le 2 \\cdot 10^5$), representing the number of queries and the value of $d$.\n* The second line contains $q$ integers, $a_1, a_2, ..., a_q$ ($1 \\le a_i \\le 2 \\cdot 10^5$), representing the queries. \n    * If $a_i$ is already in the set, it will be removed.\n    * If $a_i$ is not in the set, it will be added.\n\n**Output:**\n\nFor each query, print the number of beautiful triples in the set after processing the query."}, {"prompt_md5": "6407ac5c", "template_md5": "465699a0", "result": "You are given a list of numbers. You will be given commands to either add a number to the list or remove a number from the list. After each command, count how many groups of three numbers in the list satisfy the condition that the numbers are in increasing order and the difference between the largest and smallest number is less than or equal to a given value."}]}