{"uid": "1702-B", "url": "https://codeforces.com/contest/1702/problem/B", "tags": ["greedy"], "title": "1702-B", "statement": "B. Polycarp Writes a String from Memorytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp has a poor memory. Each day he can remember no more than $$$3$$$ of different letters.Polycarp wants to write a non-empty string of $$$s$$$ consisting of lowercase Latin letters, takingminimumnumber of days. In how many days will he be able to do it?Polycarp initially has an empty string and can only add characters to the end of that string.For example, if Polycarp wants to write the stringlollipops, he will do it in $$$2$$$ days:on the first day Polycarp will memorize the lettersl,o,iand writelolli;On the second day Polycarp will remember the lettersp,o,s, addpopsto the resulting line and get the linelollipops.If Polycarp wants to write the stringstringology, he will do it in $$$4$$$ days:in the first day will be written partstr;on day two will be written parting;on the third day, part ofologwill be written;on the fourth day, part ofywill be written.For a given string $$$s$$$, print the minimum number of days it will take Polycarp to write it.InputThe first line of input data contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Each test case consists of a non-empty string $$$s$$$ consisting of lowercase Latin letters (the length of the string $$$s$$$ does not exceed $$$2 \\\\cdot 10^5$$$) — the string Polycarp wants to construct.It is guaranteed that the sum of string lengths $$$s$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, print a single number —minimumnumber of days it will take Polycarp to write the string $$$s$$$ from memory.ExampleInput6lollipopsstringologyabracadabracodeforcestestfOutput2 4 3 4 1 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "30728a2c", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  You can only remember up to 3 different letters each day.  You start with an empty string and can only add letters to the end. What is the minimum number of days it takes to write the entire string?"}, {"prompt_md5": "3b3b9211", "template_md5": "465699a0", "result": "You are given a string.  You can only remember 3 unique characters at a time.  You can add characters to the end of a string you are building. What is the minimum number of days it takes to build the entire string?"}]}