{"uid": "1703-E", "url": "https://codeforces.com/contest/1703/problem/E", "tags": ["implementation"], "title": "1703-E", "statement": "E. Mirror Gridtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a square grid with $$$n$$$ rows and $$$n$$$ columns. Each cell contains either $$$0$$$ or $$$1$$$.In an operation, you can select a cell of the grid and flip it (from $$$0 \\\\to 1$$$ or $$$1 \\\\to 0$$$). Find the minimum number of operations you need to obtain a square that remains the same when rotated $$$0^{\\\\circ}$$$, $$$90^{\\\\circ}$$$, $$$180^{\\\\circ}$$$ and $$$270^{\\\\circ}$$$.The picture below shows an example of all rotations of a grid.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$) — the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 100$$$) — the size of the grid.Then $$$n$$$ lines follow, each with $$$n$$$ characters $$$a_{i,j}$$$ ($$$0 \\\\leq a_{i,j} \\\\leq 1$$$) — the number written in each cell.OutputFor each test case output a single integer  — the minimum number of operations needed to make the square look the same rotated $$$0^{\\\\circ}$$$, $$$90^{\\\\circ}$$$, $$$180^{\\\\circ}$$$ and $$$270^{\\\\circ}$$$.ExampleInput5301011001010511100110110101110011110005010001010101010000100100151100100000111111011001111Output1 0 9 7 6NoteIn the first test case, we can perform one operations to make the grid $$$\\\\begin{matrix}0 & 1 & 0\\\\\\\\ 1 & 1 & \\\\color{red}{1}\\\\\\\\ 0 & 1 & 0\\\\end{matrix}$$$. Now, all rotations of the square are the same.In the second test case, all rotations of the square are already the same, so we don't need any flips.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3d13170d", "template_md5": "35d339e4", "result": "You are given a square grid of size $n x n$ filled with 0s and 1s.  You can flip any cell (change it from 0 to 1 or 1 to 0).  Find the minimum number of flips needed so that the grid looks the same after being rotated 0 degrees, 90 degrees, 180 degrees, and 270 degrees.\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the size of the grid, $n$.\n    * The next $n$ lines contain the grid itself, with each line having $n$ 0s and 1s.\n\nOutput:\n\n* For each test case, output the minimum number of flips needed."}, {"prompt_md5": "b741e3ad", "template_md5": "465699a0", "result": "You are given a square grid of 0s and 1s.  Find the fewest flips needed to make the grid look the same after being rotated 90, 180, and 270 degrees."}]}