{"uid": "1707-A", "url": "https://codeforces.com/contest/1707/problem/A", "tags": ["binary search", " constructive algorithms", " greedy", " implementation"], "title": "1707-A", "statement": "A. Doremy's IQtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputDoremy is asked to test $$$n$$$ contests. Contest $$$i$$$ can only be tested on day $$$i$$$. The difficulty of contest $$$i$$$ is $$$a_i$$$. Initially, Doremy's IQ is $$$q$$$. On day $$$i$$$ Doremy will choose whether to test contest $$$i$$$ or not. She can only test a contest if her current IQ is strictly greater than $$$0$$$.If Doremy chooses to test contest $$$i$$$ on day $$$i$$$, the following happens:if $$$a_i>q$$$, Doremy will feel she is not wise enough, so $$$q$$$ decreases by $$$1$$$;otherwise, nothing changes.If she chooses not to test a contest, nothing changes.Doremy wants to test as many contests as possible. Please give Doremy a solution.InputThe input consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1\\\\le t\\\\le 10^4$$$) — the number of test cases. The description of the test cases follows.The first line contains two integers $$$n$$$ and $$$q$$$ ($$$1 \\\\le n \\\\le 10^5$$$, $$$1 \\\\le q \\\\le 10^9$$$) — the number of contests and Doremy's IQ in the beginning.The second line contains $$$n$$$ integers $$$a_1,a_2,\\\\cdots,a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — the difficulty of each contest.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case, you need to output a binary string $$$s$$$, where $$$s_i=1$$$ if Doremy should choose to test contest $$$i$$$, and $$$s_i=0$$$ otherwise. The number of ones in the string should be maximum possible, and she should never test a contest when her IQ is zero or less.If there are multiple solutions, you may output any.ExampleInput51 112 11 23 11 2 14 21 4 3 15 25 1 2 4 3Output1 11 110 1110 01111NoteIn the first test case, Doremy tests the only contest. Her IQ doesn't decrease.In the second test case, Doremy tests both contests. Her IQ decreases by $$$1$$$ after testing contest $$$2$$$.In the third test case, Doremy tests contest $$$1$$$ and $$$2$$$. Her IQ decreases to $$$0$$$ after testing contest $$$2$$$, so she can't test contest $$$3$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a84ab35a", "template_md5": "465699a0", "result": "You are given a list of tasks with increasing difficulty levels. You start with a certain amount of \"skill\".  Each task requires a skill level higher than your current skill to complete. If you complete a task, your skill decreases.  Your goal is to complete as many tasks as possible without your skill dropping to zero or below."}, {"prompt_md5": "2c719aed", "template_md5": "35d339e4", "result": "You are given $n$ contests, each with a difficulty level $a_i$. You start with an IQ of $q$. On each day $i$, you can choose to take contest $i$ if your IQ is greater than 0. If you take a contest with difficulty greater than your IQ, your IQ decreases by 1. Otherwise, your IQ remains the same.  \n\nYour goal is to determine the maximum number of contests you can take while ensuring your IQ never drops to 0 or below. Output a binary string where '1' represents taking the contest and '0' represents skipping it."}]}