{"uid": "1713-D", "url": "https://codeforces.com/contest/1713/problem/D", "tags": ["constructive algorithms", " greedy", " interactive", " number theory", " probabilities"], "title": "1713-D", "statement": "D. Tournament Countdowntime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is an interactive problem.There was a tournament consisting of $$$2^n$$$ contestants. The $$$1$$$-st contestant competed with the $$$2$$$-nd, the $$$3$$$-rd competed with the $$$4$$$-th, and so on. After that, the winner of the first match competed with the winner of second match, etc. The tournament ended when there was only one contestant left, who was declared the winner of the tournament. Such a tournament scheme is known as the single-elimination tournament.You don't know the results, but you want to find the winner of the tournament. In one query, you select two integers $$$a$$$ and $$$b$$$, which are the indices of two contestants. The jury will return $$$1$$$ if $$$a$$$ won more matches than $$$b$$$, $$$2$$$ if $$$b$$$ won more matches than $$$a$$$, or $$$0$$$ if their number of wins was equal.Find the winner in no more than $$$\\\\left \\\\lceil \\\\frac{1}{3} \\\\cdot 2^{n + 1} \\\\right \\\\rceil$$$ queries. Here $$$\\\\lceil x \\\\rceil$$$ denotes the value of $$$x$$$ rounded up to the nearest integer.Note that the tournament is long over, meaning that the results are fixed and do not depend on your queries.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 2^{14}$$$) — the number of test cases.The only line of input contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 17$$$).It is guaranteed that the sum of $$$2^n$$$ over all test cases does not exceed $$$2^{17}$$$.InteractionThe interaction for each test case begins by reading the integer $$$n$$$.To make a query, output \"? a b\" ($$$1 \\\\leq a, b \\\\leq 2^n$$$) without quotes. Afterwards, you should read one single integer — the answer for your query. You can make at most $$$\\\\left \\\\lceil \\\\frac{1}{3} \\\\cdot 2^{n + 1} \\\\right \\\\rceil$$$ such queries in each test case.If you receive the integer $$$-1$$$ instead of an answer or a valid value of $$$n$$$, it means your program has made an invalid query, has exceed the limit of queries, or has given incorrect answer on the previous test case. Your program must terminate immediately to receive aWrong Answerverdict. Otherwise you can get an arbitrary verdict because your solution will continue to read from a closed stream.When you are ready to give the final answer, output \"! x\" ($$$1 \\\\leq x \\\\leq 2^n$$$) without quotes — the winner of the tournament. Giving this answer does not count towards the limit of queries. After solving a test case, your program should move to the next one immediately. After solving all test cases, your program should be terminated immediately.After printing a query or the answer do not forget to output end of line and flush the output. Otherwise, you will getIdleness limit exceeded. To do this, use:fflush(stdout)orcout.flush()in C++;System.out.flush() in Java;flush(output)in Pascal;stdout.flush()in Python;see documentation for other languages.HacksTo hack, use the following format.The first line contains an integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 2^{14}$$$) — the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 17$$$).The second line of each test case contains $$$2^n$$$ numbers on a line — the number of wins of each participant. There should be a sequence of matches that is consistent with the number of wins.The sum of $$$2^n$$$ should not exceed $$$2^{17}$$$.ExampleInput1 3  2  0  2Output? 1 4  ? 1 6  ? 5 7  ! 7NoteThe tournament in the first test case is shown below. The number of wins is $$$[1,0,0,2,0,1,3,0]$$$.In this example, the winner is the $$$7$$$-th contestant.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9414f770", "template_md5": "35d339e4", "result": "You are participating in a tournament where $2^n$ contestants compete in a single-elimination format. You don't know the results of the matches, but you can ask queries to find the winner.\n\n**Queries:**\n\nYou can ask a query by providing two contestant indices, $a$ and $b$. The system will respond with:\n\n* 1 if contestant $a$ won more matches than contestant $b$.\n* 2 if contestant $b$ won more matches than contestant $a$.\n* 0 if both contestants won the same number of matches.\n\n**Goal:**\n\nFind the winner of the tournament using at most $\\left\\lceil \\frac{1}{3} \\cdot 2^{n+1} \\right\\rceil$ queries.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* Each test case starts with a single integer $n$ representing the number of contestants ($2^n$).\n\n**Output:**\n\n* For each test case, output \"? a b\" to make a query.\n* When you find the winner, output \"! x\" where $x$ is the winner's index."}, {"prompt_md5": "0fdf295f", "template_md5": "465699a0", "result": "You need to find the winner of a single-elimination tournament with $2^n$ contestants. You can ask questions to compare the number of wins of two contestants. You have a limited number of questions to find the winner."}]}