{"uid": "1714-A", "url": "https://codeforces.com/contest/1714/problem/A", "tags": ["implementation", " math"], "title": "1714-A", "statement": "A. Everyone Loves to Sleeptime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVlad, like everyone else, loves to sleep very much.Every day Vlad has to do $$$n$$$ things, each at a certain time. For each of these things, he has an alarm clock set, the $$$i$$$-th of them is triggered on $$$h_i$$$ hours $$$m_i$$$ minutes every day ($$$0 \\\\le h_i < 24, 0 \\\\le m_i < 60$$$). Vlad uses the $$$24$$$-hour time format, so after $$$h=12, m=59$$$ comes $$$h=13, m=0$$$ and after $$$h=23, m=59$$$ comes $$$h=0, m=0$$$.This time Vlad went to bed at $$$H$$$ hours $$$M$$$ minutes ($$$0 \\\\le H < 24, 0 \\\\le M < 60$$$) and asks you to answer: how much he will be able to sleep until the next alarm clock.If any alarm clock rings at the time when he went to bed, then he will sleep for a period of time of length $$$0$$$.InputThe first line of input data contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of test cases in the test.The first line of the case contains three integers $$$n$$$, $$$H$$$ and $$$M$$$ ($$$1 \\\\le n \\\\le 10, 0 \\\\le H < 24, 0 \\\\le M < 60$$$) — the number of alarms and the time Vlad went to bed.The following $$$n$$$ lines contain two numbers each $$$h_i$$$ and $$$m_i$$$ ($$$0 \\\\le h_i < 24, 0 \\\\le m_i < 60$$$) — the time of the $$$i$$$ alarm. It is acceptable that two or more alarms will trigger at the same time.Numbers describing time do not contain leading zeros.OutputOutput $$$t$$$ lines, each containing the answer to the corresponding test case. As an answer, output two numbers  — the number of hours and minutes that Vlad will sleep, respectively. If any alarm clock rings at the time when he went to bed, the answer will be0 0.ExampleInput31 6 138 03 6 012 3014 456 02 23 3520 1510 30Output1 47 0 0 10 55", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "387de905", "template_md5": "465699a0", "result": "Given a list of times when alarms go off, and a time someone went to bed, determine how long they can sleep before the next alarm. If an alarm goes off at bedtime, they sleep for 0 minutes."}, {"prompt_md5": "07c1a56e", "template_md5": "35d339e4", "result": "You are given a number of alarms, each with a specific hour and minute. You are also given a time when a person went to bed.  \n\nDetermine how many hours and minutes the person will sleep before the next alarm rings. If an alarm rings at the time the person went to bed, they will sleep for 0 hours and 0 minutes.\n\n**Input:**\n\n* The first line contains the number of test cases.\n* For each test case:\n    * The first line contains three numbers: the number of alarms, the hour the person went to bed, and the minutes the person went to bed.\n    * The following lines contain the hour and minute of each alarm.\n\n**Output:**\n\n* For each test case, output two numbers: the number of hours slept and the number of minutes slept."}]}