{"uid": "1718-B", "url": "https://codeforces.com/contest/1718/problem/B", "tags": ["greedy", " implementation", " math", " number theory"], "title": "1718-B", "statement": "B. Fibonacci Stringstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn all schools in Buryatia, in the $$$1$$$ class, everyone is told the theory of Fibonacci strings.\"Ablockis a subsegment of a string where all the letters are the same and are bounded on the left and right by the ends of the string or by letters other than the letters in the block. A string is called aFibonaccistring if, when it is divided into blocks, their lengths in the order they appear in the string form the Fibonacci sequence ($$$f_0 = f_1 = 1$$$, $$$f_i = f_{i-2} + f_{i-1}$$$), starting from the zeroth member of this sequence. A string is calledsemi-Fibonacciif it possible to reorder its letters to get aFibonaccistring.\"Burenka decided to enter the Buryat State University, but at the entrance exam she was given a difficult task. She was given a string consisting of the letters of the Buryat alphabet (which contains exactly $$$k$$$ letters), and was asked if the given string issemi-Fibonacci. The string can be very long, so instead of the string, she was given the number of appearances of each letter ($$$c_i$$$ for the $$$i$$$-th letter) in that string. Unfortunately, Burenka no longer remembers the theory of Fibonacci strings, so without your help she will not pass the exam.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) — the number of test cases. The following is a description of the input data sets.The first line of each test case contains one integer $$$k$$$ ($$$1 \\\\leq k \\\\leq 100$$$) — the number of letters in the alphabet.The second line of each test case contains $$$k$$$ integers $$$c_1, c_2, \\\\ldots, c_k$$$ ($$$1 \\\\leq c_i \\\\leq 10^9$$$) — the number of occurrences of each letter in the string.OutputFor each test case print the string \"YES\" if the corresponding string is semi-Fibonacci, and \"NO\" if it is not.You can print \"YES\" and \"NO\" in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" will be recognized as a positive answer).ExampleInput61121 121 233 1 327 5626 8 3 4 13 34OutputYES YES NO YES NO YESNoteIn the first test case, a one-character string is semi-Fibonacci, being itself a Fibonacci string.In the second test case, a string of two different characters is Fibonacci.In the third test case, the string \"abb\" (let the first of the alphabet letter bea, the second letterb) is not a semi-Fibonacci string, since no permutation of its letters (\"abb\", \"bab\", and \"bba\") is a Fibonacci string.In the fourth test case, two permutations of the letters of the string \"abaccac\" (the first letter isa, the second letter isb, the third letter isc) are Fibonacci strings — \"abaaccc\" and \"cbccaaa\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "629dc673", "template_md5": "35d339e4", "result": "You are given the count of occurrences of each letter in a string.  Determine if it is possible to rearrange the letters to form a \"Fibonacci string\".\n\nA Fibonacci string is a string that can be divided into blocks of consecutive identical letters, where the lengths of these blocks (from left to right) form the Fibonacci sequence: 1, 1, 2, 3, 5, 8, ...\n\nA string is considered \"semi-Fibonacci\" if it can be rearranged to form a Fibonacci string.\n\n\nInput:\n\n* The first line contains the number of test cases, *t*.\n* For each test case:\n    * The first line contains *k*, the number of unique letters in the alphabet.\n    * The second line contains *k* integers, *c<sub>1</sub>, c<sub>2</sub>, ..., c<sub>k</sub>*, representing the count of each letter in the string.\n\nOutput:\n\nFor each test case, print \"YES\" if the string is semi-Fibonacci, and \"NO\" otherwise."}, {"prompt_md5": "24611b56", "template_md5": "465699a0", "result": "Given the count of each character in a string, determine if it's possible to rearrange the characters to form a string where the lengths of consecutive blocks of identical characters follow the Fibonacci sequence (1, 1, 2, 3, 5, 8...)."}]}