{"uid": "172-A", "url": "https://codeforces.com/contest/172/problem/A", "tags": ["*special", " brute force", " implementation"], "title": "172-A", "statement": "A. Phone Codetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPolycarpus hasnfriends in Tarasov city. Polycarpus knows phone numbers of all his friends: they are stringss1,s2, ...,sn. All these strings consist only of digits and have the same length.Once Polycarpus needed to figure out Tarasov city phone code. He assumed that the phone code of the city is the longest common prefix of all phone numbers of his friends. In other words, it is the longest stringcwhich is a prefix (the beginning) of eachsifor alli(1 ≤i≤n). Help Polycarpus determine the length of the city phone code.InputThe first line of the input contains an integern(2 ≤n≤ 3·104) — the number of Polycarpus's friends. The followingnlines contain stringss1,s2, ...,sn— the phone numbers of Polycarpus's friends. It is guaranteed that all strings consist only of digits and have the same length from1to20, inclusive. It is also guaranteed that all strings are different.OutputPrint the number of digits in the city phone code.ExamplesInput400209002190099900909Output2Input212Output0Input3770123456789999999997701234567890123456777012345678998765432Output12NoteAprefixof stringtis a string that is obtained by deleting zero or more digits from the end of stringt. For example, string \"00209\" has 6 prefixes: \"\" (an empty prefix), \"0\", \"00\", \"002\", \"0020\", \"00209\".In the first sample the city phone code is string \"00\".In the second sample the city phone code is an empty string.In the third sample the city phone code is string \"770123456789\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2e92b0f4", "template_md5": "35d339e4", "result": "You are given $n$ phone numbers, each consisting of the same number of digits.  Find the length of the longest common prefix shared by all the phone numbers. \n\nFor example:\n\nInput:\n```\n4\n00209\n00219\n009900\n00909\n```\n\nOutput:\n```\n2\n```\n\nExplanation: The longest common prefix is \"00\"."}, {"prompt_md5": "f5897fad", "template_md5": "465699a0", "result": "You are given a list of phone numbers of the same length. Find the length of the longest common prefix shared by all the phone numbers."}]}