{"uid": "1720-E", "url": "https://codeforces.com/contest/1720/problem/E", "tags": ["constructive algorithms", " data structures", " greedy", " implementation", " math"], "title": "1720-E", "statement": "E. Misha and Paintingstime limit per test3.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMisha has asquare$$$n \\\\times n$$$ matrix, where the number in row $$$i$$$ and column $$$j$$$ is equal to $$$a_{i, j}$$$. Misha wants to modify the matrix to containexactly$$$k$$$ distinct integers. To achieve this goal, Misha can perform the following operation zero or more times:choose anysquaresubmatrix of the matrix (you choose $$$(x_1,y_1)$$$, $$$(x_2,y_2)$$$, such that $$$x_1 \\\\leq x_2$$$, $$$y_1 \\\\leq y_2$$$, $$$x_2 - x_1 = y_2 - y_1$$$, then submatrix is a set of cells with coordinates $$$(x, y)$$$, such that $$$x_1 \\\\leq x \\\\leq x_2$$$, $$$y_1 \\\\leq y \\\\leq y_2$$$),choose an integer $$$k$$$, where $$$1 \\\\leq k \\\\leq n^2$$$,replace all integers in the submatrix with $$$k$$$.Please find the minimum number of operations that Misha needs to achieve his goal.InputThe first input line contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\leq n \\\\leq 500, 1 \\\\leq k \\\\leq n^2$$$)  — the size of the matrix and the desired amount of distinct elements in the matrix.Then $$$n$$$ lines follows. The $$$i$$$-th of them contains $$$n$$$ integers $$$a_{i, 1}, a_{i, 2}, \\\\ldots, a_{i, n}$$$ ($$$1 \\\\leq a_{i,j} \\\\leq n^2$$$) — the elements of the $$$i$$$-th row of the matrix.OutputOutput one integer — the minimum number of operations required.ExamplesInput3 4 1 1 1 1 1 2 3 4 5Output1Input3 2 2 1 3 2 1 1 3 1 2Output2Input3 3 1 1 1 1 1 2 2 2 2Output1Input3 2 1 1 1 1 2 1 2 2 2Output0NoteIn the first test case the answer is $$$1$$$, because one can change the value in the bottom right corner of the matrix to $$$1$$$. The resulting matrix can be found below:111112341In the second test case the answer is $$$2$$$. First, one can change the entire matrix to contain only $$$1$$$s, and the change the value of any single cell to $$$2$$$. One of the possible resulting matrices is displayed below:111111112", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "650fc1db", "template_md5": "465699a0", "result": "You are given a square grid of numbers. You want to change the grid so that it contains a specific number of unique numbers. You can do this by selecting a square section of the grid and replacing all the numbers in that section with the same number. Find the fewest number of times you need to do this."}, {"prompt_md5": "76ec7001", "template_md5": "35d339e4", "result": "You are given a square matrix of size $n \\times n$ filled with integers. Each cell in the matrix contains an integer between 1 and $n^2$. You want to modify the matrix so that it contains exactly $k$ distinct integers. \n\nYou can perform the following operation any number of times:\n\n1. Choose a square submatrix of the matrix. The submatrix must have equal dimensions (e.g., a 2x2 submatrix, a 3x3 submatrix, etc.).\n2. Replace all the integers in the chosen submatrix with a single integer of your choice (between 1 and $n^2$).\n\nFind the minimum number of operations required to achieve the desired result."}]}