{"uid": "1725-C", "url": "https://codeforces.com/contest/1725/problem/C", "tags": ["binary search", " combinatorics", " geometry", " math", " two pointers"], "title": "1725-C", "statement": "C. Circular Mirrortime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPak Chanek has a mirror in the shape of a circle. There are $$$N$$$ lamps on the circumference numbered from $$$1$$$ to $$$N$$$ in clockwise order. The length of the arc from lamp $$$i$$$ to lamp $$$i+1$$$ is $$$D_i$$$ for $$$1 \\\\leq i \\\\leq N-1$$$. Meanwhile, the length of the arc between lamp $$$N$$$ and lamp $$$1$$$ is $$$D_N$$$.Pak Chanek wants to colour the lamps with $$$M$$$ different colours. Each lamp can be coloured with one of the $$$M$$$ colours. However, there cannot be three different lamps such that the colours of the three lamps are the same and the triangle made by considering the three lamps as vertices is a right triangle (triangle with one of its angles being exactly $$$90$$$ degrees).The following are examples of lamp colouring configurations on the circular mirror.Figure 1. an example of an incorrect colouring because lamps $$$1$$$, $$$2$$$, and $$$3$$$ form a right triangleFigure 2. an example of a correct colouringFigure 3. an example of a correct colouringBefore colouring the lamps, Pak Chanek wants to know the number of distinct colouring configurations he can make. Count the number of distinct possible lamp colouring configurations, modulo $$$998\\\\,244\\\\,353$$$.InputThe first line contains two integers $$$N$$$ and $$$M$$$ ($$$1 \\\\le N \\\\le 3 \\\\cdot 10^5$$$, $$$2 \\\\le M \\\\le 3 \\\\cdot 10^5$$$) — the number of lamps in the mirror and the number of different colours used.The second line contains $$$N$$$ integers $$$D_1, D_2, \\\\ldots, D_N$$$ ($$$1 \\\\le D_i \\\\le 10^9$$$) — the lengths of the arcs between the lamps in the mirror.OutputAn integer representing the number of possible lamp colouring configurations, modulo $$$998\\\\,244\\\\,353$$$.ExamplesInput4 2 10 10 6 14Output10Input1 2 10Output2NoteIn the first example, all correct lamp colouring configurations are $$$[1, 1, 2, 1]$$$, $$$[1, 1, 2, 2]$$$, $$$[1, 2, 1, 2]$$$, $$$[1, 2, 2, 1]$$$, $$$[1, 2, 2, 2]$$$, $$$[2, 1, 1, 1]$$$, $$$[2, 1, 1, 2]$$$, $$$[2, 1, 2, 1]$$$, $$$[2, 2, 1, 1]$$$, and $$$[2, 2, 1, 2]$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e8b9f0d8", "template_md5": "35d339e4", "result": "There is a circular mirror with $N$ lamps numbered from 1 to $N$. The distance between lamp $i$ and lamp $i+1$ is $D_i$ for $1 \\le i \\le N-1$. The distance between lamp $N$ and lamp 1 is $D_N$.\n\nYou need to color the lamps with $M$ different colors.  No three lamps can be colored the same color if the triangle formed by those three lamps is a right triangle.\n\nFind the number of distinct ways to color the lamps, modulo 998244353. \n\nInput:\n\n* The first line contains two integers $N$ and $M$ ($1 \\le N \\le 3 \\cdot 10^5$, $2 \\le M \\le 3 \\cdot 10^5$)\n* The second line contains $N$ integers $D_1, D_2, ..., D_N$ ($1 \\le D_i \\le 10^9$)\n\nOutput:\n\n* An integer representing the number of possible color configurations, modulo 998244353."}, {"prompt_md5": "c8b5cb3f", "template_md5": "465699a0", "result": "You have a circular arrangement of items. You need to color the items with a given number of colors.  You can't color three items the same color if they form a right angle when connected.  Find the number of valid color arrangements."}]}