{"uid": "1725-K", "url": "https://codeforces.com/contest/1725/problem/K", "tags": ["data structures", " dsu"], "title": "1725-K", "statement": "K. Kingdom of Criticismtime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputPak Chanek is visiting a kingdom that earned a nickname \"Kingdom of Criticism\" because of how often its residents criticise each aspect of the kingdom. One aspect that is often criticised is the heights of the buildings. The kingdom has $$$N$$$ buildings. Initially, building $$$i$$$ has a height of $$$A_i$$$ units.At any point in time, the residents can give a new criticism, namely they currently do not like buildings with heights between $$$l$$$ and $$$r$$$ units inclusive for some two integers $$$l$$$ and $$$r$$$. It is known that $$$r-l$$$ is always odd.In $$$1$$$ minute, the kingdom's construction team can increase or decrease the height of any building by $$$1$$$ unit as long as the height still becomes a positive number. Each time they receive the current criticism from the residents, the kingdom's construction team makes it so that there are no buildings with heights between $$$l$$$ and $$$r$$$ units inclusive in theminimum time possible. It can be obtained that there is only one way to do this.Note that the construction team only cares about the current criticism from the residents. All previous criticisms are forgotten.There will be $$$Q$$$ queries that you must solve. Each query is one of the three following possibilities:1 k w: The kingdom's construction team changes the height of building $$$k$$$ to be $$$w$$$ units ($$$1 \\\\leq k \\\\leq N$$$, $$$1 \\\\leq w \\\\leq 10^9$$$).2 k: The kingdom's construction team wants you to find the height of building $$$k$$$ ($$$1 \\\\leq k \\\\leq N$$$).3 l r: The residents currently do not like buildings with heights between $$$l$$$ and $$$r$$$ units inclusive ($$$2 \\\\leq l \\\\leq r \\\\leq 10^9-1$$$, $$$r-l$$$ is odd).Note that each change in height still persists to the next queries.InputThe first line contains a single integer $$$N$$$ ($$$1 \\\\leq N \\\\leq 4 \\\\cdot 10^5$$$) — the number buildings in the kingdom.The second line contains $$$N$$$ integers $$$A_1, A_2, \\\\ldots, A_N$$$ ($$$1 \\\\leq A_i \\\\leq 10^9$$$) — the initial heights of the buildings.The next line contains a single integer $$$Q$$$ ($$$1 \\\\leq Q \\\\leq 4 \\\\cdot 10^5$$$) — the number of queries.The $$$j$$$-th of the next $$$Q$$$ lines contains the $$$j$$$-th query as described. There is at least one query of type $$$2$$$.OutputFor each query of type $$$2$$$, output a line containing an integer representing the height of the building asked.ExampleInput5 2 6 5 6 2 9 1 5 10 2 5 1 1 3 3 3 6 3 8 9 1 2 9 2 3 2 2 2 4Output10 7 9 7NoteAfter the $$$1$$$-st query, the height of each building is $$$2, 6, 5, 6, 10$$$.After the $$$3$$$-rd query, the height of each building is $$$3, 6, 5, 6, 10$$$.After the $$$4$$$-th query, the height of each building is $$$2, 7, 7, 7, 10$$$.After the $$$5$$$-th query, the height of each building is $$$2, 7, 7, 7, 10$$$.After the $$$6$$$-th query, the height of each building is $$$2, 9, 7, 7, 10$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bcd03084", "template_md5": "35d339e4", "result": "There are $N$ buildings, each with an initial height $A_i$.  You can change the height of a building by 1 unit at a time, as long as the height remains positive.\n\nThere are $Q$ queries. Each query is one of the following:\n\n1. **Change height:** Change the height of building $k$ to $w$ units.\n2. **Get height:** Find the height of building $k$.\n3. **Criticism:** The residents dislike buildings with heights between $l$ and $r$ inclusive.  You must adjust the heights of the buildings so that no building has a height in this range.\n\nYou must do this in the minimum number of steps possible.\n\n**Input:**\n\n* The first line contains $N$.\n* The second line contains the initial heights $A_1, A_2, ..., A_N$.\n* The third line contains $Q$.\n* The following $Q$ lines each contain a query.\n\n**Output:**\n\nFor each query of type 2, output the height of the building."}, {"prompt_md5": "02e68f6a", "template_md5": "465699a0", "result": "You are given a list of building heights.  You can change the height of any building by 1, as long as it remains positive.  You will be given queries:\n\n* Change the height of a specific building to a new value.\n* Find the current height of a specific building.\n*  A range of heights is disliked.  Change the building heights so that no building has a height within that range. \n\nYou must do this as quickly as possible."}]}