{"uid": "1725-B", "url": "https://codeforces.com/contest/1725/problem/B", "tags": ["binary search", " greedy", " sortings"], "title": "1725-B", "statement": "B. Basketball Togethertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA basketball competition is held where the number of players in a team does not have a maximum or minimum limit (not necessarily $$$5$$$ players in one team for each match). There are $$$N$$$ candidate players in the competition that will be trained by Pak Chanek, the best basketball coach on earth. The $$$i$$$-th candidate player has a power of $$$P_i$$$.Pak Chanek will form zero or more teams from the $$$N$$$ candidate players on the condition that each candidate player may only join in at most one team. Each of Pak Chanek's teams will be sent to compete once with an enemy team that has a power of $$$D$$$. In each match, the team sent is said to defeat the enemy team if the sum of powers from the formed players isstrictly greater than $$$D$$$.One of Pak Chanek's skills is that when a team that has been formed plays in a match, he can change the power of each player in the team to be equal to the biggest player power from the team.Determine the maximum number of wins that can be achieved by Pak Chanek.InputThe first line contains two integers $$$N$$$ and $$$D$$$ ($$$1 \\\\le N \\\\le 10^5$$$, $$$1 \\\\le D \\\\le 10^9$$$) — the number of candidate players and the power of the enemy team.The second line contains $$$N$$$ integers $$$P_1, P_2, \\\\ldots, P_N$$$ ($$$1 \\\\le P_i \\\\le 10^9$$$) — the powers of all candidate players.OutputA line containing an integer representing the maximum number of wins that can be achieved by Pak Chanek.ExampleInput6 180 90 80 70 60 50 100Output2NoteThe $$$1$$$-st team formed is a team containing players $$$4$$$ and $$$6$$$. The power of each player in the team becomes $$$100$$$. So the total power of the team is $$$100 + 100 = 200 > 180$$$.The $$$2$$$-nd team formed is a team containing players $$$1$$$, $$$2$$$, and $$$5$$$. The power of each player in the team becomes $$$90$$$. So the total power of the team is $$$90 + 90 + 90 = 270 > 180$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6e6a150a", "template_md5": "35d339e4", "result": "You are given $N$ players, each with a power level $P_i$.  You need to form teams of these players to compete against an enemy team with a power level $D$.  \n\nHere are the rules:\n\n* Each player can only be on one team.\n* A team wins if the sum of the powers of its players is strictly greater than $D$.\n* Before each match, you can change the power of each player on a team to be equal to the highest power on that team.\n\nWhat is the maximum number of wins you can achieve?"}, {"prompt_md5": "bc2e77e3", "template_md5": "465699a0", "result": "You have a group of people with different strengths. You need to form teams to compete against an opponent with a set strength.  Each team can have any number of people.  You can make all the people on a team have the same strength, equal to the highest strength on that team.  What is the maximum number of teams you can form that will defeat the opponent?"}]}