{"uid": "173-B", "url": "https://codeforces.com/contest/173/problem/B", "tags": ["dfs and similar", " shortest paths"], "title": "173-B", "statement": "B. Chamber of Secretstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdout\"The Chamber of Secrets has been opened again\" — this news has spread all around Hogwarts and some of the students have been petrified due to seeing the basilisk. Dumbledore got fired and now Harry is trying to enter the Chamber of Secrets. These aren't good news for Lord Voldemort. The problem is, he doesn't want anybody to be able to enter the chamber. The Dark Lord is going to be busy sucking life out of Ginny.The Chamber of Secrets is ann×mrectangular grid in which some of the cells are columns. A light ray (and a basilisk's gaze) passes through the columns without changing its direction. But with some spell we can make a column magic to reflect the light ray (or the gaze) in all four directions when it receives the ray. This is shown in the figure below.The left light ray passes through a regular column, and the right ray — through the magic column.The basilisk is located at the right side of the lower right cell of the grid and is looking to the left (in the direction of the lower left cell). According to the legend, anyone who meets a basilisk's gaze directly dies immediately. But if someone meets a basilisk's gaze through a column, this person will get petrified. We know that the door to the Chamber is located on the left side of the upper left corner of the grid and anyone who wants to enter will look in the direction of its movement (in the direction of the upper right cell) from that position.This figure illustrates the first sample test.Given the dimensions of the chamber and the location of regular columns, Lord Voldemort has asked you to find the minimum number of columns that we need to make magic so that anyone who wants to enter the chamber would be petrified or just declare that it's impossible to secure the chamber.InputThe first line of the input contains two integer numbersnandm(2 ≤n,m≤ 1000). Each of the nextnlines containsmcharacters. Each character is either \".\" or \"#\" and represents one cell of the Chamber grid. It's \".\" if the corresponding cell is empty and \"#\" if it's a regular column.OutputPrint the minimum number of columns to make magic or -1 if it's impossible to do.ExamplesInput3 3.#.....#.Output2Input4 3##.....#..#.Output2NoteThe figure above shows the first sample test. In the first sample we should make both columns magic. The dragon figure represents the basilisk and the binoculars represent the person who will enter the Chamber of secrets. The black star shows the place where the person will be petrified. Yellow lines represent basilisk gaze moving through columns.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ec89d0bd", "template_md5": "35d339e4", "result": "You are given a 2D grid of size $n \\times m$ representing a chamber. Some cells in the grid are marked with '#' which represent solid columns. The rest of the cells are empty.\n\nA basilisk is located at the bottom right corner of the grid and can see in a straight line to the left.  \n\nA person wants to enter the chamber from the top left corner and will move in a straight line to the right.\n\nYou can make any column 'magic' by changing it to reflect light in all four directions.\n\nYour task is to find the minimum number of columns you need to make magic so that the person entering the chamber will either be petrified (hit by the basilisk's gaze) or determine if it's impossible to secure the chamber."}, {"prompt_md5": "8442349e", "template_md5": "465699a0", "result": "You are given a rectangular grid. Some cells are blocked. A light source is at one corner and can only move horizontally or vertically.  You can change some cells to act as mirrors, reflecting the light in all directions.  Find the minimum number of cells you need to change so that the light will hit every blocked cell. If it's impossible, output -1."}]}