{"uid": "1730-C", "url": "https://codeforces.com/contest/1730/problem/C", "tags": ["data structures", " greedy", " math", " sortings"], "title": "1730-C", "statement": "C. Minimum Notationtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have a string $$$s$$$ consisting of digits from $$$0$$$ to $$$9$$$ inclusive. You can perform the following operation any (possibly zero) number of times:You can choose a position $$$i$$$ and delete a digit $$$d$$$ on the $$$i$$$-th position. Then insert the digit $$$\\\\min{(d + 1, 9)}$$$ on any position (at the beginning, at the end or in between any two adjacent digits).What is the lexicographically smallest string you can get by performing these operations?A string $$$a$$$ is lexicographically smaller than a string $$$b$$$ of the same length if and only if the following holds:in the first position where $$$a$$$ and $$$b$$$ differ, the string $$$a$$$ has a smaller digit than the corresponding digit in $$$b$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Then the test cases follow.Each test case consists of a single line that contains one string $$$s$$$ ($$$1 \\\\le |s| \\\\le 2 \\\\cdot 10^5$$$) — the string consisting of digits. Please note that $$$s$$$ is just a string consisting of digits, so leading zeros are allowed.It is guaranteed that the sum of lengths of $$$s$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputPrint a single string — the minimum string that is possible to obtain.ExampleInput404829901314752277691991Output02599 9 01 111334567888999NoteIn the first test case:Delete $$$8$$$ and insert $$$9$$$ at the end of the notation. The resulting notation is $$$04299$$$.Delete $$$4$$$ and insert $$$5$$$ in the $$$3$$$-rd position of the notation. The resulting notation is $$$02599$$$.Nothing needs to be done in the second and third test cases.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2adc88ca", "template_md5": "35d339e4", "result": "You are given a string of digits from 0 to 9. You can perform the following operation any number of times:\n\n1. Choose a digit in the string.\n2. Delete that digit.\n3. Insert the smallest digit greater than or equal to the deleted digit into the string (the digit 9 wraps around to 0).\n\nWhat is the lexicographically smallest string you can create by performing these operations?\n\nLexicographically smallest means that if you compare two strings, the string that comes earlier in alphabetical order is considered smaller. For example, \"025\" is lexicographically smaller than \"052\". \n\n\nInput:\n\nThe first line contains the number of test cases, *t*.\n\nEach test case consists of a single line containing a string of digits, *s*.\n\nOutput:\n\nFor each test case, print the lexicographically smallest string you can create."}, {"prompt_md5": "54328a8c", "template_md5": "465699a0", "result": "You are given a string of digits. You can repeatedly remove a digit from the string and insert the next larger digit (wrapping around from 9 to 0) at any position in the string. What is the smallest possible string you can create?"}]}