{"uid": "1731-B", "url": "https://codeforces.com/contest/1731/problem/B", "tags": ["greedy", " math"], "title": "1731-B", "statement": "B. Kill Demodogstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputDemodogs from the Upside-down have attacked Hawkins again. El wants to reach Mike and also kill as many Demodogs in the way as possible.Hawkins can be represented as an $$$n \\\\times n$$$ grid. The number of Demodogs in a cell at the $$$i$$$-th row and the $$$j$$$-th column is $$$i \\\\cdot j$$$. El is at position $$$(1, 1)$$$ of the grid, and she has to reach $$$(n, n)$$$ where she can find Mike.The only directions she can move are the right (from $$$(i, j)$$$ to $$$(i, j + 1)$$$) and the down (from $$$(i, j)$$$ to $$$(i + 1, j)$$$). She can't go out of the grid, as there are doors to the Upside-down at the boundaries.Calculate the maximum possible number of Demodogs $$$\\\\mathrm{ans}$$$ she can kill on the way, considering that she kills all Demodogs in cells she visits (including starting and finishing cells).Print $$$2022 \\\\cdot \\\\mathrm{ans}$$$ modulo $$$10^9 + 7$$$. Modulo $$$10^9 + 7$$$ because the result can be too large and multiplied by $$$2022$$$ because we are never gonna see it again!(Note, you firstly multiply by $$$2022$$$ andonly afterthat take the remainder.)InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$). Description of the test cases follows.The first line of each test case contains one integer $$$n$$$ ($$$2 \\\\leq n \\\\leq 10^9$$$) — the size of the grid.OutputFor each test case, print a single integer — the maximum number of Demodogs that can be killed multiplied by $$$2022$$$, modulo $$$10^9 + 7$$$.ExampleInput423501000000000Output14154 44484 171010650 999589541NoteIn the first test case, for any path chosen by her the number of Demodogs to be killed would be $$$7$$$, so the answer would be $$$2022 \\\\cdot 7 = 14154$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9dfb45c4", "template_md5": "35d339e4", "result": "You are given a square grid of size $n \\times n$. Each cell in the grid contains a number of Demodogs equal to the product of its row and column indices (e.g., the cell at row 2, column 3 contains $2 \\cdot 3 = 6$ Demodogs).\n\nYou start at the top-left corner of the grid $(1,1)$ and need to reach the bottom-right corner $(n,n)$. You can only move right or down.\n\nYour goal is to find the maximum number of Demodogs you can kill by visiting each cell exactly once.  \n\nOutput the result of multiplying the maximum number of Demodogs killed by 2022, then taking the remainder when divided by $10^9 + 7$."}, {"prompt_md5": "8a695829", "template_md5": "465699a0", "result": "You are on a grid of size n x n. You start at the top left corner and must reach the bottom right corner. You can only move right or down.  In each cell, there is a number of enemies equal to the product of the row and column number. You want to find the maximum number of enemies you can kill by the time you reach the bottom right corner."}]}