{"uid": "1733-E", "url": "https://codeforces.com/contest/1733/problem/E", "tags": ["constructive algorithms", " dp", " math"], "title": "1733-E", "statement": "E. Conveyortime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is a conveyor with $$$120$$$ rows and $$$120$$$ columns. Each row and column is numbered from $$$0$$$ to $$$119$$$, and the cell in $$$i$$$-th row and $$$j$$$-th column is denoted as $$$(i, j)$$$. The top leftmost cell is $$$(0, 0)$$$. Each cell has a belt, and all belts are initially facing to the right.Initially, a slime ball is on the belt of $$$(0, 0)$$$, and other belts are empty. Every second, the state of the conveyor changes as follows:All slime balls on the conveyor move one cell in the direction of the belt at the same time. If there is no cell in the moved position, the slime gets out of the conveyor, and if two slime balls move to the same cell, they merge into one.All belts with slime ball in the previous second change direction at the same time: belts facing to the right become facing to the down, and vice versa.A new slime ball is placed on cell $$$(0, 0)$$$.There are $$$q$$$ queries, each being three integers $$$t$$$, $$$x$$$, and $$$y$$$. You have to find out if there is a slime at the cell $$$(x, y)$$$ after $$$t$$$ seconds from the start. Can you do it?InputThe first line contains one integer $$$q$$$ ($$$1 \\\\le q \\\\le 10^4$$$) — the number of queries.The only line of each query contains three integers $$$t$$$, $$$x$$$, and $$$y$$$ ($$$0 \\\\le t \\\\le 10^{18}$$$, $$$0 \\\\le x, y < 120$$$).OutputPrint the answer for each test case, one per line. If there is a slime ball in the cell $$$(x, y)$$$ after $$$t$$$ seconds from the initial state, print \"YES\". Otherwise, print \"NO\".ExampleInput61 1 05 1 30 0 02 4 52 0 21547748756 100 111OutputNO YES YES NO YES YESNoteThe state of conveyor with $$$t = 0$$$. Red arrow represents the direction of each belt, and blue figure represents slime.The state of conveyor with $$$t = 1$$$.The state of conveyor with $$$t = 2$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8b8694a3", "template_md5": "35d339e4", "result": "You have a 120x120 grid. Each cell has a belt that can face either right or down.  \n\nInitially, a slime ball is on the belt of cell (0,0) and all other belts are empty.\n\nEvery second, the following happens:\n\n1. All slime balls move one cell in the direction of their belt. If a slime ball reaches the edge of the grid, it is removed. If two slime balls land on the same cell, they merge into one.\n2. All belts that had a slime ball on them in the previous second change direction (right becomes down, down becomes right).\n3. A new slime ball is placed on cell (0,0).\n\nYou are given  *q* queries, each asking if there is a slime ball in cell (x,y) after *t* seconds. \n\nFor each query, output \"YES\" if there is a slime ball in cell (x,y) after *t* seconds, and \"NO\" otherwise."}, {"prompt_md5": "75e41b0c", "template_md5": "465699a0", "result": "A conveyor belt has 120 rows and 120 columns.  A slime ball starts at the top left corner. Every second, the slime ball moves in the direction the belt is facing. If it hits the edge, it falls off. If two slime balls meet, they combine.  The direction of all belts changes at the same time. A new slime ball appears at the top left corner each second.  \n\nYou are given a time and a location.  Determine if a slime ball will be at that location at that time."}]}