{"uid": "1735-B", "url": "https://codeforces.com/contest/1735/problem/B", "tags": ["greedy", " math"], "title": "1735-B", "statement": "B. Tea with Tangerinestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ pieces of tangerine peel, the $$$i$$$-th of them has size $$$a_i$$$. In one step it is possible to divide one piece of size $$$x$$$ into two pieces of positive integer sizes $$$y$$$ and $$$z$$$ so that $$$y + z = x$$$.You want that for each pair of pieces, their sizes differstrictlyless than twice. In other words, there should not be two pieces of size $$$x$$$ and $$$y$$$, such that $$$2x \\\\le y$$$. What is the minimum possible number of steps needed to satisfy the condition?InputThe first line of the input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of test cases. The description of test cases follows.The first line of each test case contains the integer $$$n$$$ ($$$1 \\\\le n \\\\le 100$$$).Then one line follows, containing $$$n$$$ integers $$$a_1 \\\\le a_2 \\\\le \\\\ldots \\\\le a_n$$$ ($$$1 \\\\le a_i \\\\le 10^7$$$).OutputFor each test case, output a single line containing the minimum number of steps.ExampleInput351 2 3 4 5110335600 900 1300 2000 2550Output10 0 4NoteIn the first test case, we initially have a piece of size $$$1$$$, so all final pieces must have size $$$1$$$. The total number of steps is: $$$0 + 1 + 2 + 3 + 4 = 10$$$.In the second test case, we have just one piece, so we don't need to do anything, and the answer is $$$0$$$ steps.In the third test case, one of the possible cut options is: $$$600,\\\\ 900,\\\\ (600 | 700),\\\\ (1000 | 1000),\\\\ (1000 | 1000 | 550)$$$. You can see this option in the picture below. The maximum piece has size $$$1000$$$, and it is less than $$$2$$$ times bigger than the minimum piece of size $$$550$$$. $$$4$$$ steps are done. We can show that it is the minimum possible number of steps.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "05f5f1a8", "template_md5": "35d339e4", "result": "You are given $n$ pieces of tangerine peel, each with a size $a_i$. You can divide a piece of size $x$ into two pieces of positive integer sizes $y$ and $z$ such that $y + z = x$.\n\nYour goal is to find the minimum number of steps needed to divide the tangerine peels so that for every pair of pieces, the size difference is strictly less than twice the smaller size. In other words, there should not be two pieces of size $x$ and $y$ such that $2x \\le y$. \n\n**Input:**\n\n* The first line contains $t$ (the number of test cases).\n* For each test case:\n    * The first line contains $n$ (the number of tangerine peels).\n    * The next line contains $n$ integers $a_1, a_2, ..., a_n$ (the sizes of the tangerine peels).\n\n**Output:**\n\nFor each test case, output the minimum number of steps needed."}, {"prompt_md5": "8984ee8f", "template_md5": "465699a0", "result": "You have a list of numbers representing the sizes of tangerine peels. You can split a peel into two smaller peels as long as the sizes of the two new peels add up to the original size.  The goal is to split the peels as many times as needed so that the difference in size between any two peels is less than double the size of the smaller peel. What is the minimum number of splits needed?"}]}