{"uid": "1738-C", "url": "https://codeforces.com/contest/1738/problem/C", "tags": ["dp", " games", " greedy", " math"], "title": "1738-C", "statement": "C. Even Number Addictstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputAlice and Bob are playing a game on a sequence $$$a_1, a_2, \\\\dots, a_n$$$ of length $$$n$$$. They move in turns andAlice moves first.In the turn of each player, he or she should select an integer and remove it from the sequence. The game ends when there is no integer left in the sequence.Alice wins if the sum of her selected integers iseven; otherwise, Bob wins.Your task is to determine who will win the game, if both players play optimally.InputEach test contains multiple test cases. The first line contains an integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 100$$$) — the number of test cases. The following lines contain the description of each test case.The first line of each test case contains an integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 100$$$), indicating the length of the sequence.The second line of each test case contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$-10^9 \\\\leq a_i \\\\leq 10^9$$$), indicating the elements of the sequence.OutputFor each test case, output \"Alice\" (without quotes) if Alice wins and \"Bob\" (without quotes) otherwise.ExampleInput431 3 541 3 5 741 2 3 4410 20 30 40OutputAlice Alice Bob AliceNoteIn the first and second test cases, Alice always selects two odd numbers, so the sum of her selected numbers is always even. Therefore, Alice always wins.In the third test case, Bob has a winning strategy that he always selects a number with the same parity as Alice selects in her last turn. Therefore, Bob always wins.In the fourth test case, Alice always selects two even numbers, so the sum of her selected numbers is always even. Therefore, Alice always wins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6fc3b98f", "template_md5": "465699a0", "result": "Two players take turns removing numbers from a list. The first player to remove numbers that add up to an even number wins. Determine who wins if both players play perfectly."}, {"prompt_md5": "427134c5", "template_md5": "35d339e4", "result": "You are given a sequence of numbers. Two players take turns removing one number from the sequence. The player who removes the last number wins.  The winner is determined by the sum of the numbers they removed. If the sum is even, the player wins. Otherwise, the other player wins.  Determine who will win if both players play optimally. \n\nInput:\n\n* The first line contains the number of test cases.\n* Each test case starts with the length of the sequence.\n* The next line contains the sequence of numbers.\n\nOutput:\n\n* For each test case, output \"Alice\" if Alice wins and \"Bob\" if Bob wins."}]}