{"uid": "1738-A", "url": "https://codeforces.com/contest/1738/problem/A", "tags": ["greedy", " implementation", " sortings"], "title": "1738-A", "statement": "A. Glory Addictstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThe hero is addicted to glory, and is fighting against a monster.The hero has $$$n$$$ skills. The $$$i$$$-th skill is of type $$$a_i$$$ (eitherfireorfrost) and has initial damage $$$b_i$$$.The hero can perform all of the $$$n$$$ skills in any order (with each skill performed exactlyonce). When performing each skill, the hero can play a magic as follows:If the current skill immediately follows another skill of a different type, then its damage isdoubled.In other words,If a skill of type fire and with initial damage $$$c$$$ is performed immediately after a skill of type fire, then it will deal $$$c$$$ damage;If a skill of type fire and with initial damage $$$c$$$ is performed immediately after a skill of type frost, then it will deal $$$2c$$$ damage;If a skill of type frost and with initial damage $$$c$$$ is performed immediately after a skill of type fire, then it will deal $$$2c$$$ damage;If a skill of type frost and with initial damage $$$c$$$ is performed immediately after a skill of type frost , then it will deal $$$c$$$ damage.Your task is to find themaximumdamage the hero can deal.InputEach test contains multiple test cases. The first line contains an integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^5$$$) — the number of test cases. The following lines contain the description of each test case.The first line of each test case contains an integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 10^5$$$), indicating the number of skills.The second line of each test case contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$0 \\\\leq a_i \\\\leq 1$$$), where $$$a_i$$$ indicates the type of the $$$i$$$-th skill. Specifically, the $$$i$$$-th skill is of type fire if $$$a_i = 0$$$, and of type frost if $$$a_i = 1$$$.The third line of each test case contains $$$n$$$ integers $$$b_1, b_2, \\\\dots, b_n$$$ ($$$1 \\\\leq b_i \\\\leq 10^9$$$), where $$$b_i$$$ indicates the initial damage of the $$$i$$$-th skill.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case, output the maximum damage the hero can deal.ExampleInput440 1 1 11 10 100 100060 0 0 1 1 13 4 5 6 7 831 1 11000000000 1000000000 1000000000111Output2112 63 3000000000 1NoteIn the first test case, we can order the skills by $$$[3, 1, 4, 2]$$$, and the total damage is $$$100 + 2 \\\\times 1 + 2 \\\\times 1000 + 10 = 2112$$$.In the second test case, we can order the skills by $$$[1, 4, 2, 5, 3, 6]$$$, and the total damage is $$$3 + 2 \\\\times 6 + 2 \\\\times 4 + 2 \\\\times 7 + 2 \\\\times 5 + 2 \\\\times 8 = 63$$$.In the third test case, we can order the skills by $$$[1, 2, 3]$$$, and the total damage is $$$1000000000 + 1000000000 + 1000000000 = 3000000000$$$.In the fourth test case, there is only one skill with initial damage $$$1$$$, so the total damage is $$$1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c7287ba3", "template_md5": "35d339e4", "result": "You are given an array of $n$ skills, where each skill has a type ($0$ for fire or $1$ for frost) and an initial damage value.  The hero can perform these skills in any order, but the damage of a skill is doubled if it immediately follows a skill of a different type.\n\nFind the maximum total damage the hero can deal.\n\n**Input:**\n\n* $t$: the number of test cases\n* For each test case:\n    * $n$: the number of skills\n    * $a_1, a_2, ..., a_n$: an array of 0s and 1s representing the type of each skill\n    * $b_1, b_2, ..., b_n$: an array of integers representing the initial damage of each skill\n\n**Output:**\n\n* For each test case, output the maximum total damage the hero can deal."}, {"prompt_md5": "e04a1f4b", "template_md5": "465699a0", "result": "You have a list of actions, each with a type (fire or frost) and a damage value.  You can perform the actions in any order, but if an action's type is different from the previous action, its damage is doubled.  Find the highest total damage you can achieve."}]}