{"uid": "1739-F", "url": "https://codeforces.com/contest/1739/problem/F", "tags": ["bitmasks", " data structures", " dp", " string suffix structures", " strings"], "title": "1739-F", "statement": "F. Keyboard Designtime limit per test4 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputMonocarp has a dictionary of $$$n$$$ words, consisting of $$$12$$$ first letters of the Latin alphabet. The words are numbered from $$$1$$$ to $$$n$$$. In every pair of adjacent characters in each word, the characters are different. For every word $$$i$$$, Monocarp also has an integer $$$c_i$$$ denoting how often he uses this word.Monocarp wants to design a keyboard that would allow him to type some of the words easily. A keyboard can be denoted as a sequence of $$$12$$$ first letters of the Latin alphabet, where each letter fromatolappears exactly once.A word can be typed with the keyboard easily if, for every pair of adjacent characters in the word, these characters are adjacent in the keyboard as well. Theoptimalityof the keyboard is the sum of $$$c_i$$$ over all words $$$i$$$ that can be typed easily with it.Help Monocarp to design a keyboard with the maximum possible optimality.InputThe first line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 1000$$$) — the number of words.Then, $$$n$$$ lines follow. The $$$i$$$-th of them contains an integer $$$c_i$$$ ($$$1 \\\\le c_i \\\\le 10^5$$$) and a string $$$s_i$$$ ($$$2 \\\\le |s_i| \\\\le 2000$$$) denoting the $$$i$$$-th word. Each character of $$$s_i$$$ is one of $$$12$$$ first letters of Latin alphabet, in lowercase. For every $$$j \\\\in [1, |s_i| - 1]$$$, the $$$j$$$-th character of $$$s_i$$$ is different from the $$$(j+1)$$$-th one.Additional constraint on the input: $$$\\\\sum \\\\limits_{i=1}^{n} |s_i| \\\\le 2000$$$.OutputPrint a sequence of $$$12$$$ first letters of the Latin alphabet, where each letter fromatolappears exactly once, denoting the optimal keyboard. If there are multiple answers, you may print any of them.ExamplesInput3 7 abacaba 10 cba 4 dbOutputhjkildbacefgInput1 100 abcaOutputabcdefghijkl", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d4851145", "template_md5": "35d339e4", "result": "There are $n$ words, each consisting of 2 to 2000 letters from the first 12 letters of the alphabet. Each word appears a certain number of times ($c_i$).\n\nYou need to design a keyboard with the 12 letters arranged in a specific order.  A word can be typed easily if the letters in the word are next to each other on the keyboard.\n\nThe goal is to find a keyboard arrangement that allows typing the most words easily (i.e., maximizes the sum of $c_i$ for all easily typable words). \n\nPrint the arrangement of the 12 letters that achieves this."}, {"prompt_md5": "97e8fbd8", "template_md5": "465699a0", "result": "You are given a list of words and how often each word is used. Design a keyboard layout with the 12 letters a-l in a specific order.  The goal is to arrange the letters so that the sum of the usage counts for words that can be typed easily on this keyboard is maximized.  A word can be typed easily if the letters in the word are next to each other on the keyboard."}]}