{"uid": "1739-A", "url": "https://codeforces.com/contest/1739/problem/A", "tags": ["implementation"], "title": "1739-A", "statement": "A. Immobile Knighttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is a chess board of size $$$n \\\\times m$$$. The rows are numbered from $$$1$$$ to $$$n$$$, the columns are numbered from $$$1$$$ to $$$m$$$.Let's call a cellisolatedif a knight placed in that cell can't move to any other cell on the board. Recall that a chess knight moves two cells in one direction and one cell in a perpendicular direction:Find anyisolatedcell on the board. If there are no such cells, print any cell on the board.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 64$$$) — the number of testcases.The only line of each testcase contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 8$$$) — the number of rows and columns of the board.OutputFor each testcase, print two integers — the row and the column of anyisolatedcell on the board. If there are no such cells, print any cell on the board.ExampleInput31 78 83 3Output1 7 7 2 2 2NoteIn the first testcase, all cells areisolated. A knight can't move from any cell of the board to any other one. Thus, any cell on board is a correct answer.In the second testcase, there are noisolatedcells. On a normal chess board, a knight has at least two moves from any cell. Thus, again, any cell is a correct answer.In the third testcase, only the middle cell of the board isisolated. The knight can move freely around the border of the board, but can't escape the middle.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "33519664", "template_md5": "35d339e4", "result": "You are given a chessboard of size $n \\times m$.  Find any cell on the board that a knight cannot move to any other cell from. If no such cell exists, print any cell on the board. \n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 64$) representing the number of test cases.\n* For each test case, the only line contains two integers $n$ and $m$ ($1 \\le n, m \\le 8$) representing the number of rows and columns of the board.\n\nOutput:\n\n* For each test case, print two integers representing the row and column of a cell that meets the criteria. If no such cell exists, print any cell on the board."}, {"prompt_md5": "5389d4f4", "template_md5": "465699a0", "result": "You are given a grid of a certain size.  Determine if there is a cell on the grid where a chess knight cannot move to any other cell on the grid. If such a cell exists, output its row and column. If not, output the row and column of any cell on the grid."}]}