{"uid": "1741-A", "url": "https://codeforces.com/contest/1741/problem/A", "tags": ["implementation", " implementation", " strings"], "title": "1741-A", "statement": "A. Compare T-Shirt Sizestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputTwo T-shirt sizes are given: $$$a$$$ and $$$b$$$. The T-shirt size is either a stringMor a string consisting of several (possibly zero) charactersXand one of the charactersSorL.For example, stringsM,XXL,S,XXXXXXXScould be the size of some T-shirts. And the stringsXM,LL,SXare not sizes.The letterMstands for medium,Sfor small,Lfor large. The letterXrefers to the degree of size (from eXtra). For example,XXLis extra-extra-large (bigger thanXL, and smaller thanXXXL).You need to compare two given sizes of T-shirts $$$a$$$ and $$$b$$$.The T-shirts are compared as follows:any small size (no matter how many lettersX) is smaller than the medium size and any large size;any large size (regardless of the number of lettersX) is larger than the medium size and any small size;the more lettersXbeforeS, the smaller the size;the more lettersXin front ofL, the larger the size.For example:XXXS<XSXXXL>XLXL>MXXL=XXLXXXXXS<MXL>XXXSInputThe first line of the input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Each test case consists of one line, in which $$$a$$$ and $$$b$$$ T-shirt sizes are written. The lengths of the strings corresponding to the T-shirt sizes do not exceed $$$50$$$. It is guaranteed that all sizes are correct.OutputFor each test case, print on a separate line the result of comparing $$$a$$$ and $$$b$$$ T-shirt sizes (lines \"<\", \">\" or \"=\" without quotes).ExampleInput6XXXS XSXXXL XLXL MXXL XXLXXXXXS ML MOutput< > > = < >", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4be7b122", "template_md5": "465699a0", "result": "You are given two T-shirt sizes.  Compare the sizes based on these rules:\n\n* Small sizes are smaller than medium and large sizes.\n* Large sizes are larger than medium and small sizes.\n* More \"X\" before \"S\" means the size is smaller.\n* More \"X\" before \"L\" means the size is larger.\n\nOutput \"<\" if the first size is smaller, \">\" if it's larger, and \"=\" if they are the same."}, {"prompt_md5": "15acd0b1", "template_md5": "35d339e4", "result": "You are given two T-shirt sizes,  $a$ and $b$.  A T-shirt size is a string that can contain the letters 'M', 'S', 'L', and 'X'. \n\n* 'M' stands for medium.\n* 'S' stands for small.\n* 'L' stands for large.\n* 'X' represents an extra size. For example, 'XXL' is extra-extra-large.\n\nHere's how to compare the sizes:\n\n* Any small size is smaller than a medium size and a large size.\n* Any large size is larger than a medium size and a small size.\n* The more 'X' characters before 'S', the smaller the size.\n* The more 'X' characters before 'L', the larger the size.\n\nFor each pair of sizes, determine if $a$ is less than, greater than, or equal to $b$."}]}