{"uid": "1742-C", "url": "https://codeforces.com/contest/1742/problem/C", "tags": ["implementation"], "title": "1742-C", "statement": "C. Stripestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn an $$$8 \\\\times 8$$$ grid, some horizontal rows have been painted red, and some vertical columns have been painted blue, in some order. The stripes are drawn sequentially, one after the other. When the stripe is drawn, it repaints all the cells through which it passes.Determine which color was used last.The red stripe was painted after the blue one, so the answer isR.InputThe first line of the input contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 4000$$$) — the number of test cases. The description of test cases follows. There is an empty line before each test case.Each test case consists of $$$8$$$ lines, each containing $$$8$$$ characters. Each of these characters is either 'R', 'B', or '.', denoting a red square, a blue square, and an unpainted square, respectively.It is guaranteed that the given field is obtained from a colorless one by drawing horizontal red rows and vertical blue columns.At least one stripe is painted.OutputFor each test case, output 'R' if a red stripe was painted last, and 'B' if a blue stripe was painted last (without quotes).ExampleInput4....B.......B.......B...RRRRRRRR....B.......B.......B.......B...RRRRRRRBB......BB......BB......BB......BB......BB......BRRRRRRRBRRRRRRBB.B.B..BBRRRRRRBB.B.B..BB.B.B..BBRRRRRRBB.B.B..BB.B.B..BB........................RRRRRRRR................................OutputR B B RNoteThe first test case is pictured in the statement.In the second test case, the first blue column is painted first, then the first and last red rows, and finally the last blue column. Since a blue stripe is painted last, the answer isB.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2fb97e75", "template_md5": "35d339e4", "result": "You are given an 8x8 grid. Some rows are painted red and some columns are painted blue. The painting happens sequentially, one stripe at a time.  Determine the color of the last stripe painted.\n\nInput:\n\n* The first line contains the number of test cases (1 to 4000).\n* Each test case is followed by an empty line.\n* Each test case consists of 8 lines, each with 8 characters.\n* Characters can be 'R' (red), 'B' (blue), or '.' (empty).\n\nOutput:\n\n* For each test case, output 'R' if the last stripe painted was red, and 'B' if it was blue."}, {"prompt_md5": "8d9cdf37", "template_md5": "465699a0", "result": "You are given an 8x8 grid with some rows painted red and some columns painted blue.  Determine the color of the last stripe painted."}]}