{"uid": "1746-G", "url": "https://codeforces.com/contest/1746/problem/G", "tags": ["binary search", " data structures", " dp", " flows", " geometry", " implementation", " sortings"], "title": "1746-G", "statement": "G. Olympiad Trainingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAnton decided to get ready for an Olympiad in Informatics. Ilya prepared $$$n$$$ tasks for him to solve. It is possible to submit the solution for the $$$i$$$-th task in the first $$$d_{i}$$$ days only. Antoncannotsolve more than one task a day. Ilya estimated the usefulness of the $$$i$$$-th tasks as $$$r_{i}$$$ and divided the tasks into three topics, the topic of the $$$i$$$-th task is $$$type_{i}$$$.Anton wants to solve exactly $$$a$$$ tasks on the first topic, $$$b$$$ tasks on the second topic and $$$c$$$ tasks on the third topic. Tell Anton if it is possible to do so, and if it is, calculate the maximum total usefulness of the tasks he may solve.InputThe first line of input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains four integers $$$n, a, b, c$$$ ($$$1 \\\\le n \\\\le 10^5$$$, $$$0 \\\\le a, b, c \\\\le n$$$).The following $$$n$$$ lines contain three integers each — $$$r_i, type_i, d_i$$$ ($$$0 \\\\le r_i \\\\le 10^{9}$$$, $$$1 \\\\le type_i \\\\le 3$$$, $$$1 \\\\le d_i \\\\le n$$$).The sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case print $$$-1$$$ if Anton cannot reach his goal; otherwise, print the maximum usefulness of the tasks he will solve.ExampleInput44 1 1 01 2 11 1 10 1 21 2 23 1 1 11 1 27 2 19 3 24 2 1 0100 2 15 2 37 1 25 1 25 1 1 110 3 19 2 320 1 116 1 41 3 4Output2 -1 17 35NoteIn the first test case from the sample test Anton can solve tasks $$$2$$$ and $$$4$$$.In the second test case from the sample test it is impossible to fulfill Anton's wish.In the third test case from the sample test it is optimal to solve tasks $$$2$$$, $$$3$$$ and $$$4$$$.In the last test case from the sample test it is optimal to solve tasks $$$1$$$, $$$2$$$ and $$$4$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "994cc62e", "template_md5": "35d339e4", "result": "You are given $n$ tasks, each with a usefulness value ($r_i$), a topic ($type_i$), and a deadline ($d_i$).  \n\nThere are three topics (1, 2, and 3). You need to solve $a$ tasks from topic 1, $b$ tasks from topic 2, and $c$ tasks from topic 3.\n\nDetermine if it is possible to solve the required number of tasks from each topic while respecting the deadlines. If it is possible, find the maximum total usefulness of the tasks that can be solved."}, {"prompt_md5": "9c034dc8", "template_md5": "465699a0", "result": "You are given a set of tasks with a deadline, a usefulness score, and a category. You need to select tasks from each category to maximize the total usefulness, while respecting the deadlines.  Can you select the desired number of tasks from each category and what is the maximum total usefulness?"}]}