{"uid": "175-B", "url": "https://codeforces.com/contest/175/problem/B", "tags": ["implementation"], "title": "175-B", "statement": "B. Plane of Tanks: Protime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya has been playing Plane of Tanks with his friends the whole year. Now it is time to divide the participants into several categories depending on their results.A player is given a non-negative integer number of points in each round of the Plane of Tanks. Vasya wrote results for each round of the last year. He hasnrecords in total.In order to determine a player's category consider the best result obtained by the player and the best results of other players. The player belongs to category:\"noob\" — ifmore than50%of players have better results;\"random\" — if his result is not worse than the result that50%of players have, but more than20%of players have better results;\"average\" — if his result is not worse than the result that80%of players have, but more than10%of players have better results;\"hardcore\" — if his result is not worse than the result that90%of players have, but more than1%of players have better results;\"pro\" — if his result is not worse than the result that99%of players have.When the percentage is calculated the player himself is taken into account. That means that if two players played the game and the first one gained 100 points and the second one 1000 points, then the first player's result is not worse than the result that50%of players have, and the second one is not worse than the result that100%of players have.Vasya gave you the last year Plane of Tanks results. Help Vasya determine each player's category.InputThe first line contains the only integer numbern(1 ≤n≤ 1000) — a number of records with the players' results.Each of the nextnlines contains a player's name and the amount of points, obtained by the player for the round, separated with a space. The name contains not less than 1 and no more than 10 characters. The name consists of lowercase Latin letters only. It is guaranteed that any two different players have different names. The amount of points, obtained by the player for the round, is a non-negative integer number and does not exceed 1000.OutputPrint on the first line the numberm— the number of players, who participated in one round at least.Each one of the nextmlines should contain a player name and a category he belongs to, separated with space. Category can be one of the following: \"noob\", \"random\", \"average\", \"hardcore\" or \"pro\" (without quotes). The name of each player should be printed only once. Player names with respective categories can be printed in an arbitrary order.ExamplesInput5vasya 100vasya 200artem 100kolya 200igor 250Output4artem noobigor prokolya randomvasya randomInput3vasya 200kolya 1000vasya 1000Output2kolya provasya proNoteIn the first example the best result, obtained byartemis not worse than the result that25%of players have (his own result), so he belongs to category \"noob\".vasyaandkolyahave best results not worse than the results that75%players have (both of them andartem), so they belong to category \"random\".igorhas best result not worse than the result that100%of players have (all other players and himself), so he belongs to category \"pro\".In the second example both players have the same amount of points, so they have results not worse than100%players have, so they belong to category \"pro\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1a677355", "template_md5": "35d339e4", "result": "You are given a list of scores from a game.  Each score is associated with a player.  Determine the category of each player based on their score compared to the scores of other players.\n\nHere's how to determine the category:\n\n* **noob:**  More than 50% of players have a better score.\n* **random:**  The player's score is not worse than the score of the player with the 50th percentile score, but more than 20% of players have a better score.\n* **average:** The player's score is not worse than the score of the player with the 80th percentile score, but more than 10% of players have a better score.\n* **hardcore:** The player's score is not worse than the score of the player with the 90th percentile score, but more than 1% of players have a better score.\n* **pro:** The player's score is not worse than the score of the player with the 99th percentile score.\n\nOutput the number of players and then list each player's name followed by their category."}, {"prompt_md5": "d94d4f18", "template_md5": "465699a0", "result": "Given a list of scores, determine the category each score belongs to based on its rank compared to the other scores.  Categories are defined by percentiles:\n\n* **noob:**  Score is worse than 50% of the other scores.\n* **random:** Score is not worse than the score of the 50th percentile, but worse than the 20th percentile.\n* **average:** Score is not worse than the score of the 80th percentile, but worse than the 10th percentile.\n* **hardcore:** Score is not worse than the score of the 90th percentile, but worse than the 1st percentile.\n* **pro:** Score is not worse than the score of the 99th percentile."}]}