{"uid": "1750-F", "url": "https://codeforces.com/contest/1750/problem/F", "tags": ["combinatorics", " dp", " math", " strings"], "title": "1750-F", "statement": "F. Majoritytime limit per test2 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputEveryone was happy coding, until suddenly a power shortage happened and the best competitive programming site went down. Fortunately, a system administrator bought some new equipment recently, including some UPSs. Thus there are some servers that are still online, but we need all of them to be working in order to keep the round rated.Imagine the servers being a binary string $$$s$$$ of length $$$n$$$. If the $$$i$$$-th server is online, then $$$s_i = 1$$$, and $$$s_i = 0$$$ otherwise.A system administrator can do the following operation calledelectricity spread, that consists of the following phases:Select two servers at positions $$$1 \\\\le i < j \\\\le n$$$ such that both are online (i.e. $$$s_i=s_j=1$$$). The spread starts only from online servers.Check if we have enough power to make the spread. We consider having enough power if the number of turned on servers in range $$$[i, j]$$$ is at least the number of turned off servers in range $$$[i, j]$$$. More formally, check whether $$$2 \\\\cdot (s_i + s_{i+1} + \\\\ldots + s_j) \\\\ge j - i + 1$$$.If the check is positive, turn on all the offline servers in range $$$[i, j]$$$. More formally, make $$$s_k := 1$$$ for all $$$k$$$ from $$$i$$$ to $$$j$$$.We call a binary string $$$s$$$ of length $$$n$$$ratedif we can turn on all servers (i.e. make $$$s_i = 1$$$ for $$$1 \\\\le i \\\\le n$$$) using the electricity spread operation any number of times (possibly, $$$0$$$). Your task is to find the number of rated strings of length $$$n$$$ modulo $$$m$$$.InputThe first and only line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 5000$$$, $$$10 \\\\le m \\\\le 10^9$$$) — the length of the string and the required module.OutputPrint a single integer — the number of rated binary strings of length $$$n$$$. Since this number can be large, print it modulo $$$m$$$.ExamplesInput2 100Output1Input3 10Output2Input4 3271890Output4Input17 123456Output32347NoteIn the first example, the only rated string is11. So the answer is $$$1$$$.In the second example, the rated strings are:111;101, because we can perform an operation with $$$i = 1$$$ and $$$j = 3$$$.So the answer is $$$2$$$.In the third sample, the rated strings are:1001;1111;1011;1101.So the answer is $$$4$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b610dcd5", "template_md5": "35d339e4", "result": "You are given a binary string of length $n$ representing servers, where 1 means online and 0 means offline. You can perform an operation called \"electricity spread\" as follows:\n\n1. Choose two online servers $i$ and $j$ ($i < j$).\n2. Check if the number of online servers between $i$ and $j$ (inclusive) is at least half the total number of servers between $i$ and $j$ (inclusive).\n3. If the condition in step 2 is true, turn on all offline servers between $i$ and $j$.\n\nDetermine the number of binary strings of length $n$ that can be made fully online (all servers 1) using the \"electricity spread\" operation any number of times. Output the result modulo $m$."}, {"prompt_md5": "19527f76", "template_md5": "465699a0", "result": "You are given a string of 0s and 1s.  You can perform an operation on a range of consecutive 1s in the string.  The operation turns all 0s in that range to 1s if there are at least as many 1s as 0s in the range.  Determine how many different strings can be made rated (all 1s) using this operation."}]}