{"uid": "1759-A", "url": "https://codeforces.com/contest/1759/problem/A", "tags": ["implementation", " strings"], "title": "1759-A", "statement": "A. Yes-Yes?time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou talked to Polycarp and asked him a question. You know that when he wants to answer \"yes\", he repeatsYesmany times in a row.Because of the noise, you only heard part of the answer — some substring of it. That is, if he answeredYesYes, then you could hearesY,YesYes,sYes,e, but you couldn'tYess,YESorse.Determine if it is true that the given string $$$s$$$ is a substring ofYesYesYes...(Yesrepeated many times in a row).InputThe first line of input data contains the singular $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases in the test.Each test case is described by a single string of Latin letters $$$s$$$ ($$$1 \\\\le |s| \\\\le 50$$$) — the part of Polycarp's answer that you heard, where $$$|s|$$$ — is the length of the string $$$s$$$.OutputOutput $$$t$$$ lines, each of which is the answer to the corresponding test case. As an answer, output \"YES\" if the specified string $$$s$$$ is a substring of the stringYesYesYes...Yes(the number of wordsYesis arbitrary), and \"NO\" otherwise.You can output the answer in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive answer).ExampleInput12YESesYescodeforcesesseYesYesYesYesYesYesYesYeseYYesssYoYesOutputNO YES NO YES NO YES YES NO NO YES NO YES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "876422cb", "template_md5": "35d339e4", "result": "You hear a repeated sequence of the word \"Yes\".  You only hear a portion of this sequence.  Given a string, determine if it is a subsequence of the repeated \"Yes\" sequence.\n\nInput:\n\n* The first line contains the number of test cases, $t$ ($1 \\le t \\le 1000$).\n* Each test case is a string, $s$ ($1 \\le |s| \\le 50$), representing the portion of the \"Yes\" sequence you heard.\n\nOutput:\n\n* For each test case, output \"YES\" if the string $s$ is a subsequence of \"YesYesYes...\", and \"NO\" otherwise."}, {"prompt_md5": "3530f628", "template_md5": "465699a0", "result": "Given a string, determine if it is a part of a repeating sequence of the word \"Yes\"."}]}