{"uid": "1759-E", "url": "https://codeforces.com/contest/1759/problem/E", "tags": ["brute force", " dp", " sortings"], "title": "1759-E", "statement": "E. The Humanoidtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ astronauts working on some space station. An astronaut with the number $$$i$$$ ($$$1 \\\\le i \\\\le n$$$) haspower$$$a_i$$$.An evil humanoid has made his way to this space station.The powerof this humanoid is equal to $$$h$$$. Also, the humanoid took with himtwogreenserums andoneblueserum.In one second , a humanoid can do any of three actions:to absorb an astronaut withpowerstrictly lesshumanoid power;to usegreenserum, if there is still one left;to useblueserum, if there is still one left.When an astronaut withpower$$$a_i$$$ is absorbed, this astronaut disappears, andpowerof the humanoid increases by $$$\\\\lfloor \\\\frac{a_i}{2} \\\\rfloor$$$, that is, an integer part of $$$\\\\frac{a_i}{2}$$$. For example, if a humanoid absorbs an astronaut withpower$$$4$$$, itspowerincreases by $$$2$$$, and if a humanoid absorbs an astronaut withpower$$$7$$$, itspowerincreases by $$$3$$$.After using thegreenserum, this serum disappears, and thepowerof the humanoid doubles, so it increases by $$$2$$$ times.After using theblueserum, this serum disappears, and thepowerof the humanoid triples, so it increases by $$$3$$$ times.The humanoid is wondering what the maximum number of astronauts he will be able to absorb if he acts optimally.InputThe first line of each test contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — number of test cases.The first line of each test case contains integers $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — number of astronauts and $$$h$$$ ($$$1 \\\\le h \\\\le 10^6$$$) — the initialpowerof the humanoid.The second line of each test case contains $$$n$$$ integers $$$a_i$$$ ($$$1 \\\\le a_i \\\\le 10^8$$$) —powersof astronauts.It is guaranteed that the sum of $$$n$$$ for all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, in a separate line, print the maximum number of astronauts that a humanoid can absorb.ExampleInput84 12 1 8 93 36 2 604 55 1 100 53 238 6 31 1124 612 12 36 1004 12 1 1 153 515 1 13Output4 3 3 3 0 4 4 3NoteIn the first case, you can proceed as follows:usegreenserum. $$$h = 1 \\\\cdot 2 = 2$$$absorb the cosmonaut $$$2$$$. $$$h = 2 + \\\\lfloor \\\\frac{1}{2} \\\\rfloor = 2$$$usegreenserum. $$$h = 2 \\\\cdot 2 = 4$$$absorb the spaceman $$$1$$$. $$$h = 4 + \\\\lfloor \\\\frac{2}{2} \\\\rfloor = 5$$$useblueserum. $$$h = 5 \\\\cdot 3 = 15$$$absorb the spaceman $$$3$$$. $$$h = 15 + \\\\lfloor \\\\frac{8}{2} \\\\rfloor = 19$$$absorb the cosmonaut $$$4$$$. $$$h = 19 + \\\\lfloor \\\\frac{9}{2} \\\\rfloor = 23$$$", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a0140ceb", "template_md5": "35d339e4", "result": "There are $n$ astronauts, each with a power level $a_i$. An entity with initial power $h$ wants to absorb as many astronauts as possible. \n\nHere's how the entity can act:\n\n* **Absorb:** The entity can absorb an astronaut with a power level strictly less than its own. The entity's power increases by the floor of half the absorbed astronaut's power level ($ \\lfloor \\frac{a_i}{2} \\rfloor$).\n* **Green Serum:** The entity has one green serum. Using it doubles the entity's power.\n* **Blue Serum:** The entity has one blue serum. Using it triples the entity's power.\n\nWhat is the maximum number of astronauts the entity can absorb, acting optimally? \n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains $n$ (number of astronauts) and $h$ (initial power of the entity).\n    * The second line contains the $n$ power levels of the astronauts ($a_i$).\n\nOutput:\n\nFor each test case, print the maximum number of astronauts the entity can absorb."}, {"prompt_md5": "f46c6776", "template_md5": "465699a0", "result": "You have a number of people with different strengths. A creature with a starting strength wants to absorb as many people as possible.  The creature can:\n\n* Absorb a person weaker than itself, gaining half their strength.\n* Use a green item that doubles its strength.\n* Use a blue item that triples its strength.\n\nFind the maximum number of people the creature can absorb."}]}