{"uid": "176-B", "url": "https://codeforces.com/contest/176/problem/B", "tags": ["dp"], "title": "176-B", "statement": "B. Word Cuttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLet's consider one interesting word game. In this game you should transform one word into another through special operations.Let's say we have wordw, let's split this word into two non-empty partsxandyso, thatw=xy. Asplitoperation is transforming wordw=xyinto wordu=yx. For example, asplitoperation can transform word \"wordcut\" into word \"cutword\".You are given two wordsstartandend. Count in how many ways we can transform wordstartinto wordend, if we apply exactlyksplitoperations consecutively to wordstart.Two ways are considered different if the sequences of applied operations differ. Two operation sequences are different if exists such numberi(1 ≤i≤k), that in thei-th operation of the first sequence the word splits into partsxandy, in thei-th operation of the second sequence the word splits into partsaandb, and additionallyx≠aholds.InputThe first line contains a non-empty wordstart, the second line contains a non-empty wordend. The words consist of lowercase Latin letters. The number of letters in wordstartequals the number of letters in wordendand is at least2and doesn't exceed1000letters.The third line contains integerk(0 ≤k≤ 105) — the required number of operations.OutputPrint a single number — the answer to the problem. As this number can be rather large, print it modulo1000000007(109+ 7).ExamplesInputabab2Output1Inputabababababab1Output2Inputabba2Output0NoteThe sought way in the first sample is:ab→a|b→ba→b|a→abIn the second sample the two sought ways are:ababab→abab|ab→abababababab→ab|abab→ababab", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6d659b10", "template_md5": "35d339e4", "result": "You are given two words, `start` and `end`, and an integer `k`.  You can transform `start` into `end` by performing the following operation exactly `k` times:\n\n* **Split Operation:** Split the word into two non-empty parts, `x` and `y`, such that the word is equal to `xy`. Then, create a new word `yx`.\n\nFor example, you can transform \"wordcut\" into \"cutword\" using a split operation.\n\nFind the number of different ways to transform `start` into `end` using exactly `k` split operations. Two ways are different if the order of the split operations is different.\n\nPrint the answer modulo 1000000007."}, {"prompt_md5": "bc537681", "template_md5": "465699a0", "result": "You are given two words of the same length. You can split a word into two parts and swap the parts.  How many ways can you transform the first word into the second word by doing this operation exactly a given number of times?"}]}