{"uid": "176-E", "url": "https://codeforces.com/contest/176/problem/E", "tags": ["data structures", " dfs and similar", " trees"], "title": "176-E", "statement": "E. Archaeologytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThis time you should help a team of researchers on an island in the Pacific Ocean. They research the culture of the ancient tribes that used to inhabit the island many years ago.Overall they've dug outnvillages. Some pairs of villages were connected by roads. People could go on the roads in both directions. Overall there were exactlyn- 1roads, and from any village one could get to any other one.The tribes were not peaceful, and they had many wars. As a result of the wars, some villages were completely destroyed. During more peaceful years, some of the villages were restored.At each moment of time, peopleusedonly those roads that belonged to some shortest way between two villagesthat existed at the given moment. In other words, people used the minimum subset of roads in such a way that it was possible to get from any existing village to any other existing one. Note that throughout the island's whole history, there existed exactlyn- 1roads that have been found by the researchers. There never were any other roads.The researchers think that observing the total sum of used roads' lengths at different moments of time can help to better understand the tribes' culture and answer several historical questions.You will be given the full history of the tribes' existence. Your task is to determine the total length of used roads at some moments of time.InputThe first line contains an integern(1 ≤n≤ 105) — the number of villages. The nextn- 1lines describe the roads. Thei-th of these lines contains three integersai,bi, andci(1 ≤ai,bi≤n,ai≠bi,1 ≤ci≤ 109,1 ≤i<n) — the numbers of villages that are connected by thei-th road and the road's length. The numbers in the lines are separated by a space.The next line contains an integerq(1 ≤q≤ 105) — the number of queries. Then followqqueries, one per line, ordered by time. Each query belongs to one of three types:\"+x\" — village numberxis restored (1 ≤x≤n).\"-x\" — village numberxis destroyed (1 ≤x≤n).\"?\" — the archaeologists want to know the total length of the roads which were used for that time period.It is guaranteed that the queries do not contradict each other, that is, there won't be queries to destroy non-existing villages or restore the already existing ones. It is guaranteed that we have at least one query of type \"?\". It is also guaranteed that one can get from any village to any other one by the given roads.At the initial moment of time, no village is considered to exist.OutputFor each query of type \"?\" print the total length of used roads on a single line. You should print the answers to the queries in the order in which they are given in the input.Please do not use the%lldspecifier to read or write 64-bit integers in C++. It is preferred to usecin,coutstreams, or the%I64dspecifier.ExamplesInput61 2 11 3 54 1 74 5 36 4 210+ 3+ 1?+ 6?+ 5?- 6- 3?Output5141710", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "23806168", "template_md5": "35d339e4", "result": "You are given a graph with $n$ nodes (villages) and $n-1$ edges (roads). Each edge has a length.  \n\nYou will be given a sequence of operations:\n\n* **+x:** Village $x$ is restored.\n* **-x:** Village $x$ is destroyed.\n* **?:**  Calculate the total length of roads used at the current state (i.e., the sum of lengths of edges connecting existing villages).\n\nAt any given time, people can only travel on roads connecting existing villages.  The goal is to calculate the total length of roads used after each operation of type \"?\". \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "7bba339c", "template_md5": "465699a0", "result": "You are given a list of connected cities and the length of each road between them.  You are also given a list of events, where each event either adds a city back into existence, removes a city, or asks for the total length of roads used at that point in time.  You need to determine the total length of roads used for each \"?\" event."}]}