{"uid": "176-A", "url": "https://codeforces.com/contest/176/problem/A", "tags": ["greedy", " sortings"], "title": "176-A", "statement": "A. Trading Businesstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTo get money for a new aeonic blaster, ranger Qwerty decided to engage in trade for a while. He wants to buy some number of items (or probably not to buy anything at all) on one of the planets, and then sell the bought items on another planet. Note that this operation is not repeated, that is, the buying and the selling are made only once. To carry out his plan, Qwerty is going to take a bank loan that covers all expenses and to return the loaned money at the end of the operation (the money is returned without the interest). At the same time, Querty wants to get as much profit as possible.The system hasnplanets in total. On each of them Qwerty can buy or sell items ofmtypes (such as food, medicine, weapons, alcohol, and so on). For each planetiand each type of itemsjQwerty knows the following:aij— the cost of buying an item;bij— the cost of selling an item;cij— the number of remaining items.It is not allowed to buy more thancijitems of typejon planeti, but it is allowed to sell any number of items of any kind.Knowing that the hold of Qwerty's ship has room for no more thankitems, determine the maximum profit which Qwerty can get.InputThe first line contains three space-separated integersn,mandk(2 ≤n≤ 10,1 ≤m,k≤ 100) — the number of planets, the number of question types and the capacity of Qwerty's ship hold, correspondingly.Then follownblocks describing each planet.The first line of thei-th block has the planet's name as a string with length from1to10Latin letters. The first letter of the name is uppercase, the rest are lowercase. Then in thei-th block followmlines, thej-th of them contains three integersaij,bijandcij(1 ≤bij<aij≤ 1000,0 ≤cij≤ 100) — the numbers that describe money operations with thej-th item on thei-th planet. The numbers in the lines are separated by spaces.It is guaranteed that the names of all planets are different.OutputPrint a single number — the maximum profit Qwerty can get.ExamplesInput3 3 10Venus6 5 37 6 58 6 10Earth10 9 08 6 410 9 3Mars4 3 08 4 127 2 5Output16NoteIn the first test case you should fly to planetVenus, take a loan on 74 units of money and buy three items of the first type and 7 items of the third type (3·6 + 7·8 = 74). Then the ranger should fly to planetEarthand sell there all the items he has bought. He gets3·9 + 7·9 = 90units of money for the items, he should give 74 of them for the loan. The resulting profit equals 16 units of money. We cannot get more profit in this case.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "99429b1c", "template_md5": "35d339e4", "result": "There are $n$ planets, each with $m$ types of items.  On each planet $i$ and for each item type $j$, you know the following:\n\n* $a_{ij}$: the cost of buying one item of type $j$ on planet $i$.\n* $b_{ij}$: the cost of selling one item of type $j$ on planet $i$.\n* $c_{ij}$: the number of items of type $j$ available for purchase on planet $i$.\n\nYou have a ship with a maximum capacity of $k$ items.  \n\nYour goal is to determine the maximum profit you can make by buying items on one planet and selling them on another planet. You can take a loan to cover the cost of buying the items, and you must repay the loan at the end. \n\nOutput the maximum profit you can achieve."}, {"prompt_md5": "b2e73b8c", "template_md5": "465699a0", "result": "You have a limited carrying capacity and need to maximize profit by buying items on one planet and selling them on another. Each planet has different prices for buying and selling various types of items, and there are limits on how many items you can buy on each planet."}]}