{"uid": "176-D", "url": "https://codeforces.com/contest/176/problem/D", "tags": ["dp"], "title": "176-D", "statement": "D. Hyper Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPaul Erdős's prediction came true. Finally an alien force landed on the Earth. In contrary to our expectation they didn't asked the humans to compute the value of a Ramsey number (maybe they had solved it themselves). They asked another question which seemed as hard as calculating Ramsey numbers. Aliens threatened that if humans don't solve this problem in less than 2 hours they will destroy the Earth.Before telling the problem they introduced the concept of Hyper Strings. A Hyper String is made by concatenation of some base strings. Suppose you are given a list of base stringsb1,b2, ...,bn. Now the Hyper String made from indices listi1,i2, ...,imis concatenation of base stringsbi1,bi2, ...,bim. A Hyper String can be very large and doing operations on it is very costly for computers.The aliens asked humans to compute the length of the longest common sub-sequence of a Hyper Stringtwith a strings.InputThe first line of input contains the single integern(1 ≤n≤ 2000) — the number of base strings.The nextnlines contains values of base strings. Each base string is made of lowercase Latin letters. A base string cannot be empty string and the sum of lengths of allnbase strings doesn't exceed106.The next line contains the single integerm(1 ≤m≤ 2000) — the number of base strings in the given Hyper Stringt.The next line containsmspace-separated integer numbersi1,i2, ...,im(1 ≤ij≤n) — the indices of base strings in the Hyper Stringt.The last line contains a non-empty strings. Stringsis made of lowercase Latin letters and its length is no more than2000characters.OutputPrint the length of longest common sub-sequence of Hyper Stringtand strings. If there is no common sub-sequence print 0.ExamplesInput2cbadgh21 2aedfhrOutput3Input2ba51 2 1 2 1aaaOutput2NoteThelengthof stringsis the number of characters in it. If the length of stringsis marked as|s|, then stringscan be represented ass=s1s2...s|s|.A non-empty stringy=s[p1p2...p|y|] =sp1sp2...sp|y|(1 ≤p1<p2< ... <p|y|≤ |s|) is asubsequenceof strings. For example, \"coders\" is a subsequence of \"codeforces\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "74c90088", "template_md5": "35d339e4", "result": "You are given a set of $n$ base strings, $b_1, b_2, ..., b_n$.  You are also given a list of indices $i_1, i_2, ..., i_m$ where $1 \\le i_j \\le n$.  The Hyper String $t$ is formed by concatenating the base strings $b_{i_1}, b_{i_2}, ..., b_{i_m}$.\n\nYou are also given a string $s$.\n\nFind the length of the longest common subsequence of the Hyper String $t$ and the string $s$. If there is no common subsequence, print 0."}, {"prompt_md5": "281f41f1", "template_md5": "465699a0", "result": "You are given a set of smaller strings.  A \"hyper string\" is created by combining a subset of these smaller strings in a specific order. You are also given a target string. Find the length of the longest sequence of characters that appears in both the hyper string and the target string. If there is no common sequence, output 0."}]}