{"uid": "1764-D", "url": "https://codeforces.com/contest/1764/problem/D", "tags": ["combinatorics", " dp", " math"], "title": "1764-D", "statement": "D. Doremy's Pegging Gametime limit per test1.5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputDoremy has $$$n+1$$$ pegs. There are $$$n$$$ red pegs arranged as vertices of a regular $$$n$$$-sided polygon, numbered from $$$1$$$ to $$$n$$$ in anti-clockwise order. There is also a blue peg ofslightly smaller diameterin the middle of the polygon. A rubber band is stretched around the red pegs.Doremy is very bored today and has decided to play a game. Initially, she has an empty array $$$a$$$. While the rubber band does not touch the blue peg, she will:choose $$$i$$$ ($$$1 \\\\leq i \\\\leq n$$$) such that the red peg $$$i$$$ has not been removed;remove the red peg $$$i$$$;append $$$i$$$ to the back of $$$a$$$.Doremy wonders how many possible different arrays $$$a$$$ can be produced by the following process. Since the answer can be big, you are only required to output it modulo $$$p$$$. $$$p$$$ is guaranteed to be a prime number.game with $$$n=9$$$ and $$$a=[7,5,2,8,3,9,4]$$$ and another game with $$$n=8$$$ and $$$a=[3,4,7,1,8,5,2]$$$InputThe first line contains two integers $$$n$$$ and $$$p$$$ ($$$3 \\\\leq n \\\\leq 5000$$$, $$$10^8 \\\\le p \\\\le 10^9$$$) — the number of red pegs and the modulo respectively.$$$p$$$ is guaranteed to be a prime number.OutputOutput a single integer, the number of different arrays $$$a$$$ that can be produced by the process described above modulo $$$p$$$.ExamplesInput4 100000007Output16Input1145 141919831Output105242108NoteIn the first test case, $$$n=4$$$, some possible arrays $$$a$$$ that can be produced are $$$[4,2,3]$$$ and $$$[1,4]$$$. However, it is not possible for $$$a$$$ to be $$$[1]$$$ or $$$[1,4,3]$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "205b469c", "template_md5": "35d339e4", "result": "You are given $n$ red pegs arranged in a regular $n$-sided polygon. There is also a blue peg in the center. A rubber band is stretched around the red pegs.\n\nYou can repeatedly remove a red peg from the polygon and add its number to an array $a$.  You can only remove a peg if the rubber band doesn't touch the blue peg.\n\nWhat is the number of different possible arrays $a$ that can be created? The answer should be modulo $p$, where $p$ is a prime number. \n\nInput:\n\nThe first line contains two integers $n$ and $p$ ($3 \\le n \\le 5000$, $10^8 \\le p \\le 10^9$).\n\nOutput:\n\nOutput a single integer, the number of different arrays $a$ modulo $p$."}, {"prompt_md5": "d31860e0", "template_md5": "465699a0", "result": "You have a set of numbered objects arranged in a circle. You can remove one object at a time, and you must keep track of the order in which you remove them.  How many different orders are possible before you can no longer remove any objects?"}]}