{"uid": "1765-K", "url": "https://codeforces.com/contest/1765/problem/K", "tags": ["greedy", " math"], "title": "1765-K", "statement": "K. Torus Pathtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given a square grid with $$$n$$$ rows and $$$n$$$ columns, where each cell has a non-negative integer written in it. There is a chip initially placed at the top left cell (the cell with coordinates $$$(1, 1)$$$). You need to move the chip to the bottom right cell (the cell with coordinates $$$(n, n)$$$).In one step, you can move the chip to the neighboring cell, but:you can move only right or down. In other words, if the current cell is $$$(x, y)$$$, you can move either to $$$(x, y + 1)$$$ or to $$$(x + 1, y)$$$. There are two special cases:if the chip is in the last column (cell $$$(x, n)$$$) and you're moving right, you'll teleport to the first column (to the cell $$$(x, 1)$$$);if the chip is in the last row (cell $$$(n, y)$$$) and you're moving down, you'll teleport to the first row (to the cell $$$(1, y)$$$).youcannotvisit the same cell twice. The starting cell is counted visited from the beginning (so you cannot enter it again), and you can't leave the finishing cell once you visit it.Your total score is counted as the sum of numbers in all cells you have visited. What is the maximum possible score you can achieve?InputThe first line contains the single integer $$$n$$$ ($$$2 \\\\le n \\\\le 200$$$) — the number of rows and columns in the grid.Next $$$n$$$ lines contains the description of each row of the grid. The $$$i$$$-th line contains $$$n$$$ integers $$$a_{i, 1}, a_{i, 2}, \\\\dots, a_{i, n}$$$ ($$$0 \\\\le a_{i, j} \\\\le 10^9$$$) where $$$a_{i, j}$$$ is the number written in the cell $$$(i, j)$$$.OutputPrint one integer — the maximum possible score you can achieve.ExamplesInput2 1 2 3 4Output8Input3 10 10 10 10 0 10 10 10 10Output80", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6548827d", "template_md5": "35d339e4", "result": "You are given a square grid of size $n x n$. Each cell in the grid contains a non-negative integer. You start at the top left cell $(1,1)$ and need to reach the bottom right cell $(n,n)$. You can only move right or down.  \n\nHere are the rules:\n\n* You can only move to a neighboring cell (right or down).\n* If you are in the last column and move right, you teleport to the first column.\n* If you are in the last row and move down, you teleport to the first row.\n* You cannot visit the same cell twice.\n\nYour goal is to find the maximum sum of the numbers in all the cells you visit while following these rules. \n\n\n\nLet me know if you'd like help with the solution!"}, {"prompt_md5": "f6737503", "template_md5": "465699a0", "result": "You have a grid of numbers. You start at the top left corner and must move to the bottom right corner, only moving right or down.  You can't visit the same square twice.  What is the highest total of numbers you can collect along the way?"}]}