{"uid": "1766-B", "url": "https://codeforces.com/contest/1766/problem/B", "tags": ["implementation"], "title": "1766-B", "statement": "B. Notepad#time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou want to type the string $$$s$$$, consisting of $$$n$$$ lowercase Latin letters, using your favorite text editor Notepad#.Notepad# supports two kinds of operations:append any letterto the endof the string;copy acontinuoussubstring of an already typed string and paste this substringto the endof the string.Can you type string $$$s$$$ instrictly lessthan $$$n$$$ operations?InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of testcases.The first line of each testcase contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the length of the string $$$s$$$.The second line contains a string $$$s$$$, consisting of $$$n$$$ lowercase Latin letters.The sum of $$$n$$$ doesn't exceed $$$2 \\\\cdot 10^5$$$ over all testcases.OutputFor each testcase, print \"YES\" if you can type string $$$s$$$ instrictly lessthan $$$n$$$ operations. Otherwise, print \"NO\".ExampleInput610codeforces8labacaba5uohhh16isthissuffixtree1x4momoOutputNO YES NO YES NO YESNoteIn the first testcase, you can start with typing \"codef\" ($$$5$$$ operations), then copy \"o\" ($$$1$$$ operation) from an already typed part, then finish with typing \"rces\" ($$$4$$$ operations). That will be $$$10$$$ operations, which is not strictly less than $$$n$$$. There exist other ways to type \"codeforces\". However, no matter what you do, you can't do less than $$$n$$$ operations.In the second testcase, you can type \"labac\" ($$$5$$$ operations), then copy \"aba\" ($$$1$$$ operation), finishing the string in $$$6$$$ operations.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c95713b3", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters. You can perform two operations:\n\n1. Append a single letter to the end of the string.\n2. Copy a continuous substring from the existing string and append it to the end.\n\nDetermine if it is possible to build the given string using strictly less than  $n$ operations, where $n$ is the length of the string.\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the length of the string, $n$.\n    * The second line contains the string.\n\nOutput:\n\nFor each test case, print \"YES\" if it is possible to build the string using less than $n$ operations, otherwise print \"NO\"."}, {"prompt_md5": "7519bf06", "template_md5": "465699a0", "result": "You have a string of letters. You can add a letter to the end or copy a section of the string and add it to the end. Can you build the string using fewer than the length of the string operations?"}]}