{"uid": "177-C1", "url": "https://codeforces.com/contest/177/problem/C1", "tags": ["dfs and similar", " dsu", " graphs"], "title": "177-C1", "statement": "C1. Partytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTo celebrate the second ABBYY Cup tournament, the Smart Beaver decided to throw a party. The Beaver has a lot of acquaintances, some of them are friends with each other, and some of them dislike each other. To make party successful, the Smart Beaver wants to invite only those of his friends who are connected by friendship relations, and not to invite those who dislike each other. Both friendship and dislike are mutual feelings.More formally, for each invited person the following conditions should be fulfilled:all his friends should also be invited to the party;the party shouldn't have any people he dislikes;all people who are invited to the party should be connected with him by friendship either directly or through a chain of common friends of arbitrary length. We'll say that peoplea1andapare connected through a chain of common friends if there exists a sequence of peoplea2,a3, ...,ap- 1such that all pairs of peopleaiandai+ 1(1 ≤i<p) are friends.Help the Beaver find the maximum number of acquaintances he can invite.InputThe first line of input contains an integern— the number of the Beaver's acquaintances.The second line contains an integerk— the number of pairs of friends. Nextklines contain space-separated pairs of integersui,vi— indices of people who form thei-th pair of friends.The next line contains an integerm— the number of pairs of people who dislike each other. Nextmlines describe pairs of people who dislike each other in the same format as the pairs of friends were described.Each pair of people is mentioned in the input at most once. In particular, two persons cannot be friends and dislike each other at the same time.The input limitations for getting 30 points are:2 ≤n≤ 14The input limitations for getting 100 points are:2 ≤n≤ 2000OutputOutput a single number — the maximum number of people that can be invited to the party. If a group of people that meets all the requirements is impossible to select, output 0.ExamplesInput981 21 32 34 56 77 88 99 621 67 9Output3NoteLet's have a look at the example.Two groups of people can be invited:{1, 2, 3}and{4, 5}, thus the answer will be the size of the largest of these groups. Group{6, 7, 8, 9}doesn't fit, since it includes people7and9who dislike each other. Group{1, 2, 3, 4, 5}also doesn't fit, because not all of its members are connected by a chain of common friends (for example, people2and5aren't connected).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "330026c1", "template_md5": "35d339e4", "result": "You are given a list of $n$ people and information about their friendships and dislikes.  \n\n* **Friendships:**  $k$ pairs of people are listed, where each pair represents friends.\n* **Dislikes:** $m$ pairs of people are listed, where each pair represents people who dislike each other.\n\nYou need to find the largest group of people that can attend a party, following these rules:\n\n1. **All friends must attend:** If a person is invited, all their friends must also be invited.\n2. **No dislikes:** No two people who dislike each other can attend the party.\n3. **Connectedness:** Everyone at the party must be connected to each other through a chain of friendships. This means that for any two people at the party, there must be a sequence of mutual friends connecting them.\n\nOutput the largest possible number of people that can attend the party. If no such group exists, output 0."}, {"prompt_md5": "e0a12720", "template_md5": "465699a0", "result": "You are given a list of people and their friendships and dislikes.  Find the largest group of people who can all be invited to a party, where:\n\n* Everyone invited must be friends with each other.\n* No one invited dislikes anyone else.\n* Everyone invited must be connected to each other through a chain of friends. \n\n\nIf no such group exists, output 0."}]}