{"uid": "1771-E", "url": "https://codeforces.com/contest/1771/problem/E", "tags": ["brute force", " dp", " implementation", " two pointers"], "title": "1771-E", "statement": "E. Hossam and a Lettertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputHossam bought a new piece of ground with length $$$n$$$ and width $$$m$$$, he divided it into an $$$n \\\\cdot m$$$ grid, each cell being of size $$$1\\\\times1$$$.Since Hossam's name starts with the letter 'H', he decided to draw the capital letter 'H' by building walls of size $$$1\\\\times1$$$ on some squares of the ground. Each square $$$1\\\\times1$$$ on the ground is assigned a quality degree: perfect, medium, or bad.The process of building walls to form up letter 'H' has the following constraints:The letter must consist of one horizontal and two vertical lines.The vertical lines must not be in the same or neighboring columns.The vertical lines must start in the same row and end in the same row (and thus have the same length).The horizontal line should connect the vertical lines, but must not cross them.The horizontal line can be in any row between the vertical lines (not only in the middle), except the top and the bottom one. (With the horizontal line in the top row the letter looks like 'n', and in the bottom row like 'U'.)It is forbidden to build walls in cells of bad quality.You can use at most one square of medium quality.You can use any number of squares of perfect quality.Find the maximum number of walls that can be used to draw the letter 'H'.Check the note for more clarification.InputThe first line of the input contains two integer numbers $$$n$$$, $$$m$$$ ($$$1 \\\\le n, m \\\\le 400$$$).The next $$$n$$$ lines of the input contain $$$m$$$ characters each, describing the grid. The character '.' stands for a perfect square, the character 'm' stands for a medium square, and the character '#' stands for a bad square.OutputPrint a single integer — the maximum number of walls that form a capital letter 'H'.If it is not possible to draw any letter 'H', print $$$0$$$.ExamplesInput2 3 #m. .#.Output0Input7 8 ...#.m.. ..m...m. .#..#.m# ...m..m. m....... ..#.m.mm ......m.Output16NoteIn the first test case, we can't build the letter 'H'.For the second test case, the figure below represents the grid and some of the valid letters 'H'. Perfect, medium, and bad squares are represented with white, yellow, and black colors respectively.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6f072f06", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$ where each cell can be perfect, medium, or bad.  You want to build a capital letter 'H' using walls (1x1 squares) on the grid, following these rules:\n\n* The 'H' must consist of one horizontal line and two vertical lines.\n* The vertical lines must not be in the same column or adjacent columns.\n* The vertical lines must start and end in the same row.\n* The horizontal line must connect the vertical lines but not cross them.\n* The horizontal line can be in any row between the vertical lines (except the top and bottom rows).\n* You cannot build walls on bad squares.\n* You can use at most one medium square.\n* You can use any number of perfect squares.\n\nFind the maximum number of walls you can use to form the letter 'H'. If it's not possible to form an 'H', output 0."}, {"prompt_md5": "9a84e363", "template_md5": "465699a0", "result": "You have a grid of squares. Some squares are good, some are medium, and some are bad. You want to build a capital 'H' shape using walls on the good and medium squares. The walls must follow certain rules:\n\n* The 'H' must have one horizontal line and two vertical lines.\n* The vertical lines must be in different columns and start and end in the same row.\n* The horizontal line must connect the vertical lines without crossing them and can be in any row between the vertical lines (except the top and bottom).\n* You can only use one medium square.\n\nFind the maximum number of walls you can use to build the 'H'. If it's impossible, print 0."}]}