{"uid": "1774-B", "url": "https://codeforces.com/contest/1774/problem/B", "tags": ["constructive algorithms", " greedy", " math"], "title": "1774-B", "statement": "B. Coloringtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputCirno_9baka has a paper tape with $$$n$$$ cells in a row on it. As he thinks that the blank paper tape is too dull, he wants to paint these cells with $$$m$$$ kinds of colors. For some aesthetic reasons, he thinks that the $$$i$$$-th color must be used exactly $$$a_i$$$ times, and for every $$$k$$$ consecutive cells, their colors have to be distinct.Help Cirno_9baka to figure out if there is such a way to paint the cells.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10\\\\,000$$$)  — the number of test cases. The description of test cases follows.The first line of each test case contains three integers $$$n$$$, $$$m$$$, $$$k$$$ ($$$1 \\\\leq k \\\\leq n \\\\leq 10^9$$$, $$$1 \\\\leq m \\\\leq 10^5$$$, $$$m \\\\leq n$$$). Here $$$n$$$ denotes the number of cells, $$$m$$$ denotes the number of colors, and $$$k$$$ means that for every $$$k$$$ consecutive cells, their colors have to be distinct.The second line of each test case contains $$$m$$$ integers $$$a_1, a_2, \\\\cdots , a_m$$$ ($$$1 \\\\leq a_i \\\\leq n$$$)  — the numbers of times that colors have to be used. It's guaranteed that $$$a_1 + a_2 + \\\\ldots + a_m = n$$$.It is guaranteed that the sum of $$$m$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case, output \"YES\" if there is at least one possible coloring scheme; otherwise, output \"NO\".You may print each letter in any case (for example, \"YES\", \"Yes\", \"yes\", and \"yEs\" will all be recognized as positive answers).ExampleInput212 6 21 1 1 1 1 712 6 22 2 2 2 2 2OutputNO YESNoteIn the first test case, there is no way to color the cells satisfying all the conditions.In the second test case, we can color the cells as follows: $$$(1, 2, 1, 2, 3, 4, 3, 4, 5, 6, 5, 6)$$$. For any $$$2$$$ consecutive cells, their colors are distinct.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d202ae0e", "template_md5": "35d339e4", "result": "You are given a tape with $n$ cells. You want to color the cells using $m$ different colors.  \n\n* Each color must be used exactly $a_i$ times ($a_1 + a_2 + ... + a_m = n$).\n* For every group of $k$ consecutive cells, the colors must be different.\n\nDetermine if it's possible to color the tape according to these rules. \n\nInput:\n\n* $t$: the number of test cases\n* For each test case:\n    * $n$: the number of cells\n    * $m$: the number of colors\n    * $k$: the minimum number of distinct colors in a group of $k$ cells\n    * $a_1, a_2, ..., a_m$: the number of times each color must be used\n\nOutput:\n\n* For each test case, print \"YES\" if it's possible to color the tape, otherwise print \"NO\"."}, {"prompt_md5": "b75580ce", "template_md5": "465699a0", "result": "You are given a number of cells and a number of colors. You must use each color a specific number of times, and no more than  'k' consecutive cells can have the same color.  Determine if it's possible to color the cells according to these rules."}]}