{"uid": "178-B2", "url": "https://codeforces.com/contest/178/problem/B2", "tags": [], "title": "178-B2", "statement": "B2. Greedy Merchantstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn ABBYY a wonderful Smart Beaver lives. This time, he began to study history. When he read about the Roman Empire, he became interested in the life of merchants.The Roman Empire consisted ofncities numbered from1ton. It also hadmbidirectional roads numbered from1tom. Each road connected two different cities. Any two cities were connected by no more than one road.We say that there is a path between citiesc1andc2if there exists a finite sequence of citiest1,t2, ...,tp(p≥ 1)such that:t1=c1tp=c2for anyi(1 ≤i<p), citiestiandti+ 1are connected by a roadWe know that there existed a path between any two cities in the Roman Empire.In the Empirekmerchants lived numbered from1tok. For each merchant we know a pair of numberssiandli, wheresiis the number of the city where this merchant's warehouse is, andliis the number of the city where his shop is. The shop and the warehouse could be located in different cities, so the merchants had to deliver goods from the warehouse to the shop.Let's call a roadimportantfor the merchant if its destruction threatens to ruin the merchant, that is, without this road there is no path from the merchant's warehouse to his shop. Merchants in the Roman Empire are very greedy, so each merchant pays a tax (1 dinar) only for those roads which are important for him. In other words, each merchant paysdidinars of tax, wheredi(di≥ 0) is the number of roads important for thei-th merchant.The tax collection day came in the Empire. The Smart Beaver from ABBYY is very curious by nature, so he decided to count how many dinars each merchant had paid that day. And now he needs your help.InputThe first input line contains two integersnandm, separated by a space,nis the number of cities, andmis the number of roads in the empire.The followingmlines contain pairs of integersai,bi(1 ≤ai,bi≤n,ai≠bi), separated by a space — the numbers of cities connected by thei-th road. It is guaranteed that any two cities are connected by no more than one road and that there exists a path between any two cities in the Roman Empire.The next line contains a single integerk— the number of merchants in the empire.The followingklines contain pairs of integerssi,li(1 ≤si,li≤n), separated by a space, —siis the number of the city in which the warehouse of thei-th merchant is located, andliis the number of the city in which the shop of thei-th merchant is located.The input limitations for getting 20 points are:1 ≤n≤ 2001 ≤m≤ 2001 ≤k≤ 200The input limitations for getting 50 points are:1 ≤n≤ 20001 ≤m≤ 20001 ≤k≤ 2000The input limitations for getting 100 points are:1 ≤n≤ 1051 ≤m≤ 1051 ≤k≤ 105OutputPrint exactlyklines, thei-th line should contain a single integerdi— the number of dinars that thei-th merchant paid.ExamplesInput7 81 22 33 44 55 65 73 54 741 52 42 64 7Output2120NoteThe given sample is illustrated in the figure below.Let's describe the result for the first merchant. The merchant's warehouse is located in city1and his shop is in city5. Let us note that if either road,(1, 2)or(2, 3)is destroyed, there won't be any path between cities1and5anymore. If any other road is destroyed, the path will be preserved. That's why for the given merchant the answer is2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "48d93908", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ roads connecting them. Each road connects two different cities, and any two cities are connected by at most one road. \n\nThere are $k$ merchants, each with a warehouse in city $s_i$ and a shop in city $l_i$.  \n\nA road is considered \"important\" for a merchant if destroying it would prevent them from traveling from their warehouse to their shop.\n\nEach merchant pays a tax of 1 dinar for each important road.\n\nGiven the cities, roads, and merchants' locations, determine how many dinars each merchant paid in taxes."}, {"prompt_md5": "c1d2c962", "template_md5": "465699a0", "result": "There are cities connected by roads. Each merchant has a warehouse in one city and a shop in another.  Determine how much tax each merchant pays based on the number of roads needed to travel between their warehouse and shop. If a road is destroyed, the merchant can no longer travel between the two cities."}]}