{"uid": "1789-F", "url": "https://codeforces.com/contest/1789/problem/F", "tags": ["bitmasks", " brute force", " dp", " greedy", " implementation", " strings"], "title": "1789-F", "statement": "F. Serval and Brain Powertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputServal loves Brain Power and his brain power problem.Serval defines that a string $$$T$$$ ispowerfuliff $$$T$$$ can be obtained by concatenating some string $$$T'$$$ multiple times. Formally speaking, $$$T$$$ is powerful iff there exist a string $$$T'$$$ and an integer $$$k\\\\geq 2$$$ such that $$$$$$T=\\\\underbrace{T'+T'+\\\\dots+T'}_{k\\\\text{ times}}$$$$$$For example,gogogois powerful because it can be obtained by concatenatinggothree times, butpoweris not powerful.Serval has a string $$$S$$$ consists of lowercase English letters. He is curious about the longest powerful subsequence of $$$S$$$, and he only needs you to find out the length of it. If all the non-empty subsequences of $$$S$$$ is not powerful, the answer is considered to be $$$0$$$.A string $$$a$$$ is a subsequence of a string $$$b$$$ if $$$a$$$ can be obtained from $$$b$$$ by the deletion of several (possibly, zero or all) characters.InputThe first line contains a single string $$$S$$$ ($$$|S|\\\\leq 80$$$) consisting of lowercase English letters.OutputPrint a single integer — the length of the longest powerful subsequence of $$$S$$$. If all the non-empty subsequences of $$$S$$$ is not powerful, print $$$0$$$.ExamplesInputbuaaOutput2InputcodeforcesroundOutput6InputoooooooooooaaaaeaaiaujoooooooooooooOutput24InputzeroOutput0NoteFor the first sample, all of the non-empty subsequences ofbuaaare listed below:bua(occurred twice,buaaandbuaa)buba(occurred twice,buaaandbuaa)ua(occurred twice,buaaandbuaa)aabua(occurred twice,buaaandbuaa)baauaabuaaSince $$$\\\\texttt{aa} = \\\\texttt{a} + \\\\texttt{a}$$$,aais a powerful subsequence. It can be shown thataais the only powerful subsequence among them. So the answer is $$$2$$$.For the second sample, the longest powerful subsequence iscodcodfromcodeforcesround. So the answer is $$$6$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5ba86e0a", "template_md5": "35d339e4", "result": "Given a string $S$ consisting of lowercase English letters, find the length of the longest subsequence of $S$ that can be formed by repeating another string multiple times. If no such subsequence exists, output 0. \n\nFor example:\n\n* If $S = \"buaa\"$, the longest powerful subsequence is \"aa\" and the answer is 2.\n* If $S = \"codeforcesround\"$, the longest powerful subsequence is \"codcod\" and the answer is 6."}, {"prompt_md5": "aaedd1f1", "template_md5": "465699a0", "result": "Given a string, find the length of the longest subsequence that can be formed by repeating a smaller substring multiple times. If no such subsequence exists, the answer is 0."}]}