{"uid": "1792-B", "url": "https://codeforces.com/contest/1792/problem/B", "tags": ["greedy", " math"], "title": "1792-B", "statement": "B. Stand-up Comediantime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEve is a beginner stand-up comedian. Her first show gathered a grand total of two spectators: Alice and Bob.Eve prepared $$$a_1 + a_2 + a_3 + a_4$$$ jokes to tell, grouped by their type:type 1: both Alice and Bob like them;type 2: Alice likes them, but Bob doesn't;type 3: Bob likes them, but Alice doesn't;type 4: neither Alice nor Bob likes them.Initially, both spectators have their mood equal to $$$0$$$. When a spectator hears a joke he/she likes, his/her mood increases by $$$1$$$. When a spectator hears a joke he/she doesn't like, his/her mood decreases by $$$1$$$. If the mood of a spectator becomes negative (strictly below zero), he/she leaves.When someone leaves, Eve gets sad and ends the show. If no one leaves, and Eve is out of jokes, she also ends the show.Thus, Eve wants to arrange her jokes in such a way that the show lasts as long as possible. Help her to calculate the maximum number of jokes she can tell before the show ends.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of testcases.The only line of each testcase contains four integers $$$a_1, a_2, a_3, a_4$$$ ($$$0 \\\\le a_1, a_2, a_3, a_4 \\\\le 10^8$$$; $$$a_1 + a_2 + a_3 + a_4 \\\\ge 1$$$) — the number of jokes of each type Eve prepared.OutputFor each testcase, print a single integer — the maximum number of jokes Eve can tell before at least one of the spectators leaves or before she runs out of jokes.ExampleInput45 0 0 00 0 0 52 5 10 63 0 0 7Output5 1 15 7NoteIn the first testcase, Eve only has jokes of the first type. Thus, there's no order to choose. She tells all her jokes, both Alice and Bob like them. Their mood becomes $$$5$$$. The show ends after Eve runs out of jokes.In the second testcase, Eve only has jokes of the fourth type. Thus, once again no order to choose. She tells a joke, and neither Alice, nor Bob likes it. Their mood decrease by one, becoming $$$-1$$$. They both have negative mood, thus, both leave, and the show ends.In the third testcase, first, Eve tells both jokes of the first type. Both Alice and Bob has mood $$$2$$$. Then she can tell $$$2$$$ jokes of the third type. Alice's mood becomes $$$0$$$. Bob's mood becomes $$$4$$$. Then $$$4$$$ jokes of the second type. Alice's mood becomes $$$4$$$. Bob's mood becomes $$$0$$$. Then another $$$4$$$ jokes of the third type. Alice's mood becomes $$$0$$$. Bob's mood becomes $$$4$$$. Then the remaining joke of the second type. Alice's mood becomes $$$1$$$. Bob's mood becomes $$$3$$$. Then one more joke of the third type, and a joke of the fourth type, for example. Alice's mood becomes $$$-1$$$, she leaves, and the show ends.In the fourth testcase, Eve should first tell the jokes both spectators like, then the jokes they don't. She can tell $$$4$$$ jokes of the fourth type until the spectators leave.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d1dddfc8", "template_md5": "35d339e4", "result": "There are two people watching a comedy show.  The comedian has jokes of four types:\n\n* Type 1: Both people like the joke.\n* Type 2: Only the first person likes the joke.\n* Type 3: Only the second person likes the joke.\n* Type 4: Neither person likes the joke.\n\nEach person starts with a mood of 0.  If they hear a joke they like, their mood increases by 1. If they hear a joke they don't like, their mood decreases by 1. If a person's mood drops below 0, they leave the show.\n\nThe comedian wants to tell as many jokes as possible before someone leaves or they run out of jokes.  Given the number of jokes of each type, find the maximum number of jokes the comedian can tell."}, {"prompt_md5": "8b3dde38", "template_md5": "465699a0", "result": "You have a set of jokes, categorized as liked by both people, liked by one person, disliked by one person, and disliked by both.  People start with a mood of 0.  A liked joke increases mood by 1, a disliked joke decreases mood by 1. If mood goes below 0, the person leaves. The goal is to arrange the jokes to maximize the number told before someone leaves or all jokes are told."}]}