{"uid": "1792-F2", "url": "https://codeforces.com/contest/1792/problem/F2", "tags": ["brute force", " combinatorics", " divide and conquer", " dp", " fft", " graphs"], "title": "1792-F2", "statement": "F2. Graph Coloring (hard version)time limit per test5.5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThe only difference between the easy and the hard version is the constraint on $$$n$$$.You are given an undirected complete graph on $$$n$$$ vertices. A complete graph is a graph where each pair of vertices is connected by an edge. You have to paint the edges of the graph into two colors, red and blue (each edge will have one color).A set of vertices $$$S$$$ isred-connectedif, for every pair of vertices $$$(v_1, v_2)$$$ such that $$$v_1 \\\\in S$$$ and $$$v_2 \\\\in S$$$, there exists a path from $$$v_1$$$ to $$$v_2$$$ that goes only through red edges and vertices from $$$S$$$. Similarly, a set of vertices $$$S$$$ isblue-connectedif, for every pair of vertices $$$(v_1, v_2)$$$ such that $$$v_1 \\\\in S$$$ and $$$v_2 \\\\in S$$$, there exists a path from $$$v_1$$$ to $$$v_2$$$ that goes only through blue edges and vertices from $$$S$$$.You have to paint the graph in such a way that:there is at least one red edge;there is at least one blue edge;for each set of vertices $$$S$$$ such that $$$|S| \\\\ge 2$$$, $$$S$$$ is either red-connected or blue-connected, butnot both.Calculate the number of ways to paint the graph, and print it modulo $$$998244353$$$.InputThe first (and only) line contains one integer $$$n$$$ ($$$3 \\\\le n \\\\le 5 \\\\cdot 10^4$$$).OutputPrint one integer — the number of ways to paint the graph, taken modulo $$$998244353$$$.ExamplesInput3Output6Input4Output50Input100Output878752271Input1337Output520628749Input42013Output906821221", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d99084b4", "template_md5": "35d339e4", "result": "You are given a complete graph with $n$ vertices.  You need to color each of the $\\binom{n}{2}$ edges either red or blue.  \n\nYou must follow these rules:\n\n* There must be at least one red edge.\n* There must be at least one blue edge.\n* For any set of vertices $S$ with at least 2 vertices, either all the edges within $S$ are the same color (red or blue), or there is a path between any two vertices in $S$ using only edges of that color.\n\nFind the number of ways to color the graph that satisfy these rules, and print the answer modulo 998244353."}, {"prompt_md5": "df2f0085", "template_md5": "465699a0", "result": "You have a complete graph with a given number of vertices. You need to color all the edges red or blue.  The goal is to color the graph so that:\n\n* There is at least one red edge and at least one blue edge.\n* For any group of two or more vertices, they are either all connected by only red edges or only blue edges.\n\nFind the number of ways to color the graph that satisfy these rules."}]}