{"uid": "1794-E", "url": "https://codeforces.com/contest/1794/problem/E", "tags": ["data structures", " dp", " greedy", " hashing", " implementation", " trees"], "title": "1794-E", "statement": "E. Labeling the Tree with Distancestime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an unweighted tree of $$$n$$$ vertices numbered from $$$1$$$ to $$$n$$$ and a list of $$$n-1$$$ integers $$$a_1, a_2, \\\\ldots, a_{n-1}$$$. A tree is a connected undirected graph without cycles. You will use each element of the list to label one vertex. No vertex should be labeled twice. You can label the only remaining unlabeled vertex with any integer.A vertex $$$x$$$ is calledgoodif it is possible to do this labeling so that for each vertex $$$i$$$, its label is the distance between $$$x$$$ and $$$i$$$. The distance between two vertices $$$s$$$ and $$$t$$$ on a tree is the minimum number of edges on a path that starts at vertex $$$s$$$ and ends at vertex $$$t$$$.Find all good vertices.InputThe first line contains one integer $$$n$$$ ($$$2\\\\le n\\\\le 2\\\\cdot 10^5$$$) — the number of vertices in the tree.The second line contains $$$n - 1$$$ integers $$$a_1,a_2,\\\\ldots,a_{n-1}$$$ ($$$0\\\\le a_i < n$$$) — the given list.Then, $$$n−1$$$ lines follow. Each of them contains two integers $$$u$$$ and $$$v$$$ ($$$1\\\\le u,v\\\\le n$$$) denoting an edge between vertices $$$u$$$ and $$$v$$$. It is guaranteed that the edges form a tree.OutputIn the first line print the number of good vertices.In the second line, print the indices of all good verticesin ascending order.ExamplesInput6 2 1 0 1 2 1 2 2 3 2 4 4 5 4 6Output2 2 4Input5 1 2 1 2 1 2 3 2 3 4 5 4Output1 3Input3 2 2 1 2 2 3Output0NoteThis is the tree for the first example:And these are two possible labelings with the elements on the list so that $$$2$$$ is a good vertex (left) and $$$4$$$ is a good vertex (right).The square below each vertex represents its label. The black squares contain the numbers which were on the given list and the only white square contains the only number which was not on the given list.In the second example, the only good vertex is vertex $$$3$$$.In the third example, there are no good vertices.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fd4aabb2", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices numbered from 1 to $n$. You are also given a list of $n-1$ integers $a_1, a_2, ..., a_{n-1}$. \n\nYou need to label each vertex with one of these integers, and you can choose any integer to label the remaining unlabeled vertex.\n\nA vertex $x$ is considered \"good\" if it's possible to label the vertices such that for every vertex $i$, the label of vertex $i$ is the distance between vertex $x$ and vertex $i$. The distance between two vertices in a tree is the minimum number of edges you need to travel to get from one vertex to the other.\n\nFind all the \"good\" vertices in the tree."}, {"prompt_md5": "0f06b3a9", "template_md5": "465699a0", "result": "You are given a tree (a connected graph with no cycles) and a list of numbers. You need to assign each vertex in the tree a number from the list, with no repeats.  \n\nA vertex is \"good\" if you can assign the numbers so that the number on each vertex represents the shortest distance from that vertex to a special vertex (which you can choose).\n\nFind all the \"good\" vertices in the tree."}]}