{"uid": "1795-B", "url": "https://codeforces.com/contest/1795/problem/B", "tags": ["brute force", " geometry", " greedy"], "title": "1795-B", "statement": "B. Ideal Pointtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given $$$n$$$ one-dimensional segments (each segment is denoted by two integers — its endpoints).Let's define the function $$$f(x)$$$ as the number of segments covering point $$$x$$$ (a segment covers the point $$$x$$$ if $$$l \\\\le x \\\\le r$$$, where $$$l$$$ is the left endpoint and $$$r$$$ is the right endpoint of the segment).An integer point $$$x$$$ is calledidealif it belongs to more segments than any other integer point, i. e. $$$f(y) < f(x)$$$ is true for any other integer point $$$y$$$.You are given an integer $$$k$$$. Your task is to determine whether it is possible to remove some (possibly zero) segments, so that the given point $$$k$$$ becomesideal.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.The first line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n, k \\\\le 50$$$).Then $$$n$$$ lines follow, $$$i$$$-th line of them contains two integers $$$l_i$$$ and $$$r_i$$$ ($$$1 \\\\le l_i, r_i \\\\le 50$$$; $$$l_i \\\\le r_i$$$) — the endpoints of the $$$i$$$-th segment.OutputFor each test case, printYESif it is possible to remove some (possibly zero) segments, so that the given point $$$k$$$ becomesideal, otherwise printNO.You may print each letter in any case (YES,yes,Yeswill all be recognized as positive answer,NO,noandnOwill all be recognized as negative answer).ExampleInput44 31 37 92 53 62 91 43 71 32 43 51 46 75 5OutputYES NO NO YESNoteIn the first example, the point $$$3$$$ is already ideal (it is covered by three segments), so you don't have to delete anything.In the fourth example, you can delete everything except the segment $$$[5, 5]$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "74dc5b93", "template_md5": "35d339e4", "result": "You are given $n$ line segments, each defined by its left endpoint ($l$) and right endpoint ($r$).  \n\nFor a given point $x$,  $f(x)$ represents the number of segments that cover $x$ (i.e., $l \\le x \\le r$).\n\nAn integer point $k$ is called \"ideal\" if it is covered by more segments than any other integer point.\n\nYour task is to determine if you can remove some segments (possibly none) so that the point $k$ becomes ideal.\n\n**Input:**\n\n* The first line contains $t$ (the number of test cases).\n* For each test case:\n    * The first line contains $n$ and $k$.\n    * The next $n$ lines each contain two integers, $l$ and $r$, representing a segment.\n\n**Output:**\n\nFor each test case, print \"YES\" if it's possible to make $k$ ideal by removing segments, otherwise print \"NO\"."}, {"prompt_md5": "ec2b9eb0", "template_md5": "465699a0", "result": "You are given a set of intervals on a number line.  Each interval represents a segment.  You are also given a specific number. Determine if you can remove some intervals so that the given number is covered by more intervals than any other number."}]}