{"uid": "18-A", "url": "https://codeforces.com/contest/18/problem/A", "tags": ["brute force", " geometry"], "title": "18-A", "statement": "A. Triangletime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutAt a geometry lesson Bob learnt that a triangle is called right-angled if it is nondegenerate and one of its angles is right. Bob decided to draw such a triangle immediately: on a sheet of paper he drew three points with integer coordinates, and joined them with segments of straight lines, then he showed the triangle to Peter. Peter said that Bob's triangle is not right-angled, but isalmostright-angled: the triangle itself is not right-angled, but it is possible to move one of the points exactly by distance 1 so, that all the coordinates remain integer, and the triangle become right-angled. Bob asks you to help him and find out if Peter tricks him. By the given coordinates of the triangle you should find out if it is right-angled, almost right-angled, or neither of these.InputThe first input line contains 6 space-separated integersx1,y1,x2,y2,x3,y3— coordinates of the triangle's vertices. All the coordinates are integer and don't exceed 100 in absolute value. It's guaranteed that the triangle is nondegenerate, i.e. its total area is not zero.OutputIf the given triangle is right-angled, outputRIGHT, if it is almost right-angled, outputALMOST, and if it is neither of these, outputNEITHER.ExamplesInput0 0 2 0 0 1OutputRIGHTInput2 3 4 5 6 6OutputNEITHERInput-1 0 2 0 0 1OutputALMOST", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "82c00dbf", "template_md5": "35d339e4", "result": "Given three points with integer coordinates, determine if the triangle formed by these points is:\n\n* **RIGHT:**  A right-angled triangle (one angle is 90 degrees).\n* **ALMOST:**  Can be made into a right-angled triangle by moving one point by a distance of 1, keeping the coordinates integers.\n* **NEITHER:**  Not right-angled and cannot be made right-angled by moving a point by 1.\n\n**Input:**\n\nSix space-separated integers representing the x and y coordinates of the three points.\n\n**Output:**\n\nOne of the following strings:\n\n* **RIGHT**\n* **ALMOST**\n* **NEITHER**"}, {"prompt_md5": "9d646299", "template_md5": "465699a0", "result": "Given three points with integer coordinates, determine if the triangle they form is a right triangle, almost a right triangle (can become a right triangle by moving one point by one unit), or neither."}]}