{"uid": "180-C", "url": "https://codeforces.com/contest/180/problem/C", "tags": ["dp"], "title": "180-C", "statement": "C. Lettertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPatrick has just finished writing a message to his sweetheart Stacey when he noticed that the message didn't look fancy. Patrick was nervous while writing the message, so some of the letters there were lowercase and some of them were uppercase.Patrick believes that a message isfancyif any uppercase letter stands to the left of any lowercase one. In other words, this rule describes the strings where first go zero or more uppercase letters, and then — zero or more lowercase letters.To make the message fancy, Patrick can erase some letter and add the same letter in the same place in the opposite case (that is, he can replace an uppercase letter with the lowercase one and vice versa). Patrick got interested in the following question: what minimum number of actions do we need to make a message fancy? Changing a letter's case in the message counts as one action. Patrick cannot perform any other actions.InputThe only line of the input contains a non-empty string consisting of uppercase and lowercase letters. The string's length does not exceed105.OutputPrint a single number — the least number of actions needed to make the messagefancy.ExamplesInputPRuvetSTAaYAOutput5InputOYPROSTIYAOPECHATALSYAPRIVETSTASYAOutput0InputhelloworldOutput0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9baf96d2", "template_md5": "35d339e4", "result": "You are given a string consisting of uppercase and lowercase letters.  Determine the minimum number of times you need to change a letter from uppercase to lowercase or vice versa to make the string \"fancy\". \n\nA string is considered \"fancy\" if all uppercase letters appear before all lowercase letters."}, {"prompt_md5": "574276ad", "template_md5": "465699a0", "result": "You are given a string of uppercase and lowercase letters.  Determine the fewest changes needed to make the string so that all uppercase letters come before all lowercase letters. Each change flips a letter from uppercase to lowercase or vice versa."}]}