{"uid": "180-D", "url": "https://codeforces.com/contest/180/problem/D", "tags": ["greedy", " strings"], "title": "180-D", "statement": "D. Nametime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutEverything got unclear to us in a far away constellation Tau Ceti. Specifically, the Taucetians choose names to their children in a very peculiar manner.Two young parentsabacandbbadthink what name to give to their first-born child. They decided that the name will be the permutation of letters of strings. To keep up with the neighbours, they decided to call the baby so that the name was lexicographically strictly larger than the neighbour's son's namet.On the other hand, they suspect that a name tax will be introduced shortly. According to it, the Taucetians with lexicographicallylargernames will paylargertaxes. That's the reasonabacandbbadwant to call the newborn so that the name was lexicographically strictly larger than nametand lexicographically minimum at that.The lexicographical order of strings is the order we are all used to, the \"dictionary\" order. Such comparison is used in all modern programming languages to compare strings. Formally, a stringpof lengthnis lexicographically less than stringqof lengthm, if one of the two statements is correct:n<m, andpis the beginning (prefix) of stringq(for example, \"aba\" is less than string \"abaa\"),p1=q1,p2=q2, ...,pk- 1=qk- 1,pk<qkfor somek(1 ≤k≤min(n,m)), here characters in strings are numbered starting from 1.Write a program that, given stringsand the heighbours' child's nametdetermines the string that is the result of permutation of letters ins. The string should be lexicographically strictly more thantand also, lexicographically minimum.InputThe first line contains a non-empty strings(1 ≤ |s| ≤ 5000), where|s|is its length. The second line contains a non-empty stringt(1 ≤ |t| ≤ 5000), where|t|is its length. Both strings consist of lowercase Latin letters.OutputPrint the sought name or-1if it doesn't exist.ExamplesInputaadaacOutputaadInputabadbobOutputdaabInputabcdefgOutput-1InputczaaababcdefOutputabczaaNoteIn the first sample the given stringsis the sought one, consequently, we do not need to change the letter order there.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d77e66e4", "template_md5": "35d339e4", "result": "Given two strings, $s$ and $t$, find the lexicographically smallest permutation of $s$ that is lexicographically larger than $t$. If no such permutation exists, output $-1$. \n\n**Example:**\n\n* Input: \n    * $s = $ \"adaac\"\n    * $t = $ \"adaa\"\n* Output: \"ad aa\" \n\n\n* Input:\n    * $s = $ \"badb\"\n    * $t = $ \"bob\"\n* Output: \"daab\""}, {"prompt_md5": "c23067ab", "template_md5": "465699a0", "result": "Given two strings, find the lexicographically smallest string that is a permutation of the first string and lexicographically larger than the second string. If no such string exists, output -1."}]}