{"uid": "180-B", "url": "https://codeforces.com/contest/180/problem/B", "tags": ["math", " number theory"], "title": "180-B", "statement": "B. Divisibility Rulestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutVasya studies divisibility rules at school. Here are some of them:Divisibility by2.A number is divisible by2if and only if its last digit is divisible by2or in other words, is even.Divisibility by3.A number is divisible by3if and only if the sum of its digits is divisible by3.Divisibility by4.A number is divisible by4if and only if its last two digits form a number that is divisible by4.Divisibility by5.A number is divisible by5if and only if its last digit equals5or0.Divisibility by6.A number is divisible by6if and only if it is divisible by2and3simultaneously (that is, if the last digit is even and the sum of all digits is divisible by3).Divisibility by7.Vasya doesn't know such divisibility rule.Divisibility by8.A number is divisible by8if and only if its last three digits form a number that is divisible by8.Divisibility by9.A number is divisible by9if and only if the sum of its digits is divisible by9.Divisibility by10.A number is divisible by10if and only if its last digit is a zero.Divisibility by11.A number is divisible by11if and only if the sum of digits on its odd positions either equals to the sum of digits on the even positions, or they differ in a number that is divisible by11.Vasya got interested by the fact that some divisibility rules resemble each other. In fact, to check a number's divisibility by2,4,5,8and10it is enough to check fulfiling some condition for one or several last digits. Vasya calls such rules the2-typerules.If checking divisibility means finding a sum of digits and checking whether the sum is divisible by the given number, then Vasya calls this rule the3-typerule (because it works for numbers3and9).If we need to find the difference between the sum of digits on odd and even positions and check whether the difference is divisible by the given divisor, this rule is called the11-typerule (it works for number11).In some cases we should divide the divisor into several factors and check whether rules of different types (2-type,3-type or11-type) work there. For example, for number6we check2-type and3-type rules, for number66we check all three types. Such mixed divisibility rules are called6-typerules.And finally, there are some numbers for which no rule works: neither2-type, nor3-type, nor11-type, nor6-type. The least such number is number7, so we'll say that in such cases the mysterious7-typerule works, the one that Vasya hasn't discovered yet.Vasya's dream is finding divisibility rules for all possible numbers. He isn't going to stop on the decimal numbers only. As there are quite many numbers, ha can't do it all by himself. Vasya asked you to write a program that determines the divisibility rule type in theb-based notation for the given divisord.InputThe first input line contains two integersbandd(2 ≤b,d≤ 100) — the notation system base and the divisor. Both numbers are given in the decimal notation.OutputOn the first output line print the type of the rule in theb-based notation system, where the divisor isd: \"2-type\", \"3-type\", \"11-type\", \"6-type\" or \"7-type\". If there are several such types, print the one that goes earlier in the given sequence. If a number belongs to the2-type, print on the second line the least number of the lastb-based digits that we will need to use to check the divisibility.ExamplesInput10 10Output2-type1Input2 3Output11-typeNoteThe divisibility rule for number3in binary notation looks as follows: \"A number is divisible by3if and only if the sum of its digits that occupy the even places differs from the sum of digits that occupy the odd places, in a number that is divisible by3\". That's an11-type rule. For example,2110= 101012. For it the sum of digits on odd positions equals1 + 1 + 1 = 3, an on even positions —0 + 0 = 0. The rule works and the number is divisible by3.In some notations a number can fit into the3-type rule and the11-type rule. In this case the correct answer is \"3-type\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2543ed37", "template_md5": "35d339e4", "result": "Given a base $b$ and a divisor $d$, determine the type of divisibility rule used to check if a number is divisible by $d$ in base $b$.\n\nThe types of rules are:\n\n* **2-type:**  The divisibility depends on the last few digits of the number in base $b$.\n* **3-type:** The divisibility depends on the sum of the digits of the number in base $b$.\n* **11-type:** The divisibility depends on the difference between the sum of digits at odd positions and the sum of digits at even positions in base $b$.\n* **6-type:** The divisibility rule is a combination of 2-type and 3-type rules.\n* **7-type:** No known rule applies.\n\nIf the rule is 2-type, output the minimum number of digits from the end of the number in base $b$ needed to check divisibility."}, {"prompt_md5": "75bb7f14", "template_md5": "465699a0", "result": "Given a base $b$ and a divisor $d$, determine the type of divisibility rule used to check if a number is divisible by $d$ in base $b$.  The rule types are:\n\n* 2-type:  Divisibility based on the last few digits.\n* 3-type: Divisibility based on the sum of the digits.\n* 11-type: Divisibility based on the difference between the sum of digits at odd and even positions.\n* 6-type: A combination of 2-type and 3-type rules.\n* 7-type: No known rule applies."}]}