{"uid": "1800-G", "url": "https://codeforces.com/contest/1800/problem/G", "tags": ["dfs and similar", " hashing", " implementation", " trees"], "title": "1800-G", "statement": "G. Symmetreetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputKid was gifted a tree of $$$n$$$ vertices with the root in the vertex $$$1$$$. Since he really likesymmetricalobjects, Kid wants to find out if this tree issymmetrical.For example, the trees in the picture above aresymmetrical.And the trees in this picture are notsymmetrical.Formally, a tree issymmetricalif there exists an order of children such that:The subtree of the leftmost child of the root is a mirror image of the subtree of the rightmost child;the subtree of the second-left child of the root is a mirror image of the subtree of the second-right child of the root;...if the number of children of the root is odd, then the subtree of the middle child should besymmetrical.InputThe first line of input data contains single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases in the test.The first line of each case contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the number of vertices in the tree.The following $$$n-1$$$ lines contain two integers each $$$u$$$ and $$$v$$$ ($$$1 \\\\le u, v \\\\le n$$$, $$$u \\\\neq v$$$) — indices of vertices connected by an edge.It is guaranteed that the sum of $$$n$$$ over all cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputOutput $$$t$$$ strings, each of which is the answer to the corresponding test case. As an answer, output \"YES\" if this tree issymmetrical, and \"NO\" otherwise.You can output the answer in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive answer).ExampleInput661 51 61 22 32 471 51 33 61 44 74 291 22 42 33 51 77 67 88 9102 99 102 36 74 31 23 82 56 5103 28 109 74 28 22 14 56 55 71OutputYES NO YES NO NO YES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "902ff3a5", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices, where the root is vertex 1.  Determine if the tree is symmetrical. A tree is symmetrical if you can order the children of the root such that:\n\n* The subtree rooted at the leftmost child is a mirror image of the subtree rooted at the rightmost child.\n* The subtree rooted at the second-left child is a mirror image of the subtree rooted at the second-right child.\n* And so on, continuing this pattern.\n* If the root has an odd number of children, the subtree rooted at the middle child must also be symmetrical.\n\nInput:\n\n* The first line contains $t$ ($1 \\le t \\le 10^4$) - the number of test cases.\n* For each test case:\n    * The first line contains $n$ ($1 \\le n \\le 2 \\cdot 10^5$) - the number of vertices in the tree.\n    * The next $n-1$ lines each contain two integers $u$ and $v$ ($1 \\le u, v \\le n$, $u \\neq v$) - representing an edge between vertices $u$ and $v$.\n\nOutput:\n\nFor each test case, output \"YES\" if the tree is symmetrical, and \"NO\" otherwise."}, {"prompt_md5": "a447edd4", "template_md5": "465699a0", "result": "Determine if a given tree is symmetrical. A tree is symmetrical if its subtrees mirror each other from left to right."}]}