{"uid": "1804-D", "url": "https://codeforces.com/contest/1804/problem/D", "tags": ["brute force", " dp", " greedy", " implementation"], "title": "1804-D", "statement": "D. Accommodationtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputAnnie is an amateur photographer. She likes to take pictures of giant residential buildings at night. She just took a picture of a huge rectangular building that can be seen as a table of $$$n \\\\times m$$$ windows. That means that the building has $$$n$$$ floors and each floor has exactly $$$m$$$ windows. Each window is either dark or bright, meaning there is light turned on in the room behind it.Annies knows that each apartment in this building is either one-bedroom or two-bedroom. Each one-bedroom apartment has exactly one window representing it on the picture, and each two-bedroom apartment has exactly twoconsecutivewindows on the same floor. Moreover, the value of $$$m$$$ is guaranteed to be divisible by $$$4$$$ and it is known that each floor has exactly $$$\\\\frac{m}{4}$$$ two-bedroom apartments and exactly $$$\\\\frac{m}{2}$$$ one-bedroom apartments. The actual layout of apartments is unknown and can be different for each floor.Annie considers an apartment to be occupied ifat least oneof its windows is bright. She now wonders, what are the minimum and maximum possible number of occupied apartments if judged by the given picture?Formally, for each of the floors, she comes up with some particular apartments layout with exactly $$$\\\\frac{m}{4}$$$ two-bedroom apartments (two consecutive windows) and $$$\\\\frac{m}{2}$$$ one-bedroom apartments (single window). She then counts the total number of apartments that have at least one bright window. What is the minimum and maximum possible number she can get?InputThe first line of the input contains two positive integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n \\\\cdot m \\\\leq 5 \\\\cdot 10^5$$$) — the number of floors in the building and the number of windows per floor, respectively. It is guaranteed that $$$m$$$ is divisible by $$$4$$$.Then follow $$$n$$$ lines containing $$$m$$$ characters each. The $$$j$$$-th character of the $$$i$$$-th line is \"0\" if the $$$j$$$-th window on the $$$i$$$-th floor is dark, and is \"1\" if this window is bright.OutputPrint two integers, the minimum possible number of occupied apartments and the maximum possible number of occupied apartments, assuming each floor can have an individual layout of $$$\\\\frac{m}{4}$$$ two-bedroom and $$$\\\\frac{m}{2}$$$ one-bedroom apartments.ExamplesInput5 4 0100 1100 0110 1010 1011Output7 10Input1 8 01011100Output3 4NoteIn the first example, each floor consists of one two-bedroom apartment and two one-bedroom apartments.The following apartment layout achieves the minimum possible number of occupied apartments equal to $$$7$$$.|0 1|0|0||1 1|0|0||0|1 1|0||1|0 1|0||1|0|1 1|The following apartment layout achieves the maximum possible number of occupied apartments equal to $$$10$$$.|0 1|0|0||1|1 0|0||0 1|1|0||1|0 1|0||1 0|1|1|", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a8dd49ad", "template_md5": "35d339e4", "result": "You are given a rectangular grid representing a building with $n$ floors and $m$ windows per floor. Each window can be either dark (0) or bright (1). \n\nIt is known that:\n\n* $m$ is divisible by 4.\n* Each floor has $\\frac{m}{4}$ two-bedroom apartments (represented by two consecutive bright windows) and $\\frac{m}{2}$ one-bedroom apartments (represented by a single bright window).\n\nThe layout of apartments on each floor is unknown.\n\nFind the minimum and maximum number of occupied apartments (at least one bright window) that can be achieved based on this information."}, {"prompt_md5": "238ae3e7", "template_md5": "465699a0", "result": "You are given a grid representing a building with lights on or off in each window.  Each floor has the same number of windows.  \n\nYou know that some windows represent one-bedroom apartments and some represent two-bedroom apartments.  \n\nFind the minimum and maximum number of apartments that could be occupied (have at least one light on) based on the grid."}]}