{"uid": "1805-B", "url": "https://codeforces.com/contest/1805/problem/B", "tags": ["greedy", " strings"], "title": "1805-B", "statement": "B. The String Has a Targettime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$. You can apply this operation to the string exactly once: choose index $$$i$$$ and move character $$$s_i$$$ to the beginning of the string (removing it at the old position). For example, if you apply the operation with index $$$i=4$$$ to the string \"abaacd\" with numbering from $$$1$$$, you get the string \"aabacd\". What is the lexicographically minimal$$$^{\\\\dagger}$$$ string you can obtain by this operation?$$$^{\\\\dagger}$$$A string $$$a$$$ is lexicographically smaller than a string $$$b$$$ of the same length if and only if the following holds:in the first position where $$$a$$$ and $$$b$$$ differ, the string $$$a$$$ has a letter that appears earlier in the alphabet than the corresponding letter in $$$b$$$.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$). The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10 ^ 5$$$) — the length of the string.The second line of each test case contains the string $$$s$$$ of length $$$n$$$, consisting of lowercase English letters.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10 ^ 5$$$.OutputFor each test case, on a separate line print the lexicographically smallest string that can be obtained after applying the operation to the original string exactly once.ExampleInput43cba4acac5abbcb4aabaOutputacb aacc abbcb aaabNoteIn the first test case, you need to move the last character to the beginning.In the second case, you need to move the second letter \"a\".In the third set you need to apply the operation with $$$i=1$$$, then the string will not change.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f06fb92e", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters. You can move any single letter to the beginning of the string, removing it from its original position. What is the smallest possible string you can create by doing this exactly once?\n\nFor example, if the string is \"abaacd\" and you move the character at index 4 (\"d\"), the resulting string would be \"aabacd\". \n\n\nYou will be given multiple test cases, each with a different string."}, {"prompt_md5": "887e07b6", "template_md5": "465699a0", "result": "You are given a string. You can move one character to the beginning of the string. What is the smallest possible string you can make?"}]}