{"uid": "1807-B", "url": "https://codeforces.com/contest/1807/problem/B", "tags": ["greedy"], "title": "1807-B", "statement": "B. Grab the Candiestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMihai and Bianca are playing with bags of candies. They have a row $$$a$$$ of $$$n$$$ bags of candies. The $$$i$$$-th bag has $$$a_i$$$ candies. The bags are given to the players in the order from the first bag to the $$$n$$$-th bag.If a bag has an even number of candies, Mihai grabs the bag. Otherwise, Bianca grabs the bag. Once a bag is grabbed, the number of candies in it gets added to the total number of candies of the player that took it.Mihai wants to show off, so he wants to reorder the array so that at any moment (except at the start when they both have no candies), Mihai will havestrictly morecandies than Bianca. Help Mihai find out if such a reordering exists.InputThe first line of the input contains an integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 1000$$$) — the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 100$$$) — the number of bags in the array.The second line of each test case contains $$$n$$$ space-separated integers $$$a_i$$$ ($$$1 \\\\leq a_i \\\\leq 100$$$) — the number of candies in each bag.OutputFor each test case, output \"YES\" (without quotes) if such a reordering exists, and \"NO\" (without quotes) otherwise.You can output the answer in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive answer).ExampleInput341 2 3 441 1 1 231 4 3OutputYES NO NONoteIn the first test case, Mihai can reorder the array as follows: $$$[4, 1, 2, 3]$$$. Then the process proceeds as follows:the first bag has $$$4$$$ candies, which is even, so Mihai takes it — Mihai has $$$4$$$ candies, and Bianca has $$$0$$$.the second bag has $$$1$$$ candies, which is odd, so Bianca takes it — Mihai has $$$4$$$ candies, and Bianca has $$$1$$$.the third bag has $$$2$$$ candies, which is even, so Mihai takes it — Mihai has $$$6$$$ candies, and Bianca has $$$1$$$.the fourth bag has $$$3$$$ candies, which is odd, so Bianca takes it — Mihai has $$$6$$$ candies, and Bianca has $$$4$$$.Since Mihai always has more candies than Bianca, this reordering works.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "65dca4e2", "template_md5": "35d339e4", "result": "You are given an array of integers $a$ of length $n$. Each integer represents the number of candies in a bag.  Two players take turns grabbing bags. If a bag has an even number of candies, Player 1 takes it. If a bag has an odd number of candies, Player 2 takes it.  After taking a bag, a player adds the number of candies in the bag to their total.\n\nDetermine if it is possible to rearrange the array so that Player 1 always has more candies than Player 2 at every step of the game (except for the very beginning). \n\n\nIf it is possible, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "2af1b517", "template_md5": "465699a0", "result": "You are given a list of numbers. Each number represents the number of candies in a bag. Two players take turns grabbing bags. If a bag has an even number of candies, the first player takes it. If a bag has an odd number of candies, the second player takes it.  The player who takes a bag adds the number of candies in that bag to their total.  \n\nDetermine if it's possible to rearrange the list so that the first player always has more candies than the second player after each turn."}]}