{"uid": "1808-E1", "url": "https://codeforces.com/contest/1808/problem/E1", "tags": ["combinatorics", " divide and conquer", " dp"], "title": "1808-E1", "statement": "E1. Minibuses on Venus (easy version)time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is the easy version of the problem. The only difference between the three versions is the constraints on $$$n$$$ and $$$k$$$. You can make hacks only if all versions of the problem are solved.Maxim is a minibus driver on Venus.To ride on Maxim's minibus, you need a ticket. Each ticket has a number consisting of $$$n$$$ digits. However, as we know, the residents of Venus use a numeral system with base $$$k$$$, rather than the decimal system. Therefore, the ticket number can be considered as a sequence of $$$n$$$ integers from $$$0$$$ to $$$k-1$$$, inclusive.The residents of Venus consider a ticket to beluckyif there is a digit on it that is equal to the sum of the remaining digits, modulo $$$k$$$. For example, if $$$k=10$$$, then the ticket $$$7135$$$ is lucky because $$$7 + 1 + 5 \\\\equiv 3 \\\\pmod{10}$$$. On the other hand, the ticket $$$7136$$$ is not lucky because no digit is equal to the sum of the others modulo $$$10$$$.Once, while on a trip, Maxim wondered: how many lucky tickets exist? At the same time, Maxim understands that this number can be very large, so he is interested only in the answer modulo some prime number $$$m$$$.InputThe only line of the input contains three integers $$$n$$$, $$$k$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 100$$$, $$$1 \\\\le k \\\\le 30$$$, $$$10^8 \\\\le m \\\\le 10^9 + 7$$$, $$$m$$$ is a prime number) — the number of digits on the ticket, the base of the numeral system on Venus, and the module for answer calculation.OutputPrint one integer — the number of lucky tickets modulo $$$m$$$, i. e. the remainder after dividing the answer by $$$m$$$.ExamplesInput3 2 1000000007Output4Input3 4 1000000007Output28NoteIn the first example, there are only four lucky tickets: $$$000$$$, $$$011$$$, $$$101$$$, and $$$110$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4fbc000a", "template_md5": "35d339e4", "result": "Given an integer $n$, $k$, and $m$, find the number of $n$-digit numbers in base $k$ that are \"lucky\". A number is lucky if one of its digits is equal to the sum of the other digits modulo $k$. Output the answer modulo $m$.\n\nConstraints:\n\n* $1 \\le n \\le 100$\n* $1 \\le k \\le 30$\n* $10^8 \\le m \\le 10^9 + 7$ ($m$ is prime)"}, {"prompt_md5": "1a085fe1", "template_md5": "465699a0", "result": "Given a number of digits, a base, and a modulus, count how many possible number sequences (using digits 0 to base-1) are \"lucky\". A lucky number sequence has a digit that equals the sum of the other digits, modulo the base. Output the count modulo the given modulus."}]}