{"uid": "1809-A", "url": "https://codeforces.com/contest/1809/problem/A", "tags": ["implementation"], "title": "1809-A", "statement": "A. Garlandtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have a garland consisting of $$$4$$$ colored light bulbs, the color of the $$$i$$$-th light bulb is $$$s_i$$$.Initially, all the light bulbs are turned off. Your task is to turn all the light bulbs on. You can perform the following operation any number of times: select a light bulb and switch its state (turn it on if it was off, and turn it off if it was on). The only restriction on the above operation is that you can apply the operation to a light bulb only if the previous operation was applied to a light bulb of a different color (the first operation can be applied to any light bulb).Calculate the minimum number of operations to turn all the light bulbs on, or report that this is impossible.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The single line of each test case contains $$$s$$$ — a sequence of $$$4$$$ characters, where each character is a decimal digit. The $$$i$$$-th character denotes the color of the $$$i$$$-th light bulb.OutputFor each test case, print one integer — the minimum number of operations to turn all the light bulbs on. If it is impossible to turn all the bulbs on, print-1.ExampleInput3954600003313Output4 -1 6NoteIn the first example, all the colors are different, so you can just turn all the bulbs on in $$$4$$$ operations.In the second example, it is impossible to turn all the bulbs on, because after you switch one light bulb, it is impossible to turn the others on.In the third example, you can proceed as follows: turn the first light bulb on, turn the third light bulb on, turn the fourth light bulb on, turn the third light bulb off, turn the second light bulb on, turn the third light bulb on.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "283738b4", "template_md5": "35d339e4", "result": "You have a garland with 4 light bulbs. Each bulb has a color represented by a digit (0-3).  All bulbs are initially off. You can turn a bulb on or off, but you can only switch a bulb if the previous switch was on a bulb of a different color. The first switch can be on any bulb.\n\nFind the fewest number of switches needed to turn all the bulbs on. If it's impossible, say -1."}, {"prompt_md5": "dd4e438d", "template_md5": "465699a0", "result": "You have a sequence of 4 items, each with a unique color. You can switch the state (on/off) of an item, but you can only switch an item if the previous switch was on a different colored item.  Find the fewest switches needed to turn all items on, or say it's impossible."}]}