{"uid": "1810-B", "url": "https://codeforces.com/contest/1810/problem/B", "tags": ["constructive algorithms", " math", " number theory"], "title": "1810-B", "statement": "B. Candiestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis problem is about candy. Initially, you only have $$$1$$$ candy, and you want to have exactly $$$n$$$ candies.You can use the two following spells in any order at most $$$40$$$ times in total.Assume you have $$$x$$$ candies now. If you use the first spell, then $$$x$$$ candies become $$$2x-1$$$ candies.Assume you have $$$x$$$ candies now. If you use the second spell, then $$$x$$$ candies become $$$2x+1$$$ candies.Construct a sequence of spells, such that after using them in order, you will haveexactly$$$n$$$ candies, or determine it's impossible.InputEach test contains multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Their description follows.Each test case contains one line with a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 10^9$$$) — the required final number of candies.OutputFor each test case, output the following.If it's possible to eventually have $$$n$$$ candies within $$$40$$$ spells, in the first line print an integer $$$m$$$ ($$$1 \\\\le m \\\\le 40$$$), representing the total number of spells you use.In the second print $$$m$$$ integers $$$a_{1}, a_{2}, \\\\ldots, a_{m}$$$ ($$$a_{i}$$$ is $$$1$$$ or $$$2$$$) separated by spaces, where $$$a_{i} = 1$$$ means that you use the first spell in the $$$i$$$-th step, while $$$a_{i} = 2$$$ means that you use the second spell in the $$$i$$$-th step.Note that youdo nothave to minimize $$$m$$$, and if there are multiple solutions, you may output any one of them.If it's impossible, output $$$-1$$$ in one line.ExampleInput423717Output-1 1 2  2 2 2  4 2 1 1 1NoteFor $$$n=3$$$, you can just use the second spell once, and then have $$$2 \\\\cdot 1 + 1 = 3$$$ candies.For $$$n=7$$$, you can use the second spell twice. After the first step, you will have $$$3$$$ candies. And after the second step, you will have $$$2 \\\\cdot 3 + 1 = 7$$$ candies.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b285a9d9", "template_md5": "35d339e4", "result": "You start with 1 candy. You can use two spells to change the number of candies you have:\n\n* Spell 1: Doubles the number of candies and subtracts 1.  \n* Spell 2: Doubles the number of candies and adds 1.\n\nYou can use each spell at most 40 times in total.  \n\nGiven a target number of candies ($n$), determine if it's possible to reach that number using these spells. If possible, output the number of spells used and the order in which you used them (1 for Spell 1, 2 for Spell 2). If it's impossible, output -1."}, {"prompt_md5": "a0dacd3b", "template_md5": "465699a0", "result": "You start with 1 candy. You can use two spells: one that doubles your candy and subtracts 1, and another that doubles your candy and adds 1. You want to reach a specific number of candies using these spells at most 40 times.  Determine if it's possible and, if so, list the spells you'd use."}]}