{"uid": "1814-A", "url": "https://codeforces.com/contest/1814/problem/A", "tags": ["implementation", " math"], "title": "1814-A", "statement": "A. Coinstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn Berland, there are two types of coins, having denominations of $$$2$$$ and $$$k$$$ burles.Your task is to determine whether it is possible to represent $$$n$$$ burles in coins, i. e. whether there exist non-negative integers $$$x$$$ and $$$y$$$ such that $$$2 \\\\cdot x + k \\\\cdot y = n$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The only line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 10^{18}$$$; $$$k \\\\ne 2$$$).OutputFor each test case, printYESif it is possible to represent $$$n$$$ burles in coins; otherwise, printNO. You may print each letter in any case (YES,yes,Yeswill all be recognized as positive answer,NO,noandnOwill all be recognized as negative answer).ExampleInput45 36 17 48 8OutputYES YES NO YESNoteIn the first test case, you can take one coin with denomination $$$2$$$ and one coin with denomination $$$k = 3$$$.In the second test case, you can take three coins with denomination $$$2$$$. Alternatively, you can take six coins with denomination $$$k = 1$$$.In the third test case, there is no way to represent $$$7$$$ burles.In the fourth test case, you can take one coin with denomination $$$k = 8$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "66a8aaec", "template_md5": "35d339e4", "result": "You are given two types of coins: one with a value of $2$ and another with a value of $k$.  \n\nGiven a target amount $n$, determine if it is possible to make change for $n$ using only these coins. \n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* Each test case contains two integers, $n$ and $k$ ($1 \\le k \\le n \\le 10^{18}$, $k \\neq 2$).\n\n**Output:**\n\nFor each test case, print \"YES\" if it is possible to make change for $n$ using the coins, otherwise print \"NO\"."}, {"prompt_md5": "86a83c6b", "template_md5": "465699a0", "result": "Given two coin denominations, one for 2 units and another for *k* units, determine if it's possible to make a total of *n* units using only these coins."}]}