{"uid": "1816-B", "url": "https://codeforces.com/contest/1816/problem/B", "tags": ["constructive algorithms", " greedy"], "title": "1816-B", "statement": "B. Grid Reconstructiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputConsider a $$$2 \\\\times n$$$ grid, where $$$n$$$ is aneveninteger. You may place the integers $$$1, 2, \\\\ldots, 2n$$$ on the grid, using each integerexactly once.Apathis a sequence of cells achieved by starting at $$$(1, 1)$$$, then repeatedly walking either downwards or to the right, and stopping when $$$(2, n)$$$ is reached. The path should not extend beyond the grid.Thecostof a path is the alternating sum of the numbers written on the cells in a path. That is, let the numbers written on the cells be $$$a_1, a_2, \\\\ldots, a_k$$$ (in the order that it is visited), the cost of the path is $$$a_1 - a_2 + a_3 - a_4 + \\\\ldots = \\\\sum_{i=1}^k a_i \\\\cdot (-1)^{i+1}$$$.Construct a way to place the integers $$$1, 2, \\\\ldots, 2n$$$ on the grid, such that the minimum cost over all paths from $$$(1, 1)$$$ to $$$(2, n)$$$ is maximized. If there are multiple such grids that result in the maximum value, output any of them.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 1000$$$) — the number of test cases. The description of test cases follows.The first and the only line of each test case contains a single integer $$$n$$$ ($$$2 \\\\leq n \\\\leq 10^5$$$, $$$n$$$ is even) — the number of the columns in the grid.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case, output $$$2$$$ lines, each containing $$$n$$$ integers — the desired grid. If there are multiple solutions, output any of them.ExampleInput3246Output3 2 1 4 8 2 6 4 1 5 3 7 11 5 9 1 7 3 6 10 2 8 4 12NoteIn the first test case, there are only two paths from cell $$$(1, 1)$$$ to cell $$$(2, 2)$$$. Their costs are $$$3-1+4=6$$$ and $$$3-2+4=5$$$. Then the minimum cost is $$$5$$$, which is the maximum possible value.In the second test case, there are four paths from cell $$$(1, 1)$$$ to cell $$$(2, 4)$$$. Their costs are $$$8-1+5-3+7=16$$$, $$$8-2+5-3+7=15$$$, $$$8-2+6-3+7=16$$$, and $$$8-2+6-4+7=15$$$. Then the minimum value is $$$15$$$, which is the maximum possible value.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "880547df", "template_md5": "465699a0", "result": "You are given a 2xN grid where N is an even number. You need to place the numbers 1 through 2N on the grid, each number only once.  \n\nYou can travel from the top left corner to the bottom right corner of the grid by only moving down or right. The cost of a path is calculated by alternatingly adding and subtracting the numbers you encounter on the path.\n\nFind a way to place the numbers on the grid so that the lowest possible cost of any path is as high as possible."}, {"prompt_md5": "9fac42ad", "template_md5": "35d339e4", "result": "You are given a 2 x *n* grid, where *n* is an even integer. You need to place the numbers 1, 2, ..., 2*n* on the grid, using each number exactly once.\n\nA path is a sequence of cells that starts at (1,1) and moves either down or right, ending at (2, *n*). The cost of a path is the alternating sum of the numbers on the cells in the path. For example, if the path visits cells with numbers *a<sub>1</sub>*, *a<sub>2</sub>*, ..., *a<sub>k</sub>*, the cost is *a<sub>1</sub> - a<sub>2</sub> + a<sub>3</sub> - a<sub>4</sub> + ...*.\n\nYour task is to find a way to place the numbers on the grid so that the minimum cost of any path from (1,1) to (2, *n*) is as large as possible.  If there are multiple solutions, output any one."}]}