{"uid": "1817-B", "url": "https://codeforces.com/contest/1817/problem/B", "tags": ["brute force", " constructive algorithms", " dfs and similar", " graphs"], "title": "1817-B", "statement": "B. Fish Graphtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a simple undirected graph with $$$n$$$ nodes and $$$m$$$ edges. Note that the graph is not necessarily connected. The nodes are labeled from $$$1$$$ to $$$n$$$.We define a graph to be aFish Graphif it contains a simple cycle with a special node $$$u$$$ belonging to the cycle. Apart from the edges in the cycle, the graph should have exactly $$$2$$$ extra edges. Both edges should connect to node $$$u$$$, but they should not be connected to any other node of the cycle.Determine if the graph contains a subgraph that is a Fish Graph, and if so, find any such subgraph.In this problem, we define a subgraph as a graph obtained by taking any subset of the edges of the original graph.Visualization of example 1. The red edges form one possible subgraph that is a Fish Graph.InputThe first line of input contains the integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 1000$$$), the number of test cases. The description of test cases follows.The first line of each test case contains two integers, $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 2\\\\,000$$$) — the number of nodes and the number of edges.Each of the next $$$m$$$ lines contains the description of an edge. Each line contains two integers $$$u_i$$$ and $$$v_i$$$ ($$$1 \\\\leq u_i, v_i \\\\leq n$$$, $$$u_i\\\\neq v_i$$$) — an edge connects node $$$u_i$$$ to node $$$v_i$$$.It is guaranteed that no two edges connect the same unordered pair of nodes.Furthermore, it is guaranteed that the sum of $$$n$$$ and the sum of $$$m$$$ over all test cases both do not exceed $$$2\\\\,000$$$.OutputFor each testcase, output \"YES\" if the graph contains a subgraph that is a Fish Graph, otherwise print \"NO\". If the answer is \"YES\", on the following lines output a description of the subgraph.The first line of the description contains one integer $$$k$$$ — the number of edges of the subgraph.On the next $$$k$$$ lines, output the edges of the chosen subgraph. Each of the $$$k$$$ lines should contains two integers $$$u$$$ and $$$v$$$ ($$$1\\\\le u, v\\\\le n$$$, $$$u\\\\neq v$$$) — the edge between $$$u$$$ and $$$v$$$ belongs to the subgraph. The order in which $$$u$$$ and $$$v$$$ are printed does not matter, as long as the two nodes are connected by an edge in the original graph. The order in which you print the edges does not matter, as long as the resulting subgraph is a fish graph.If there are multiple solutions, print any.ExampleInput37 81 22 33 44 14 54 64 26 77 76 71 22 33 44 11 33 54 41 33 44 11 2OutputYES 6 5 4 6 4 4 3 1 4 2 1 3 2 YES 5 5 3 2 3 3 1 4 3 1 4 NONoteIn the first example, a possible valid subgraph contains the cycle $$$1 \\\\rightarrow 2 \\\\rightarrow 3 \\\\rightarrow 4 \\\\rightarrow 1$$$. The special node of this cycle is node $$$4$$$. The two extra edges $$$4 - 5$$$ and $$$4 - 6$$$ are both connected to $$$4$$$, completing the Fish Graph.In the second example, a possible valid subgraph contains the cycle $$$1 \\\\rightarrow 3 \\\\rightarrow 4 \\\\rightarrow 1$$$. The special node of this cycle is node $$$3$$$. The two extra edges $$$3 - 2$$$ and $$$3 - 5$$$ are both connected to $$$3$$$, completing the Fish Graph.In the last example, it can be proven that there is no valid subgraph.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2d24436b", "template_md5": "35d339e4", "result": "You are given a graph with $n$ nodes and $m$ edges.  \n\nA **Fish Graph** is a graph with a cycle containing a special node $u$.  The graph must also have exactly two extra edges, both connected to node $u$, but not to any other node in the cycle.\n\nDetermine if the given graph contains a subgraph that is a Fish Graph. If so, find one such subgraph.\n\n**Input:**\n\n* The first line contains $t$ (the number of test cases).\n* For each test case:\n    * The first line contains $n$ and $m$ (the number of nodes and edges).\n    * The next $m$ lines each contain two integers $u_i$ and $v_i$ representing an edge between nodes $u_i$ and $v_i$.\n\n**Output:**\n\n* For each test case:\n    * Print \"YES\" if a Fish Graph subgraph exists, otherwise print \"NO\".\n    * If \"YES\", print the number of edges in the subgraph $k$.\n    * Print $k$ lines, each containing two integers $u$ and $v$ representing an edge in the subgraph."}, {"prompt_md5": "7b7f4a47", "template_md5": "465699a0", "result": "You are given a graph with nodes and edges.  Determine if there is a smaller subgraph within the graph that forms a cycle with a special node. This special node must also be connected to two other nodes outside the cycle. If such a subgraph exists, output \"YES\" and describe it. Otherwise, output \"NO\"."}]}