{"uid": "182-A", "url": "https://codeforces.com/contest/182/problem/A", "tags": ["geometry", " graphs", " implementation", " shortest paths"], "title": "182-A", "statement": "A. Battlefieldtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya lagged behind at the University and got to the battlefield. Just joking! He's simply playing some computer game. The field is a flat platform withntrenches dug on it. The trenches are segments on a plane parallel to the coordinate axes. No two trenches intersect.There is a huge enemy laser far away from Vasya. The laser charges foraseconds, and then shoots continuously forbseconds. Then, it charges foraseconds again. Then it shoots continuously forbseconds again and so on. Vasya knows numbersaandb. He also knows that while the laser is shooting, Vasya must be in the trench, but while the laser is charging, Vasya can safely move around the field. The main thing is to have time to hide in the trench before the shot. If Vasya reaches the trench exactly at the moment when the laser starts shooting, we believe that Vasya managed to hide. Coincidentally,the lengthof any trench in meters numericallydoes not exceedb.Initially, Vasya is at pointA. He needs to get to pointB. Vasya moves at speed 1 meter per second in either direction. You can get in or out of the trench at any its point. Getting in or out of the trench takes no time. It is also possible to move in the trench, without leaving it.What is the minimum time Vasya needs to get from pointAto pointB, if at the initial time the laser has just started charging? If Vasya cannot get from pointAto pointB, print -1. If Vasya reaches pointBat the moment when the laser begins to shoot, it is believed that Vasya managed to reach pointB.InputThe first line contains two space-separated integers:aandb(1 ≤a,b≤ 1000), — the duration of charging and the duration of shooting, in seconds.The second line contains four space-separated integers:Ax,Ay,Bx,By( - 104≤Ax,Ay,Bx,By≤ 104)— the coordinates of pointsАandB. It is guaranteed that pointsAandBdo not belong to any trench.The third line contains a single integer:n(1 ≤n≤ 1000), — the number of trenches.Each of the followingnlines contains four space-separated integers:x1,y1,x2,y2( - 104≤xi,yi≤ 104)— the coordinates of ends of the corresponding trench.All coordinates are given in meters. It is guaranteed that for any trench eitherx1=x2, ory1=y2. No two trenches intersect. The length of any trench in meters doesn't exceedbnumerically.OutputIf Vasya can get from pointAto pointB, print the minimum time he will need for it. Otherwise, print number -1.The answer will be considered correct if the absolute or relative error does not exceed10- 4ExamplesInput2 40 5 6 530 0 0 41 1 4 16 0 6 4Output19.0000000000Input5 100 0 10 1015 0 5 9Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f0847ab6", "template_md5": "35d339e4", "result": "A laser fires in a repeating pattern: charge for $a$ seconds, then fire for $b$ seconds. This cycle repeats indefinitely.  \n\nYou are given two points, A and B, and a set of trenches on a 2D plane. The trenches are horizontal or vertical line segments.  \n\nYou can move at a speed of 1 meter per second. You must be inside a trench when the laser is firing, and you can move freely outside of a trench.\n\n**Problem:**\n\nFind the minimum time it takes to travel from point A to point B, starting when the laser is charging. \n\n* You can enter and exit trenches at any point.\n* If you reach point B at the moment the laser starts firing, you are considered safe.\n\n**Input:**\n\n* Two integers, $a$ and $b$, representing the charge and fire durations of the laser.\n* Four integers, $Ax$, $Ay$, $Bx$, $By$, representing the coordinates of points A and B.\n* An integer, $n$, representing the number of trenches.\n* $n$ lines, each containing four integers, $x1$, $y1$, $x2$, $y2$, representing the coordinates of the endpoints of each trench.\n\n**Output:**\n\n* The minimum time to travel from A to B, or -1 if it is impossible."}, {"prompt_md5": "b9c3aa84", "template_md5": "465699a0", "result": "A laser shoots in intervals of charging and shooting. You need to move a certain distance while avoiding the laser beams. You can move freely during charging periods and must be inside a trench during shooting periods. Find the minimum time to reach your destination, knowing the laser's charging and shooting durations, your starting and ending points, and the locations of the trenches. If it's impossible to reach the destination safely, return -1."}]}