{"uid": "182-E", "url": "https://codeforces.com/contest/182/problem/E", "tags": ["dp"], "title": "182-E", "statement": "E. Wooden Fencetime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya has recently bought some land and decided to surround it with a wooden fence.He went to a company called \"Wooden board\" that produces wooden boards for fences. Vasya read in the catalog of products that the company has at its disposalndifferent types of wood. The company uses thei-th type of wood to produce a board of this type that is a rectangularaibybiblock.Vasya decided to order boards in this company and build a fence from them. It turned out that the storehouse of the company is so large that Vasya can order arbitrary number of boards of every type. Note that Vasya is allowed toturnthe boards as he builds the fence.However, Vasya cannot turn square boards.Vasya is required to construct a fence of lengthl, however, an arbitrary fence won't do. Vasya wants his fence to look beautiful. We'll say that a fence isbeautifulif and only if the following two conditions are fulfilled:there are notwo successive boards of the same typethe first board of the fence has an arbitrary length, and thelengthof each subsequent board equals thewidthof the previous oneIn other words, the fence is considered beautiful, if the type of thei-th board in the fence is different from thei- 1-th board's type; besides, thei-th board's length is equal to thei- 1-th board's width (for alli, starting from 2).Now Vasya wonders, how many variants of arranging a fence for his land exist. Your task is to count the number of different beautiful fences of lengthl.Two fences will be considered the same if the corresponding sequences of fence boards types and rotations are the same, otherwise the fences are different.Since the sought number can be large enough, you need to calculate the answer modulo1000000007(109+ 7).InputThe first line contains two integersnandl(1 ≤n≤ 100, 1 ≤l≤ 3000) — the number of different board types and the fence length, correspondingly. Nextnlines contain descriptions of board types: thei-th line contains two integersaiandbi(1 ≤ai,bi≤ 100) — the sizes of the board of thei-th type. All numbers on the lines are separated by spaces.OutputPrint a single integer — the sought number of variants modulo1000000007(109+ 7).ExamplesInput2 31 22 3Output2Input1 22 2Output1Input6 62 13 22 53 35 12 1Output20NoteIn the first sample there are exactly two variants of arranging a beautiful fence of length 3:As the first fence board use the board of the first type of length 1 and width 2. As the second board use board of the second type of length 2 and width 3.Use one board of the second type after you turn it. That makes its length equal 3, and width — 2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97a494af", "template_md5": "35d339e4", "result": "There are $n$ types of wooden boards available, each with dimensions $a_i \\times b_i$. You need to build a fence of length $l$ using these boards. \n\nThe fence must satisfy these rules:\n\n* No two consecutive boards can be of the same type.\n* The length of each board must be equal to the width of the previous board.\n* You can rotate the boards.\n\nFind the number of different ways to build a fence that meets these rules, modulo $10^9 + 7$."}, {"prompt_md5": "c475beeb", "template_md5": "465699a0", "result": "You have a set of rectangular boards of different sizes. You need to build a fence of a specific length using these boards. The fence must meet these rules:\n\n* Each board must be a different size from the one before it.\n* The length of each board must equal the width of the previous board.\n\nYou can rotate the boards.  Count how many different fences you can build that follow these rules."}]}