{"uid": "1820-B", "url": "https://codeforces.com/contest/1820/problem/B", "tags": ["math", " strings", " two pointers"], "title": "1820-B", "statement": "B. JoJo's Incredible Adventurestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputDid you think there was going to be a JoJo legend here? But no, that was me, Dio!Given a binary string $$$s$$$ of length $$$n$$$, consisting of characters0and1. Let's build asquaretable of size $$$n \\\\times n$$$, consisting of0and1characters as follows.In the first row of the table write the original string $$$s$$$. In the second row of the table writecyclic shiftof the string $$$s$$$ by one to the right. In the third row of the table, write the cyclic shift of line $$$s$$$ by two to the right. And so on. Thus, the row with number $$$k$$$ will contain a cyclic shift of string $$$s$$$ by $$$k$$$ to the right. The rowsare numbered from $$$0$$$ to $$$n - 1$$$ top-to-bottom.In the resulting table we need to find the rectangle consisting only of ones that has the largest area.We call a rectangle the set of all cells $$$(i, j)$$$ in the table, such that $$$x_1 \\\\le i \\\\le x_2$$$ and $$$y_1 \\\\le j \\\\le y_2$$$ for some integers $$$0 \\\\le x_1 \\\\le x_2 < n$$$ and $$$0 \\\\le y_1 \\\\le y_2 < n$$$.Recall that the cyclic shift of string $$$s$$$ by $$$k$$$ to the right is the string $$$s_{n-k+1} \\\\ldots s_n s_1 s_2 \\\\ldots s_{n-k}$$$. For example, the cyclic shift of the string \"01011\" by $$$0$$$ to the right is the string itself \"01011\", its cyclic shift by $$$3$$$ to the right is the string \"01101\".InputEach test consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 2 \\\\cdot 10^4$$$) — the number of test cases. The description of test cases follows.The first and the only line of each test case contains a single binary string $$$s$$$ ($$$1 \\\\le \\\\lvert s \\\\rvert \\\\le 2 \\\\cdot 10^5$$$), consisting of characters0and1.It is guaranteed that the sum of string lengths $$$|s|$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, output a single integer — the maximum area of a rectangle consisting only of ones. If there is no such rectangle, output $$$0$$$.ExampleInput501101011110101010Output0 1 2 6 1NoteIn the first test case, there is a table $$$1 \\\\times 1$$$ consisting of a single character0, so there are no rectangles consisting of ones, and the answer is $$$0$$$.In the second test case, there is a table $$$1 \\\\times 1$$$, consisting of a single character1, so the answer is $$$1$$$.In the third test case, there is a table:101110011In the fourth test case, there is a table:011110001111100111110011111001111100In the fifth test case, there is a table:101010010101101010010101101010010101Rectangles with maximum area are shown in bold.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "834f1383", "template_md5": "35d339e4", "result": "You are given a binary string of length $n$ consisting of 0s and 1s. \n\nCreate an $n \\times n$ table where:\n\n* The first row contains the original string.\n* Each subsequent row is a cyclic right shift of the original string by one position. For example, if the string is \"01011\", the second row would be \"10110\".\n\nFind the largest rectangle within this table that is entirely filled with 1s.  Output the area of this largest rectangle. If no such rectangle exists, output 0."}, {"prompt_md5": "0edb9782", "template_md5": "465699a0", "result": "You are given a binary string. Create a square table where each row is a right cyclic shift of the string. Find the largest rectangle in the table that is filled with 1s.  If no such rectangle exists, output 0."}]}