{"uid": "183-D", "url": "https://codeforces.com/contest/183/problem/D", "tags": ["dp", " greedy", " probabilities"], "title": "183-D", "statement": "D. T-shirttime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are going to work in Codeforces as an intern in a team ofnengineers, numbered1throughn. You want to give each engineer a souvenir: a T-shirt from your country (T-shirts are highly desirable in Codeforces). Unfortunately you don't know the size of the T-shirt each engineer fits in. There aremdifferent sizes, numbered1throughm, and each engineer will fit in a T-shirt of exactly one size.You don't know the engineers' exact sizes, so you asked your friend, Gerald. Unfortunately, he wasn't able to obtain the exact sizes either, but he managed to obtain for each engineeriand for all sizesj, the probability that the size of the T-shirt that fits engineeriisj.Since you're planning to give each engineer one T-shirt, you are going to bring with you exactlynT-shirts. For thosenT-shirts, you can bring any combination of sizes (you can bring multiple T-shirts with the same size too!). You don't know the sizes of T-shirts for each engineer when deciding what sizes to bring, so you have to pick this combination based only on the probabilities given by your friend, Gerald.Your task is to maximize the expected number of engineers that receive a T-shirt of his size.This is defined more formally as follows. When you finally arrive at the office, you will ask each engineer his T-shirt size. Then, if you still have a T-shirt of that size, you will give him one of them. Otherwise, you don't give him a T-shirt. You will ask the engineers in order starting from engineer1, then engineer2, and so on until engineern.InputThe first line contains two space-separated integersnandm(1 ≤n≤ 3000, 1 ≤m≤ 300), denoting the number of engineers and the number of T-shirt sizes, respectively.Thennlines follow, each line containsmspace-separated integers. Thej-th integer in thei-th line represents the probability that thei-th engineer fits in a T-shirt of sizej. Each probability will be given as an integer between0and1000, inclusive. The actual probability should be calculated as the given number divided by1000.It is guaranteed that for any engineer, the sum of the probabilities for allmT-shirts is equal to one.OutputPrint a single real number denoting the maximum possible expected number of engineers that will receive a T-shirt.For the answer the absolute or relative error of10- 9is acceptable.ExamplesInput2 2500 500500 500Output1.500000000000Input3 31000 0 01000 0 00 1000 0Output3.000000000000Input1 4100 200 300 400Output0.400000000000NoteFor the first example, bring one T-shirt of each size. With0.5chance, either both engineers fit inside T-shirts of size1or both fit inside T-shirts of size2. With the other0.5chance, one engineer fits inside a T-shirt of size1and the other inside a T-shirt of size2. If the first is true, the number of engineers that receive a T-shirt is one. If the second is true, the number of such engineers is two. Hence, the expected number of engineers who receive a T-shirt is1.5. This is maximum possible expected number of engineers for all sets of T-shirts.For the second example, bring two T-shirts of size1and one T-shirt of size2. This way, each engineer will definitely receive a T-shirt of his size.For the third example, bring one T-shirt of size4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a607179a", "template_md5": "35d339e4", "result": "You have $n$ engineers and $m$ different T-shirt sizes. You know the probability that each engineer fits into each size.  You want to bring $T$ T-shirts, one of each size, to give to the engineers.  \n\nYou don't know which size each engineer fits, so you need to choose the $T$ sizes to bring based on the probabilities.  \n\nWhat is the maximum number of engineers you can expect to give a T-shirt to? \n\n**Input:**\n\n* Two integers $n$ and $m$ ($1 \\le n \\le 3000$, $1 \\le m \\le 300$) representing the number of engineers and the number of T-shirt sizes.\n* $n$ lines, each with $m$ integers between 0 and 1000. The $j$-th integer in the $i$-th line represents the probability that the $i$-th engineer fits into a size $j$ T-shirt (the actual probability is the given number divided by 1000).\n\n**Output:**\n\n* A real number representing the maximum expected number of engineers who will receive a T-shirt."}, {"prompt_md5": "bff2c1ad", "template_md5": "465699a0", "result": "You have a limited number of items to give out. Each person has a different probability of needing a specific type of item. You need to choose which items to bring to maximize the number of people who get what they need."}]}