{"uid": "1830-F", "url": "https://codeforces.com/contest/1830/problem/F", "tags": ["data structures", " dp"], "title": "1830-F", "statement": "F. The Third Gracetime limit per test5 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputYou are given $$$n$$$ intervals and $$$m$$$ points on the number line. The $$$i$$$-th intervals covers coordinates $$$[l_i,r_i]$$$ and the $$$i$$$-th point is on coordinate $$$i$$$ and has coefficient $$$p_i$$$.Initially, all points are not activated. You should choose a subset of the $$$m$$$ points to activate. For each of $$$n$$$ interval, we define itscostas:$$$0$$$, if there are no activated points in the interval;the coefficient of the activated point with thelargest coordinatewithin it, otherwise.Your task is to maximize the sum of the costs of all intervals by choosing which points to activate.InputEach test contains multiple test cases. The first line of input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^5$$$) — the number of test cases. The description of test cases follows.The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 10^6, 1 \\\\le m \\\\le 10^6$$$) — the number of intervals and the number of points.The following $$$n$$$ lines of each test case contains two integers $$$l_i$$$ and $$$r_i$$$ ($$$1 \\\\le l_i \\\\le r_i \\\\le m$$$) — the endpoints of the $$$i$$$-th interval.The following line of each test case contains $$$m$$$ integers $$$p_1,p_2,\\\\ldots,p_m$$$ ($$$0 \\\\le p_i \\\\le 10^9$$$) — the coefficients of the points.It is guaranteed that the sum of $$$n$$$ does not exceed $$$10^6$$$ and the sum of $$$m$$$ does not exceed $$$10^6$$$.OutputOutput the maximum possible sum of costs of all intervals.ExampleInput22 81 53 878 0 50 0 0 0 0 301 61 50 0 0 0 0 100Output108 0NoteIn the first sample, we can activate points $$$1$$$ and $$$8$$$. The sum of costs of all intervals will be $$$78+30=108$$$.In the second sample, we will activate no points. The sum of costs of all intervals will be $$$0$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "81f11192", "template_md5": "35d339e4", "result": "You are given $n$ intervals on a number line, each defined by its start point ($l_i$) and end point ($r_i$). You are also given $m$ points on the number line, each with a specific coefficient ($p_i$).\n\nYour goal is to choose a subset of these points to activate.  The cost of an interval is:\n\n* 0 if no activated points are within the interval.\n* The coefficient of the highest-coordinate activated point within the interval, otherwise.\n\nFind the maximum possible sum of costs for all intervals by strategically activating the points."}, {"prompt_md5": "e8d30bfe", "template_md5": "465699a0", "result": "You have a number line with intervals and points. Each point has a value.  You can choose some points to activate.  The cost of an interval is the value of the highest activated point within it, or 0 if no points are activated.  Find the maximum total cost of all intervals."}]}