{"uid": "1833-C", "url": "https://codeforces.com/contest/1833/problem/C", "tags": ["greedy", " math"], "title": "1833-C", "statement": "C. Vlad Building Beautiful Arraytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVlad was given an array $$$a$$$ of $$$n$$$ positive integers. Now he wants to build abeautifularray $$$b$$$ of length $$$n$$$ from it.Vlad considers an arraybeautifulif all the numbers in it are positive and have the same parity. That is, all numbers in thebeautifularray aregreaterthan zero and are either all even or all odd.To build the array $$$b$$$, Vlad can assign each $$$b_i$$$ either the value $$$a_i$$$ or $$$a_i - a_j$$$, where any $$$j$$$ from $$$1$$$ to $$$n$$$ can be chosen.To avoid trying to do the impossible, Vlad asks you to determine whether it is possible to build abeautifularray $$$b$$$ of length $$$n$$$ using his array $$$a$$$.InputThe first line of input contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Then follow the descriptions of the test cases.The first line of each case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the length of the array $$$a$$$.The second line of each case contains $$$n$$$ positive integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — the elements of the array $$$a$$$.It is guaranteed that the sum of $$$n$$$ over all cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputOutput $$$t$$$ strings, each of which is the answer to the corresponding test case. As the answer, output \"YES\" if Vlad can build abeautifularray $$$b$$$, and \"NO\" otherwise.You can output the answer in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive answer).ExampleInput752 6 8 4 351 4 7 6 942 6 4 1075 29 13 9 10000001 11 352 1 2 4 252 4 5 4 342 5 5 4OutputNO YES YES YES YES NO NO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bb5cf378", "template_md5": "465699a0", "result": "You are given a list of numbers.  You can create a new list by either keeping the original number or subtracting any other number from the original list.  Determine if it's possible to create a new list where all the numbers are either all even or all odd."}, {"prompt_md5": "a4673286", "template_md5": "35d339e4", "result": "You are given an array of $n$ positive integers. You can create a new array of the same length by assigning each element either its original value or the difference between its original value and any other element in the array. \n\nDetermine if it is possible to create a new array where all elements are positive and either all even or all odd. \n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the length of the array, $n$.\n    * The second line contains the $n$ integers of the array.\n\nOutput:\n\nFor each test case, output \"YES\" if it is possible to create the desired array, and \"NO\" otherwise."}]}