{"uid": "1833-A", "url": "https://codeforces.com/contest/1833/problem/A", "tags": ["implementation", " strings"], "title": "1833-A", "statement": "A. Musical Puzzletime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVlad decided to compose a melody on his guitar. Let's represent the melody as a sequence of notes corresponding to the characters 'a', 'b', 'c', 'd', 'e', 'f', and 'g'.However, Vlad is not very experienced in playing the guitar and can only recordexactly twonotes at a time. Vlad wants to obtain the melody $$$s$$$, and to do this, he can merge the recorded melodies together. In this case, the last sound of the first melody must match the first sound of the second melody.For example, if Vlad recorded the melodies\"ab\"and\"ba\", he can merge them together and obtain the melody\"aba\", and then merge the result with\"ab\"to get\"abab\".Help Vlad determine theminimumnumber of melodies consisting of two notes that he needs to record in order to obtain the melody $$$s$$$.InputThe first line of input contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Following that are the descriptions of the test cases.The first line of each test case contains an integer $$$n$$$ ($$$2 \\\\le n \\\\le 50$$$) — the length of the melody $$$s$$$.The second line of each test case contains a string $$$s$$$ of length $$$n$$$, consisting of characters 'a', 'b', 'c', 'd', 'e', 'f', 'g'.OutputOutput $$$t$$$ integers, each representing the answer for the corresponding test case. As the answer outputminimumnumber of melodies consisting of two notes that Vlad needs to record.ExampleInput54abab7abacaba6aaaaaa7abcdefg5babddOutput2 4 1 6 4NoteIn the first sample, you need to record the melodies\"ab\"and\"ba\", as described in the problem statement.In the second sample, you need to record the melodies\"ab\",\"ba\",\"ac\", and\"ca\".In the third sample, the only necessary melody is\"aa\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "11da7a8e", "template_md5": "35d339e4", "result": "You are given a sequence of notes, consisting of the characters 'a', 'b', 'c', 'd', 'e', 'f', and 'g'.  You can only record two notes at a time.  To create the given sequence, you can merge two recorded sequences together, where the last note of the first sequence must match the first note of the second sequence.\n\nFind the minimum number of two-note sequences you need to record to create the given sequence. \n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 10^4$) representing the number of test cases.\n* For each test case:\n    * The first line contains an integer $n$ ($2 \\le n \\le 50$) representing the length of the sequence.\n    * The second line contains a string of length $n$ consisting of the characters 'a', 'b', 'c', 'd', 'e', 'f', and 'g'.\n\nOutput:\n\n* For each test case, output the minimum number of two-note sequences needed."}, {"prompt_md5": "3eb1ad2e", "template_md5": "465699a0", "result": "You are given a sequence of notes. You can only record two notes at a time, and to combine them, the last note of the first recording must match the first note of the second. Find the fewest number of two-note recordings needed to create the given sequence."}]}