{"uid": "1834-F", "url": "https://codeforces.com/contest/1834/problem/F", "tags": ["brute force", " math"], "title": "1834-F", "statement": "F. Typewritertime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently, Polycarp was given an unusual typewriter as a gift! Unfortunately, the typewriter was defective and had a rather strange design.The typewriter consists of $$$n$$$ cells numbered from left to right from $$$1$$$ to $$$n$$$, and a carriage that moves over them. The typewriter cells contain $$$n$$$distinctintegers from $$$1$$$ to $$$n$$$, and each cell $$$i$$$ initially contains the integer $$$p_i$$$. Before all actions, the carriage is at cell number $$$1$$$ and there is nothing in its buffer storage. The cell on which the carriage is located is called thecurrentcell.The carriage can perform five types of operations:Take the integer from the current cell, if it is not empty, and put it in the carriage buffer, if it is empty (this buffer can containno more than oneinteger).Put the integer from the carriage buffer, if it is not empty, into the current cell, if it is empty.Swap the number in the carriage buffer with the number in the current cell, if both the buffer and the cell contain integers.Move the carriage from the current cell $$$i$$$ to cell $$$i + 1$$$ (if $$$i < n$$$), while the integer in the buffer is preserved.Reset the carriage, i.e. move it to cell number $$$1$$$, while the integer in the buffer is preserved.Polycarp was very interested in this typewriter, so he asks you to help him understand it and will ask you $$$q$$$ queries of three types:Perform a cyclic shift of the sequence $$$p$$$ to the left by $$$k_j$$$.Perform a cyclic shift of the sequence $$$p$$$ to the right by $$$k_j$$$.Reverse the sequence $$$p$$$.Before and after each query, Polycarp wants to know whatminimumnumber of carriage resets is needed for the current sequence in order to distribute the numbers to their cells (so that the number $$$i$$$ ends up in cell number $$$i$$$).Note that Polycarp only wants to know the minimum number of carriage resets required to arrange the numbers in their places, buthe does not actually distribute them.Help Polycarp find the answers to his queries!InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 4 \\\\cdot 10^5$$$) — the number of cells.The second line contains $$$n$$$ distinct integers $$$p_1, p_2, \\\\ldots, p_n$$$ ($$$1 \\\\le p_i \\\\le n$$$) — the initial arrangement of integers in the cells.The third line contains a single integer $$$q$$$ ($$$0 \\\\le q \\\\le 4 \\\\cdot 10^5$$$) — the number of queries.Each of the next $$$q$$$ lines describes a query from Polycarp:The $$$j$$$-th line, at first, contains the integer $$$t_j$$$ ($$$1 \\\\le t_j \\\\le 3$$$)  — the type of query.If the query is of type $$$t_j = 1$$$ or $$$t_j = 2$$$, then the integer $$$k_j$$$ ($$$1 \\\\le k_j \\\\le n$$$)  — the length of the shift  — follows in the same line.OutputOutput $$$q + 1$$$ numbers — the minimum number of carriage resets required before and after each of Polycarp's queries.ExamplesInput3 2 3 1 0Output1Input3 1 2 3 2 2 1 3Output0 2 1Input5 3 1 2 5 4 5 1 3 3 2 3 1 4 3Output3 2 1 2 1 2NoteIn the first example, the answer is $$$1$$$. You can understand how the carriage works using this example.In the second example, the sequences for which the answer needs to be calculated look like this:Before all queries: $$$1\\\\ 2\\\\ 3$$$ — the answer is $$$0$$$.After shifting to the right by $$$1$$$: $$$3\\\\ 1\\\\ 2$$$ — the answer is $$$2$$$.After reversing the sequence: $$$2\\\\ 1\\\\ 3$$$ — the answer is $$$1$$$.In the third example, the sequences before and after each query look like this:$$$3\\\\ 1\\\\ 2\\\\ 5\\\\ 4$$$ — the answer is $$$3$$$.$$$5\\\\ 4\\\\ 3\\\\ 1\\\\ 2$$$ — the answer is $$$2$$$.$$$2\\\\ 1\\\\ 3\\\\ 4\\\\ 5$$$ — the answer is $$$1$$$.$$$3\\\\ 4\\\\ 5\\\\ 2\\\\ 1$$$ — the answer is $$$2$$$.$$$1\\\\ 3\\\\ 4\\\\ 5\\\\ 2$$$ — the answer is $$$1$$$.$$$2\\\\ 5\\\\ 4\\\\ 3\\\\ 1$$$ — the answer is $$$2$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "589f82e6", "template_md5": "465699a0", "result": "You are given a sequence of numbers. You can perform the following operations on the sequence:\n\n* Shift the sequence left or right by a given number of positions.\n* Reverse the sequence.\n\nAfter each operation, determine the minimum number of times you need to rearrange the sequence to have each number in its correct position."}, {"prompt_md5": "4003df02", "template_md5": "35d339e4", "result": "You are given an array of $n$ distinct integers from 1 to $n$.  There is a special device with $n$ cells, each initially containing one of these integers. The device has a buffer that can hold one integer. The device can perform the following operations:\n\n1. **Take:** If the current cell is not empty, take the integer from the current cell and put it in the buffer.\n2. **Put:** If the buffer is not empty, put the integer from the buffer into the current cell.\n3. **Swap:** If both the buffer and the current cell contain integers, swap the integers.\n4. **Move Right:** Move the device to the next cell to the right (if it's not already at the last cell), preserving the integer in the buffer.\n5. **Reset:** Move the device back to the first cell, preserving the integer in the buffer.\n\nYou are given $q$ queries. Each query is one of the following:\n\n1. **Cyclic Shift Left:** Shift the array $k$ positions to the left.\n2. **Cyclic Shift Right:** Shift the array $k$ positions to the right.\n3. **Reverse:** Reverse the array.\n\nFor each query, determine the minimum number of \"Reset\" operations needed to arrange the integers in the array so that the $i$-th integer ends up in the $i$-th cell."}]}