{"uid": "1835-F", "url": "https://codeforces.com/contest/1835/problem/F", "tags": ["bitmasks", " dfs and similar", " graph matchings", " graphs", " implementation"], "title": "1835-F", "statement": "F. Good Graphtime limit per test7 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a bipartite graph $$$G$$$ with the vertex set in the left part $$$L$$$, in the right part $$$R$$$, and $$$m$$$ edges connecting these two sets. We know that $$$|L| = |R| = n$$$.For any subset $$$S \\\\subseteq L$$$, let $$$N(S)$$$ denote the set of all neighbors of vertices in $$$S$$$. We say that a subset $$$S \\\\subseteq L$$$ in graph $$$G$$$ istightif $$$|S| = |N(S)|$$$. We say that graph $$$G$$$ isgoodif $$$\\\\forall_{S \\\\subseteq L}, |S| \\\\leq |N(S)|$$$.Your task is to verify whether the graph is good and, if so, to optimize it. If the graph is not good, find a subset $$$S \\\\subseteq L$$$ such that $$$|S| > |N(S)|$$$. However, if the graph is good, your task is to find a good bipartite graph $$$G'$$$ with the same set of vertices $$$L \\\\cup R$$$, in which $$$\\\\forall_{S \\\\subseteq L}$$$, $$$S$$$ is tight in $$$G$$$ if and only if $$$S$$$ is tight in $$$G'$$$. If there are multiple such graphs, choose one with the smallest possible number of edges. If there are still multiple such graphs, print any.InputThe first line of the input contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n \\\\leq 10^3$$$, $$$0 \\\\leq m \\\\leq n^2$$$), separated by a single space. The number $$$n$$$ denotes the number of vertices in each of the sets $$$L$$$ and $$$R$$$, and the number $$$m$$$ denotes the number of edges between them.The following $$$m$$$ lines describe the edges. Each of them contains two integers $$$l$$$ and $$$r$$$ ($$$1 \\\\leq l \\\\leq n$$$, $$$n+1 \\\\leq r \\\\leq 2 \\\\cdot n$$$), separated by a single space, indicating that there is an edge from vertex $$$l \\\\in L$$$ to vertex $$$r \\\\in R$$$.OutputIf the graph $$$G$$$ given in the input is not good, output one word \"NO\" in the first line of the output. In the second line of the output, output the number $$$k$$$, and in the third line, output $$$k$$$ numbers $$$l_1, l_2, \\\\dots, l_k$$$, separated by single spaces. These numbers should indicate that for the set $$$S = \\\\{l_1, l_2, \\\\dots, l_k\\\\}$$$, $$$|S| > |N(S)|$$$.However, if the graph $$$G$$$ given in the input is good, output one word \"YES\" in the first line of the output. In the second line of the output, output the number $$$m'$$$, indicating the number of edges in the new, also good graph $$$G'$$$. Then, in the following $$$m'$$$ lines, output the edges of the graph $$$G'$$$ in the same format as given in the input.ExamplesInput3 8 1 4 1 5 1 6 2 4 2 5 2 6 3 5 3 6OutputYES 6 1 4 1 5 2 5 2 6 3 6 3 4Input3 4 1 4 1 5 2 6 3 6OutputNO 2 2 3NoteIn the first sample test, the graph $$$G$$$ is good; thus, we are looking for an equivalent graph with the same tight sets. The only tight set is $$$\\\\{ 1, 2, 3 \\\\}$$$, which remains tight in the resulting graph. Moreover, no other set is tight in the resulting graph. One can prove that no graph with less than $$$6$$$ edges and the same tight sets exists.In the second sample test, the graph $$$G$$$ is not good. Set $$$\\\\{ 2, 3 \\\\}$$$ has only one neighbour — vertex $$$6$$$. Thus, $$$|\\\\{ 2, 3 \\\\}| > |\\\\{ 6 \\\\}|$$$, which is a prove that the input graph is not good.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "da1780ef", "template_md5": "35d339e4", "result": "You are given a graph with two sets of vertices,  *L* and *R*, with the same number of vertices ( *n* ). There are *m* edges connecting vertices from *L* to *R*.\n\nA subset *S* of *L* is called **tight** if the number of vertices in *S* is equal to the number of vertices in *R* that are connected to vertices in *S*.\n\nA graph is **good** if for every subset *S* of *L*, the number of vertices in *S* is less than or equal to the number of vertices in *R* that are connected to vertices in *S*.\n\n**Your task:**\n\n1. **Determine if the graph is good.**\n2. **If the graph is not good:**\n   - Find a subset *S* of *L* where the number of vertices in *S* is greater than the number of vertices in *R* that are connected to vertices in *S*.\n3. **If the graph is good:**\n   - Find a new good graph with the same vertices (*L* union *R*) where:\n     - A subset *S* of *L* is tight in the original graph if and only if *S* is tight in the new graph.\n   - Choose the new graph with the fewest edges possible. If there are multiple such graphs, print any one.\n\n\n\nLet me know if you have any other questions."}, {"prompt_md5": "56d87828", "template_md5": "465699a0", "result": "You are given a graph with two sets of points connected by edges.  Determine if the graph meets a specific condition: for any subset of points in one set, the number of connected points in the other set is greater than or equal to the number of points in the subset. If it does, find a simpler graph with the same points that also meets this condition. If it doesn't, find a subset of points where this condition fails."}]}