{"uid": "1836-B", "url": "https://codeforces.com/contest/1836/problem/B", "tags": ["greedy", " math"], "title": "1836-B", "statement": "B. Astrophysiciststime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn many, many years, far, far away, there will be a launch of the first flight to Mars. To celebrate the success, $$$n$$$ astrophysicists working on the project will be given bonuses of a total value of $$$k$$$ gold coins.You have to distribute the money among the astrophysicists, and to make it easier, you have to assign bonuses in silver coins. Each gold coin is worth $$$g$$$ silver coins, so you have to distribute all $$$k \\\\cdot g$$$ silver coins among $$$n$$$ people.Unfortunately, the company has some financial troubles right now. Therefore, instead of paying the number of silver coins written on the bonus, they decided to round this amount to the nearest integer number of gold coins.The rounding procedure is as follows. If an astrophysicist has bonus equal to $$$x$$$ silver coins, and we denote $$$r = x \\\\bmod g$$$, then:If $$$r \\\\geq \\\\lceil \\\\frac{g}{2} \\\\rceil$$$, the astrophysicist receives $$$x + (g - r)$$$ silver coins;Otherwise, an astrophysicists receives $$$x - r$$$ silver coins.Note that due to rounding, the total sum of actually paid money is not, in general, equal to $$$k \\\\cdot g$$$ silver coins. The operation $$$a \\\\bmod b$$$ denotes the remainder of the division of $$$a$$$ by $$$b$$$. Sum of values before roundinghas to be equal to $$$k \\\\cdot g$$$ silver coins, but some workers can be assigned $$$0$$$ silver coins.You aim to distribute the bonuses so that the company saves as many silver coins due to rounding as possible. Please note that there is always a distribution in which the company spends no more than $$$k \\\\cdot g$$$ silver coins.InputIn the first line of input, there is one integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) denoting the number of test cases.Each of the following $$$t$$$ lines describes one test case and contains three integers $$$n$$$, $$$k$$$, $$$g$$$ ($$$1 \\\\le n \\\\le 10^9$$$, $$$0 \\\\le k \\\\le 10^9$$$, $$$2 \\\\le g \\\\le 10^9$$$) — respectively the number of astrophysicists in the company, total number of gold coins to assign and the number of silver coins that one gold coin corresponds to.OutputIn a separate line for each test case, output a single integer — the maximum number of silver coins that could be saved due to rounding.ExampleInput53 3 1002 1 1491 2 1336 16 673 8 22Output100 0 26 72 176NoteIn the first test case, one of the optimal assignments could be the following:First person: $$$x = 30$$$ silver coins: company pays $$$0$$$, saves $$$30$$$ silver coins,Second person: $$$x = 140$$$ silver coins: company pays $$$100$$$, saves $$$40$$$ silver coins,Third person: $$$x = 130$$$ silver coins: company pays $$$100$$$, saves $$$30$$$ silver coins.In the second test case, we could have the following assignment:First person: $$$x = 8$$$ silver coins: company pays $$$14$$$, spends extra $$$6$$$ silver coins,Second person: $$$x = 6$$$ silver coins: company pays $$$0$$$, saves $$$6$$$ silver coins.If the bonuses are assigned to $$$7$$$ silver coins for both astrophysicists, then the company would have to pay an additional gold coin to cover the bonuses.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "245c244f", "template_md5": "35d339e4", "result": "You are given $n$ people and $k$ gold coins. Each gold coin is worth $g$ silver coins.  \n\nYou need to distribute the $k \\cdot g$ silver coins among the $n$ people.  \n\nHere's the catch:\n\n* Each person's bonus is rounded to the nearest whole number of gold coins.\n* If a person's bonus in silver coins ($x$) has a remainder ($r = x \\bmod g$) of at least $\\lceil \\frac{g}{2} \\rceil$, they receive $x + (g - r)$ silver coins.\n* Otherwise, they receive $x - r$ silver coins.\n\nThe goal is to find the maximum number of silver coins the company can save by rounding down the bonuses. \n\n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 10^4$) representing the number of test cases.\n* Each of the following $t$ lines describes a test case with three integers: $n$, $k$, and $g$ ($1 \\le n \\le 10^9$, $0 \\le k \\le 10^9$, $2 \\le g \\le 10^9$).\n\nOutput:\n\n* For each test case, print a single integer representing the maximum number of silver coins that can be saved."}, {"prompt_md5": "e94454b4", "template_md5": "465699a0", "result": "You need to distribute a total amount of money to a group of people. Each unit of money can be given out in two forms: large or small.  You want to minimize the total amount of money spent by strategically rounding the amount given to each person to the nearest whole number of large units."}]}