{"uid": "1837-F", "url": "https://codeforces.com/contest/1837/problem/F", "tags": ["binary search", " data structures", " greedy", " implementation"], "title": "1837-F", "statement": "F. Editorial for Twotime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBerland Intercollegiate Contest has just finished. Monocarp and Polycarp, as the jury, are going to conduct an editorial. Unfortunately, the time is limited, since they have to finish before the closing ceremony.There were $$$n$$$ problems in the contest. The problems are numbered from $$$1$$$ to $$$n$$$. The editorial for the $$$i$$$-th problem takes $$$a_i$$$ minutes. Monocarp and Polycarp are going to conduct an editorial for exactly $$$k$$$ of the problems.The editorial goes as follows. They have a full problemset of $$$n$$$ problems before them, in order. They remove $$$n - k$$$ problems without changing the order of the remaining $$$k$$$ problems. Then, Monocarp takes some prefix of these $$$k$$$ problems (possibly, an empty one or all problems). Polycarp takes the remaining suffix of them. After that, they go to different rooms and conduct editorials for their problems in parallel. So, the editorial takes as much time as the longer of these two does.Please, help Monocarp and Polycarp to choose the problems and the split in such a way that the editorial finishes as early as possible. Print the duration of the editorial.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of testcases.The first line of each testcase contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 3 \\\\cdot 10^5$$$) — the number of problems in the full problemset and the number of problems Monocarp and Polycarp are going to conduct an editorial for.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — the time each editorial takes.The sum of $$$n$$$ over all testcases doesn't exceed $$$3 \\\\cdot 10^5$$$.OutputFor each testcase, print a single integer — the smallest amount of time the editorial takes, if Monocarp and Polycarp can choose which $$$k$$$ of $$$n$$$ problems to conduct an editorial for and how to split them among themselves.ExampleInput65 41 10 1 1 15 31 20 5 15 35 31 20 3 15 510 610 8 20 14 3 8 6 4 16 1110 59 9 2 13 15 19 4 9 13 121 11Output2 6 5 21 18 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b3eecfc1", "template_md5": "35d339e4", "result": "There are $n$ problems. You need to choose $k$ of them to write editorials for.  \n\nThe time it takes to write an editorial for the $i$-th problem is $a_i$.\n\nYou can split the $k$ problems into two groups, one for you and one for another person.  The total time to write the editorials is the maximum of the time it takes you and the other person.\n\nFind the minimum possible total time to write the editorials. \n\nInput:\n\n* $t$ - the number of test cases\n* For each test case:\n    * $n$ - the number of problems\n    * $k$ - the number of problems to write editorials for\n    * $a_1, a_2, ..., a_n$ - the time to write an editorial for each problem\n\nOutput:\n\n* For each test case, print the minimum possible total time to write the editorials."}, {"prompt_md5": "a8cd186a", "template_md5": "465699a0", "result": "You are given a list of tasks, each taking a certain amount of time. You need to choose $k$ tasks out of $n$ and split them into two groups.  The total time it takes to complete the tasks is the maximum time taken by either group. Find the minimum possible total time."}]}