{"uid": "1838-C", "url": "https://codeforces.com/contest/1838/problem/C", "tags": ["constructive algorithms", " math", " number theory"], "title": "1838-C", "statement": "C. No Prime Differencestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given integers $$$n$$$ and $$$m$$$. Fill an $$$n$$$ by $$$m$$$ grid with the integers $$$1$$$ through $$$n\\\\cdot m$$$, in such a way that for any two adjacent cells in the grid, the absolute difference of the values in those cells is not a prime number. Two cells in the grid are considered adjacent if they share a side.It can be shown that under the given constraints, there is always a solution.InputThe first line of the input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases. The description of the test cases follows.The first and only line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$4 \\\\le n, m \\\\le 1000$$$) — the dimensions of the grid.It is guaranteed that the sum of $$$n\\\\cdot m$$$ over all test cases does not exceed $$$10^6$$$.OutputFor each test case, output $$$n$$$ lines of $$$m$$$ integers each, representing the final grid. Every number from $$$1$$$ to $$$n\\\\cdot m$$$ should appear exactly once in the grid.The extra spaces and blank lines in the sample output below are only present to make the output easier to read, and arenotrequired.If there are multiple solutions, print any of them.ExampleInput34 45 76 4Output16  7  1  9 12  8  2  3 13  4 10 11 14  5  6 15  29 23 17  9  5  6  2 33 27 21 15 11  7  1 32 31 25 19 20 16 10 26 30 24 18 14  8  4 35 34 28 22 13 12  3   2  3  7 11  8  9  1 10 17 13  5  4 18 14  6 12 19 23 15 21 20 24 16 22NoteThe first sample case corresponds to the picture above. The only absolute differences between adjacent elements in this grid are $$$1$$$, $$$4$$$, $$$6$$$, $$$8$$$, and $$$9$$$, none of which are prime.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b803978d", "template_md5": "35d339e4", "result": "You are given two integers $n$ and $m$.  You need to fill an $n \\times m$ grid with the numbers 1 through $n \\times m$ so that the absolute difference between any two adjacent cells is not a prime number. Two cells are adjacent if they share a side. \n\n**Input:**\n\n* The first line contains an integer $t$ (the number of test cases).\n* For each test case, the first line contains two integers $n$ and $m$ (the dimensions of the grid).\n\n**Output:**\n\n* For each test case, print the $n \\times m$ grid. Each number from 1 to $n \\times m$ must appear exactly once in the grid. \n\n\n\nLet me know if you'd like help with any specific part of the problem or need further clarification!"}, {"prompt_md5": "34163ca3", "template_md5": "465699a0", "result": "Fill a grid with numbers from 1 to the total number of cells in the grid.  The numbers in adjacent cells (sharing a side) must have an absolute difference that is not a prime number."}]}