{"uid": "1840-A", "url": "https://codeforces.com/contest/1840/problem/A", "tags": ["implementation", " strings", " two pointers"], "title": "1840-A", "statement": "A. Cipher Shifertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is a string $$$a$$$ (unknown to you), consisting of lowercase Latin letters, encrypted according to the following rule into string $$$s$$$:after each character of string $$$a$$$, an arbitrary (possibly zero) number of any lowercase Latin letters, different from the character itself, is added;after each such addition, the character that we supplemented is added.You are given string $$$s$$$, and you need to output the initial string $$$a$$$. In other words, you need to decrypt string $$$s$$$.Note that each string encrypted in this way is decrypteduniquely.InputThe first line of the input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.The descriptions of the test cases follow.The first line of each test case contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 100$$$) — the length of the encrypted message.The second line of each test case contains a string $$$s$$$ of length $$$n$$$ — the encrypted message obtained from some string $$$a$$$.OutputFor each test case, output the decrypted message $$$a$$$ on a separate line.ExampleInput38abacabac5qzxcq20ccooddeeffoorrcceessOutputac q codeforcesNoteIn the first encrypted message, the letter $$$a$$$ is encrypted as $$$aba$$$, and the letter $$$c$$$ is encrypted as $$$cabac$$$.In the second encrypted message, only one letter $$$q$$$ is encrypted as $$$qzxcq$$$.In the third encrypted message, zero characters are added to each letter.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "71ee961b", "template_md5": "35d339e4", "result": "You are given a string $s$ that is created by taking a secret string $a$ and adding a variable number of different lowercase letters after each character in $a$.  Then, the added character is appended to the end of the string. \n\nFor example:\n\n* If $a$ is \"ab\", $s$ could be \"ababac\".\n\nYour task is to figure out the original string $a$ given the encrypted string $s$. \n\nYou will be given multiple test cases, each with a different encrypted string."}, {"prompt_md5": "174cf6f5", "template_md5": "465699a0", "result": "You are given a string that was created by adding zero or more different letters after each letter of a secret string.  Your task is to figure out the original secret string."}]}