{"uid": "1843-C", "url": "https://codeforces.com/contest/1843/problem/C", "tags": ["bitmasks", " combinatorics", " math", " trees"], "title": "1843-C", "statement": "C. Sum in Binary Treetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVanya really likes math. One day when he was solving another math problem, he came up with an interesting tree. This tree is built as follows.Initially, the tree has only one vertex with the number $$$1$$$ — the root of the tree. Then, Vanya adds two children to it, assigning them consecutive numbers — $$$2$$$ and $$$3$$$, respectively. After that, he will add children to the vertices in increasing order of their numbers, starting from $$$2$$$, assigning their children the minimum unused indices. As a result, Vanya will have an infinite tree with the root in the vertex $$$1$$$, where each vertex will have exactly two children, and the vertex numbers will be arranged sequentially by layers.Part of Vanya's tree.Vanya wondered what the sum of the vertex numbers on the path from the vertex with number $$$1$$$ to the vertex with number $$$n$$$ in such a tree is equal to. Since Vanya doesn't like counting, he asked you to help him find this sum.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.This is followed by $$$t$$$ lines — the description of the test cases. Each line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^{16}$$$) — the number of vertex for which Vanya wants to count the sum of vertex numbers on the path from the root to that vertex.OutputFor each test case, print one integer — the desired sum.ExampleInput63103711000000000000000015Output4 18 71 1 19999999999999980 26NoteIn the first test case of example on the path from the root to the vertex $$$3$$$ there are two vertices $$$1$$$ and $$$3$$$, their sum equals $$$4$$$.In the second test case of example on the path from the root to the vertex with number $$$10$$$ there are vertices $$$1$$$, $$$2$$$, $$$5$$$, $$$10$$$, sum of their numbers equals $$$1+2+5+10 = 18$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "34c72dd1", "template_md5": "35d339e4", "result": "You are given a special type of tree. The tree starts with a root node labeled 1.  Then, two children are added to the root, labeled 2 and 3.  Subsequently, children are added to each node in increasing order, with the minimum unused label assigned to each new child.\n\nGiven a number $n$, find the sum of all the node labels on the path from the root node (label 1) to the node with label $n$. \n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 10^4$) representing the number of test cases.\n* Each of the following $t$ lines contains an integer $n$ ($1 \\le n \\le 10^{16}$) representing the target node label.\n\nOutput:\n\nFor each test case, print the sum of node labels on the path from the root to the node with label $n$."}, {"prompt_md5": "0034294e", "template_md5": "465699a0", "result": "Given a special tree structure where each node has two children and the node numbers increase sequentially, find the sum of node numbers along the path from the root node (node 1) to a given node."}]}