{"uid": "1844-D", "url": "https://codeforces.com/contest/1844/problem/D", "tags": ["constructive algorithms", " greedy", " math", " number theory", " strings"], "title": "1844-D", "statement": "D. Row Majortime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTherow-major orderof an $$$r \\\\times c$$$ grid of characters $$$A$$$ is the string obtained by concatenating all the rows, i.e. $$$$$$ A_{11}A_{12} \\\\dots A_{1c}A_{21}A_{22} \\\\dots A_{2c} \\\\dots A_{r1}A_{r2} \\\\dots A_{rc}. $$$$$$A grid of characters $$$A$$$ isbadif there are some two adjacent cells (cells sharing an edge) with the same character.You are given a positive integer $$$n$$$. Consider all strings $$$s$$$ consisting of only lowercase Latin letters such that they arenotthe row-major order ofanybad grid. Find any string with the minimum number of distinct characters among all such strings of length $$$n$$$.It can be proven that at least one such string exists under the constraints of the problem.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$). The description of the test cases follows.The only line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^6$$$).It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10^6$$$.OutputFor each test case, output a string with the minimum number of distinct characters among all suitable strings of length $$$n$$$.If there are multiple solutions, print any of them.ExampleInput44216Outputthat is a tomatoNoteIn the first test case, there are $$$3$$$ ways $$$s$$$ can be the row-major order of a grid, and they are all not bad:tththathatatIt can be proven that $$$3$$$ distinct characters is the minimum possible.In the second test case, there are $$$2$$$ ways $$$s$$$ can be the row-major order of a grid, and they are both not bad:iissIt can be proven that $$$2$$$ distinct characters is the minimum possible.In the third test case, there is only $$$1$$$ way $$$s$$$ can be the row-major order of a grid, and it is not bad.In the fourth test case, there are $$$4$$$ ways $$$s$$$ can be the row-major order of a grid, and they are all not bad:ttotomtomatoomaatomtoatoIt can be proven that $$$4$$$ distinct characters is the minimum possible. Note that, for example, the string \"orange\" is not an acceptable output because it has $$$6 > 4$$$ distinct characters, and the string \"banana\" is not an acceptable output because it is the row-major order of the following bad grid:banana", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bae0b99e", "template_md5": "35d339e4", "result": "You are given a positive integer $n$.  \n\nYou need to find the shortest string of length $n$ that cannot be formed by concatenating the rows of a grid of characters where any two adjacent cells (sharing an edge) have different characters.\n\nOutput the string."}, {"prompt_md5": "07497b41", "template_md5": "465699a0", "result": "Given a number *n*, find the shortest string of lowercase letters that cannot be formed by combining the rows of a grid where any two adjacent cells have different letters."}]}