{"uid": "1845-E", "url": "https://codeforces.com/contest/1845/problem/E", "tags": ["dp", " implementation", " math"], "title": "1845-E", "statement": "E. Boxes and Ballstime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ boxes placed in a line. The boxes are numbered from $$$1$$$ to $$$n$$$. Some boxes contain one ball inside of them, the rest are empty. At least one box contains a ball and at least one box is empty.In one move, youhave tochoose a box with a ball inside and an adjacent empty box and move the ball from one box into another. Boxes $$$i$$$ and $$$i+1$$$ for all $$$i$$$ from $$$1$$$ to $$$n-1$$$ are considered adjacent to each other. Boxes $$$1$$$ and $$$n$$$ arenot adjacent.How many different arrangements of balls exist afterexactly$$$k$$$ moves are performed? Two arrangements are considered different if there is at least one such box that it contains a ball in one of them and doesn't contain a ball in the other one.Since the answer might be pretty large, print its remainder modulo $$$10^9+7$$$.InputThe first line contains two integers $$$n$$$ and $$$k$$$ ($$$2 \\\\le n \\\\le 1500$$$; $$$1 \\\\le k \\\\le 1500$$$) — the number of boxes and the number of moves.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$a_i \\\\in \\\\{0, 1\\\\}$$$) — $$$0$$$ denotes an empty box and $$$1$$$ denotes a box with a ball inside. There is at least one $$$0$$$ and at least one $$$1$$$.OutputPrint a single integer — the number of different arrangements of balls that can exist afterexactly$$$k$$$ moves are performed, modulo $$$10^9+7$$$.ExamplesInput4 1 1 0 1 0Output3Input4 2 1 0 1 0Output2Input10 6 1 0 0 1 0 0 0 1 1 1Output69NoteIn the first example, there are the following possible arrangements:0 1 1 0— obtained after moving the ball from box $$$1$$$ to box $$$2$$$;1 0 0 1— obtained after moving the ball from box $$$3$$$ to box $$$4$$$;1 1 0 0— obtained after moving the ball from box $$$3$$$ to box $$$2$$$.In the second example, there are the following possible arrangements:1 0 1 0— three ways to obtain that: just reverse the operation performed during the first move;0 1 0 1— obtained from either of the first two arrangements after the first move.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d08c0abb", "template_md5": "35d339e4", "result": "You have $n$ boxes arranged in a line. Some boxes contain a ball, and some are empty. You can move a ball from a box to an adjacent empty box in one move.  \n\nGiven $n$ and the number of moves $k$, find the number of different possible arrangements of balls after exactly $k$ moves.  Two arrangements are different if there is at least one box that contains a ball in one arrangement but not the other.\n\nThe answer may be large, so print it modulo $10^9 + 7$."}, {"prompt_md5": "9018f446", "template_md5": "465699a0", "result": "You have a line of boxes, some containing balls and some empty. You can move a ball from a box to its empty neighbor.  How many different arrangements of balls are possible after a specific number of moves?"}]}