{"uid": "1846-D", "url": "https://codeforces.com/contest/1846/problem/D", "tags": ["constructive algorithms", " geometry", " math"], "title": "1846-D", "statement": "D. Rudolph and Christmas Treetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRudolph drew a beautiful Christmas tree and decided to print the picture. However, the ink in the cartridge often runs out at the most inconvenient moment. Therefore, Rudolph wants to calculate in advance how much green ink he will need.The tree is a vertical trunk withidenticaltriangular branches at different heights. The thickness of the trunk is negligible.Each branch is an isosceles triangle with base $$$d$$$ and height $$$h$$$, whose base is perpendicular to the trunk. The triangles are arranged upward at an angle, and the trunk passes exactly in the middle. The base of the $$$i$$$-th triangle is located at a height of $$$y_i$$$.The figure below shows an example of a tree with $$$d = 4, h = 2$$$ and three branches with bases at heights $$$[1, 4, 5]$$$.Help Rudolph calculate the total area of the tree branches.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Then follow the descriptions of the test cases.The first line of each test case contains three integers $$$n, d, h$$$ ($$$1 \\\\le n, d, h \\\\le 2 \\\\cdot 10^5$$$) — the number of branches, the length of the base, and the height of the branches, respectively.The second line of each test case contains $$$n$$$ integers $$$y_i$$$ $$$(1 \\\\le y_i \\\\le 10^9, y_1 < y_2 < ... < y_n)$$$ — the heights of the bases of the branches.The sum of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, output a single real number on a separate line — the total area of the tree branches. The answer will be considered correct if its absolute or relative error does not exceed $$$10^{-6}$$$.ExampleInput53 4 21 4 51 5 134 6 61 2 3 42 1 2000001 2000002 4 39 11Output11 2.5 34.5 199999.9999975 11.333333", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3c168864", "template_md5": "35d339e4", "result": "You are given a Christmas tree made of identical triangular branches. Each branch has a base of length $d$ and height $h$. The branches are arranged upward at an angle, with the base of the $i$-th branch located at a height of $y_i$. \n\nCalculate the total area of all the branches.\n\n**Input:**\n\n* $t$: the number of test cases\n* For each test case:\n    * $n$: the number of branches\n    * $d$: the length of the base of each branch\n    * $h$: the height of each branch\n    * $y_i$: the height of the base of the $i$-th branch\n\n**Output:**\n\n* For each test case, output the total area of the tree branches."}, {"prompt_md5": "c41b998b", "template_md5": "465699a0", "result": "Calculate the total area of a Christmas tree made of a trunk and triangular branches. Each branch has a fixed base and height, and the branches are arranged at increasing heights."}]}