{"uid": "1846-A", "url": "https://codeforces.com/contest/1846/problem/A", "tags": ["implementation", " math"], "title": "1846-A", "statement": "A. Rudolph and Cut the Ropetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ nails driven into the wall, the $$$i$$$-th nail is driven $$$a_i$$$ meters above the ground, one end of the $$$b_i$$$ meters long rope is tied to it. All nails hang at different heights one above the other. One candy is tied to all ropes at once. Candy is tied to end of a rope that is not tied to a nail.To take the candy, you need to lower it to the ground. To do this, Rudolph can cut some ropes, one at a time. Help Rudolph find the minimum number of ropes that must be cut to get the candy.The figure shows an example of the first test:InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 50$$$) — the number of nails.The $$$i$$$-th of the next $$$n$$$ lines contains two integers $$$a_i$$$ and $$$b_i$$$ ($$$1 \\\\le a_i, b_i \\\\le 200$$$) — the height of the $$$i$$$-th nail and the length of the rope tied to it, all $$$a_i$$$ are different.It is guaranteed that the data is not contradictory, it is possible to build a configuration described in the statement.OutputFor each test case print one integer — the minimum number of ropes that need to be cut to make the candy fall to the ground.ExampleInput434 33 11 249 25 27 73 4511 75 1012 93 21 535 64 57 7Output2 2 3 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97d186e8", "template_md5": "35d339e4", "result": "You are given $n$ nails hammered into a wall at different heights. Each nail has a rope of length $b_i$ attached to it. One end of all the ropes is tied together, forming a single candy-holding point.  \n\nYour goal is to figure out the fewest ropes you need to cut so that the candy falls to the ground. \n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of nails, $n$.\n    * The next $n$ lines each contain two numbers: the height of a nail ($a_i$) and the length of the rope attached to it ($b_i$).\n\n**Output:**\n\nFor each test case, print the minimum number of ropes that need to be cut."}, {"prompt_md5": "d9a6cc2b", "template_md5": "465699a0", "result": "You have a number of ropes hanging from different heights. Each rope has a candy attached to its end. You need to figure out the fewest ropes you need to cut so that all the candies reach the ground."}]}