{"uid": "1848-F", "url": "https://codeforces.com/contest/1848/problem/F", "tags": ["binary search", " bitmasks", " combinatorics", " divide and conquer", " dp", " math"], "title": "1848-F", "statement": "F. Vika and Wikitime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently, Vika was studying her favorite internet resource - Wikipedia.On the expanses of Wikipedia, she read about an interesting mathematical operationbitwise XOR, denoted by $$$\\\\oplus$$$.Vika began to study the properties of this mysterious operation. To do this, she took an array $$$a$$$ consisting of $$$n$$$ non-negative integers and applied the following operation to all its elements at the same time: $$$a_i = a_i \\\\oplus a_{(i+1) \\\\bmod n}$$$. Here $$$x \\\\bmod y$$$ denotes the remainder of dividing $$$x$$$ by $$$y$$$. The elements of the array are numbered starting from $$$0$$$.Since it is not enough to perform the above actions once for a complete study, Vika repeats them until the array $$$a$$$ becomes all zeros.Determine how many of the above actions it will take to make all elements of the array $$$a$$$ zero. If this moment never comes, output $$$-1$$$.InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 2^{20}$$$) - the length of the array $$$a$$$.It is guaranteed that $$$n$$$ can be represented as $$$2^k$$$ for some integer $$$k$$$ ($$$0 \\\\le k \\\\le 20$$$).The second line contains $$$n$$$ integers $$$a_0, a_1, a_2, \\\\dots, a_{n-1}$$$ ($$$0 \\\\le a_i \\\\le 10^9$$$) - the elements of the array $$$a$$$.OutputOutput a single number - the minimum number of actions required to make all elements of the array $$$a$$$ zero, or $$$-1$$$ if the array $$$a$$$ will never become zero.ExamplesInput4 1 2 1 2Output2Input2 0 0Output0Input1 14Output1Input8 0 1 2 3 4 5 6 7Output5NoteIn the first example, after one operation, the array $$$a$$$ will become equal to $$$[3, 3, 3, 3]$$$. After one more operation, it will become equal to $$$[0, 0, 0, 0]$$$.In the second example, the array $$$a$$$ initially consists only of zeros.In the third example, after one operation, the array $$$a$$$ will become equal to $$$[0]$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "db2ae906", "template_md5": "35d339e4", "result": "You are given an array of $n$ non-negative integers.  You perform the following operation repeatedly on the array:\n\nFor each index $i$ from 0 to $n-1$, set $a_i$ to $a_i \\oplus a_{(i+1) \\mod n}$.\n\nHere, $\\oplus$ denotes the bitwise XOR operation, and $a_{(i+1) \\mod n}$ means the element at index $(i+1)$ modulo $n$.\n\nDetermine the minimum number of times you need to perform this operation until all elements in the array become zero. If this never happens, output -1."}, {"prompt_md5": "eb98e374", "template_md5": "465699a0", "result": "You are given a list of numbers.  Repeatedly apply the following operation to the list: for each number in the list, replace it with the result of combining it with the number after it (wrapping around to the beginning of the list if necessary).  Determine the fewest times this operation must be performed until all numbers in the list are zero. If this never happens, output -1."}]}