{"uid": "1850-C", "url": "https://codeforces.com/contest/1850/problem/C", "tags": ["implementation", " strings"], "title": "1850-C", "statement": "C. Word on the Papertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn an $$$8 \\\\times 8$$$ grid of dots, a word consisting of lowercase Latin letters is written vertically in one column, from top to bottom. What is it?InputThe input consists of multiple test cases. The first line of the input contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 1000$$$) — the number of test cases.Each test case consists of $$$8$$$ lines, each containing $$$8$$$ characters. Each character in the grid is either $$$\\\\texttt{.}$$$ (representing a dot) or a lowercase Latin letter ($$$\\\\texttt{a}$$$–$$$\\\\texttt{z}$$$).The word lies entirely in a single column and is continuous from the beginning to the ending (without gaps). See the sample input for better understanding.OutputFor each test case, output a single line containing the word made up of lowercase Latin letters ($$$\\\\texttt{a}$$$–$$$\\\\texttt{z}$$$) that is written vertically in one column from top to bottom.ExampleInput5...................................i.....................................l.......o.......s.......t....................................................................t.......h.......e................................................g.......a.......m.......ea.......a.......a.......a.......a.......a.......a.......a.......Outputi lost the game aaaaaaaa", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9584c054", "template_md5": "35d339e4", "result": "You are given an 8x8 grid of dots. Some of the dots contain lowercase letters (a-z).  The letters form a single word that goes straight up and down in one column.  \n\nYour task is to read the grid and determine the word. \n\nYou will be given multiple grids to solve."}, {"prompt_md5": "a113c38a", "template_md5": "465699a0", "result": "You are given an 8x8 grid of dots with some letters. Find the word that is written vertically in one of the columns."}]}