{"uid": "1854-B", "url": "https://codeforces.com/contest/1854/problem/B", "tags": ["bitmasks", " brute force", " dp"], "title": "1854-B", "statement": "B. Earn or Unlocktime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputAndrea is playing the gameTanto Cuore.He has a deck of $$$n$$$ cards with values $$$a_1, \\\\ldots, a_n$$$ from top to bottom. Each card can be either locked or unlocked. Initially, only the topmost card is unlocked.The game proceeds in turns. In each turn, Andrea chooses an unlocked card in the deck — the value written on the card is $$$v$$$ — and performs exactly one of the following two operations:Unlock the first $$$v$$$lockedcards in the deck from the top. If there are less than $$$v$$$ locked cards in the deck, then unlock all the locked cards.Earn $$$v$$$victory points.In both cases, after performing the operation, he removes the card from the deck.The game ends when all the cards remaining in the deck are locked, or there are no more cards in the deck.What is the maximum number of victory points Andrea can earn?InputThe first line contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 10^5$$$) — the number of cards in the deck.The second line contains $$$n$$$ integers $$$a_1, \\\\ldots, a_n$$$ ($$$0 \\\\leq a_1, \\\\ldots, a_n \\\\leq n$$$) — the values of the cards in the deck.OutputOutput a single integer — the maximum number of victory points Andrea can earn.ExamplesInput2 1 2Output2Input5 2 4 5 0 1Output9Input4 0 4 4 4Output0NoteIn the first sample test, the deck starts as [unlocked, locked]. Then, Andrea uses the first card to unlock the second card. Then he uses the second card to earn $$$2$$$ victory points.In the second sample test, Andrea can use the first card to unlock the second and the third card. Then he uses the second and the third card to earn $$$4+5=9$$$ victory points.In the third sample test, Andrea can't unlock any cards or gain any victory points with the first card.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8c6620c8", "template_md5": "35d339e4", "result": "You are given a deck of $n$ cards with values $a_1, a_2, ..., a_n$ from top to bottom. Initially, only the top card is unlocked.\n\nYou can play the following game:\n\n1. Choose an unlocked card. The value on the card is $v$.\n2. Unlock the first $v$ locked cards from the top of the deck. If there are fewer than $v$ locked cards, unlock all the locked cards.\n3. Earn $v$ victory points.\n4. Remove the chosen card from the deck.\n\nThe game ends when all cards are locked or there are no cards left in the deck.\n\nWhat is the maximum number of victory points you can earn?"}, {"prompt_md5": "507ddd13", "template_md5": "465699a0", "result": "You have a deck of cards with numbers on them.  The top card is always unlocked.  You can choose an unlocked card and either unlock the next few cards in the deck (up to the number on the card) or earn points equal to the number on the card.  You remove the card after using it.  What is the maximum number of points you can earn?"}]}