{"uid": "1856-B", "url": "https://codeforces.com/contest/1856/problem/B", "tags": ["implementation", " math"], "title": "1856-B", "statement": "B. Good Arraystime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array ofpositiveintegers $$$a$$$ of length $$$n$$$.Let's call an array ofpositiveintegers $$$b$$$ of length $$$n$$$goodif:$$$a_i \\\\neq b_i$$$ forall$$$i$$$ from $$$1$$$ to $$$n$$$,$$$a_1 + a_2 +\\\\ldots + a_n = b_1 + b_2 + \\\\ldots + b_n$$$.Does a good array exist?InputEach test contains multiple test cases. The first line of input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$) — the length of the array $$$a$$$.The second line of each test case contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10 ^ 9$$$) — the elements of the array $$$a$$$.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case, output \"YES\" (without quotes) if there exists a good array, and \"NO\" (without quotes) otherwise.You can output the answer in any case (upper or lower). For example, the strings \"yEs\",\"yes\", \"Yes\", and \"YES\" will be recognized as positive responses.ExampleInput636 1 221 143 1 2 411751 2 1 1 13618343152 819343431 1000000000OutputYES NO YES NO NO YESNoteIn the first test case, a possiblegoodarray is $$$[3, 3, 3]$$$. Some examples of notgoodarrays are:$$$[8, 0, 1]$$$ — the array does not consist of onlypositiveintegers,$$$[5, 2, 4]$$$ — the array does not have the same sum as the given array,$$$[5, 2, 2]$$$ — the third element is equal to the third element of the given array.In the second test case, $$$[1, 1]$$$ is the only array of positive integers of length $$$2$$$ that has the sum of it's elements equal to $$$2$$$. Since $$$[1, 1]$$$ is not agoodarray, the answer is \"NO\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "520ed652", "template_md5": "35d339e4", "result": "You are given an array of positive integers $a$ of length $n$.  \n\nFind out if there exists another array $b$ of the same length that meets these conditions:\n\n*  No element in $b$ is equal to the corresponding element in $a$.\n* The sum of all elements in $a$ is equal to the sum of all elements in $b$.\n\nIf such an array $b$ exists, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "144fc0c0", "template_md5": "465699a0", "result": "You are given a list of numbers.  Determine if there exists another list of the same length with different numbers in each position, but with the same sum."}]}