{"uid": "1860-E", "url": "https://codeforces.com/contest/1860/problem/E", "tags": ["data structures", " dfs and similar", " graphs", " shortest paths"], "title": "1860-E", "statement": "E. Fast Travel Text Editortime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$, consisting of lowercase Latin letters.There's a cursor, initially placed between two adjacent letters of the string. The cursor can't be placed before the first or after the last letter.In one move, you can perform one of three actions:move a cursor one position to the left (if that doesn't place it before the first letter);move a cursor one position to the right (if that doesn't place it after the last letter);let $$$x$$$ be the letter immediately to the left of the cursor, and $$$y$$$ be the letter immediately to the right of the cursor. Choose any pair ofadjacentletters in the string such that theleftof them is $$$x$$$ and therightof them is $$$y$$$, and move the cursor to the position between these two letters.You are asked $$$m$$$ queries. In each query, you are given two integers $$$f$$$ and $$$t$$$, which correspond to two valid positions of the cursor in the string. In response to the query, you have to calculate the minimum number of operations required to move the cursor from position $$$f$$$ to position $$$t$$$.InputThe first line contains a string $$$s$$$ ($$$2 \\\\le |s| \\\\le 5 \\\\cdot 10^4$$$), consisting of lowercase Latin letters.The second line contains a single integer $$$m$$$ ($$$1 \\\\le m \\\\le 5 \\\\cdot 10^4$$$) — the number of queries.The $$$i$$$-th of the next $$$m$$$ lines contains two integers $$$f$$$ and $$$t$$$ ($$$1 \\\\le f, t \\\\le |s| - 1$$$) — the initial and the target positions of the cursor in the $$$i$$$-th query. Position $$$x$$$ means that the cursor is between the $$$x$$$-th and the $$$(x+1)$$$-st letters of the string ($$$1$$$-indexed).OutputFor each query, print the minimum number of actions required to move the cursor from position $$$f$$$ to position $$$t$$$.ExamplesInputcodecode 3 1 7 3 5 3 6Output3 2 2Inputabcdefghij 3 1 9 9 1 5 5Output8 8 0Inputaaaaaaaaaaaa 4 10 8 3 7 6 1 11 11Output1 1 1 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "09ebc4cb", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters. There is a cursor initially placed between two letters in the string. \n\nYou can perform the following actions:\n\n1. Move the cursor one position to the left (if it's not already at the beginning).\n2. Move the cursor one position to the right (if it's not already at the end).\n3. Find any two adjacent letters in the string where the left letter is the current letter to the left of the cursor and the right letter is the current letter to the right of the cursor. Move the cursor to the position between these two letters.\n\nYou will be given multiple queries. Each query will give you two positions,  $f$ and $t$, representing where the cursor is initially and where you want to move it. For each query, find the minimum number of actions needed to move the cursor from position $f$ to position $t$."}, {"prompt_md5": "db914db0", "template_md5": "465699a0", "result": "You have a string of letters. You can move a cursor one position left or right within the string. You can also move the cursor to any position between two adjacent letters in the string. Given two positions in the string, find the fewest moves needed to move the cursor from one position to the other."}]}