{"uid": "1861-A", "url": "https://codeforces.com/contest/1861/problem/A", "tags": ["constructive algorithms", " math"], "title": "1861-A", "statement": "A. Prime Deletiontime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputAprimenumber is a positive integer that has exactly two different positive divisors: $$$1$$$ and the integer itself. For example, $$$2$$$, $$$3$$$, $$$13$$$ and $$$101$$$ are prime numbers; $$$1$$$, $$$4$$$, $$$6$$$ and $$$42$$$ are not.You are given a sequence of digits from $$$1$$$ to $$$9$$$, in whichevery digit from $$$1$$$ to $$$9$$$ appears exactly once.You are allowed to do the following operationseveral (maybe zero) times: choose any digit from the sequence and delete it.However, you cannot perform this operation if the sequence consists of only two digits.Your goal is to obtain a sequence which represents a prime number. Note that you cannot reorder the digits in the sequence.Print the resulting sequence, or report that it is impossible to perform the operations so that the resulting sequence is a prime number.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 5000$$$) — the number of test cases.Each test case consists of one line containing a string of $$$9$$$ digits (without any characters between them). Each digit from $$$1$$$ to $$$9$$$ appears in this string exactly once.OutputFor each test case, print the answer on a separate line as follows:if it is impossible to perform the described operations, print $$$-1$$$;otherwise, print any sequence that represents a prime number, which can be obtained from the given string performing several (maybe zero) operations described in the statement. If there are multiple such sequences, you can print any one of them.ExampleInput4123456789987654321243567918576318429Output167 53 3571 57638429", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f80e7f37", "template_md5": "35d339e4", "result": "You are given a sequence of the digits from 1 to 9, where each digit appears exactly once. You can repeatedly remove one digit from the sequence, but you cannot remove digits if there are only two digits left.  \n\nYour goal is to remove digits from the sequence to create a sequence that represents a prime number. A prime number is a whole number greater than 1 that has only two divisors: 1 and itself.\n\nFor each test case, print the resulting prime number sequence, or print -1 if it is impossible to create a prime number by removing digits."}, {"prompt_md5": "16f7a9f0", "template_md5": "465699a0", "result": "You are given a list of the digits 1 through 9, each appearing only once. You can remove one digit at a time from the list.  Your goal is to remove digits until the remaining digits form a prime number. If this is impossible, say so."}]}