{"uid": "1861-F", "url": "https://codeforces.com/contest/1861/problem/F", "tags": ["binary search", " bitmasks", " flows", " greedy"], "title": "1861-F", "statement": "F. Four Suitstime limit per test6 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputThe game of Berland poker is played as follows. There are $$$n+1$$$ people: $$$n$$$ players, numbered from $$$1$$$ to $$$n$$$, and the dealer. The dealer has a deck which contains cards of four different suits (the number of cards of each suitis not necessarily the same); the number of cards in the deck is divisible by $$$n$$$. The dealer gives all cards to the players, so thatevery player receives the same number of cards, and the whole deck is used.After the cards are dealt, every player chooses one of four suits (independently) and discards all cards from their hand which do not belong to their chosen suit. The winner of the game is the player with the maximum number of cards left in their hand. The number of points the winner receives is $$$x - y$$$, where $$$x$$$ is the number of cards in the winner's hand, and $$$y$$$ is the maximum number of cards among allotherplayers; everyone else receives $$$0$$$ points. Note that it means thatif there are multiple players with the maximum number of cards, everyone receives $$$0$$$ points.Since every player wants to maximize their odds to win,they will choose a suit with the maximum number of cards in their hand.Monocarp is the dealer. He has already given some cards to the players; the $$$i$$$-th player received $$$a_{i,j}$$$ cards of suit $$$j$$$. Note thatthe number of cards in players' hands don't have to be the same at this moment. Monocarp has $$$b_1, b_2, b_3, b_4$$$ cards of suit $$$1, 2, 3, 4$$$ respectively left in his deck. He has to give them to the players so that, after all cards are dealt, every player has the same number of cards.For each player, calculate the maximum number of points they can receive among all ways to deal the remaining cards according to the rules of the game.InputThe first line of the input contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 5 \\\\cdot 10^4$$$) — the number of players.Then $$$n$$$ lines follow. The $$$i$$$-th of them contains four integers $$$a_{i,1}, a_{i,2}, a_{i,3}, a_{i,4}$$$ ($$$0 \\\\le a_{i,j} \\\\le 10^6$$$), where $$$a_{i,j}$$$ is the number of cards of the $$$j$$$-th suit that the $$$i$$$-th player currently has.The last line contains $$$4$$$ integers $$$b_1, b_2, b_3, b_4$$$ ($$$0 \\\\le b_j \\\\le 10^6$$$), where $$$b_j$$$ is the number of cards of the $$$j$$$-th suit Monocarp has to deal yet.Additional constraint on the input: it is possible to deal all of the remaining cards so that every player has the same number of cards.OutputPrint $$$n$$$ integers. The $$$i$$$-th of them should be the maximum number of points the $$$i$$$-th player can get among all possible ways to deal the remaining cards.ExamplesInput2 3 1 1 1 1 1 1 1 2 2 0 0Output1 0Input4 0 0 0 0 0 0 0 1 2 2 0 0 0 1 0 0 3 2 3 2Output1 1 1 1Input7 2 1 0 1 0 0 2 1 4 4 1 2 0 0 1 0 1 1 0 1 0 2 1 1 0 2 0 0 15 10 10 14Output5 6 1 7 5 5 7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c7d307ae", "template_md5": "35d339e4", "result": "There are $n$ players and a dealer.  The dealer has a deck of cards with 4 suits. The deck has a total of $n \\cdot k$ cards, where $k$ is a positive integer.  \n\nThe dealer has already dealt some cards to the players. The $i$-th player currently has $a_{i,1}$ cards of suit 1, $a_{i,2}$ cards of suit 2, $a_{i,3}$ cards of suit 3, and $a_{i,4}$ cards of suit 4. The dealer has $b_1$ cards of suit 1, $b_2$ cards of suit 2, $b_3$ cards of suit 3, and $b_4$ cards of suit 4 left.\n\nThe dealer will deal the remaining cards to the players so that each player ends up with the same number of cards.\n\nEach player will choose one suit to keep and discard the rest. The player with the most cards of their chosen suit wins. If there are ties, no one wins. The winner gets $x-y$ points, where $x$ is the number of cards the winner has and $y$ is the number of cards the player with the second most cards has.\n\nFor each player, find the maximum number of points they can get."}, {"prompt_md5": "05e41572", "template_md5": "465699a0", "result": "You have a deck of cards divided into four suits.  You need to distribute the remaining cards to players so that each player has the same number of cards.  Each player chooses a suit and keeps only the cards of that suit. The player with the most cards of their chosen suit wins points.  Calculate the maximum points each player can get."}]}