{"uid": "1862-D", "url": "https://codeforces.com/contest/1862/problem/D", "tags": ["binary search", " combinatorics", " constructive algorithms", " math"], "title": "1862-D", "statement": "D. Ice Cream Ballstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputTema decided to improve his ice cream making skills. He has already learned how to make ice cream in a coneusing exactly twoballs.Before his ice cream obsession, Tema was interested in mathematics. Therefore, he is curious about theminimumnumber of balls he needs to have in order to makeexactly$$$n$$$differenttypes of ice cream.There are plenty possible ice cream flavours: $$$1, 2, 3, \\\\dots$$$. Tema can make two-balls ice cream with any flavours (probably the same).Two ice creams are considered different if their sets of ball flavours are different. For example, $$$\\\\{1, 2\\\\} = \\\\{2, 1\\\\}$$$, but $$$\\\\{1, 1\\\\} \\\\neq \\\\{1, 2\\\\}$$$.For example, having the following ice cream balls: $$$\\\\{1, 1, 2\\\\}$$$, Tema can make only two types of ice cream: $$$\\\\{1, 1\\\\}$$$ and $$$\\\\{1, 2\\\\}$$$.Note, that Tema do not need to make all the ice cream cones at the same time. This means that he making ice cream cones independently. Also in order to make a following cone $$$\\\\{x, x\\\\}$$$ for some $$$x$$$, Tema needs at least $$$2$$$ balls of type $$$x$$$.Help Tema answer this question. It can be shown that answer always exist.InputEach test consists of multiple test cases. The first line of input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Then follows the description of the test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^{18}$$$) — the number of ice cream types that Tema wants to make.OutputFor each test case, output a single integer — the minimum number of balls Tema needs to buy.ExampleInput51361791000000000000000000Output2 3 4 27 2648956421NoteIn the first sample, it is enough to have following balls types: $$$\\\\{1, 1\\\\}$$$.Note, that set $$$\\\\{1\\\\}$$$ if not enough since we need at least $$$2$$$ balls of a type $$$1$$$ in order to make such cone $$$\\\\{1, 1\\\\}$$$.In the second sample, it is not possible to make it with $$$2$$$ balls, but it can be done with these balls: $$$\\\\{1, 2, 3\\\\}$$$.In the third sample, $$$\\\\{1, 2, 3, 4\\\\}$$$ is optimal answer, so we can get following ice cream cones: $$$\\\\{1, 2\\\\}$$$, $$$\\\\{1, 3\\\\}$$$, $$$\\\\{1, 4\\\\}$$$, $$$\\\\{2, 3\\\\}$$$, $$$\\\\{2, 4\\\\}$$$, $$$\\\\{3, 4\\\\}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8b8635ec", "template_md5": "35d339e4", "result": "You are given an integer $n$.  You need to determine the minimum number of ice cream balls you need to buy to be able to make $n$ different types of ice cream.  Each ice cream is made with two balls, and two ice creams are different if they have different sets of ball flavors.  You can use the same flavor for both balls in an ice cream. \n\nFor example, if $n=3$, you could make the following ice creams:\n\n* {1, 2}\n* {1, 3}\n* {2, 3}\n\n\n\nYou need at least two balls of the same flavor to make an ice cream with that flavor."}, {"prompt_md5": "54788fa3", "template_md5": "465699a0", "result": "You need to find the minimum number of items you need to buy to be able to create  $n$ distinct combinations of two items each.  You can use the same item in a combination."}]}