{"uid": "1866-M", "url": "https://codeforces.com/contest/1866/problem/M", "tags": ["brute force", " combinatorics", " dp", " math", " probabilities"], "title": "1866-M", "statement": "M. Mighty Rock Towertime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputPak Chanek comes up with an idea in the midst of boredom to play a game. The game is a rock tower game. There is a big rock that is used as a base. There are also $$$N$$$ small identical rocks that Pak Chanek will use to build a rock tower with a height of $$$N$$$ above the base rock.Initially, there are no small rocks that are located above the base rock. In other words, the height of the tower above the base rock is initially $$$0$$$. In one move, Pak Chanek can place one small rock onto the top of the tower which makes the height of the tower above the base rock increase by $$$1$$$. Each time Pak Chanek place one small rock, the following will happen after the small rock is placed:Let's say $$$x$$$ is the height of the tower above the base rockright after the small rock is placed.There is a probability of $$$P_x$$$ percent that the topmost rock falls.If $$$x \\\\geq 2$$$ and the topmost rock falls, then there is another probability of $$$P_x$$$ percent that the $$$2$$$-nd topmost rock also falls.If $$$x \\\\geq 3$$$ and the $$$2$$$-nd topmost rock falls, then there is another probability of $$$P_x$$$ percent that the $$$3$$$-rd topmost rock also falls.If $$$x \\\\geq 4$$$ and the $$$3$$$-rd topmost rock falls, then there is another probability of $$$P_x$$$ percent that the $$$4$$$-th topmost rock also falls.And so on.If the tower successfully reaches a height of $$$N$$$ without any rocks falling after that, then the game is ended.If given an integer array $$$[P_1, P_2, \\\\ldots, P_N]$$$, what is the expected value of the number of moves that Pak Chanek needs to do to end the game? It can be proven that the expected value can be represented as an simple fraction $$$\\\\frac{P}{Q}$$$ where $$$Q$$$ is coprime to $$$998\\\\,244\\\\,353$$$. Output the value of $$$P \\\\times Q^{-1}$$$ modulo $$$998\\\\,244\\\\,353$$$.InputThe first line contains a single integer $$$N$$$ ($$$1 \\\\leq N \\\\leq 2\\\\cdot10^5$$$) — the required height of the rock tower.The second line contains $$$N$$$ integers $$$P_1, P_2, P_3, \\\\ldots, P_N$$$ ($$$0 \\\\leq P_i \\\\leq 99$$$).OutputAn integer representing the expected value of the number of moves that Pak Chanek needs to do to end the game, modulo $$$998\\\\,244\\\\,353$$$.ExamplesInput2 80 50Output499122186Input3 25 16 20Output879786027NoteIn the first example, the expected value of the number of moves that Pak Chanek needs to do to end the game is $$$\\\\frac{19}{2}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b4b8c9f5", "template_md5": "35d339e4", "result": "You are given an integer $N$ and an array of $N$ integers $P_1, P_2, ..., P_N$.  \n\nEach integer $P_i$ represents the probability (as a percentage) that the $i$th rock placed on a tower will fall.\n\nThe game is to build a tower of height $N$ by placing one rock at a time.  \n\n* If a rock is placed, there is a probability of $P_x$% that it will fall, where $x$ is the current height of the tower.\n* If a rock falls, there is a probability of $P_x$% that the second rock from the top will also fall, and so on.\n\nWhat is the expected number of moves (rocks placed) it takes to build a tower of height $N$ without any rocks falling after the final rock is placed?\n\nThe answer should be expressed as a fraction $P/Q$ where $Q$ is coprime to 998244353. Output the value of $P \\times Q^{-1}$ modulo 998244353."}, {"prompt_md5": "4deec5ba", "template_md5": "465699a0", "result": "You need to build a tower of a given height. Each time you add a block, there's a chance it will fall, and if it does, there's a chance the block below it will also fall, and so on.  What is the average number of blocks you need to add to successfully build the tower?"}]}