{"uid": "187-D", "url": "https://codeforces.com/contest/187/problem/D", "tags": ["data structures"], "title": "187-D", "statement": "D. BRT Contracttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn the last war of PMP, he defeated all his opponents and advanced to the final round. But after the end of semi-final round evil attacked him from behind and killed him! God bless him.Before his death, PMP signed a contract with the bus rapid transit (BRT) that improves public transportations by optimizing time of travel estimation. You should help PMP finish his last contract.Each BRT line is straight line that passesnintersecting on its ways. At each intersection there is traffic light that periodically cycles between green and red. It starts illuminating green at time zero. During the green phase which lasts forgseconds, traffic is allowed to proceed. After the green phase the light changes to red and remains in this color forrseconds. During the red phase traffic is prohibited from proceeding. If a vehicle reaches the intersection exactly at a time when the light changes to red, it should stop, but the vehicle is clear to proceed if the light has just changed to green.All traffic lights have the same timing and are synchronized. In other words the period of red (and green) phase is the same for all of traffic lights and they all start illuminating green at time zero.The BRT Company has calculated the time that a bus requires to pass each road segment. A road segment is the distance between two consecutive traffic lights or between a traffic light and source (or destination) station. More precisely BRT specialists providen+ 1positive integersli, the time in seconds that a bus needs to traversei-th road segment in the path from source to destination. Thel1value denotes the time that a bus needs to pass the distance between source and the first intersection. Theln+ 1value denotes the time between the last intersection and destination.In one dayqbuses leave the source station. Thei-th bus starts from source at timeti(in seconds). Decision makers of BRT Company want to know what time a bus gets to destination?The bus is considered as point. A bus will always move if it can. The buses do not interfere with each other.InputThe first line of input contains three space-separated positive integersn,g,r(1 ≤n≤ 105, 2 ≤g+r≤ 109) — the number of intersections, duration of green phase and duration of red phase. Next line containsn+ 1integersli(1 ≤li≤ 109) — the time to pass thei-th road segment in the path from source to destination.Next line contains a single integerq(1 ≤q≤ 105) — the number of buses in a day. Thei-th of nextqlines contains a single integerti(1 ≤ti≤ 109) — the time wheni-th bus leaves the source station.OutputIn thei-th line of output you should print a single integer — the time thati-th bus gets to destination.Please do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to usecin,coutstreams or the%I64dspecifier.ExamplesInput1 3 25 2512345Output89121212Input5 3 710 1 1 8 900000005 100000000031101000000000Output190000004019000000402900000030NoteIn the first sample, buses #1, #2 and #5 will reach the destination without waiting behind the red light. But buses #3 and #4 should wait.In the second sample, first bus should wait at third, fourth and fifth intersections. Second and third buses should wait only at the fifth intersection.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8846564b", "template_md5": "465699a0", "result": "There are multiple roads with traffic lights. Each light has a green phase and a red phase.  A bus travels along these roads, taking a certain amount of time to pass each segment.  Given the bus's starting time and the timing of the traffic lights, determine the time it takes for each bus to reach its destination."}, {"prompt_md5": "bac1e66c", "template_md5": "35d339e4", "result": "There are $n$ intersections along a straight road. Each intersection has a traffic light that cycles between green and red. The green phase lasts for $g$ seconds, and the red phase lasts for $r$ seconds. All traffic lights are synchronized and start green at time 0.\n\nYou are given the time it takes a bus to travel each segment between intersections, including the segment from the starting point to the first intersection and the segment from the last intersection to the destination. There are $q$ buses that depart from the starting point at different times $t_i$.\n\nFor each bus, determine the time it takes to reach the destination. \n\n**Input:**\n\n* $n$, $g$, $r$ (number of intersections, green phase duration, red phase duration)\n* $n+1$ integers $l_i$ (time to travel each segment)\n* $q$ (number of buses)\n* $q$ integers $t_i$ (departure time of each bus)\n\n**Output:**\n\n* $q$ integers (arrival time of each bus)"}]}