{"uid": "1874-D", "url": "https://codeforces.com/contest/1874/problem/D", "tags": ["divide and conquer", " dp", " math", " probabilities"], "title": "1874-D", "statement": "D. Jellyfish and Mikutime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere are $$$n + 1$$$ cities with numbers from $$$0$$$ to $$$n$$$, connected by $$$n$$$ roads. The $$$i$$$-th $$$(1 \\\\leq i \\\\leq n)$$$ road connects city $$$i-1$$$ and city $$$i$$$ bi-directionally. After Jellyfish flew back to city $$$0$$$, she found out that she had left her Miku fufu in city $$$n$$$.Each road has apositive integerlevel ofbeauty. Denote the beauty of the $$$i$$$-th road as $$$a_i$$$.Jellyfish is trying to find her fufu. Because of her poor sense of direction, she doesn't know which way to go. Every day, she randomly chooses a road connected to the city she currently is in and traverses it. Let $$$s$$$ be the sum of the beauty of the roads connected to the current city. For each road connected to the current city, Jellyfish will traverse the road with a probability of $$$\\\\frac x s$$$, where $$$x$$$ is the beauty of the road, reaching the city on the other side of the road.Jellyfish will start at city $$$0$$$, and she will get only her fufu back when she reaches city $$$n$$$.You want to choose the beauty of the roads such that the expected number of days Jellyfish takes to find her fufu will be the minimum possible. However, due to limited funding, the sum of beauties of all roads must be less than or equal to $$$m$$$.Find the minimum expected number of days Jellyfish needs to get her fufu back if the beauty of the roads is chosen optimally.InputThe first and only line of the input contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n \\\\leq m \\\\leq 3000$$$) — the number of the roads and the maximum sum of beauty of the roads.OutputOutput the minimum expected number of days Jellyfish needs to get her fufu back if the beauty of the roads is chosen optimally.Your answer will be accepted if the absolute or relative error does not exceed $$$10^{-9}$$$. Formally, let your answer be $$$a$$$, and the jury's answer be $$$b$$$. Your answer is considered correct if $$$\\\\frac{|a-b|}{\\\\max(1,|b|)} \\\\leq 10^{-9}$$$.ExamplesInput3 8Output5.200000000000Input10 98Output37.721155173329NoteIn the first example, the optimal assignment of beauty is $$$a=[1, 2, 5]$$$. The expected number of days Jellyfish needs to get her fufu back is $$$5.2$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "374c3447", "template_md5": "35d339e4", "result": "There are $n+1$ cities numbered from 0 to $n$.  There are $n$ roads, one connecting each pair of consecutive cities. Each road has a positive integer beauty value.\n\nYou need to assign beauty values to the roads so that the expected number of days it takes to travel from city 0 to city $n$ is minimized.  \n\nHere's how the travel works:\n\n*  Starting at city 0, the traveler randomly chooses a road connected to their current city.\n*  The probability of choosing a road is proportional to its beauty value.  For example, if the total beauty of roads connected to the current city is $s$, the probability of choosing a road with beauty $x$ is $\\frac{x}{s}$.\n\nThe total beauty of all roads must be less than or equal to $m$.\n\nFind the minimum expected number of days to reach city $n$."}, {"prompt_md5": "b33a2974", "template_md5": "465699a0", "result": "You have a line of cities connected by roads. Each road has a cost. You start at one end of the line and need to reach the other end. You randomly choose a road connected to your current city to travel, with the probability of choosing a road being proportional to its cost.  What is the minimum total cost of all the roads needed to minimize the expected number of days it takes to reach the other end?"}]}