{"uid": "1879-B", "url": "https://codeforces.com/contest/1879/problem/B", "tags": ["constructive algorithms", " greedy"], "title": "1879-B", "statement": "B. Chips on the Boardtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a board of size $$$n \\\\times n$$$ ($$$n$$$ rows and $$$n$$$ colums) and two arrays of positive integers $$$a$$$ and $$$b$$$ of size $$$n$$$.Your task is to place the chips on this board so that the following condition is satisfied for every cell $$$(i, j)$$$:there exists at least one chip in the same column or in the same row as the cell $$$(i, j)$$$. I. e. there exists a cell $$$(x, y)$$$ such that there is a chip in that cell, and either $$$x = i$$$ or $$$y = j$$$ (or both).The cost of putting a chip in the cell $$$(i, j)$$$ is equal to $$$a_i + b_j$$$.For example, for $$$n=3$$$, $$$a=[1, 4, 1]$$$ and $$$b=[3, 2, 2]$$$. One of the possible chip placements is as follows:White squares are emptyThe total cost of that placement is $$$(1+3) + (1+2) + (1+2) = 10$$$.Calculate the minimum possible total cost of putting chips according to the rules above.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 3 \\\\cdot 10^5$$$).The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$).The third line contains $$$n$$$ integers $$$b_1, b_2, \\\\dots, b_n$$$ ($$$1 \\\\le b_i \\\\le 10^9$$$).The sum of $$$n$$$ over all test cases doesn't exceed $$$3 \\\\cdot 10^5$$$.OutputFor each test case, print a single integer — the minimum possible total cost of putting chips according to the rules.ExampleInput431 4 13 2 214524 52 355 2 4 5 33 4 2 1 5Output10 9 13 24NoteThe first test case of the example is described in the statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9b85cb2d", "template_md5": "465699a0", "result": "You have a square grid of a given size. You need to place objects on the grid so that every cell has at least one object either in the same row or the same column. The cost of placing an object in a cell is the sum of two given numbers associated with that cell's row and column. Find the minimum total cost to place the objects."}, {"prompt_md5": "1cd02f0d", "template_md5": "35d339e4", "result": "You are given a square board of size $n \\times n$. There are two arrays, $a$ and $b$, both of size $n$. \n\nYou need to place chips on the board so that every cell $(i, j)$ has at least one chip either in the same row or the same column.  \n\nThe cost of placing a chip in cell $(i, j)$ is $a_i + b_j$.\n\nFind the minimum total cost to place the chips according to these rules.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the size of the board, $n$.\n    * The second line contains the elements of array $a$.\n    * The third line contains the elements of array $b$.\n\n**Output:**\n\nFor each test case, print the minimum total cost."}]}