{"uid": "188-H", "url": "https://codeforces.com/contest/188/problem/H", "tags": ["*special", " expression parsing", " implementation"], "title": "188-H", "statement": "H. Stacktime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn this problem we'll use a stack which supports two types of operations:Push a given number on the stack.Pop two numbers from the stack, perform a given operation (addition or multiplication) on them and push the result on the stack.You are given a string which describes the sequence of operations to be performed on the stack.i-th character corresponds toi-th operation:Ifi-th character is a digit, push the corresponding number on the stack.Ifi-th character is «+» or «*», perform the corresponding operation.Initially the stack is empty. Output the topmost number on the stack after executing all given operations.InputThe only line of input contains a string of operations, consisting of characters «+», «*» and digits (0..9). The length of the string will be between 1 and 20 characters, inclusive.The given sequence of operations is guaranteed to be correct, i.e. the stack will have at least two elements before every math operation. The numbers on the stack will never exceed106.OutputOutput a single number — the topmost element of the stack after performing all given operations.ExamplesInput12+3*66*+Output45Input149Output9NoteIn the first case the stack will end up containing a single number — the result of calculating (1+2)*3+6*6.In the second case there are no math operations, so the answer will be the last number pushed on the stack.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ca25d393", "template_md5": "35d339e4", "result": "You are given a string of operations. Each operation can be one of the following:\n\n* A digit (0-9): Push that digit onto a stack.\n* '+': Pop the top two numbers from the stack, add them together, and push the result back onto the stack.\n* '*': Pop the top two numbers from the stack, multiply them together, and push the result back onto the stack.\n\nThe stack starts empty.  After performing all the operations in the string, what is the number at the top of the stack?"}, {"prompt_md5": "44e68d99", "template_md5": "465699a0", "result": "You are given a sequence of numbers and operations (+ or *).  \n\nYou must simulate a stack data structure.  \n\nPush each number onto the stack. When you encounter an operation, pop the top two numbers from the stack, perform the operation, and push the result back onto the stack.\n\nAfter processing all the operations, output the single number remaining on top of the stack."}]}