{"uid": "1881-B", "url": "https://codeforces.com/contest/1881/problem/B", "tags": ["math"], "title": "1881-B", "statement": "B. Three Threadletstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOnce upon a time, bartender Decim found three threadlets and a pair of scissors.In one operation, Decim chooses any threadlet and cuts it into two threadlets, whose lengths arepositive integersand their sum isequalto the length of the threadlet being cut.For example, he can cut a threadlet of length $$$5$$$ into threadlets of lengths $$$2$$$ and $$$3$$$, but he cannot cut it into threadlets of lengths $$$2.5$$$ and $$$2.5$$$, or lengths $$$0$$$ and $$$5$$$, or lengths $$$3$$$ and $$$4$$$.Decim can performat mostthree operations. He is allowed to cut the threadlets obtained from previous cuts. Will he be able to make all the threadlets of equal length?InputThe first line contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Then follows the description of each test case.In a single line of each test case, there are three integers $$$a$$$, $$$b$$$, $$$c$$$ ($$$1 \\\\le a, b, c \\\\le 10^9$$$) — the lengths of the threadlets.OutputFor each test case, output \"YES\" if it is possible to make all the threadlets of equal length by performing at most three operations, otherwise output \"NO\".You can output \"YES\" and \"NO\" in any case (for example, the strings \"yEs\", \"yes\", \"Yes\", and \"YES\" will be recognized as a positive answer).ExampleInput151 3 25 5 56 36 127 8 76 3 34 4 1212 6 81000000000 1000000000 10000000003 7 19 9 19 3 62 8 25 3 108 4 82 8 4OutputYES YES NO NO YES YES NO YES NO NO YES YES NO YES NONoteLet's consider some testcases of the first test.In the first testcase, you can apply following operations:$$$1, 3, 2 \\\\to 1, 2, 1, 2 \\\\to 1, 1, 1, 1, 2 \\\\to 1, 1, 1, 1, 1, 1$$$.In the second testcase, you can do nothing, the threadlets are already of equal length.In the third testcase, it isn't possible to make threadlets of equal length.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "30c9b9d5", "template_md5": "35d339e4", "result": "You are given three positive integers, $a$, $b$, and $c$.  You can perform the following operation at most three times:\n\n* Choose one of the integers and cut it into two positive integers whose sum is equal to the original integer.\n\nDetermine if it is possible to make all three integers equal by performing these operations."}, {"prompt_md5": "88889a9b", "template_md5": "465699a0", "result": "You are given three numbers representing the lengths of three pieces of string. You can cut any piece into two smaller pieces that add up to the original length. Can you cut the strings so that all three pieces have the same length, using at most three cuts?"}]}