{"uid": "1883-A", "url": "https://codeforces.com/contest/1883/problem/A", "tags": ["math"], "title": "1883-A", "statement": "A. Morningtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a four-digit pin code consisting of digits from $$$0$$$ to $$$9$$$ that needs to be entered. Initially, the cursor points to the digit $$$1$$$. In one second, you can perform exactly one of the following two actions:Press the cursor to display the current digit,Move the cursor to any adjacent digit.The image above shows the device you are using to enter the pin code. For example, for the digit $$$5$$$, the adjacent digits are $$$4$$$ and $$$6$$$, and for the digit $$$0$$$, there is only one adjacent digit, $$$9$$$.Determine the minimum number of seconds required to enter the given four-digit pin code.InputEach test consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) - the number of the test cases. This is followed by their description.The single line of each test case describes the pin code as a string of length $$$4$$$, consisting of digits from $$$0$$$ to $$$9$$$.OutputFor each test case, output the minimum number of seconds required to enter the given pin code.ExampleInput101111123610101920927300007492854302948361Output4 9 31 27 28 13 25 16 33 24NoteIn the first test case, the cursor needs to be pressed $$$4$$$ times.In the second test case, it can be done in $$$9$$$ seconds as follows:Press the cursor.Move the cursor to the digit $$$2$$$.Press the cursor.Move the cursor to the digit $$$3$$$.Press the cursor.Move the cursor to the digit $$$4$$$.Move the cursor to the digit $$$5$$$.Move the cursor to the digit $$$6$$$.Press the cursor.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8c9fe348", "template_md5": "35d339e4", "result": "You are given a 4-digit PIN code. You can only move the cursor one position to the left or right each second.  You must press the cursor to enter each digit. What is the minimum number of seconds it takes to enter the PIN code?\n\nInput:\n\n* Each line contains a 4-digit PIN code.\n\nOutput:\n\n* For each PIN code, output the minimum number of seconds to enter it."}, {"prompt_md5": "4d935ff8", "template_md5": "465699a0", "result": "You have a 4-digit code to enter. You can either press the current digit or move the cursor to an adjacent digit each second. What is the minimum time to enter the code?"}]}