{"uid": "1886-F", "url": "https://codeforces.com/contest/1886/problem/F", "tags": ["data structures", " greedy"], "title": "1886-F", "statement": "F. Diamond Thefttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMonocarp is the most famous thief in Berland. This time, he decided to steal two diamonds. Unfortunately for Monocarp, there are $$$n$$$ cameras monitoring the diamonds. Each camera has two parameters, $$$t_i$$$ and $$$s_i$$$. The first parameter determines whether the camera is monitoring the first diamond only ($$$t_i=1$$$), the second diamond only ($$$t_i=2$$$), or both diamonds ($$$t_i=3$$$). The second parameter determines the number of seconds the camera will be disabled after it is hacked.Every second, Monocarp can perform one of the following three actions:do nothing;choose a camera and hack it; if Monocarp hacks the $$$i$$$-th camera, it will be disabled for the next $$$s_i$$$ seconds (if the current second is the $$$T$$$-th one, the camera will be disabled from the $$$(T+1)$$$-th to the $$$(T+s_i)$$$-th second, inclusive);steal a diamond if all cameras monitoring it are currently disabled. Monocarp cannot steal the second diamond if he hasn't stolen the first diamond yet.Note that Monocarp can hack a camera multiple times, even if it is currently disabled.Your task is to determine the minimum time it will take Monocarp to steal both diamonds,beginning with the first diamond, or report that it is impossible.InputThe first line contains a single integer $$$n$$$ ($$$0 \\\\le n \\\\le 1500$$$) — the number of cameras.Then $$$n$$$ lines follow, the $$$i$$$-th of them contains two integers $$$t_i$$$ and $$$s_i$$$ ($$$1 \\\\le t_i \\\\le 3$$$; $$$1 \\\\le s_i \\\\le 2n$$$) — the parameters of the $$$i$$$-th camera.OutputPrint a single integer — the minimum time it will take for Monocarp to stealthe first diamond first and then the second diamond. If it is impossible, print-1.ExamplesInput4 2 6 1 2 1 2 2 1Output6Input4 2 8 3 2 3 2 3 5Output9Input2 3 2 2 3Output4Input1 3 1Output4Input8 2 1 2 2 3 5 3 6 1 2 1 3 1 4 1 5Output11", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "61d9ba33", "template_md5": "35d339e4", "result": "There are $n$ cameras monitoring two diamonds. Each camera has two parameters:\n\n* $t_i$:  Indicates which diamond the camera monitors (1 for the first diamond, 2 for the second diamond, 3 for both).\n* $s_i$:  Indicates the number of seconds the camera will be disabled after being hacked.\n\nYou can perform the following actions each second:\n\n* Do nothing.\n* Hack a camera, disabling it for $s_i$ seconds.\n* Steal a diamond if all cameras monitoring it are disabled. You must steal the first diamond before the second.\n\nDetermine the minimum time it takes to steal both diamonds, or report if it's impossible."}, {"prompt_md5": "3ed87c47", "template_md5": "465699a0", "result": "You have a number of security cameras, each with a type and a duration.  The type determines which of two objects the camera monitors. The duration is how long the camera is disabled after being hacked. You can hack cameras repeatedly. Your goal is to steal both objects in the minimum amount of time, starting with the first object.  If it's impossible to steal both objects, say so."}]}