{"uid": "1886-E", "url": "https://codeforces.com/contest/1886/problem/E", "tags": ["bitmasks", " constructive algorithms", " dp", " greedy", " math", " sortings", " two pointers"], "title": "1886-E", "statement": "E. I Wanna be the Team Leadertime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputMonocarp is a team leader in a massive IT company.There are $$$m$$$ projects his team of programmers has to complete, numbered from $$$1$$$ to $$$m$$$. The $$$i$$$-th project has a difficulty level $$$b_i$$$.There are $$$n$$$ programmers in the team, numbered from $$$1$$$ to $$$n$$$. The $$$j$$$-th programmer has a stress tolerance level $$$a_j$$$.Monocarp wants to assign the programmers to the projects in such a way that:each programmer is assigned to no more than one project;each project has at least one programmer assigned to it;let $$$k$$$ programmers be assigned to the $$$i$$$-th project; then all the assigned programmers have to have a stress tolerance level greater than or equal to $$$\\\\frac{b_i}{k}$$$.Help Monocarp to find a valid assignment. If there are multiple answers, print any of them.InputThe first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$; $$$1 \\\\le m \\\\le 20$$$) — the number of programmers and the number of projects.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — the stress tolerance level of each programmer.The third line contains $$$m$$$ integers $$$b_1, b_2, \\\\dots, b_m$$$ ($$$1 \\\\le b_i \\\\le 10^9$$$) — the difficulty level of each project.OutputIf there is no valid assignment, print \"NO\".Otherwise, in the first line, print \"YES\". In the $$$i$$$-th of the next $$$m$$$ lines, print the list of the programmers assigned to the $$$i$$$-th project: first, the number of programmers, then their indices in an arbitrary order.If there are multiple answers, print any of them.ExamplesInput5 3 4 6 100 5 1 50 1 12OutputYES 1 3 1 5 3 2 4 1Input5 3 3 6 100 5 1 50 1 12OutputNOInput5 3 2 2 2 2 4 3 5 1OutputYES 1 5 3 1 2 3 1 4Input5 1 10 20 30 40 50 4OutputYES 1 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "395a76b6", "template_md5": "35d339e4", "result": "There are $n$ programmers and $m$ projects. Each programmer has a stress tolerance level $a_j$ and each project has a difficulty level $b_i$. \n\nYou need to assign each programmer to at most one project, and each project must have at least one programmer.  \n\nThe stress tolerance of the programmers assigned to a project must be greater than or equal to the project's difficulty level divided by the number of programmers assigned to it.\n\nFind a valid assignment of programmers to projects. If no such assignment exists, output \"NO\". Otherwise, output \"YES\" and for each project, output the number of programmers assigned to it followed by their indices."}, {"prompt_md5": "dc4f02a3", "template_md5": "465699a0", "result": "You have a set of tasks and a set of workers. Each task has a difficulty level, and each worker has a stress tolerance level.  You need to assign workers to tasks so that:\n\n* Each worker is assigned to at most one task.\n* Each task has at least one worker assigned to it.\n* For each task, the stress tolerance of all assigned workers is greater than or equal to the task's difficulty level divided by the number of workers assigned to it.\n\nFind a valid assignment of workers to tasks. If no such assignment exists, say so."}]}