{"uid": "1887-E", "url": "https://codeforces.com/contest/1887/problem/E", "tags": ["binary search", " constructive algorithms", " graphs", " interactive"], "title": "1887-E", "statement": "E. Good Coloringstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice suggested Bob to play a game. Bob didn't like this idea, but he couldn't refuse Alice, so he asked you to write a program that would play instead of him.The game starts with Alice taking out a grid sheet of size $$$n \\\\times n$$$, the cells of which areinitially not colored. After that she colors some $$$2n$$$ cells with colors $$$1,2,\\\\ldots, 2n$$$, respectively, and informs Bob about these cells.In one move, Bob can point to a cell that has not been colored yet and ask Alice to color that cell. Alice colors that cell with one of the $$$2n$$$ colors of her choice, informing Bob of the chosen color. Bob can make no more than $$$10$$$ moves, after which he needs to find agoodset of four cells.A set of four cells is considered good if the following conditions are met:All the cells in the set are colored;No two cells in the set are colored with the same color;The centers of the cells form a rectangle with sides parallel to the grid lines.InputEach test consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 200$$$) — the number of test cases. The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$3 \\\\le n \\\\le 1000$$$) — the size of the grid.The $$$i$$$-th of the following $$$2n$$$ lines contains two integers $$$x_i$$$ and $$$y_i$$$ ($$$1 \\\\le x_i, y_i \\\\le n$$$) — the coordinates of the cell colored with the $$$i$$$-th color.It is guaranteed that all coordinates $$$(x_i, y_i)$$$ are pairwise distinct for the same test case.After reading the input data for each test case, continue the interaction as described below.InteractionYou can make no more than $$$10$$$ moves. To make a move, output \"?$$$x$$$ $$$y$$$\" ($$$1 \\\\leq x,y \\\\leq n$$$). In response to this, the jury's program will output a single integer from $$$1$$$ to $$$2n$$$ — the color of cell $$$(x,y)$$$.After all moves (it is not necessary to make all $$$10$$$ moves and it is not necessary to make at least one move), output a string in the format \"!$$$x_1$$$ $$$x_2$$$ $$$y_1$$$ $$$y_2$$$\" ($$$1 \\\\leq x_1, x_2, y_1, y_2 \\\\leq n, x_1 \\\\ne x_2, y_1 \\\\ne y_2$$$). If cells $$$(x_1, y_1)$$$, $$$(x_1, y_2)$$$, $$$(x_2, y_1)$$$, $$$(x_2, y_2)$$$ are colored with different colors, the jury's program will output \"OK\". After that, proceed to the next test case or terminate the program if there are no more test cases left.Otherwise, if any of the specified cells are colored with the same color or one of the cells is not colored yet, the jury's program will output \"ERROR\". In this case, your program should immediately terminate its execution to receive theWrong Answerverdict. Otherwise, you may receive an arbitrary verdict.After each move or answer, do not forget to output the end of line and flush the output. Otherwise, you will get theIdleness limit exceededverdict.To do this, use:fflush(stdout)orcout.flush()in C++;System.out.flush()in Java;flush(output)in Pascal;stdout.flush()in Python;see documentation for other languages.Note that the interactor isadaptive, meaning that the color Alice will use to color the cells during Bob's moves is not fixed in advance.HacksYou cannot use hacks in this problem.ExampleInput2 3 1 2 1 3 2 1 2 3 3 1 3 2  1  OK 3 1 1 1 2 1 3 2 1 2 2 2 3  OKOutput? 1 1  ! 1 2 1 3         ! 1 2 1 2NoteIn the first test case:In the second test case, cells with coordinates $$$(1, 1), (1, 2), (2, 1), (2, 2)$$$ are initially colored by Alice in different colors.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "45d4d494", "template_md5": "465699a0", "result": "You are given a grid of a certain size. Some cells are initially colored. You can ask to color any uncolored cell. You have 10 moves to do this. After that, you need to choose four colored cells that form a rectangle. If the rectangle condition is met and all cells have different colors, you win. Otherwise, you lose."}, {"prompt_md5": "5b57a195", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times n$.  \n\n*  Initially, the grid is empty.\n*  An opponent colors $2n$ cells with colors 1 through $2n$. They tell you which cells they colored.\n*  You can ask the opponent to color an empty cell with one of the $2n$ colors. You can do this up to 10 times.\n*  After asking questions, you need to choose four cells that:\n    * Are all colored.\n    * Have different colors.\n    * Form a rectangle with sides parallel to the grid lines.\n\nIf you choose a valid set of four cells, you win. Otherwise, you lose.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the grid size, $n$.\n    * The next $2n$ lines each contain two integers, $x$ and $y$, representing the coordinates of a colored cell.\n\n**Output:**\n\n* For each test case:\n    * To ask the opponent to color a cell, output \"? $x$ $y$\".\n    * To submit your choice of four cells, output \"! $x_1$ $x_2$ $y_1$ $y_2$\".\n\n\n\nLet me know if you'd like help with a specific part of the problem or have any other questions."}]}