{"uid": "189-B", "url": "https://codeforces.com/contest/189/problem/B", "tags": ["brute force", " math"], "title": "189-B", "statement": "B. Counting Rhombitime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou have two positive integerswandh. Your task is to count the number of rhombi which have the following properties:Have positive area.With vertices at integer points.All vertices of the rhombi are located inside or on the border of the rectangle with vertices at points(0, 0),(w, 0),(w,h),(0,h). In other words, for all vertices(xi,yi)of the rhombus the following conditions should fulfill:0 ≤xi≤wand0 ≤yi≤h.Its diagonals are parallel to the axis.Count the number of such rhombi.Let us remind you that arhombusis a quadrilateral whose four sides all have the same length.InputThe first line contains two integerswandh(1 ≤w,h≤ 4000)— the rectangle's sizes.OutputPrint a single number — the number of sought rhombi.Please do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to usecin,coutstreams or the%I64dspecifier.ExamplesInput2 2Output1Input1 2Output0NoteIn the first example there exists only one such rhombus. Its vertices are located at points(1, 0),(2, 1),(1, 2),(0, 1).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8042cf1c", "template_md5": "35d339e4", "result": "You are given two positive integers, $w$ and $h$.  You need to count the number of rhombi that meet the following conditions:\n\n* The rhombus has a positive area.\n* All four vertices of the rhombus are at integer coordinates.\n* All vertices of the rhombus lie inside or on the border of a rectangle with vertices at $(0,0)$, $(w,0)$, $(w,h)$, and $(0,h)$.\n\nIn other words, for each vertex $(x_i, y_i)$ of the rhombus, the following must be true:\n\n* $0 \\le x_i \\le w$\n* $0 \\le y_i \\le h$\n\nThe diagonals of the rhombus must be parallel to the x and y axes. \n\nOutput the total number of such rhombi."}, {"prompt_md5": "468292ff", "template_md5": "465699a0", "result": "You are given the dimensions of a rectangle. Count the number of rhombi that fit inside the rectangle, with all corners at whole number points and diagonals aligned with the rectangle's sides."}]}