{"uid": "1895-B", "url": "https://codeforces.com/contest/1895/problem/B", "tags": ["greedy", " math", " sortings"], "title": "1895-B", "statement": "B. Points and Minimum Distancetime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given a sequence of integers $$$a$$$ of length $$$2n$$$. You have to split these $$$2n$$$ integers into $$$n$$$ pairs; each pair will represent the coordinates of a point on a plane. Each number from the sequence $$$a$$$ should become the $$$x$$$ or $$$y$$$ coordinate of exactly one point. Note that some points can be equal.After the points are formed, you have to choose a path $$$s$$$ that starts from one of these points, ends at one of these points, and visits all $$$n$$$ points at least once.The length of path $$$s$$$ is the sum of distances between all adjacent points on the path. In this problem, the distance between two points $$$(x_1, y_1)$$$ and $$$(x_2, y_2)$$$ is defined as $$$|x_1-x_2| + |y_1-y_2|$$$.Your task is to form $$$n$$$ points and choose a path $$$s$$$ in such a way that the length of path $$$s$$$ is minimized.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of testcases.The first line of each testcase contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 100$$$) — the number of points to be formed.The next line contains $$$2n$$$ integers $$$a_1, a_2, \\\\dots, a_{2n}$$$ ($$$0 \\\\le a_i \\\\le 1\\\\,000$$$) — the description of the sequence $$$a$$$.OutputFor each testcase, print the minimum possible length of path $$$s$$$ in the first line.In the $$$i$$$-th of the following $$$n$$$ lines, print two integers $$$x_i$$$ and $$$y_i$$$ — the coordinates of the point that needs to be visited at the $$$i$$$-th position.If there are multiple answers, print any of them.ExampleInput2215 1 10 5310 30 20 20 30 10Output9 10 1 15 5 20 20 20 10 30 10 30NoteIn the first testcase, for instance, you can form points $$$(10, 1)$$$ and $$$(15, 5)$$$ and start the path $$$s$$$ from the first point and end it at the second point. Then the length of the path will be $$$|10 - 15| + |1 - 5| = 5 + 4 = 9$$$.In the second testcase, you can form points $$$(20, 20)$$$, $$$(10, 30)$$$, and $$$(10, 30)$$$, and visit them in that exact order. Then the length of the path will be $$$|20 - 10| + |20 - 30| + |10 - 10| + |30 - 30| = 10 + 10 + 0 + 0 = 20$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "578bbf5c", "template_md5": "35d339e4", "result": "You are given a sequence of $2n$ integers. You need to pair these integers up to form $n$ points on a plane, where each pair represents the $(x, y)$ coordinates of a point.  \n\nThe distance between two points $(x_1, y_1)$ and $(x_2, y_2)$ is calculated as $|x_1 - x_2| + |y_1 - y_2|$.\n\nYour goal is to arrange these points and find a path that visits each point exactly once, starting and ending at any of the points. The length of the path is the sum of the distances between consecutive points on the path.\n\nFind the shortest possible path length. \n\n\nFor each test case, output:\n\n1. The minimum path length.\n2. The $x$ and $y$ coordinates of each point in the shortest path."}, {"prompt_md5": "f914803d", "template_md5": "465699a0", "result": "You are given a list of numbers.  You need to pair these numbers up to create points on a grid.  Then, you need to find the shortest path that visits each point exactly once. The distance between two points is the sum of the absolute differences of their x and y coordinates. What is the shortest possible path?"}]}