{"uid": "1895-E", "url": "https://codeforces.com/contest/1895/problem/E", "tags": ["binary search", " brute force", " data structures", " dfs and similar", " dp", " dsu", " games", " graphs", " greedy", " sortings", " two pointers"], "title": "1895-E", "statement": "E. Infinite Card Gametime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputMonocarp and Bicarp are playing a card game. Each card has two parameters: an attack value and a defence value. A card $$$s$$$ beats another card $$$t$$$ if the attack of $$$s$$$ is strictly greater than the defence of $$$t$$$.Monocarp has $$$n$$$ cards, the $$$i$$$-th of them has an attack value of $$$\\\\mathit{ax}_i$$$ and a defence value of $$$\\\\mathit{ay}_i$$$. Bicarp has $$$m$$$ cards, the $$$j$$$-th of them has an attack value of $$$\\\\mathit{bx}_j$$$ and a defence value of $$$\\\\mathit{by}_j$$$.On the first move, Monocarp chooses one of his cards and plays it. Bicarp has to respond with his own card that beats that card. After that, Monocarp has to respond with a card that beats Bicarp's card. After that, it's Bicarp's turn, and so forth.After a card is beaten, it returns to the hand of the player who played it.It implies that each player always has the same set of cards to play as at the start of the game. The game ends when the current player has no cards that beat the card which their opponent just played, and the current player loses.If the game lasts for $$$100^{500}$$$ moves, it's declared a draw.Both Monocarp and Bicarp play optimally. That is, if a player has a winning strategy regardless of his opponent's moves, he plays for a win. Otherwise, if he has a drawing strategy, he plays for a draw.You are asked to calculate three values:the number of Monocarp's starting moves that result in a win for Monocarp;the number of Monocarp's starting moves that result in a draw;the number of Monocarp's starting moves that result in a win for Bicarp.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le 3 \\\\cdot 10^5$$$) — the number of cards Monocarp has.The second line contains $$$n$$$ integers $$$\\\\mathit{ax}_1, \\\\mathit{ax}_2, \\\\dots, \\\\mathit{ax}_n$$$ ($$$1 \\\\le \\\\mathit{ax}_i \\\\le 10^6$$$) — the attack values of Monocarp's cards.The third line contains $$$n$$$ integers $$$\\\\mathit{ay}_1, \\\\mathit{ay}_2, \\\\dots, \\\\mathit{ay}_n$$$ ($$$1 \\\\le \\\\mathit{ay}_i \\\\le 10^6$$$) — the defence values of Monocarp's cards.The fourth line contains a single integer $$$m$$$ ($$$1 \\\\le m \\\\le 3 \\\\cdot 10^5$$$) — the number of cards Bicarp has.The fifth line contains $$$m$$$ integers $$$\\\\mathit{bx}_1, \\\\mathit{bx}_2, \\\\dots, \\\\mathit{bx}_m$$$ ($$$1 \\\\le \\\\mathit{bx}_j \\\\le 10^6$$$) — the attack values of Bicarp's cards.The sixth line contains $$$m$$$ integers $$$\\\\mathit{by}_1, \\\\mathit{by}_2, \\\\dots, \\\\mathit{by}_m$$$ ($$$1 \\\\le \\\\mathit{by}_j \\\\le 10^6$$$) — the defence values of Bicarp's cards.Additional constraints on the input: the sum of $$$n$$$ over all test cases doesn't exceed $$$3 \\\\cdot 10^5$$$, the sum of $$$m$$$ over all test cases doesn't exceed $$$3 \\\\cdot 10^5$$$.OutputFor each test case, print three integers:the number of Monocarp's starting moves that result in a win for Monocarp;the number of Monocarp's starting moves that result in a draw;the number of Monocarp's starting moves that result in a win for Bicarp.ExampleInput338 7 47 1 1028 45 1098 8 5 5 5 4 4 1 42 7 5 2 8 9 7 1 9109 8 7 6 5 5 4 3 2 17 1 6 7 5 8 8 4 9 611051105Output1 1 1 2 4 3 0 1 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2b68efa2", "template_md5": "35d339e4", "result": "Two players have decks of cards. Each card has an attack value and a defense value. A card beats another card if its attack is greater than the other card's defense.\n\nPlayers take turns playing cards. On a turn, a player must play a card that beats the opponent's last played card. If a player cannot play a card that beats the opponent's last card, they lose.\n\nCards are returned to the player's hand after being played. The game continues until one player loses or reaches a maximum number of moves (100^500).\n\nGiven the attack and defense values of each card in both decks, determine:\n\n* The number of starting moves for the first player that result in a win for the first player.\n* The number of starting moves for the first player that result in a draw.\n* The number of starting moves for the first player that result in a win for the second player."}, {"prompt_md5": "84f0665d", "template_md5": "465699a0", "result": "Two players have sets of cards. Each card has an attack and defense value. A card beats another if its attack is higher than the other's defense. Players take turns playing cards, and the game continues until one player can't play a card that beats the opponent's last play.  The game ends in a draw if it continues for a very long time.  \n\nDetermine how many starting card plays for the first player lead to each of the following outcomes: a win for the first player, a draw, and a win for the second player."}]}