{"uid": "1895-A", "url": "https://codeforces.com/contest/1895/problem/A", "tags": ["math"], "title": "1895-A", "statement": "A. Treasure Chesttime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputMonocarp has found a treasure map. The map represents the treasure location as an OX axis. Monocarp is at $$$0$$$, the treasure chest is at $$$x$$$, the key to the chest is at $$$y$$$.Obviously, Monocarp wants to open the chest. He can perform the following actions:go $$$1$$$ to the left or $$$1$$$ to the right (spending $$$1$$$ second);pick the key or the chest up if he is in the same point as that object (spending $$$0$$$ seconds);put the chest down in his current point (spending $$$0$$$ seconds);open the chest if he's in the same point as the chest and has picked the key up (spending $$$0$$$ seconds).Monocarp can carry the chest, but the chest is pretty heavy. He knows that he can carry it for at most $$$k$$$ seconds in total (putting it down and picking it back up doesn't reset his stamina).What's the smallest time required for Monocarp to open the chest?InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of testcases.The only line of each testcase contains three integers $$$x, y$$$ and $$$k$$$ ($$$1 \\\\le x, y \\\\le 100$$$; $$$x \\\\neq y$$$; $$$0 \\\\le k \\\\le 100$$$) — the initial point of the chest, the point where the key is located, and the maximum time Monocarp can carry the chest for.OutputFor each testcase, print a single integer — the smallest time required for Monocarp to open the chest.ExampleInput35 7 210 5 05 8 2Output7 10 9NoteIn the first testcase, Monocarp can open the chest in $$$7$$$ seconds with the following sequence of moves:go $$$5$$$ times to the right ($$$5$$$ seconds);pick up the chest ($$$0$$$ seconds);go $$$2$$$ times to the right ($$$2$$$ seconds);pick up the key ($$$0$$$ seconds);put the chest down ($$$0$$$ seconds);open the chest ($$$0$$$ seconds).He only carries the chest for $$$2$$$ seconds, which he has the stamina for.In the second testcase, Monocarp can pick up the key on his way to the chest.In the third testcase, Monocarp can't use the strategy from the first testcase because he would have to carry the chest for $$$3$$$ seconds, while he only has the stamina for $$$2$$$ seconds. Thus, he carries the chest to $$$7$$$, puts it down, moves $$$1$$$ to the right to pick up the key and returns $$$1$$$ left to open the chest.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ecc91009", "template_md5": "35d339e4", "result": "You are given three integers:\n\n*  $x$: the location of a treasure chest\n*  $y$: the location of a key\n*  $k$: the maximum time a person can carry the chest\n\nThe person starts at location 0. They can move 1 unit to the left or right each second. They can also pick up and put down the chest and the key.  \n\nThe goal is to find the minimum time it takes to open the chest, given the following rules:\n\n* Moving costs 1 second.\n* Picking up or putting down the chest or key costs 0 seconds.\n* Opening the chest costs 0 seconds if the person has the key and is at the chest's location.\n* The person can carry the chest for a maximum of $k$ seconds at a time."}, {"prompt_md5": "f5593e51", "template_md5": "465699a0", "result": "You are given three positions: a starting point, a key location, and a treasure chest location. You can move one unit to the left or right each second. You can carry the chest for a limited amount of time.  Find the shortest time to pick up the key and open the chest."}]}