{"uid": "19-B", "url": "https://codeforces.com/contest/19/problem/B", "tags": ["dp"], "title": "19-B", "statement": "B. Checkout Assistanttime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutBob came to a cash & carry store, putnitems into his trolley, and went to the checkout counter to pay. Each item is described by its priceciand timetiin seconds that a checkout assistant spends on this item. While the checkout assistant is occupied with some item, Bob can steal some other items from his trolley. To steal one item Bob needs exactly 1 second. What is the minimum amount of money that Bob will have to pay to the checkout assistant? Remember, please, that it is Bob, who determines the order of items for the checkout assistant.InputThe first input line contains numbern(1 ≤n≤ 2000). In each of the followingnlines each item is described by a pair of numbersti,ci(0 ≤ti≤ 2000, 1 ≤ci≤ 109). Iftiis 0, Bob won't be able to steal anything, while the checkout assistant is occupied with itemi.OutputOutput one number — answer to the problem: what is the minimum amount of money that Bob will have to pay.ExamplesInput42 100 201 51 3Output8Input30 10 100 100Output111", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "52f192fd", "template_md5": "35d339e4", "result": "You are given a list of $n$ items, where each item has a price ($c_i$) and a processing time ($t_i$) at the checkout counter.  Bob can steal items from his trolley while the cashier is processing another item, but he can only steal an item if the processing time of the current item is greater than 0.  \n\nFind the minimum total price Bob has to pay for all the items. Bob can choose the order in which the items are processed."}, {"prompt_md5": "00b87d0a", "template_md5": "465699a0", "result": "You have a list of items, each with a price and a processing time. You can steal other items while an item is being processed, but you can only steal one item per second. What is the minimum amount of money you have to pay for all the items?"}]}