{"uid": "19-C", "url": "https://codeforces.com/contest/19/problem/C", "tags": ["greedy", " hashing", " string suffix structures"], "title": "19-C", "statement": "C. Deletion of Repeatstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOnce Bob saw a string. It contained so many different letters, that the letters were marked by numbers, but at the same time each letter could be met in the string at most 10 times. Bob didn't like that string, because it contained repeats: a repeat of lengthxis such a substring of length2x, that its first half coincides character by character with its second half. Bob started deleting all the repeats from the string. He does it as follows: while it's possible, Bob takes the shortest repeat, if it is not unique, he takes the leftmost one, and deletes its left half and everything that is to the left of this repeat.You're given the string seen by Bob. Find out, what it will look like after Bob deletes all the repeats in the way described above.InputThe first input line contains integern(1 ≤n≤ 105) — length of the string. The following line containsnspace-separated integer numbers from0to109inclusive — numbers that stand for the letters of the string. It's guaranteed that each letter can be met in the string at most 10 times.OutputIn the first line output the length of the string's part, left after Bob's deletions. In the second line output all the letters (separated by a space) of the string, left after Bob deleted all the repeats in the described way.ExamplesInput61 2 3 1 2 3Output31 2 3Input74 5 6 5 6 7 7Output17", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "08c5b01f", "template_md5": "35d339e4", "result": "You are given a string of length $n$ consisting of numbers from 0 to 10^9. Each number represents a letter.  A \"repeat\" is a substring of length $2x$ where the first half is identical to the second half.\n\nThe task is to simulate the following process:\n\n1. Find the shortest repeat in the string. If there are multiple repeats of the same length, choose the leftmost one.\n2. Delete the left half of the repeat and everything to the left of it.\n3. Repeat steps 1 and 2 until no more repeats can be found.\n\nOutput the length of the remaining string and the sequence of letters after all repeats have been deleted."}, {"prompt_md5": "4dc399b6", "template_md5": "465699a0", "result": "You are given a string of numbers. Each number represents a letter.  The string may contain repeating sequences of letters.  You need to remove the shortest repeating sequence from the string, starting from the leftmost occurrence.  Repeat this process until no more repeating sequences can be removed. Output the length of the remaining string and the remaining string itself."}]}