{"uid": "19-E", "url": "https://codeforces.com/contest/19/problem/E", "tags": ["dfs and similar", " divide and conquer", " dsu"], "title": "19-E", "statement": "E. Fairytime limit per test1.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOnce upon a time there lived a good fairy A. One day a fine young man B came to her and asked to predict his future. The fairy looked into her magic ball and said that soon the fine young man will meet the most beautiful princess ever and will marry her. Then she drew on a sheet of papernpoints and joined some of them with segments, each of the segments starts in some point and ends in some other point. Having drawn that picture, she asked the young man to erase one of the segments from the sheet. Then she tries to colour each point red or blue so, that there is no segment having points of the same colour as its ends. If she manages to do so, the prediction will come true. B wants to meet the most beautiful princess, that's why he asks you to help him. Find all the segments that will help him to meet the princess.InputThe first input line contains two integer numbers:n— amount of the drawn points andm— amount of the drawn segments (1 ≤n≤ 104, 0 ≤m≤ 104). The followingmlines contain the descriptions of the segments. Each description contains two different space-separated integer numbersv,u(1 ≤v≤n, 1 ≤u≤n) — indexes of the points, joined by this segment. No segment is met in the description twice.OutputIn the first line output numberk— amount of the segments in the answer. In the second line outputkspace-separated numbers — indexes of these segments in ascending order. Each index should be output only once. Segments are numbered from 1 in the input order.ExamplesInput4 41 21 32 43 4Output41 2 3 4Input4 51 22 33 44 11 3Output15", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "748f23ac", "template_md5": "35d339e4", "result": "You are given $n$ points and $m$ segments connecting these points.  Each segment connects two distinct points.  \n\nDetermine the minimum number of segments that must be removed so that the remaining points can be colored red or blue such that no segment has both endpoints the same color.\n\nOutput the indices of these segments in ascending order."}, {"prompt_md5": "f5cb26ad", "template_md5": "465699a0", "result": "You are given a set of points and lines connecting some of them.  Find the lines that, if removed, allow you to color all the points either red or blue so that no connected line has both ends the same color."}]}