{"uid": "1901-D", "url": "https://codeforces.com/contest/1901/problem/D", "tags": ["binary search", " dp", " greedy", " implementation", " math"], "title": "1901-D", "statement": "D. Yet Another Monster Fighttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya is a sorcerer that fights monsters. Again. There are $$$n$$$ monsters standing in a row, the amount of health points of the $$$i$$$-th monster is $$$a_i$$$.Vasya is a very powerful sorcerer who knows many overpowered spells. In this fight, he decided to use a chain lightning spell to defeat all the monsters. Let's see how this spell works.Firstly, Vasya chooses an index $$$i$$$ of some monster ($$$1 \\\\le i \\\\le n$$$) and the initial power of the spell $$$x$$$. Then the spell hits monstersexactly$$$n$$$ times, one hit per monster. The first target of the spell is always the monster $$$i$$$. For every targetexcept for the first one, the chain lightning will choose arandommonsterwho was not hit by the spell and is adjacent to one of the monsters that already was hit. So, each monster will be hit exactly once. The first monster hit by the spell receives $$$x$$$ damage, the second monster receives $$$(x-1)$$$ damage, the third receives $$$(x-2)$$$ damage, and so on.Vasya wants to show how powerful he is, so he wants to kill all the monsters with a single chain lightning spell. The monster is considered dead if the damage he received is not less than the amount of its health points. On the other hand, Vasya wants to show he doesn't care that much, so he wants to choose theminimuminitial power of the spell $$$x$$$ such that it kills all monsters,no matter which monster (among those who can get hit) gets hit on each step.Of course, Vasya is a sorcerer, but the amount of calculations required to determine the optimal spell setup is way above his possibilities, so you have to help him find the minimum spell power required to kill all the monsters.Note that Vasya chooses the initial target and the power of the spell, other things should be considered random and Vasya wants to kill all the monsters even in the worst possible scenario.InputThe first line of the input contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 3 \\\\cdot 10^5$$$) — the number of monsters.The second line of the input contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$), where $$$a_i$$$ is the amount of health points of the $$$i$$$-th monster.OutputPrint one integer — the minimum spell power required to kill all the monsters if Vasya chooses the first target optimally, and the order of spell hits can be any possible within the given rules.ExamplesInput6 2 1 5 6 4 3Output8Input5 4 4 4 4 4Output8Input2 1 1000000000Output1000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "49b263a0", "template_md5": "35d339e4", "result": "You are given an array of integers $a$ of length $n$, where each integer represents the health points of a monster.  You need to find the minimum power $x$ of a spell such that you can kill all monsters with a single chain lightning spell.\n\nHere's how the spell works:\n\n1. You choose an index $i$ of a monster to start the spell.\n2. The spell hits each monster exactly once.\n3. The first monster hit receives $x$ damage.\n4. The second monster hit receives $x-1$ damage.\n5. This pattern continues, with each subsequent monster receiving $x-k$ damage, where $k$ is the monster's position in the chain.\n6. Monsters are killed if their health points are reduced to 0 or less.\n\nThe order in which monsters are hit after the initial target is random, but each monster must be hit exactly once. You need to find the minimum $x$ that guarantees all monsters are killed, regardless of the random order of hits."}, {"prompt_md5": "a4a29181", "template_md5": "465699a0", "result": "You are given a list of integers representing the health points of monsters. You need to find the minimum amount of damage needed to kill all monsters in a single attack, where the attack spreads damage to adjacent monsters in a chain-like fashion, with the damage decreasing for each subsequent monster hit."}]}