{"uid": "1902-A", "url": "https://codeforces.com/contest/1902/problem/A", "tags": ["constructive algorithms"], "title": "1902-A", "statement": "A. Binary Imbalancetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$, consisting only of characters '0' and/or '1'.In one operation, you choose a position $$$i$$$ from $$$1$$$ to $$$|s| - 1$$$, where $$$|s|$$$ is the current length of string $$$s$$$. Then you insert a character between the $$$i$$$-th and the $$$(i+1)$$$-st characters of $$$s$$$. If $$$s_i = s_{i+1}$$$, you insert '1'. If $$$s_i \\\\neq s_{i+1}$$$, you insert '0'.Is it possible to make the number of zeroes in the string strictly greater than the number of ones, using any number of operations (possibly, none)?InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of testcases.The first line of each testcase contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le 100$$$).The second line contains a string $$$s$$$ of length exactly $$$n$$$, consisting only of characters '0' and/or '1'.OutputFor each testcase, print \"YES\" if it's possible to make the number of zeroes in $$$s$$$ strictly greater than the number of ones, using any number of operations (possibly, none). Otherwise, print \"NO\".ExampleInput3200211210OutputYES NO YESNoteIn the first testcase, the number of zeroes is already greater than the number of ones.In the second testcase, it's impossible to insert any zeroes in the string.In the third testcase, you can choose $$$i = 1$$$ to insert a zero between the $$$1$$$-st and the $$$2$$$-nd characters. Since $$$s_1 \\\\neq s_2$$$, you insert a '0'. The resulting string is \"100\". It has two zeroes and only a single one, so the answer is \"YES\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "810b3fc3", "template_md5": "35d339e4", "result": "You are given a string consisting only of '0's and '1's. You can insert a '0' or '1' between any two characters in the string, following these rules:\n\n* If the two characters are the same, insert a '1'.\n* If the two characters are different, insert a '0'.\n\nDetermine if it's possible to make the number of '0's in the string strictly greater than the number of '1's after performing these operations.\n\n\nInput:\n\n* The first line contains the number of test cases.\n* Each test case has two lines:\n    * The first line contains the length of the string.\n    * The second line contains the string itself.\n\nOutput:\n\n* For each test case, print \"YES\" if it's possible to have more '0's than '1's, otherwise print \"NO\"."}, {"prompt_md5": "f22aad48", "template_md5": "465699a0", "result": "You are given a string of 0s and 1s. You can insert a 0 or 1 between any two characters in the string, following these rules:\n\n* If the two characters are the same, insert a 1.\n* If the two characters are different, insert a 0.\n\nCan you make the number of 0s in the string greater than the number of 1s?"}]}