{"uid": "1903-A", "url": "https://codeforces.com/contest/1903/problem/A", "tags": ["brute force", " greedy", " sortings"], "title": "1903-A", "statement": "A. Halloumi Boxestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputTheofanis is busy after hislast contest, as now, he has to deliver many halloumis all over the world. He stored them inside $$$n$$$ boxes and each of which has some number $$$a_i$$$ written on it.He wants to sort them in non-decreasing order based on their number, however, his machine works in a strange way. It can only reverse any subarray$$$^{\\\\dagger}$$$ of boxes with lengthat most$$$k$$$.Find if it's possible to sort the boxes usingany number of reverses.$$$^{\\\\dagger}$$$ Reversing a subarray means choosing two indices $$$i$$$ and $$$j$$$ (where $$$1 \\\\le i \\\\le j \\\\le n$$$) and changing the array $$$a_1, a_2, \\\\ldots, a_n$$$ to $$$a_1, a_2, \\\\ldots, a_{i-1}, \\\\; a_j, a_{j-1}, \\\\ldots, a_i, \\\\; a_{j+1}, \\\\ldots, a_{n-1}, a_n$$$. The length of the subarray is then $$$j - i + 1$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of test cases.Each test case consists of two lines.The first line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 100$$$) — the number of boxes and the length of the maximum reverse that Theofanis can make.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^{9}$$$) — the number written on each box.OutputFor each test case, printYES(case-insensitive), if the array can be sorted in non-decreasing order, orNO(case-insensitive) otherwise.ExampleInput53 21 2 33 19 9 94 46 4 2 14 310 3 830 142 13 1OutputYES YES YES YES NONoteIn the first two test cases, the boxes are already sorted in non-decreasing order.In the third test case, we can reverse the whole array.In the fourth test case, we can reverse the first two boxes and the last two boxes.In the fifth test case, it can be shown that it's impossible to sort the boxes.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7c2fb5da", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, $a_1, a_2, ..., a_n$. You can reverse any subarray of length at most $k$ within the array. Determine if it is possible to sort the array in non-decreasing order using any number of these reversals.\n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 100$) representing the number of test cases.\n* Each test case consists of two lines.\n    * The first line contains two integers $n$ and $k$ ($1 \\le k \\le n \\le 100$) representing the number of elements in the array and the maximum length of a reversible subarray.\n    * The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le 10^9$) representing the elements of the array.\n\nOutput:\n\nFor each test case, print \"YES\" if the array can be sorted in non-decreasing order using the allowed reversals, and \"NO\" otherwise."}, {"prompt_md5": "b5e14c8b", "template_md5": "465699a0", "result": "You are given a list of numbers. You can reverse any sublist of at most a given length.  Determine if you can sort the list in non-decreasing order using these reversals."}]}