{"uid": "1906-B", "url": "https://codeforces.com/contest/1906/problem/B", "tags": ["bitmasks", " constructive algorithms", " hashing"], "title": "1906-B", "statement": "B. Button Pressingtime limit per test1 secondmemory limit per test1024 megabytesinputstandard inputoutputstandard outputYou are given $$$N$$$ buttons (numbered from $$$1$$$ to $$$N$$$) and $$$N$$$ lamps (numbered from $$$1$$$ to $$$N$$$). Each lamp can either be on or off. Initially, lamp $$$i$$$ is on if $$$A_i = 1$$$, and off if $$$A_i = 0$$$.Button $$$i$$$ is connected to lamp $$$i - 1$$$ (if $$$i > 1$$$) and lamp $$$i + 1$$$ (if $$$i < N$$$). In one move, you can press a button $$$i$$$only if lamp $$$i$$$ is on. When a button is pressed, the state of the lamps connected to this button is toggled. Formally, the lamps will be on if it was off previously, and the lamps will be off if it was on previously. Note that lamp $$$i$$$ is not connected to button $$$i$$$, thus, the state of lamp $$$i$$$ does not change if button $$$i$$$ is pressed.After zero or more moves, you want lamp $$$i$$$ to be on if $$$B_i = 1$$$, and off if $$$B_i = 0$$$. Determine if it is possible to achieve this task.InputThis problem has multiple test cases. The first line consists of an integer $$$T$$$ ($$$1 \\\\leq T \\\\leq 1000$$$), which represents the number of test cases. Each test case consists of three lines.The first line of each test case consists of an integer $$$N$$$ ($$$3 \\\\le N \\\\le 200\\\\,000$$$). The sum of $$$N$$$ over all test cases does not exceed $$$200\\\\,000$$$.The second line of each test case consists of a string $$$A$$$ of length $$$N$$$. Each character of $$$A$$$ can either be0or1. The $$$i$$$-th character represents the initial state of lamp $$$i$$$.The third line of each test case consists of a string $$$A$$$ of length $$$N$$$. Each character of $$$B$$$ can either be0or1. The $$$i$$$-th character represents the desired final state of lamp $$$i$$$.OutputFor each test case, outputYESin a single line if the final state of all lamps can be reached after zero or more moves, orNOotherwise.ExamplesInput2 4 0101 0100 3 000 010OutputYES NOInput5 7 0101011 1111010 5 11111 00000 4 1101 1101 6 101010 100100 3 000 000OutputNO NO YES YES YESNoteExplanation for the sample input/output #1For the first test case, by pressing the buttons $$$4, 2, 4, 3, 1, 2$$$ in sequence, the condition of the buttons changes as: $$$0101 \\\\rightarrow 0111 \\\\rightarrow 1101 \\\\rightarrow 1111 \\\\rightarrow 1010 \\\\rightarrow 1110 \\\\rightarrow 0100$$$.For the second test case, you are unable to press any button, hence it is impossible to reach the final state.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b29b8fd6", "template_md5": "35d339e4", "result": "You have $N$ buttons and $N$ lamps. Each lamp can be on (1) or off (0).  Initially, lamp $i$ is on if $A_i = 1$ and off if $A_i = 0$.\n\nButton $i$ is connected to lamp $i-1$ (if $i>1$) and lamp $i+1$ (if $i<N$). Pressing button $i$ toggles the state of the connected lamps.  Lamp $i$ itself is not connected to button $i$.\n\nYou want to make the lamps have a specific final state described by the array $B$.  Determine if it is possible to achieve this by pressing the buttons.\n\n**Input:**\n\n* $T$: the number of test cases\n* For each test case:\n    * $N$: the number of lamps\n    * $A$: a string of length $N$ representing the initial state of the lamps (0 or 1)\n    * $B$: a string of length $N$ representing the desired final state of the lamps (0 or 1)\n\n**Output:**\n\n* For each test case, output \"YES\" if it is possible to achieve the final state, or \"NO\" otherwise."}, {"prompt_md5": "0ac97bb9", "template_md5": "465699a0", "result": "You have a line of lights. Each light can be on or off. You can toggle the state of two connected lights by pressing a button.  You are given the initial state of the lights and the desired final state. Can you reach the desired final state by pressing buttons?"}]}