{"uid": "1906-A", "url": "https://codeforces.com/contest/1906/problem/A", "tags": ["brute force"], "title": "1906-A", "statement": "A. Easy As ABCtime limit per test1 secondmemory limit per test1024 megabytesinputstandard inputoutputstandard outputYou are playing a word puzzle. The puzzle starts with a $$$3$$$ by $$$3$$$ grid, where each cell contains either the letterA,B, orC.The goal of this puzzle is to find the lexicographically smallest possible word of length $$$3$$$. The word can be formed by choosing three different cells where the cell containing the first letter is adjacent to the cell containing the second letter, and the cell containing the second letter is adjacent to the cell containing the third letter.Two cells are adjacent to each other if they share a border or a corner, as shown in the following illustration. Formally, if $$$(r, c)$$$ denotes the cell in the $$$r$$$-th row and $$$c$$$-th column, then cell $$$(r, c)$$$ is adjacent to cell $$$(r, c + 1)$$$, $$$(r - 1, c + 1)$$$, $$$(r - 1, c)$$$, $$$(r - 1, c - 1)$$$, $$$(r, c - 1)$$$, $$$(r + 1, c - 1)$$$, $$$(r + 1, c)$$$, and $$$(r + 1, c + 1)$$$.Determine the lexicographically smallest possible word of length $$$3$$$ that you can find within the grid.A string $$$s$$$ of length $$$n$$$ is lexicographically smaller than string $$$t$$$ of the same length if there exists an integer $$$1 \\\\leq i \\\\leq n$$$ such that $$$s_j = t_j$$$ for all $$$1 \\\\leq j < i$$$, and $$$s_i < t_i$$$ in alphabetical order. The following illustration shows some examples on some grids and their the lexicographically smallest possible word of length $$$3$$$ that you can find within the grids.InputInput consists of three lines, each containing three letters, representing the puzzle grid. Each letter in the grid can only be eitherA,B, orC.OutputOutput the lexicographically smallest possible word of length $$$3$$$ that you can find within the grid.ExamplesInputBCB CAC BCBOutputABCInputBCB CCC CCAOutputACBInputACA CBC ACAOutputABAInputACA CAC ACAOutputAAAInputCCC CBC CCCOutputBCC", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "40b2592c", "template_md5": "35d339e4", "result": "You are given a 3x3 grid of letters (A, B, or C).  Find the smallest possible 3-letter word you can make by choosing three different cells in the grid, where the cells are connected horizontally, vertically, or diagonally. \n\nFor example, if the grid is:\n\n```\nABC\nBCA\nCAB\n```\n\nThe smallest word you can make is \"ABC\"."}, {"prompt_md5": "ee600d0e", "template_md5": "465699a0", "result": "You are given a 3x3 grid of letters (A, B, or C). Find the smallest possible 3-letter word you can make by picking letters from adjacent cells in the grid.  Adjacent cells are those that share a side or corner."}]}