{"uid": "1914-A", "url": "https://codeforces.com/contest/1914/problem/A", "tags": ["implementation", " strings"], "title": "1914-A", "statement": "A. Problemsolving Logtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMonocarp is participating in a programming contest, which features $$$26$$$ problems, named from 'A' to 'Z'. The problems are sorted by difficulty. Moreover, it's known that Monocarp can solve problem 'A' in $$$1$$$ minute, problem 'B' in $$$2$$$ minutes, ..., problem 'Z' in $$$26$$$ minutes.After the contest, you discovered his contest log — a string, consisting of uppercase Latin letters, such that the $$$i$$$-th letter tells which problem Monocarp was solving during the $$$i$$$-th minute of the contest. If Monocarp had spent enough time in total on a problem to solve it, he solved it. Note that Monocarp could have been thinking about a problem after solving it.Given Monocarp's contest log, calculate the number of problems he solved during the contest.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of testcases.The first line of each testcase contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 500$$$) — the duration of the contest, in minutes.The second line contains a string of length exactly $$$n$$$, consisting only of uppercase Latin letters, — Monocarp's contest log.OutputFor each testcase, print a single integer — the number of problems Monocarp solved during the contest.ExampleInput36ACBCBC7AAAAFPC22FEADBBDFFEDFFFDHHHADCCOutput3 1 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ce1daec3", "template_md5": "35d339e4", "result": "There are 26 problems labeled A through Z.  The time it takes to solve each problem is:\n\n* A: 1 minute\n* B: 2 minutes\n* ...\n* Z: 26 minutes\n\nYou are given a string representing the sequence of problems solved during a contest of length $n$ minutes. Each character in the string represents the problem being worked on during that minute.  \n\nDetermine the number of problems solved during the contest. A problem is considered solved if enough time is spent on it."}, {"prompt_md5": "075aed75", "template_md5": "465699a0", "result": "You are given a list of tasks with increasing difficulty and the time it takes to complete each task. You are also given a log of which task was being worked on each minute. Determine the number of tasks completed given the log."}]}