{"uid": "1918-A", "url": "https://codeforces.com/contest/1918/problem/A", "tags": ["constructive algorithms", " greedy", " implementation", " math"], "title": "1918-A", "statement": "A. Brick Walltime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA brick is a strip of size $$$1 \\\\times k$$$, placed horizontally or vertically, where $$$k$$$ can be an arbitrary number that is at least $$$2$$$ ($$$k \\\\ge 2$$$).A brick wall of size $$$n \\\\times m$$$ is such a way to place several bricks inside a rectangle $$$n \\\\times m$$$, that all bricks lie either horizontally or vertically in the cells, do not cross the border of the rectangle, and that each cell of the $$$n \\\\times m$$$ rectangle belongs to exactly one brick. Here $$$n$$$ is the height of the rectangle $$$n \\\\times m$$$ and $$$m$$$ is the width.Notethat there can be bricks with different values of k in the same brick wall.The wall stability is the difference between the number of horizontal bricks and the number of vertical bricks.Notethat if you used $$$0$$$ horizontal bricks and $$$2$$$ vertical ones, then the stability will be$$$-2$$$, not $$$2$$$.What is the maximal possible stability of a wall of size $$$n \\\\times m$$$?It is guaranteed that under restrictions in the statement at least one $$$n \\\\times m$$$ wall exists.InputThe first line of the input contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10\\\\,000$$$), the number of test cases.The only line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$2 \\\\le n,\\\\,m \\\\le 10^4$$$).OutputFor each test case, print one integer, the maximum stability of a wall of size $$$n \\\\times m$$$.ExampleInput52 27 816 93 510000 10000Output2 28 64 6 50000000NoteIn the 1st test case, the maximum stability of $$$2$$$ is obtained by placing two horizontal bricks $$$1 \\\\times 2$$$ one on top of the other.In the 2nd test case, one can get the maximum stability of $$$28$$$ by placing $$$4$$$ horizontal bricks $$$1 \\\\times 2$$$ in each of the $$$7$$$ rows.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "221110a6", "template_md5": "35d339e4", "result": "You are given a rectangle with dimensions $n \\times m$. You need to fill the rectangle with bricks. Each brick is a rectangle with dimensions $1 \\times k$, where $k$ is at least 2.  \n\n* Bricks can be placed horizontally or vertically.\n* Bricks cannot overlap or extend beyond the rectangle's borders.\n* Each cell in the rectangle must be covered by exactly one brick.\n\nThe \"stability\" of the wall is the difference between the number of horizontal bricks and the number of vertical bricks.\n\nWhat is the maximum possible stability you can achieve for a wall of size $n \\times m$? \n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* Each test case has two lines:\n    * The first line contains the height of the rectangle, $n$.\n    * The second line contains the width of the rectangle, $m$.\n\n**Output:**\n\nFor each test case, print the maximum possible stability."}, {"prompt_md5": "9bb3bb59", "template_md5": "465699a0", "result": "You are given a rectangle. You can fill the rectangle with horizontal or vertical \"bricks\". Each brick is at least 2 units wide or tall.  Find the biggest difference you can make between the number of horizontal bricks and the number of vertical bricks."}]}