{"uid": "1920-E", "url": "https://codeforces.com/contest/1920/problem/E", "tags": ["combinatorics", " dp", " math"], "title": "1920-E", "statement": "E. Counting Binary Stringstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputPatrick calls a substring$$$^\\\\dagger$$$ of a binary string$$$^\\\\ddagger$$$goodif this substring contains exactly one1.Help Patrick count the number of binary strings $$$s$$$ such that $$$s$$$ contains exactly $$$n$$$ good substrings and has no good substring of length strictly greater than $$$k$$$. Note that substrings are differentiated by their location in the string, so if $$$s =$$$1010you should count both occurrences of10.$$$^\\\\dagger$$$ A string $$$a$$$ is a substring of a string $$$b$$$ if $$$a$$$ can be obtained from $$$b$$$ by the deletion of several (possibly, zero or all) characters from the beginning and several (possibly, zero or all) characters from the end.$$$^\\\\ddagger$$$ A binary string is a string that only contains the characters0and1.InputEach test consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 2500$$$) — the number of test cases. The description of the test cases follows.The only line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\leq n \\\\leq 2500$$$, $$$1 \\\\leq k \\\\leq n$$$) — the number of required good substrings and the maximum allowed length of a good substring.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2500$$$.OutputFor each test case, output a single integer — the number of binary strings $$$s$$$ such that $$$s$$$ contains exactly $$$n$$$ good substrings and has no good substring of length strictly greater than $$$k$$$. Since this integer can be too large, output it modulo $$$998\\\\,244\\\\,353$$$.ExampleInput61 13 24 25 46 22450 2391Output1 3 5 12 9 259280854NoteIn the first test case, the only suitable binary string is1. String01is not suitable because it contains a substring01with length $$$2 > 1$$$.In the second test case, suitable binary strings are011,110and111.In the third test case, suitable binary strings are101,0110,0111,1110, and1111.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e09fc842", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $k$.  Find the number of binary strings (strings consisting only of 0s and 1s) of length at least $n$ that contain exactly $n$ substrings of length 1 and no substrings of length greater than $k$.  Output the answer modulo 998244353."}, {"prompt_md5": "bb2b151e", "template_md5": "465699a0", "result": "You are given two numbers, *n* and *k*. Find the number of binary strings (strings made up of only 0s and 1s) of length *n* that have exactly *n* substrings of length 1 and no substrings of length greater than *k*.  The answer should be given modulo 998244353."}]}