{"uid": "1921-A", "url": "https://codeforces.com/contest/1921/problem/A", "tags": ["greedy", " math"], "title": "1921-A", "statement": "A. Squaretime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA square of positive (strictly greater than $$$0$$$) area is located on the coordinate plane, with sides parallel to the coordinate axes. You are given the coordinates of its corners, in random order. Your task is to find the area of the square.InputEach test consists of several testcases. The first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of testcases. The following is a description of the testcases.Each testcase contains four lines, each line contains two integers $$$x_i, y_i$$$ ($$$-1000\\\\le x_i, y_i\\\\le 1000$$$), coordinates of the corners of the square.It is guaranteed that there is a square with sides parallel to the coordinate axes, with positive (strictly greater than $$$0$$$) area, with corners in given points.OutputFor each test case, print a single integer, the area of the square.ExampleInput31 24 51 54 2-1 11 -11 1-1 -145 1145 3917 1117 39Output9 4 784", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "347dee55", "template_md5": "35d339e4", "result": "You are given the coordinates of four points that form a square.  The points are given in random order.  Find the area of the square.\n\n**Input:**\n\n* The first line contains the number of test cases,  *t*.\n* Each test case has four lines, each containing two integers representing the x and y coordinates of a corner of the square.\n\n**Output:**\n\n* For each test case, print the area of the square as a single integer. \n\n\n**Constraints:**\n\n* $1 \\le t \\le 100$\n* $-1000 \\le x_i, y_i \\le 1000$ \n* The area of the square is strictly greater than 0."}, {"prompt_md5": "abdc7632", "template_md5": "465699a0", "result": "You are given the coordinates of four points.  These points form a square.  Find the area of the square."}]}