{"uid": "1922-B", "url": "https://codeforces.com/contest/1922/problem/B", "tags": ["combinatorics", " constructive algorithms", " math", " sortings"], "title": "1922-B", "statement": "B. Forming Trianglestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have $$$n$$$ sticks, numbered from $$$1$$$ to $$$n$$$. The length of the $$$i$$$-th stick is $$$2^{a_i}$$$.You want to chooseexactly$$$3$$$ sticks out of the given $$$n$$$ sticks, and form anon-degeneratetriangle out of them, using the sticks as the sides of the triangle. A triangle is called non-degenerate if its area isstrictlygreater than $$$0$$$.You have to calculate the number of ways to choose exactly $$$3$$$ sticks so that a triangle can be formed out of them. Note that the order of choosing sticks does not matter (for example, choosing the $$$1$$$-st, $$$2$$$-nd and $$$4$$$-th stick is the same as choosing the $$$2$$$-nd, $$$4$$$-th and $$$1$$$-st stick).InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Each test case consists of two lines:the first line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 3 \\\\cdot 10^5$$$);the second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$0 \\\\le a_i \\\\le n$$$).Additional constraint on the input: the sum of $$$n$$$ over all test cases does not exceed $$$3 \\\\cdot 10^5$$$.OutputFor each test case, print one integer — the number of ways to choose exactly $$$3$$$ sticks so that a triangle can be formed out of them.ExampleInput471 1 1 1 1 1 143 2 1 331 2 311Output35 2 0 0NoteIn the first test case of the example, any three sticks out of the given $$$7$$$ can be chosen.In the second test case of the example, you can choose the $$$1$$$-st, $$$2$$$-nd and $$$4$$$-th stick, or the $$$1$$$-st, $$$3$$$-rd and $$$4$$$-th stick.In the third test case of the example, you cannot form a triangle out of the given sticks with lengths $$$2$$$, $$$4$$$ and $$$8$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "53666798", "template_md5": "35d339e4", "result": "You are given $n$ sticks, where the length of the $i$-th stick is $2^{a_i}$.  You need to choose exactly 3 sticks from these $n$ sticks to form a non-degenerate triangle. A non-degenerate triangle has an area strictly greater than 0.  \n\nDetermine the number of ways to choose 3 sticks that will form a non-degenerate triangle. The order in which you choose the sticks does not matter. \n\n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 10^4$) representing the number of test cases.\n* Each test case consists of two lines:\n    * The first line contains an integer $n$ ($1 \\le n \\le 3 \\cdot 10^5$) representing the number of sticks.\n    * The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 \\le a_i \\le n$) representing the exponents of 2 for each stick's length.\n\nOutput:\n\nFor each test case, print an integer representing the number of ways to choose 3 sticks to form a non-degenerate triangle."}, {"prompt_md5": "65a64924", "template_md5": "465699a0", "result": "You are given a set of sticks of different lengths.  Each stick's length is a power of 2.  You need to find how many ways you can choose 3 sticks from the set to form a triangle.  A triangle can be formed if the sum of the lengths of any two sides is greater than the length of the third side."}]}