{"uid": "1922-E", "url": "https://codeforces.com/contest/1922/problem/E", "tags": ["bitmasks", " constructive algorithms", " divide and conquer", " greedy", " math"], "title": "1922-E", "statement": "E. Increasing Subsequencestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's recall that an increasing subsequence of the array $$$a$$$ is a sequence that can be obtained from it by removing some elements without changing the order of the remaining elements, and the remaining elements are strictly increasing (i. e $$$a_{b_1} < a_{b_2} < \\\\dots < a_{b_k}$$$ and $$$b_1 < b_2 < \\\\dots < b_k$$$). Note that an empty subsequence is also increasing.You are given a positive integer $$$X$$$. Your task is to find an array of integers of lengthat most $$$200$$$, such that it has exactly $$$X$$$ increasing subsequences, or report that there is no such array. If there are several answers, you can print any of them.If two subsequences consist of the same elements, but correspond to different positions in the array, they are considered different (for example, the array $$$[2, 2]$$$ has two different subsequences equal to $$$[2]$$$).InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.The only line of each test case contains a single integer $$$X$$$ ($$$2 \\\\le X \\\\le 10^{18}$$$).OutputFor each query, print the answer to it. If it is impossible to find the required array, print-1on the first line. Otherwise, print a positive integer $$$n$$$ on the first line — the length of the array. On the second line, print $$$n$$$ integers — the required array itself. If there are several answers, you can print any of them. All elements of the array should be in the range $$$[-10^9; 10^9]$$$.ExampleInput4251337Output1 0 3 0 1 0 5 2 2 3 4 2 7 -1 -1 0 0 2 3 -1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "956d98da", "template_md5": "35d339e4", "result": "You are given a number $X$. Your task is to find an array of integers with a length of at most 200, that has exactly $X$ increasing subsequences. An increasing subsequence is a sequence of numbers in the array where each number is larger than the one before it. \n\nIf it's impossible to find such an array, print -1. Otherwise, print the length of the array followed by the array itself."}, {"prompt_md5": "7785e0da", "template_md5": "465699a0", "result": "Given a number X, find a list of numbers with at most 200 elements that has exactly X increasing subsequences. An increasing subsequence is a sequence of numbers in the list that are in order. If no such list exists, output -1."}]}