{"uid": "1925-D", "url": "https://codeforces.com/contest/1925/problem/D", "tags": ["combinatorics", " dp", " math", " probabilities"], "title": "1925-D", "statement": "D. Good Triptime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ children in a class, $$$m$$$ pairs among them are friends. The $$$i$$$-th pair who are friends have a friendship value of $$$f_i$$$.The teacher has to go for $$$k$$$ excursions, and for each of the excursions she chooses a pair of children randomly, equiprobably and independently. If a pair of children who are friends is chosen, their friendship value increases by $$$1$$$ for all subsequent excursions (the teacher can choose a pair of children more than once). The friendship value of a pair who are not friends is considered $$$0$$$, and it does not change for subsequent excursions.Find the expected value of the sum of friendship values of all $$$k$$$ pairs chosen for the excursions (at the time of being chosen). It can be shown that this answer can always be expressed as a fraction $$$\\\\dfrac{p}{q}$$$ where $$$p$$$ and $$$q$$$ are coprime integers. Calculate $$$p\\\\cdot q^{-1} \\\\bmod (10^9+7)$$$.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 5 \\\\cdot 10^4$$$). Description of the test cases follows.The first line of each test case contains $$$3$$$ integers $$$n$$$, $$$m$$$ and $$$k$$$ ($$$2 \\\\le n \\\\le 10^5$$$, $$$0 \\\\le m \\\\le \\\\min \\\\Big(10^5$$$, $$$ \\\\frac{n(n-1)}{2} \\\\Big)$$$, $$$1 \\\\le k \\\\le 2 \\\\cdot 10^5$$$) — the number of children, pairs of friends and excursions respectively.The next $$$m$$$ lines contain three integers each — $$$a_i$$$, $$$b_i$$$, $$$f_i$$$ — the indices of the pair of children who are friends and their friendship value. ($$$a_i \\\\neq b_i$$$, $$$1 \\\\le a_i,b_i \\\\le n$$$, $$$1 \\\\le f_i \\\\le 10^9$$$).It is guaranteed that all pairs of friends are distinct.It is guaranteed that the sum of $$$n$$$ and sum $$$m$$$ over all test cases does not exceed $$$10^5$$$ and the sum of $$$k$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, print one integer — the answer to the problem.ExampleInput4100 0 242 1 101 2 13 1 22 1 15 2 41 2 253 2 24Output0 55 777777784 40000020NoteFor the first test case, there are no pairs of friends, so the friendship value of all pairs is $$$0$$$ and stays $$$0$$$ for subsequent rounds, hence the friendship value for all excursions is $$$0$$$.For the second test case, there is only one pair possible $$$(1, 2)$$$ and its friendship value is initially $$$1$$$, so each turn they are picked and their friendship value increases by $$$1$$$. Therefore, the total sum is $$$1+2+3+\\\\ldots+10 = 55$$$.For the third test case, the final answer is $$$\\\\frac{7}{9} = 777\\\\,777\\\\,784\\\\bmod (10^9+7)$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4ea1b069", "template_md5": "35d339e4", "result": "There are $n$ children and $m$ pairs of friends among them. Each friendship has a value $f_i$. \n\nA teacher will go on $k$ excursions.  On each excursion, the teacher will randomly choose a pair of children to go. If the chosen children are friends, their friendship value increases by 1 for all future excursions. If they are not friends, their friendship value remains 0.\n\nWhat is the expected total friendship value of all $k$ chosen pairs?  The answer can be expressed as a fraction $p/q$ where $p$ and $q$ are coprime integers. Calculate $p \\cdot q^{-1} \\pmod{10^9 + 7}$. \n\n\nInput:\n\n* The first line contains the number of test cases $t$ ($1 \\le t \\le 5 \\cdot 10^4$).\n* For each test case:\n    * The first line contains three integers $n$, $m$, and $k$ ($2 \\le n \\le 10^5$, $0 \\le m \\le \\min(10^5, \\frac{n(n-1)}{2})$, $1 \\le k \\le 2 \\cdot 10^5$)\n    * The next $m$ lines contain three integers each: $a_i$, $b_i$, and $f_i$ — the indices of the pair of friends and their friendship value ($a_i \\neq b_i$, $1 \\le a_i, b_i \\le n$, $1 \\le f_i \\le 10^9$).\n\nOutput:\n\n* For each test case, print one integer — the answer to the problem."}, {"prompt_md5": "a4c2923a", "template_md5": "465699a0", "result": "There are some people who are friends.  Each day, two people are randomly chosen. If they are friends, their friendship level increases.  \n\nYou are given the number of people, the number of friendships, and the number of days.  Find the average total friendship level at the end of the days."}]}