{"uid": "1925-B", "url": "https://codeforces.com/contest/1925/problem/B", "tags": ["brute force", " greedy", " math", " number theory"], "title": "1925-B", "statement": "B. A Balanced Problemset?time limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJay managed to create a problem of difficulty $$$x$$$ and decided to make it the second problem for Codeforces Round #921.But Yash fears that this problem will make the contest highly unbalanced, and the coordinator will reject it. So, he decided to break it up into a problemset of $$$n$$$ sub-problems such that the difficulties of all the sub-problems are a positive integer and their sum is equal to $$$x$$$.The coordinator, Aleksey, defines the balance of a problemset as theGCDof the difficulties of all sub-problems in the problemset.Find the maximum balance that Yash can achieve if he chooses the difficulties of the sub-problems optimally.InputThe first line of input contains a single integer $$$t$$$ ($$$1\\\\leq t\\\\leq 10^3$$$) denoting the number of test cases.Each test case contains a single line of input containing two integers $$$x$$$ ($$$1\\\\leq x\\\\leq 10^8$$$) and $$$n$$$ ($$$1\\\\leq n\\\\leq x$$$).OutputFor each test case, print a single line containing a single integer denoting the maximum balance of the problemset Yash can achieve.ExampleInput310 35 5420 69Output2 1 6NoteFor the first test case, one possible way is to break up the problem of difficulty $$$10$$$ into a problemset having three problems of difficulties $$$4$$$, $$$2$$$ and $$$4$$$ respectively, giving a balance equal to $$$2$$$.For the second test case, there is only one way to break up the problem of difficulty $$$5$$$ into a problemset of $$$5$$$ problems with each problem having a difficulty $$$1$$$ giving a balance equal to $$$1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "50bb5ba3", "template_md5": "465699a0", "result": "You are given a number representing the total difficulty of a problem and another number representing the number of sub-problems it should be divided into.  Find the largest possible common divisor of the difficulties of the sub-problems."}, {"prompt_md5": "ff24bccc", "template_md5": "35d339e4", "result": "You are given an integer $x$ representing the difficulty of a problem.  You need to divide this problem into $n$ sub-problems, where each sub-problem has a positive integer difficulty. The sum of the difficulties of all sub-problems must equal $x$.\n\nThe balance of the problemset is defined as the greatest common divisor (GCD) of the difficulties of all the sub-problems.\n\nFind the maximum balance that can be achieved by optimally choosing the difficulties of the sub-problems. \n\n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 10^3$) representing the number of test cases.\n* Each test case contains a line with two integers $x$ ($1 \\le x \\le 10^8$) and $n$ ($1 \\le n \\le x$)\n\nOutput:\n\n* For each test case, print a single integer representing the maximum balance."}]}