{"uid": "1926-G", "url": "https://codeforces.com/contest/1926/problem/G", "tags": ["dfs and similar", " dp", " flows", " graphs", " greedy", " implementation", " trees"], "title": "1926-G", "statement": "G. Vlad and Trouble at MITtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVladislav has a son who really wanted to go to MIT. The college dormitory at MIT (Moldova Institute of Technology) can be represented as a tree with $$$n$$$ vertices, each vertex being a room with exactly one student. Atreeis a connected undirected graph with $$$n$$$ vertices and $$$n-1$$$ edges.Tonight, there are three types of students:students who want to party and play music (marked with $$$\\\\texttt{P}$$$),students who wish to sleep and enjoy silence (marked with $$$\\\\texttt{S}$$$), andstudents who don't care (marked with $$$\\\\texttt{C}$$$).Initially, all the edges arethinwalls which allow music to pass through, so when a partying student puts music on, it will be heard in every room. However, we can place somethickwalls on any edges — thick walls don't allow music to pass through them.The university wants to install some thick walls so that every partying student can play music, and no sleepy student can hear it.Because the university lost a lot of money in a naming rights lawsuit, they ask you to find the minimum number of thick walls they will need to use.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 1000$$$) — the number of test cases.The first line of each test case contains an integer $$$n$$$ ($$$2 \\\\leq n \\\\leq 10^5$$$) — the number of vertices in the tree.The second line of each test case contains $$$n-1$$$ integers $$$a_2, \\\\dots , a_n$$$ ($$$1 \\\\leq a_i < i$$$) — it means there is an edge between $$$i$$$ and $$$a_i$$$ in the tree.The third line of each test case contains a string $$$s$$$ of length $$$n$$$ consisting of characters $$$\\\\texttt{P}$$$, $$$\\\\texttt{S}$$$, and $$$\\\\texttt{C}$$$, denoting that student $$$i$$$ is of type $$$s_i$$$.The sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.OutputFor each test case, output a single integer — the minimum number of thick walls needed.ExampleInput331 1CSP41 2 2PCSS41 2 2PPSSOutput1 1 2NoteIn the first case, we can install one thick wall between rooms $$$1$$$ and $$$2$$$, as shown below. We cannot install $$$0$$$ walls, since then the music from room 3 will reach room 2 where a student wants to sleep, so the answer is $$$1$$$. There are other valid solutions.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a8c4fdc3", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices, where each vertex represents a room and an edge represents a connection between two rooms.  Each room has a student who can be of three types:\n\n*  **P:** Wants to play music.\n*  **S:** Wants to sleep in silence.\n*  **C:** Doesn't care about music.\n\nInitially, sound can travel freely between any two connected rooms. You can build \"thick walls\" on some edges to block sound.\n\nThe goal is to find the minimum number of thick walls needed so that:\n\n* Every student who wants to play music can do so without disturbing any student who wants to sleep.\n\n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "f1c14c5c", "template_md5": "465699a0", "result": "You are given a tree-shaped network with nodes representing rooms. Each room has a type: party, sleep, or neutral.  You can add walls to some connections in the network to block sound.  Find the fewest walls needed so that every party room can play music without disturbing any sleep rooms."}]}