{"uid": "1926-F", "url": "https://codeforces.com/contest/1926/problem/F", "tags": ["bitmasks", " brute force", " dfs and similar", " dp", " implementation"], "title": "1926-F", "statement": "F. Vlad and Avoiding Xtime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVladislav has a grid of size $$$7 \\\\times 7$$$, where each cell is colored black or white. In one operation, he can choose any cell and change its color (black $$$\\\\leftrightarrow$$$ white).Find the minimum number of operations required to ensure that there are no black cells with four diagonal neighbors also being black.The left image shows that initially there are two black cells violating the condition. By flipping one cell, the grid will work.InputThe first line of input contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 200$$$) — the number of test cases. Then follows the description of the test cases.Each test case consists of $$$7$$$ lines, each containing $$$7$$$ characters. Each of these characters is either $$$\\\\texttt{W}$$$ or $$$\\\\texttt{B}$$$, denoting a white or black cell, respectively.OutputFor each test case, output a single integer — the minimum number of operations required to ensure that there are no black cells with all four diagonal neighbors also being black.ExampleInput4WWWWWWWWWWWBBBWWWWWBWWWBBBBBWWWBWWWWWBBBWWWWWWWWWWWWWWWWWWWWWWWWBBBBBWWBBBBBWWBBBBBWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWBBBBBWBBBBBBBBBBBBBBWWWWWWWBBBBBBBBBBBBBBBBBBBBBOutput1 2 0 5NoteThe first test case is illustrated in the statement.The second test case is illustrated below:In the third test case, the grid already satisfies the condition.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "67dab953", "template_md5": "35d339e4", "result": "You are given a 7x7 grid of black and white cells.  You can change the color of any cell from black to white or white to black in one operation.  Find the minimum number of operations needed so that there are no black cells with all four of its diagonally adjacent cells also being black. \n\nInput:\n\nThe first line contains the number of test cases (t). Each test case consists of 7 lines, each with 7 characters representing the grid. 'W' represents a white cell and 'B' represents a black cell.\n\nOutput:\n\nFor each test case, output the minimum number of operations needed."}, {"prompt_md5": "48d3951b", "template_md5": "465699a0", "result": "You are given a 7x7 grid of black and white squares. You can change the color of any square. Find the fewest changes needed so that no square has all four diagonally adjacent squares also black."}]}