{"uid": "1927-A", "url": "https://codeforces.com/contest/1927/problem/A", "tags": ["greedy", " strings"], "title": "1927-A", "statement": "A. Make it Whitetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have a horizontal strip of $$$n$$$ cells. Each cell is either white or black.You can choose acontinuoussegment of cells once and paint them all white. After this action, all the black cells in this segment will become white, and the white ones will remain white.What is the minimum length of the segment that needs to be painted white in order for all $$$n$$$ cells to become white?InputThe first line of the input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. The descriptions of the test cases follow.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10$$$) — the length of the strip.The second line of each test case contains a string $$$s$$$, consisting of $$$n$$$ characters, each of which is either'W'or'B'. The symbol'W'denotes a white cell, and'B'— a black one. It is guaranteed that at least one cell of the given strip is black.OutputFor each test case, output a single number — the minimum length of acontinuoussegment of cells that needs to be painted white in order for theentirestrip to become white.ExampleInput86WBBWBW1B2WB3BBW4BWWB6BWBWWB6WWBBWB9WBWBWWWBWOutput4 1 1 2 4 6 4 7NoteIn the first test case of the example for the strip \"WBBWBW\", the minimum length of the segment to be repainted white is $$$4$$$. It is necessary to repaint to white the segment from the $$$2$$$-nd to the $$$5$$$-th cell (the cells are numbered from $$$1$$$ from left to right).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fc563bb8", "template_md5": "35d339e4", "result": "You have a line of $n$ cells. Each cell is either white (W) or black (B). You can choose a continuous group of cells and paint them white.  After painting, all black cells in that group become white, and white cells stay white. What is the shortest group of cells you need to paint to make the entire line white?\n\nInput:\n\n* The first line has a number $t$ (1 to 10,000) representing the number of test cases.\n* Each test case starts with a number $n$ (1 to 10) representing the number of cells.\n* The next line has a string of $n$ characters, 'W' or 'B', representing the color of each cell.\n\nOutput:\n\n* For each test case, print the shortest length of a group of cells you need to paint to make the entire line white."}, {"prompt_md5": "c991cb36", "template_md5": "465699a0", "result": "You have a line of cells that are either white or black. You can paint a continuous section of cells white, turning all black cells in that section white. What is the shortest section you need to paint to make all the cells white?"}]}