{"uid": "193-B", "url": "https://codeforces.com/contest/193/problem/B", "tags": ["brute force"], "title": "193-B", "statement": "B. Xortime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutJohn Doe has four arrays:a,b,k, andp. Each array consists ofnintegers. Elements of all arrays are indexed starting from1. Arraypis a permutation of integers1ton.John invented a game for his friends and himself. Initially a player is given arraya. The player must consecutively execute exactlyuoperations ona. You are permitted to execute the following operations:Operation 1: For eachchangeaiinto. Expressionmeans applying the operation of a bitwise xor to numbersxandy. The given operation exists in all modern programming languages, for example, in languageC++andJavait is marked as \"^\", inPascal— as \"xor\".Operation 2: For eachchangeaiintoapi+r. When this operation is executed, all changes are made at the same time.After alluoperations are applied, the number of points the player gets is determined by the formula.John wants to find out what maximum number of points a player can win in his game. Help him.InputThe first line contains space-separated integersn,uandr(1 ≤n,u≤ 30,0 ≤r≤ 100) — the number of elements in each array, the number of operations and the number that describes one of the operations.Each of the next four lines containsnspace-separated integers — arraysa,b,k,p. The first line has arraya, the second line has arrayb, the third line has arraykand the fourth one has arrayp.It is guaranteed that elements of arraysaandbare positive and do not exceed104(1 ≤ai,bi≤ 104), elements of arraykdo not exceed104in the absolute value(|k| ≤ 104)andpis a permutation of numbers from1ton.OutputOn a single line print numbers— the maximum number of points that a player can win in John's game.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput3 2 17 7 78 8 81 2 31 3 2Output96Input2 1 01 11 11 -11 2Output0NoteIn the first sample you should first apply the operation of the first type, then the operation of the second type.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b25ac6bf", "template_md5": "35d339e4", "result": "You are given four arrays: a, b, k, and p. Each array has n integers. Array p is a permutation of the integers from 1 to n.\n\nYou can perform the following operations on array a:\n\n* **Operation 1:** For each element $a_i$, perform a bitwise XOR operation with $b_i$ (denoted as $a_i \\oplus b_i$).\n* **Operation 2:** For each element $a_i$, add $k_i$ to it.\n\nYou can perform exactly u of these operations. After applying all operations, the score is calculated as:\n\n$\\sum_{i=1}^{n} a_i \\cdot p_i$\n\nFind the maximum possible score.\n\n**Input:**\n\n* The first line contains four space-separated integers: n, u, r (1 ≤ n, u ≤ 30, 0 ≤ r ≤ 100).\n* The next four lines each contain n space-separated integers: a, b, k, and p.\n\n**Output:**\n\n* Print a single integer representing the maximum possible score."}, {"prompt_md5": "aea673b4", "template_md5": "465699a0", "result": "You are given four arrays of numbers.  You can perform two types of operations on the first array:\n\n1. Apply a bitwise XOR operation to each element of the array with a given number.\n2. Add a given number to each element of the array.\n\nYou can perform these operations a limited number of times.  Your goal is to find the maximum possible sum of the elements in the first array after performing the operations."}]}