{"uid": "1931-G", "url": "https://codeforces.com/contest/1931/problem/G", "tags": ["combinatorics", " math", " number theory"], "title": "1931-G", "statement": "G. One-Dimensional Puzzletime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have a one-dimensional puzzle, all the elements of which need to be put in one row, connecting with each other. All the puzzle elements are completely white and distinguishable from each other only if they have different shapes.Each element has straight borders at the top and bottom, and on the left and right it has connections, each of which can be a protrusion or a recess. Youcannotrotate the elements.You can see that there are exactly $$$4$$$ types of elements. Two elements can be connected if the right connection of the left element is opposite to the left connection of the right element.All possible types of elements.The puzzle contains $$$c_1, c_2, c_3, c_4$$$ elements of each type. The puzzle is considered complete if you have managed to combineallelements into one long chain. You want to know how many ways this can be done.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 2 \\\\cdot 10^5$$$) — the number of input test cases. The descriptions of the test cases follow.The description of each test case contains $$$4$$$ integers $$$c_i$$$ ($$$0 \\\\le c_i \\\\le 10^6$$$) — the number of elements of each type, respectively.It is guaranteed that the sum of $$$c_i$$$ for all test cases does not exceed $$$4 \\\\cdot 10^6$$$.OutputFor each test case, print one integer — the number of possible ways to solve the puzzle.Two methods are considered different if there is $$$i$$$, such that the types of elements at the $$$i$$$ position in these methods differ.Since the answer can be very large, output it modulo $$$998244353$$$.If it is impossible to solve the puzzle, print $$$0$$$.ExampleInput111 1 1 11 2 5 104 6 100 200900000 900000 900000 9000000 0 0 00 0 566 2391 0 0 0100 0 100 00 0 0 45 5 0 25 4 0 5Output4 66 0 794100779 1 0 1 0 1 36 126", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5b92f2a8", "template_md5": "35d339e4", "result": "You have a puzzle with 4 types of pieces. Each piece has a shape with connections on the left and right sides.  The connections can be a protrusion or a recess.  \n\nTwo pieces can be connected if the right connection of the left piece matches the left connection of the right piece.\n\nYou are given the number of pieces of each type.  \n\nYour task is to determine how many ways you can arrange all the pieces into a single line, connecting them correctly.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* Each test case has four integers, $c_1$, $c_2$, $c_3$, and $c_4$, representing the number of pieces of each type.\n\n**Output:**\n\n* For each test case, print the number of ways to arrange the pieces, modulo 998244353. If it's impossible to arrange the pieces, print 0."}, {"prompt_md5": "d058bd16", "template_md5": "465699a0", "result": "You have a puzzle with 4 types of pieces. Each piece has a shape that allows it to connect to other pieces in a specific way. You need to figure out how many ways you can arrange all the pieces into a single line.  \n\n\n\nLet me know if you'd like me to elaborate on any specific aspect of the puzzle's connection rules."}]}