{"uid": "1936-B", "url": "https://codeforces.com/contest/1936/problem/B", "tags": ["binary search", " data structures", " implementation", " math", " two pointers"], "title": "1936-B", "statement": "B. Pinballtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is a one-dimensional grid of length $$$n$$$. The $$$i$$$-th cell of the grid contains a character $$$s_i$$$, which is either '<' or '>'.When a pinball is placed on one of the cells, it moves according to the following rules:If the pinball is on the $$$i$$$-th cell and $$$s_i$$$ is '<', the pinball moves one cell to the left in the next second. If $$$s_i$$$ is '>', it moves one cell to the right.After the pinball has moved, the character $$$s_i$$$ is inverted (i. e. if $$$s_i$$$ used to be '<', it becomes '>', and vice versa).The pinball stops moving when it leaves the grid: either from the left border or from the right one.You need to answer $$$n$$$independentqueries. In the $$$i$$$-th query, a pinball will be placed on the $$$i$$$-th cell. Note that we always place a pinball on the initial grid.For each query, calculate how many seconds it takes the pinball to leave the grid. It can be shown that the pinball will always leave the grid within a finite number of steps.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 10^5$$$). The description of the test cases follows.The first line of each test case contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le 5 \\\\cdot 10^5$$$).The second line of each test case contains a string $$$s_1s_2 \\\\ldots s_{n}$$$ of length $$$n$$$ consisting of characters '<' and '>'.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$5 \\\\cdot 10^5$$$.OutputFor each test case, for each $$$i$$$ ($$$1 \\\\le i \\\\le n$$$) output the answer if a pinball is initially placed on the $$$i$$$-th cell.ExampleInput33><<4<<<<6<><<<>Output3 6 5  1 2 3 4  1 4 7 10 8 1NoteIn the first test case, the movement of the pinball for $$$i=1$$$ is shown in the following pictures. It takes the pinball $$$3$$$ seconds to leave the grid.The movement of the pinball for $$$i=2$$$ is shown in the following pictures. It takes the pinball $$$6$$$ seconds to leave the grid.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b304fc8f", "template_md5": "35d339e4", "result": "You are given a line of $n$ cells, each containing either a '<' or a '>' character.  A pinball is placed on each cell, one at a time.  \n\nWhen the pinball is on a cell with a '<', it moves one cell to the left. When it is on a cell with a '>', it moves one cell to the right.\n\nAfter each move, the character in the cell is flipped ( '<' becomes '>' and '>' becomes '<').\n\nThe pinball continues moving until it reaches the edge of the line.\n\nFor each cell, determine how many seconds it takes for the pinball to leave the line. \n\n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of cells, $n$.\n    * The second line contains a string of $n$ characters, each either '<' or '>', representing the initial state of the line.\n\nOutput:\n\n* For each test case, output $n$ numbers, each representing the number of seconds it takes for the pinball to leave the line when placed on the corresponding cell."}, {"prompt_md5": "c89ee521", "template_md5": "465699a0", "result": "You are given a line of characters, each character is either '<' or '>'.  A ball starts at a given position on the line. If the character is '<', the ball moves one position to the left. If the character is '>', the ball moves one position to the right. After each move, the character is flipped. The ball keeps moving until it reaches the edge of the line. For each starting position, determine how many moves it takes for the ball to leave the line."}]}