{"uid": "1941-C", "url": "https://codeforces.com/contest/1941/problem/C", "tags": ["dp", " greedy", " strings"], "title": "1941-C", "statement": "C. Rudolf and the Ugly Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRudolf has a string $$$s$$$ of length $$$n$$$. Rudolf considers the string $$$s$$$ to be ugly if it contains the substring$$$^\\\\dagger$$$ \"pie\" or the substring \"map\", otherwise the string $$$s$$$ will be considered beautiful.For example, \"ppiee\", \"mmap\", \"dfpiefghmap\" are ugly strings, while \"mathp\", \"ppiiee\" are beautiful strings.Rudolf wants to shorten the string $$$s$$$ by removing some characters to make it beautiful.The main character doesn't like to strain, so he asks you to make the string beautiful by removing the minimum number of characters. He can remove characters fromanypositions in the string (not just from the beginning or end of the string).$$$^\\\\dagger$$$ String $$$a$$$ is a substring of $$$b$$$ if there exists aconsecutivesegment of characters in string $$$b$$$ equal to $$$a$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. The descriptions of the test cases follow.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^6$$$) — the length of the string $$$s$$$.The next line of each test case contains the string $$$s$$$ of length $$$n$$$. The string $$$s$$$ consists of lowercase Latin letters.The sum of $$$n$$$ over all test cases does not exceed $$$10^6$$$.OutputFor each test case, output a single integer — the minimum number of characters that need to be deleted to make the string $$$s$$$ beautiful. If the string is initially beautiful, then output $$$0$$$.ExampleInput69mmapnapie9azabazapi8mappppie18mapmapmapmapmapmap1p11pppiepieeeeOutput2 0 2 6 0 2NoteIn the first test case, for example, you can delete the $$$4$$$th and $$$9$$$th characters to make the string beautiful.In the second test case, the string is already beautiful.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "34f165f0", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  The string is considered \"ugly\" if it contains the substring \"pie\" or \"map\".  \n\nYour task is to find the minimum number of characters you need to remove from the string to make it no longer \"ugly\". If the string is already not \"ugly\", output 0."}, {"prompt_md5": "e9aa82cd", "template_md5": "465699a0", "result": "Given a string, determine the minimum number of characters to remove to make it not contain the substrings \"pie\" or \"map\".  If the string is already free of these substrings, output 0."}]}