{"uid": "1945-D", "url": "https://codeforces.com/contest/1945/problem/D", "tags": ["dp", " greedy"], "title": "1945-D", "statement": "D. Seraphim the Owltime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe guys lined up in a queue of $$$n$$$ people, starting with person number $$$i = 1$$$, to ask Serafim the Owl about the meaning of life. Unfortunately, Kirill was very busy writing the legend for this problem, so he arrived a little later and stood at the end of the line after the $$$n$$$-th person. Kirill is completely dissatisfied with this situation, so he decided to bribe some people ahead of him.For the $$$i$$$-th person in the queue, Kirill knows two values: $$$a_i$$$ and $$$b_i$$$. If at the moment Kirill is standing at position $$$i$$$, then he can choose any position $$$j$$$ such that $$$j < i$$$ and exchange places with the person at position $$$j$$$. In this case, Kirill will have to pay him $$$a_j$$$ coins. And for each $$$k$$$ such that $$$j < k < i$$$, Kirill will have to pay $$$b_k$$$ coins to the person at position $$$k$$$. Kirill can perform this action any number of times.Kirill is thrifty, so he wants to spend as few coins as possible, but he doesn't want to wait too long, so Kirill believes he should be among the first $$$m$$$ people in line.Help Kirill determine the minimum number of coins he will have to spend in order to not wait too long.InputEach test consists of several sets of input data. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. Then follows the description of the test case.The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le m \\\\le n \\\\le 200\\\\,000$$$) — the number of people in the queue besides Kirill and the maximum allowable final position of Kirill, respectively.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ separated by spaces ($$$1 \\\\le a_i \\\\le 10^9$$$).The third line contains $$$n$$$ integers $$$b_1, b_2, \\\\dots, b_n$$$ separated by spaces ($$$1 \\\\le b_i \\\\le 10^9$$$).It is guaranteed that the sum of the values of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, output a single integer — the minimum number of coins Kirill needs to spend.ExampleInput44 27 3 6 94 3 8 56 26 9 7 1 8 35 8 8 1 4 17 77 2 9 2 6 5 99 1 10 7 1 4 92 12 31 1Output14 22 9 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f0c624f7", "template_md5": "35d339e4", "result": "There are $n$ people in a line. You want to get into the line within the first $m$ positions. You can bribe people in front of you to switch places. \n\nTo switch places with the $j$th person, you pay them $a_j$ coins.  For each person between $j$ and you (excluding $j$), you pay them $b_i$ coins.\n\nFind the minimum number of coins you need to spend to get into the first $m$ positions.\n\nInput:\n\n* $t$: the number of test cases\n* For each test case:\n    * $n$: the number of people in the line\n    * $m$: the maximum allowed position you want to be in\n    * $a_1, a_2, ..., a_n$: the bribe amounts for each person\n    * $b_1, b_2, ..., b_n$: the amounts paid to people between you and the person you switch with\n\nOutput:\n\n* For each test case, output the minimum number of coins needed."}, {"prompt_md5": "b4cb83b9", "template_md5": "465699a0", "result": "You are in a line of people. You want to move to a specific position in the line that is closer to the front. You can swap places with someone in front of you, but it costs money.  The cost depends on the person you swap with and the people between you. Find the cheapest way to get to your desired position."}]}