{"uid": "1948-B", "url": "https://codeforces.com/contest/1948/problem/B", "tags": ["brute force", " dp", " greedy", " implementation"], "title": "1948-B", "statement": "B. Array Fixtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an integer array $$$a$$$ of length $$$n$$$.You can perform the following operation any number of times (possibly zero): take any element of the array $$$a$$$, which is at least $$$10$$$, delete it, and instead insert the digits that element consisted of in the same position, in order they appear in that element.For example:if we apply this operation to the $$$3$$$-rd element of the array $$$[12, 3, 45, 67]$$$, then the array becomes $$$[12, 3, 4, 5, 67]$$$.if we apply this operation to the $$$2$$$-nd element of the array $$$[2, 10]$$$, then the array becomes $$$[2, 1, 0]$$$.Your task is to determine whether it is possible to make $$$a$$$ sorted in non-descending order using the aforementioned operationany number of times (possibly zero). In other words, you have to determine if it is possible to transform the array $$$a$$$ in such a way that $$$a_1 \\\\le a_2 \\\\le \\\\dots \\\\le a_k$$$, where $$$k$$$ is the current length of the array $$$a$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^3$$$) — the number of test cases.Each test case consists of two lines:the first line contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 50$$$).the second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$0 \\\\le a_i \\\\le 99$$$).OutputFor each test case, printYESif it is possible to make $$$a$$$ sorted in non-decreasing order using the aforementioned operation; otherwise, printNO.You can print each letter in any case. For example,yes,Yes,YeSwill all be recognized as a positive answer.ExampleInput3412 3 45 67312 28 520 0OutputYES NO YESNoteIn the first example, you can split the first element, then the array becomes $$$[1, 2, 3, 45, 67]$$$.In the second example, there is no way to get a sorted array.In the third example, the array is already sorted.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "df684d2f", "template_md5": "35d339e4", "result": "You are given an array of integers. You can perform the following operation any number of times:\n\n1. Choose an integer in the array that is at least 10.\n2. Remove that integer from the array.\n3. Insert the individual digits of that integer back into the array, in the same order they appear in the original integer.\n\nDetermine if it is possible to sort the array in non-decreasing order using this operation.\n\n**Input:**\n\n* The first line contains the number of test cases,  *t*.\n* Each test case has two lines:\n    * The first line contains the length of the array, *n*.\n    * The second line contains *n* integers, representing the elements of the array.\n\n**Output:**\n\nFor each test case, print \"YES\" if it is possible to sort the array, and \"NO\" otherwise."}, {"prompt_md5": "6171b424", "template_md5": "465699a0", "result": "You are given a list of numbers. You can split any number in the list that is at least 10 into its individual digits and insert those digits into the list.  Can you rearrange the list so that the numbers are in order from smallest to largest?"}]}