{"uid": "1949-C", "url": "https://codeforces.com/contest/1949/problem/C", "tags": ["dfs and similar", " dp", " greedy", " trees"], "title": "1949-C", "statement": "C. Annual Ants' Gatheringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDeep within a forest lies an ancient tree, home to $$$n$$$ ants living in $$$n$$$ tiny houses, indexed from $$$1$$$ to $$$n$$$, connected by the branches of the tree.Once a year, all the ants need to gather to watch the EUC. For this, all ants move along the $$$n-1$$$ branches of the tree they live on to meet at the home of one ant.However, this year the ants could not agree on where to meet and need your help to gather up. You can tell all the ants currently at house $$$u$$$ to move to house $$$v$$$ if there is a branch directly connecting those two houses. However, the ants ignore your command if there are fewer ants gathered in house $$$v$$$ than in house $$$u$$$, i.e., if it would be easier for the ants from house $$$v$$$ to move. This even holds true if no ant at all is currently in house $$$v$$$. You can give this kind of commands as many times as you want.Is it possible for you to gather all the ants in a single house?InputThe first line contains one integer $$$n$$$ ($$$1\\\\leq n\\\\leq 200\\\\,000$$$) — the number of ant homes.Each of the following $$$n-1$$$ lines contains two integers $$$u$$$ and $$$v$$$ ($$$1\\\\leq u, v\\\\leq n$$$) — there is a branch directly connecting the house $$$u$$$ and house $$$v$$$. It is guaranteed that every ant can reach the house of any other ant just by following the branches of the tree.OutputPrint $$$\\\\texttt{YES}$$$ if it is possible to gather all the ants in a single house. Otherwise, print $$$\\\\texttt{NO}$$$.ExamplesInput75 13 24 63 67 11 3OutputYESInput51 44 23 25 3OutputNOInput64 55 66 12 63 2OutputYESNoteIn thefirst sample, you can gather all the ants at house $$$3$$$ as follows:You tell to the ant at house $$$4$$$ to move to house $$$6$$$.You tell to the ant at house $$$2$$$ to move to house $$$3$$$.You tell to the two ants at house $$$6$$$ to move to house $$$3$$$ (which already contains two ants).You tell to the ant at house $$$5$$$ to move to house $$$1$$$.You tell to the ant at house $$$7$$$ to move to house $$$1$$$ (which already contains two ants).You tell to the three ants at house $$$1$$$ to move to house $$$3$$$ (which already contains four ants).In thesecond sample, it is impossible to gather all the ants in a single house.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6c45f721", "template_md5": "35d339e4", "result": "There are $n$ houses connected by $n-1$ branches, forming a tree. Each house has at least one ant. You can tell ants in one house to move to another connected house if there are more ants in the source house than the destination house.  \n\nCan you move all the ants into a single house? \n\nIf yes, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "3925b621", "template_md5": "465699a0", "result": "You have a tree with $n$ nodes. Each node has a number of people. You can move people from one node to another if the destination node has fewer people than the source node. Can you move all the people to a single node?"}]}