{"uid": "1949-G", "url": "https://codeforces.com/contest/1949/problem/G", "tags": ["graphs", " greedy"], "title": "1949-G", "statement": "G. Scootertime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThe Czech Technical University campus consists of $$$n$$$ buildings, indexed from $$$1$$$ to $$$n$$$. In each building, there can be a math class scheduled, or a computer science class, or neither (but not both). Additionally, in each building, there is at most one professor, and each professor is either an expert in mathematics or in computer science.As an intern at University Express Inc., your job is to quickly transport the professors to their classes. For this, you have been granted a brand new two-person scooter, able to accommodate yourself, plus at most one passenger.Initially, you are the only person on the scooter. When you arrive at a building, you may drop off or pick up professors to/from that building. However, in order to improve the efficiency of your task, you are allowed to drive to each of the $$$n$$$ buildingsat most once, in the order of your choice (you can also decide where to start the itinerary).After the end of your itinerary, in each building where a math class is scheduled, there must be a professor expert in math, and in each building where a computer science class is scheduled, there must be a professor expert in computer science.Devise an itinerary that makes it possible to teach all classes.InputThe first line contains an integer $$$n$$$ ($$$1\\\\le n \\\\le 2000$$$) — the number of buildings in the campus.The second line contains a string of $$$c$$$ of length $$$n$$$ consisting of the characters $$$\\\\texttt{-}$$$, $$$\\\\texttt{C}$$$, $$$\\\\texttt{M}$$$ — the $$$i$$$-th character denotes the subject of the class scheduled in the $$$i$$$-th building. $$$\\\\texttt{C}$$$ stands for computer science, $$$\\\\texttt{M}$$$ stands for mathematics, while $$$\\\\texttt{-}$$$ means that there is no class scheduled in the $$$i$$$-th building.The third line contains a string $$$p$$$ of length $$$n$$$ consisting of the characters $$$\\\\texttt{-}$$$, $$$\\\\texttt{C}$$$, $$$\\\\texttt{M}$$$ — the $$$i$$$-th character denotes the expertise of the professor in the $$$i$$$-th building (if there is a professor). $$$\\\\texttt{C}$$$ stands for computer science, $$$\\\\texttt{M}$$$ stands for mathematics, while $$$\\\\texttt{-}$$$ means that there is no professor in the $$$i$$$-th building.It is guaranteed that, for all tests given to your program, there exists a valid itinerary.OutputIn the first line print an integer $$$l$$$ — the number of operations in your chosen itinerary.The $$$i$$$-th ($$$1 \\\\leq i \\\\leq l$$$) of the next $$$l$$$ lines must contain one of three commands:$$$\\\\texttt{DRIVE } x$$$ — go to the building with the number $$$x$$$ ($$$1 \\\\leq x \\\\leq n$$$);$$$\\\\texttt{PICKUP}$$$ — pick up the professor which wasinitiallyat the current building;$$$\\\\texttt{DROPOFF}$$$ — drop off the passenger professor at the current building.In order for the itinerary to be valid, the following conditions must hold:No two $$$\\\\texttt{DRIVE}$$$ instructions should go to the same building;At most one $$$\\\\texttt{DROPOFF}$$$ and one $$$\\\\texttt{PICKUP}$$$ instructionin this ordershould be issued at each specific building;For all $$$\\\\texttt{PICKUP}$$$ instructions, there must be a professorinitiallyat the building, as well as no one already riding along on the scooter;For all $$$\\\\texttt{DROPOFF}$$$ instructions, there must be a professor riding along at the time of the command;After the itinerary, in each building, if there is a class in that building, there must be a professor expert in the class' subject (either initially, or because they were dropped off there).Note that, in particular, you cannot pick up a professor that you just dropped off for an itinerary to be valid.ExamplesInput3CM--CMOutput7 DRIVE 3 PICKUP DRIVE 2 DROPOFF PICKUP DRIVE 1 DROPOFFInput1CCOutput0Input2-MMCOutput4 DRIVE 1 PICKUP DRIVE 2 DROPOFFNoteIn thefirst sample, You start by driving to building number $$$3$$$. You then pick up the mathematics professor. After dropping him off at building number $$$2$$$, where a mathematics class is being held, you pick up the computer science professor from there, and drop her off at building number $$$1$$$, finishing your itinerary.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b11755b3", "template_md5": "35d339e4", "result": "You have $n$ buildings, each of which can have either a math class, a computer science class, or no class. Each building also has either a math professor or a computer science professor, or no professor.\n\nYou have a scooter that can carry two people. You start with no passengers. You can visit each building at most once in any order.\n\nYour goal is to create a plan to visit the buildings and move professors so that:\n\n* Every building with a math class has a math professor.\n* Every building with a computer science class has a computer science professor.\n\nYou can perform the following actions:\n\n* **DRIVE x:** Go to building $x$.\n* **PICKUP:** Pick up the professor in the current building.\n* **DROPOFF:** Drop off the professor currently riding with you.\n\nThe plan must follow these rules:\n\n* You can only visit each building once.\n* You can only pick up a professor if there is one in the current building and you are not already carrying a passenger.\n* You can only drop off a professor if you are carrying one.\n\n\n\nThe input will give you a description of the classes and professors in each building. The output should be a list of actions to follow to complete the task."}, {"prompt_md5": "aa1467c7", "template_md5": "465699a0", "result": "You have a set of buildings, each with a class (math or computer science) or no class. Each building has a professor who is either a math or computer science expert, or no professor. You need to create a route to visit each building exactly once, picking up and dropping off professors to ensure each class has a professor of the correct subject."}]}