{"uid": "1949-E", "url": "https://codeforces.com/contest/1949/problem/E", "tags": ["brute force", " math"], "title": "1949-E", "statement": "E. Damage per Secondtime limit per test5 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputYou just created a new character in your favourite role-playing game and now have to decide how to skill him.The two skill attributes to be chosen are:damage per hitandhits per second. Damage per hit is the amount of damage you deal with a single hit, while hits per second is the number of hits you can make in one second. Initially, both skill attributes are set at $$$0$$$. You have $$$k$$$ skill points to distribute as you want; in other words, you can choose the values of the two skills so that they are positive integers with sum at most $$$k$$$.The tutorial of the game (the boring part you want to finish as soon as possible) consists of $$$n$$$ monsters to be killed one after the other. The $$$i$$$-th monster has $$$h_i$$$ health points, i.e., it dies after you have inflicted at least $$$h_i$$$ damage.How can you assign the two skill attributes to minimize the time necessary to kill all the $$$n$$$ monsters?InputThe first line contains two integers $$$n$$$ and $$$k$$$ ($$$1\\\\leq n\\\\leq200\\\\,000$$$, $$$2\\\\leq k\\\\leq200\\\\,000$$$) — the number of enemies and the number of skill points.The second line contains $$$n$$$ integers $$$h_i$$$ ($$$1\\\\leq h_i\\\\leq10^{13}$$$) — the health of the $$$i$$$th enemy.OutputPrint two positive integers $$$x$$$ and $$$y$$$ ($$$1\\\\le x, y$$$ and $$$x+y\\\\le k$$$) — the number of skill points you want to invest in damage per hit and hits per second. If there are multiple optimal solutions, print any of them.ExamplesInput1 714Output3 4Input4 91 2 3 4Output4 5Input5 133 4 5 6 7Output7 6NoteIn thefirst sample, there is only one monster and you have $$$7$$$ skill points to distribute. If you make $$$3$$$ damage per hit, you will need $$$5$$$ hits to kill it. If you do $$$4$$$ hits per second, you will need $$$1.25$$$ seconds to beat the monster. There is no way to beat the monster faster than this.In thesecond sample, you will need one hit for each monster and a total time of $$$0.8$$$ seconds if you distribute $$$4$$$ skill points on damage per hit and the remaining $$$5$$$ points on hits per second.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8129c1b8", "template_md5": "35d339e4", "result": "You have $k$ skill points to distribute between two attributes: damage per hit ($x$) and hits per second ($y$).  You need to minimize the time it takes to kill $n$ monsters. Each monster has a certain amount of health points ($h_i$).\n\n**Input:**\n\n* The first line contains two integers, $n$ (the number of monsters) and $k$ (the number of skill points).\n* The second line contains $n$ integers, $h_1$, $h_2$, ..., $h_n$ (the health points of each monster).\n\n**Output:**\n\n* Print two integers, $x$ and $y$, representing the skill points allocated to damage per hit and hits per second, respectively. \n\n**Constraints:**\n\n* $1 \\le n \\le 200,000$\n* $2 \\le k \\le 200,000$\n* $1 \\le h_i \\le 10^{13}$\n* $1 \\le x, y$\n* $x + y \\le k$"}, {"prompt_md5": "39546c81", "template_md5": "465699a0", "result": "You have a limited number of points to spend on two abilities: damage per hit and hits per second. You need to defeat a series of enemies, each with a different amount of health.  Find the best combination of points to spend on each ability to defeat all enemies as quickly as possible."}]}