{"uid": "1952-J", "url": "https://codeforces.com/contest/1952/problem/J", "tags": ["brute force", " constructive algorithms", " expression parsing", " implementation", " sortings"], "title": "1952-J", "statement": "J. Help, what does it mean to be \"Based\"time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputInputSup, gimme a single integer $$$x$$$ ($$$1 \\\\le x \\\\le 4$$$) homie uwu :3OutputIf $$$x = 1$$$, spit out some based code that, like when ya feed it two integers $$$a$$$ and $$$b$$$, it hands over their sum.If $$$x = 2$$$, slap some based code that takes an integer $$$a$$$ and returns its absolute value like magic, no cap.If $$$x = 3$$$, check this out: blaze some based code that grabs an integer $$$n$$$ ($$$1 \\\\le n \\\\le 50$$$) and an array $$$a$$$ of $$$n$$$ distinct integers, then flexes the maximum value real quick.If $$$x = 4$$$, toss me some based code that snatches an integer $$$n$$$ ($$$1 \\\\le n \\\\le 50$$$), an array $$$a$$$ of $$$n$$$ distinct integers and an integer $$$k$$$ ($$$1 \\\\le k \\\\le n$$$), then nails down that $$$k$$$-th largest value in the array. Get it, fam!ExamplesInput1Outputyoink a yoink b *slaps a on top of b* yeet b go touch some grassInput2Outputyoink a bruh b is lowkey just 0 rip this b fell off by a vibe check a ratios b simp for 7 bruh a is lowkey just b yeet a go touch some grassInput3Outputyoink n yoink a bruh m is lowkey just a[0] bruh i is lowkey just 1 vibe check n ratios i simp for 9 yeet m go touch some grass vibe check a[i] ratios m bruh m is lowkey just a[i] *slaps 1 on top of i* simp for 5Input4OutputNoteSlide into the \"My Submissions\" page and vibe check ur code by clicking on its ID. You'll see just how based or cringe it is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "09806020", "template_md5": "35d339e4", "result": "You are given an integer $x$ ($1 \\le x \\le 4$).  Write code based on the value of $x$:\n\n* If $x = 1$, write a function that takes two integers $a$ and $b$ and returns their sum.\n* If $x = 2$, write a function that takes an integer $a$ and returns its absolute value.\n* If $x = 3$, write a function that takes an integer $n$ ($1 \\le n \\le 50$) and an array of $n$ distinct integers $a$, and returns the maximum value in the array.\n* If $x = 4$, write a function that takes an integer $n$ ($1 \\le n \\le 50$), an array of $n$ distinct integers $a$, and an integer $k$ ($1 \\le k \\le n$), and returns the $k$-th largest value in the array."}, {"prompt_md5": "22520ee2", "template_md5": "465699a0", "result": "You are given a number  $x$ (between 1 and 4). \n\n* If $x$ is 1, write code that takes two numbers and returns their sum.\n* If $x$ is 2, write code that takes a number and returns its absolute value.\n* If $x$ is 3, write code that takes a number and an array of distinct numbers, and returns the largest number in the array.\n* If $x$ is 4, write code that takes a number, an array of distinct numbers, and another number, and returns the k-th largest number in the array."}]}