{"uid": "1954-C", "url": "https://codeforces.com/contest/1954/problem/C", "tags": ["greedy", " math", " number theory"], "title": "1954-C", "statement": "C. Long Multiplicationtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two integers $$$x$$$ and $$$y$$$ of the same length, consisting of digits from $$$1$$$ to $$$9$$$.You can perform the following operation any number of times (possibly zero): swap the $$$i$$$-th digit in $$$x$$$ and the $$$i$$$-th digit in $$$y$$$.For example, if $$$x=73$$$ and $$$y=31$$$, you can swap the $$$2$$$-nd digits and get $$$x=71$$$ and $$$y=33$$$.Your task is to maximize the product of $$$x$$$ and $$$y$$$ using the aforementioned operation any number of times. If there are multiple answers, print any of them.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.The first line of each test case contains a single integer $$$x$$$ ($$$1 \\\\le x < 10^{100}$$$).The second line of each test case contains a single integer $$$y$$$ ($$$1 \\\\le y < 10^{100}$$$).Additional constraint on input: the integers $$$x$$$ and $$$y$$$ consist only of digits from $$$1$$$ to $$$9$$$.OutputFor each test case, print two lines — the first line should contain the number $$$x$$$ after performing the operations; similarly, the second line should contain the number $$$y$$$ after performing the operations. If there are multiple answers, print any of them.ExampleInput373312535163982Output71 33 5 2 3912 3586", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "95af8c57", "template_md5": "465699a0", "result": "You are given two numbers of the same length. Each number is made up of digits from 1 to 9. You can swap the digits in the same position of the two numbers any number of times.  Find the two numbers that will result in the largest possible product after swapping digits."}, {"prompt_md5": "09bcedbd", "template_md5": "35d339e4", "result": "You are given two numbers,  $x$ and $y$,  each consisting of digits from 1 to 9. You can swap the digits in the same position of  $x$ and $y$ any number of times.  Your goal is to find the largest possible product of $x$ and $y$ after performing these swaps. \n\nPrint the final values of $x$ and $y$ that achieve this maximum product. If there are multiple solutions, print any one of them."}]}