{"uid": "1955-A", "url": "https://codeforces.com/contest/1955/problem/A", "tags": ["math"], "title": "1955-A", "statement": "A. Yogurt Saletime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe price of one yogurt at the \"Vosmiorochka\" store is $$$a$$$ burles, but there is a promotion where you can buy two yogurts for $$$b$$$ burles.Maxim needs to buyexactly$$$n$$$ yogurts. When buying two yogurts, he can choose to buy them at the regular price or at the promotion price.What is the minimum amount of burles Maxim should spend to buy $$$n$$$ yogurts?InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le {10}^{4}$$$) — the number of test cases.The first and only line of each test case contains three integers $$$n$$$, $$$a$$$, and $$$b$$$ ($$$1 \\\\le n \\\\le 100$$$, $$$1 \\\\le a, b \\\\le 30$$$) — the number of yogurts Maxim wants to buy, the price for one yogurt, and the price for two yogurts on promotion.OutputFor each test case, print in a separate line the minimum cost of buying $$$n$$$ yogurts at \"Vosmiorochka\".ExampleInput42 5 93 5 93 5 114 5 11Output9 14 15 20NoteIn the third test case of the example, it is more advantageous to buy three yogurts for $$$15$$$ burles than two for $$$11$$$ and one for $$$5$$$.In the fourth test case of the example, you need to buy four yogurts, each for $$$5$$$ burles.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b69704ce", "template_md5": "35d339e4", "result": "A yogurt store has a promotion where you can buy two yogurts for a discounted price ($b$) or buy them individually for $a$ each.  You need to buy exactly $n$ yogurts. What is the minimum amount of money you need to spend? \n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* Each test case has three lines:\n    * $n$: the number of yogurts to buy\n    * $a$: the price of one yogurt\n    * $b$: the price of two yogurts\n\nOutput:\n\n* For each test case, print the minimum cost to buy $n$ yogurts."}, {"prompt_md5": "bbd214bc", "template_md5": "465699a0", "result": "You are given a price for a single item and a discounted price for buying two items.  You need to find the cheapest way to buy a specific number of items."}]}