{"uid": "1955-C", "url": "https://codeforces.com/contest/1955/problem/C", "tags": ["greedy", " implementation", " math"], "title": "1955-C", "statement": "C. Inhabitant of the Deep Seatime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard output$$$n$$$ ships set out to explore the depths of the ocean. The ships are numbered from $$$1$$$ to $$$n$$$ and follow each other in ascending order; the $$$i$$$-th ship has a durability of $$$a_i$$$.The Kraken attacked the ships $$$k$$$ times in a specific order. First, it attacks the first of the ships, then the last, then the first again, and so on.Each attack by the Kraken reduces the durability of the ship by $$$1$$$. When the durability of the ship drops to $$$0$$$, it sinks and is no longer subjected to attacks (thus the ship ceases to be the first or last, and the Kraken only attacks the ships that have not yet sunk). If all the ships have sunk, the Kraken has nothing to attack and it swims away.For example, if $$$n=4$$$, $$$k=5$$$, and $$$a=[1, 2, 4, 3]$$$, the following will happen:The Kraken attacks the first ship, its durability becomes zero and now $$$a = [2, 4, 3]$$$;The Kraken attacks the last ship, now $$$a = [2, 4, 2]$$$;The Kraken attacks the first ship, now $$$a = [1, 4, 2]$$$;The Kraken attacks the last ship, now $$$a = [1, 4, 1]$$$;The Kraken attacks the first ship, its durability becomes zero and now $$$a = [4, 1]$$$.How many ships were sunk after the Kraken's attack?InputThe first line contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$1 \\\\le k \\\\le 10^{15}$$$) — the number of ships and how many times the Kraken will attack the ships.The second line of each test case contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — the durability of the ships.It is guaranteed that the sum of $$$n$$$ for all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, output the number of ships sunk by the Kraken on a separate line.ExampleInput64 51 2 4 34 61 2 4 35 202 7 1 8 22 23 22 151 52 75 2Output2 3 5 0 2 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "723012c4", "template_md5": "35d339e4", "result": "You are given $t$ test cases. Each test case consists of:\n\n* $n$: the number of ships.\n* $k$: the number of attacks.\n* $a$: an array of $n$ integers representing the durability of each ship.\n\nThe attacks happen in a specific pattern:\n\n1. Attack the first ship.\n2. Attack the last ship.\n3. Attack the first ship again.\n4. And so on...\n\nEach attack reduces the durability of a ship by 1. If a ship's durability reaches 0, it sinks and is no longer attacked.\n\nFor each test case, determine the number of ships that sink after all the attacks."}, {"prompt_md5": "cd3b73a4", "template_md5": "465699a0", "result": "You are given a list of numbers representing the durability of ships.  A creature attacks the ships in a repeating pattern: first ship, last ship, first ship, and so on. Each attack reduces a ship's durability by 1.  If a ship's durability reaches 0, it sinks.  Find the number of ships that sink after a given number of attacks."}]}