{"uid": "1958-C", "url": "https://codeforces.com/contest/1958/problem/C", "tags": ["*special"], "title": "1958-C", "statement": "C. Firewoodtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputIt's pretty cold in Berland (yes, even in May). So Monocarp has to light his fireplace.Monocarp has a big log of wood, which weighs $$$2^n$$$ grams. Monocarp has watched the weather forecast and decided that he has to burn $$$k$$$ grams of wood in the fireplace today, and the remaining $$$2^n-k$$$ grams of wood will be used tomorrow.In one minute, Monocarp can use his saw to split one of his logs in half. Initially he has only one log, but of course, after splitting a log, he gets two new logs. If the weight of the log is $$$x$$$, then each of the resulting logs has weight equal to $$$\\\\frac{x}{2}$$$. Monocarp can't split logs of weight $$$1$$$ gram.Monocarp has to cut his log in such a way that some of the resulting logs weigh exactly $$$k$$$ grams in total (and since the total weight of wood doesn't change, the remaining logs will have a total weight equal to exactly $$$2^n-k$$$). Help him to calculate the minimum number of minutes he has to spend cutting the logs.InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Each test case consists of one line containing two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 60$$$; $$$1 \\\\le k \\\\le 2^n-1$$$).OutputFor each test case, print one integer — the minimum number of minutes Monocarp has to spend splitting the wood.ExampleInput42 22 110 350 36679020707840Output1 2 10 16NoteIn the first test case, Monocarp has to cut his log exactly once. Then he will have two logs weighing $$$2$$$ grams each.In the second test case, Monocarp has to cut his log of $$$4$$$ grams once, then cut one of the resulting logs. He will have one log of weight $$$2$$$ and two logs of weight $$$1$$$, so he can use two logs to get exactly $$$3$$$ grams.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ba9b25b0", "template_md5": "35d339e4", "result": "You are given a log of wood that weighs $2^n$ grams. You need to cut the log into pieces so that the total weight of some of the pieces is exactly $k$ grams. The remaining pieces will be used later.\n\nYou can cut a log in half every minute, but you cannot cut a log that weighs 1 gram.\n\nFind the minimum number of minutes it takes to cut the log.\n\nInput:\n\nThe first line contains the number of test cases, $t$.\n\nEach test case contains two integers, $n$ and $k$, where:\n\n* $1 \\le t \\le 10^4$\n* $1 \\le n \\le 60$\n* $1 \\le k \\le 2^n - 1$\n\nOutput:\n\nFor each test case, print the minimum number of minutes it takes to cut the log."}, {"prompt_md5": "fe8ef3fc", "template_md5": "465699a0", "result": "You have a log of wood with a weight of 2^n grams. You need to cut the log into pieces so that the total weight of some pieces is exactly k grams.  You can cut a log in half every minute, but you can't cut a log that weighs 1 gram. Find the minimum number of minutes it takes to cut the log."}]}