{"uid": "1958-J", "url": "https://codeforces.com/contest/1958/problem/J", "tags": ["*special"], "title": "1958-J", "statement": "J. Necromancertime limit per test6 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputMonocarp is playing a computer game. In this game, his character is a necromancer. He is fighting $$$n$$$ monsters numbered from $$$1$$$ to $$$n$$$. Each monster has two parameters: health and strength.Monocarp considers $$$q$$$ scenarios of the battle. In each scenario, he chooses some segment $$$[l, r]$$$ of monsters and calculates the number of moves it takes to defeat all these monsters.Each scenario proceeds as follows. First, Monocarp kills monster $$$l$$$ and revives it as a zombie (this does not count as a move). Then each move the following happens: let $$$i$$$ be the index of the first monster in the segment $$$[l, r]$$$ that is still alive. All zombies attack monster $$$i$$$, reducing its health by their total strength. After that, if monster $$$i$$$ has $$$0$$$ or less health, it dies and Monocarp revives it as a zombie.When the monster is revived, the zombie's strength is equal to the monster's strength.Help Monocarp for each scenario to calculate how many moves it will take to kill all the monsters in the segment.InputThe first line contains two integers $$$n$$$ and $$$q$$$ ($$$1 \\\\le n, q \\\\le 2 \\\\cdot 10^5$$$) — the number of monsters and the number of scenarios, respectively.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^4$$$), where $$$a_i$$$ is the number of health points of the $$$i$$$-th monster.The third line contains $$$n$$$ integers $$$b_1, b_2, \\\\dots, b_n$$$ ($$$1 \\\\le b_i \\\\le 10^4$$$), where $$$b_i$$$ is the strength of the $$$i$$$-th monster.Then $$$q$$$ lines follow. The $$$j$$$-th of them contains two integers $$$l_j$$$ and $$$r_j$$$ ($$$1 \\\\le l_j \\\\le r_j \\\\le n$$$) — the boundaries of the $$$j$$$-th scenario.OutputFor each scenario, print a single integer — the number of moves it will take to kill all the monsters in the segment.ExampleInput7 54 5 9 9 4 2 41 3 3 1 2 3 33 51 46 61 72 6Output4 10 0 13 7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a86362da", "template_md5": "35d339e4", "result": "There are $n$ monsters, each with a health value ($a_i$) and a strength value ($b_i$). \n\nYou are given $q$ scenarios. Each scenario is defined by a segment of monsters, $[l, r]$. \n\nFor each scenario, determine the minimum number of moves required to kill all monsters in the segment. \n\nHere's how the battle works:\n\n1. The first monster in the segment ($l$) is killed and revived as a zombie.\n2. In each subsequent move:\n    * All zombies attack the first living monster in the segment.\n    * The attacked monster's health is reduced by the total strength of the zombies.\n    * If a monster's health reaches 0 or less, it dies and is revived as a zombie with the same strength as its original value.\n\nThis process continues until all monsters in the segment are dead. \n\n\n\nInput:\n\n* The first line contains two integers, $n$ and $q$ ($1 \\le n, q \\le 2 \\cdot 10^5$), representing the number of monsters and scenarios, respectively.\n* The second line contains $n$ integers, $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le 10^4$), representing the health of each monster.\n* The third line contains $n$ integers, $b_1, b_2, ..., b_n$ ($1 \\le b_i \\le 10^4$), representing the strength of each monster.\n* Each of the following $q$ lines contains two integers, $l_j$ and $r_j$ ($1 \\le l_j \\le r_j \\le n$), representing the boundaries of each scenario.\n\nOutput:\n\nFor each scenario, print a single integer representing the minimum number of moves required to kill all monsters in the segment."}, {"prompt_md5": "43e4f003", "template_md5": "465699a0", "result": "You are given a list of creatures with health and strength values.  You need to determine the minimum number of turns it takes to defeat a specified group of creatures. On each turn, the first living creature in the group is attacked by all the undead creatures, reducing its health. If a creature's health reaches zero or below, it is revived as an undead creature with the same strength."}]}