{"uid": "197-A", "url": "https://codeforces.com/contest/197/problem/A", "tags": ["constructive algorithms", " games", " math"], "title": "197-A", "statement": "A. Plate Gametime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got a rectangular table with lengthaand widthband the infinite number of plates of radiusr. Two players play the following game: they take turns to put the plates on the table so that the plates don't lie on each other (but they can touch each other), and so that any point on any plate is located within the table's border. During the game one cannot move the plates that already lie on the table. The player who cannot make another move loses. Determine which player wins, the one who moves first or the one who moves second, provided that both players play optimally well.InputA single line contains three space-separated integersa,b,r(1 ≤a,b,r≤ 100)— the table sides and the plates' radius, correspondingly.OutputIf wins the player who moves first, print \"First\" (without the quotes). Otherwise print \"Second\" (without the quotes).ExamplesInput5 5 2OutputFirstInput6 7 4OutputSecondNoteIn the first sample the table has place for only one plate. The first player puts a plate on the table, the second player can't do that and loses.In the second sample the table is so small that it doesn't have enough place even for one plate. So the first player loses without making a single move.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "780ee3db", "template_md5": "35d339e4", "result": "You have a rectangular table with length $a$ and width $b$. There are infinitely many plates with a radius of $r$. Two players take turns placing plates on the table.  Plates cannot overlap, but they can touch.  A plate must fit entirely within the table's borders. The player who cannot make a legal move loses. Determine which player wins if both players play perfectly.\n\nInput:\n\nA single line with three space-separated integers: $a$, $b$, and $r$ (where $1 \\le a, b, r \\le 100$).\n\nOutput:\n\nPrint \"First\" if the first player wins, or \"Second\" if the second player wins."}, {"prompt_md5": "c50e566e", "template_md5": "465699a0", "result": "Two players take turns placing circles of a given size onto a rectangular table. The circles cannot overlap, and must fit within the table's boundaries. The first player who cannot place a circle loses. Determine which player has a winning strategy."}]}