{"uid": "1970-E1", "url": "https://codeforces.com/contest/1970/problem/E1", "tags": ["dp"], "title": "1970-E1", "statement": "E1. Trails (Easy)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputHarry Potter is hiking in the Alps surrounding Lake Geneva. In this area there are $$$m$$$ cabins, numbered 1 to $$$m$$$. Each cabin is connected, with one or more trails, to a central meeting point next to the lake. Each trail is eithershortorlong. Cabin $$$i$$$ is connected with $$$s_i$$$ short trails and $$$l_i$$$ long trails to the lake.Each day, Harry walks a trail from the cabin where he currently is to Lake Geneva, and then from there he walks a trail to any of the $$$m$$$ cabins (including the one he started in). However, as he has to finish the hike in a day, at least one of the two trails has to be short.How many possible combinations of trails can Harry take if he starts in cabin 1 and walks for $$$n$$$ days?Give the answer modulo $$$10^9 + 7$$$.InputThe first line contains the integers $$$m$$$ and $$$n$$$.The second line contains $$$m$$$ integers, $$$s_1, \\\\dots, s_m$$$, where $$$s_i$$$ is the number of short trails between cabin $$$i$$$ and Lake Geneva.The third and last line contains $$$m$$$ integers, $$$l_1, \\\\dots, l_m$$$, where $$$l_i$$$ is the number of long trails between cabin $$$i$$$ and Lake Geneva.We have the following constraints:$$$0 \\\\le s_i, l_i \\\\le 10^3$$$.$$$1 \\\\le m \\\\le 10^2$$$.$$$1 \\\\le n \\\\le 10^3$$$.OutputThe number of possible combinations of trails, modulo $$$10^9 + 7$$$.ExampleInput3 21 0 10 1 1Output18", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0459da77", "template_md5": "35d339e4", "result": "There are $m$ cabins numbered 1 to $m$. Each cabin is connected to a central meeting point with one or more trails. Each trail is either short or long. Cabin $i$ is connected with $s_i$ short trails and $l_i$ long trails to the meeting point.\n\nYou start at cabin 1 and walk for $n$ days. Each day, you walk one trail from your current cabin to the meeting point, and then another trail from the meeting point to any cabin (including the one you started in). At least one of the two trails you walk each day must be short.\n\nHow many different combinations of trails can you take?  The answer should be given modulo $10^9 + 7$. \n\nInput:\n\n* The first line contains two integers, $m$ and $n$.\n* The second line contains $m$ integers, $s_1, s_2, ..., s_m$, where $s_i$ is the number of short trails from cabin $i$ to the meeting point.\n* The third line contains $m$ integers, $l_1, l_2, ..., l_m$, where $l_i$ is the number of long trails from cabin $i$ to the meeting point.\n\nOutput:\n\n* The number of possible combinations of trails, modulo $10^9 + 7$."}, {"prompt_md5": "4a22e3d3", "template_md5": "465699a0", "result": "You have $m$ locations. Each location has a number of short and long paths to a central point. You start at location 1 and must visit each location for $n$ days.  Each day, you must take at least one short path. How many different ways can you visit all the locations?"}]}