{"uid": "1971-B", "url": "https://codeforces.com/contest/1971/problem/B", "tags": ["implementation", " strings"], "title": "1971-B", "statement": "B. Different Stringtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a string $$$s$$$ consisting of lowercase English letters.Rearrange the characters of $$$s$$$ to form a new string $$$r$$$ that isnot equalto $$$s$$$, or report that it's impossible.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 1000$$$) — the number of test cases.The only line of each test case contains a string $$$s$$$ of length at most $$$10$$$ consisting of lowercase English letters.OutputFor each test case, if no such string $$$r$$$ exists as described in the statement, output \"NO\" (without quotes).Otherwise, output \"YES\" (without quotes). Then, output one line — the string $$$r$$$, consisting of letters of string $$$s$$$.You can output \"YES\" and \"NO\" in any case (for example, strings \"yEs\", \"yes\", and \"Yes\" will be recognized as a positive response).If multiple answers are possible, you can output any of them.ExampleInput8codeforcesaaaaaxxxxycodnutdealermwisththhhhhhhhhhOutputYES forcodesec NO YES xxyxx YES oc NO YES undertale YES thtsiwm NONoteIn the first test case, another possible answer is $$$\\\\texttt{forcescode}$$$.In the second test case, all rearrangements of $$$\\\\texttt{aaaaa}$$$ are equal to $$$\\\\texttt{aaaaa}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "274950f2", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  Determine if you can rearrange the letters to create a new string that is different from the original. If possible, output \"YES\" and the new string. Otherwise, output \"NO\"."}, {"prompt_md5": "7e4b17ed", "template_md5": "465699a0", "result": "Given a string of lowercase letters, determine if you can rearrange its letters to create a new string that is different from the original. If possible, output \"YES\" and the new string. Otherwise, output \"NO\"."}]}