{"uid": "1971-D", "url": "https://codeforces.com/contest/1971/problem/D", "tags": ["dp", " greedy", " implementation", " sortings", " strings"], "title": "1971-D", "statement": "D. Binary Cuttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a binary string$$$^{\\\\dagger}$$$. Please find the minimum number of pieces you need to cut it into, so that the resulting pieces can be rearranged into a sorted binary string.Note that:each character must lie in exactly one of the pieces;the pieces must be contiguous substrings of the original string;you must use all the pieces in the rearrangement.$$$^{\\\\dagger}$$$ Abinary stringis a string consisting of characters $$$\\\\texttt{0}$$$ and $$$\\\\texttt{1}$$$. Asorted binary stringis a binary string such that all characters $$$\\\\texttt{0}$$$ come before all characters $$$\\\\texttt{1}$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 500$$$) — the number of test cases.The only line of each test case contains a single string $$$s$$$ ($$$1 \\\\leq |s| \\\\leq 500$$$) consisting of characters $$$\\\\texttt{0}$$$ and $$$\\\\texttt{1}$$$, where $$$|s|$$$ denotes the length of the string $$$s$$$.OutputFor each test case, output a single integer — the minimum number of pieces needed to be able to rearrange the string into a sorted binary string.ExampleInput6110100000000011000011110110Output3 1 1 2 1 2NoteThe first test case is pictured in the statement. It can be proven that you can't use fewer than $$$3$$$ pieces.In the second and third test cases, the binary string is already sorted, so only $$$1$$$ piece is needed.In the fourth test case, you need to make a single cut between the two characters and rearrange them to make the string $$$\\\\texttt{01}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5f6e9bef", "template_md5": "35d339e4", "result": "You are given a binary string  $s$ (a string consisting only of 0s and 1s).  Find the fewest number of pieces you need to cut the string into so that you can rearrange the pieces into a sorted binary string (a string where all 0s come before all 1s).\n\nHere are the rules:\n\n* Each character in the original string must be in exactly one piece.\n* The pieces must be continuous parts of the original string.\n* You must use all the pieces when rearranging them. \n\n\nFor example:\n\nInput: 1101000000000011000011110110\n\nOutput: 3"}, {"prompt_md5": "a43dfb58", "template_md5": "465699a0", "result": "You are given a string of 0s and 1s.  Find the fewest cuts you need to make to the string so that you can rearrange the resulting pieces into a string where all 0s come before all 1s."}]}