{"uid": "1972-B", "url": "https://codeforces.com/contest/1972/problem/B", "tags": ["games"], "title": "1972-B", "statement": "B. Coin Gamestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ coins on the table forming a circle, and each coin is either facing up or facing down. Alice and Bob take turns to play the following game, and Alice goes first.In each operation, the player chooses a facing-up coin, removes the coin, and flips the two coins that are adjacent to it. If (before the operation) there are only two coins left, then one will be removed and the other won't be flipped (as it would be flipped twice). If (before the operation) there is only one coin left, no coins will be flipped. If (before the operation) there are no facing-up coins, the player loses.Decide who will win the game if they both play optimally. It can be proved that the game will end in a finite number of operations, and one of them will win.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1\\\\le t\\\\le 100$$$). The description of the test cases follows.The first line of each test case contains only one positive integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 100$$$), representing the number of the coins.A string $$$s$$$ of length $$$n$$$ follows on the second line of each test case, containing only \"U\" and \"D\", representing that each coin is facing up or facing down.OutputFor each test case, print \"YES\" if Alice will win the game, and \"NO\" otherwise.You can output the answer in any case (upper or lower). For example, the strings \"yEs\", \"yes\", \"Yes\", and \"YES\" will be recognized as positive responses.ExampleInput35UUDUD5UDDUD2UUOutputYES NO NONoteIn the first test case, the game may go as follows.Alice chooses the first coin and $$$s$$$ becomes \"DDUU\".Bob chooses the last coin and $$$s$$$ becomes \"UDD\".Alice chooses the first coin and $$$s$$$ becomes \"UU\".Bob chooses the first coin and $$$s$$$ becomes \"U\".Alice chooses the only coin and $$$s$$$ becomes empty.Bob can't choose any coin now, and he loses the game.It can be proved that Bob will always lose if they both play optimally.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4d95cb86", "template_md5": "35d339e4", "result": "There are $n$ coins arranged in a circle. Each coin is either facing up (U) or down (D). Two players take turns.  On each turn, a player chooses a coin facing up, removes it, and flips the two coins next to it. If there are only two coins left, only one is removed and not flipped. If there is only one coin left, nothing happens. If there are no coins facing up, the player loses. \n\nDetermine which player will win if both players play optimally. \n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of coins, $n$.\n    * The second line contains a string of length $n$ representing the coins, with \"U\" for up and \"D\" for down.\n\nOutput:\n\nFor each test case, print \"YES\" if the first player wins, and \"NO\" otherwise."}, {"prompt_md5": "019ccafa", "template_md5": "465699a0", "result": "Two players take turns.  Each turn, a player chooses a face-up item from a circle of items. The chosen item is removed, and the two items next to it are flipped. If there are only one or two items left, the rules change. The first player to be unable to make a move loses. Determine which player will win if both play optimally."}]}