{"uid": "1973-A", "url": "https://codeforces.com/contest/1973/problem/A", "tags": ["brute force", " dp", " implementation", " math"], "title": "1973-A", "statement": "A. Chess For Threetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThree friends gathered to play a few games of chess together.In every game, two of them play against each other. The winner gets $$$2$$$ points while the loser gets $$$0$$$, and in case of a draw, both players get $$$1$$$ point each. Note that the same pair of players could have played any non-negative number of times (possibly zero). It is also possible that no games were played at all.You've been told that their scores after all the games were played were $$$p_1$$$, $$$p_2$$$ and $$$p_3$$$. Additionally, it is guaranteed that $$$p_1 \\\\leq p_2 \\\\leq p_3$$$ holds.Find the maximum number of draws that could have happened and print it. If there isn't any way to obtain $$$p_1$$$, $$$p_2$$$ and $$$p_3$$$ as a result of a non-negative number of games between the three players, print $$$-1$$$ instead.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 500$$$). The description of the test cases follows.The first line of each test case contains three integers $$$p_1$$$, $$$p_2$$$ and $$$p_3$$$ ($$$0 \\\\leq p_1 \\\\leq p_2 \\\\leq p_3 \\\\leq 30$$$) — the scores of the three players, sorted non-decreasingly.OutputFor each testcase, print one number — the maximum possible number of draws that could've happened, or $$$-1$$$ if the scores aren't consistent with any valid set of games and results.ExampleInput70 0 00 1 11 1 11 1 23 3 33 4 51 1 10Output0 1 -1 2 -1 6 2NoteIn the first example, no games were played at all, so no draws could occur either.For the second example, exactly one game occurred between the second and the third player and it ended in draw, so the answer is $$$1$$$.It's easy to see that there's no set of games achieving the scores in third example, so the answer for it is $$$-1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b7e1e252", "template_md5": "35d339e4", "result": "Three people played a game.  Each game has two players, and the winner gets 2 points, the loser gets 0 points, and a draw results in 1 point for each player.  \n\nYou are given the final scores of the three people ($p_1$, $p_2$, and $p_3$), where $p_1 \\le p_2 \\le p_3$.\n\nFind the maximum number of draws that could have happened. If it's impossible to get these scores with any combination of wins, losses, and draws, print -1."}, {"prompt_md5": "76e29924", "template_md5": "465699a0", "result": "Three people played a game. Each game has a winner who gets 2 points, a loser who gets 0 points, and a draw where both players get 1 point. You know the final scores of the three people. Find the maximum number of draws that could have happened. If it's impossible to get those scores with any combination of wins, losses, and draws, say -1."}]}