{"uid": "1974-A", "url": "https://codeforces.com/contest/1974/problem/A", "tags": ["greedy", " math"], "title": "1974-A", "statement": "A. Phone Desktoptime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Rosie has a phone with a desktop (or launcher, as it is also called). The desktop can consist of several screens. Each screen is represented as a grid of size $$$5 \\\\times 3$$$, i.e., five rows and three columns.There are $$$x$$$ applications with an icon size of $$$1 \\\\times 1$$$ cells; such an icon occupies only one cell of the screen. There are also $$$y$$$ applications with an icon size of $$$2 \\\\times 2$$$ cells; such an icon occupies asquareof $$$4$$$ cells on the screen. Each cell of each screen can be occupied by no more than one icon.Rosie wants to place the application icons on the minimum number of screens. Help her find the minimum number of screens needed.InputThe first line of the input contains $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) — the number of test cases.The first and only line of each test case contains two integers $$$x$$$ and $$$y$$$ ($$$0 \\\\leq x, y \\\\leq 99$$$) — the number of applications with a $$$1 \\\\times 1$$$ icon and the number of applications with a $$$2 \\\\times 2$$$ icon, respectively.OutputFor each test case, output the minimal number of required screens on a separate line.ExampleInput111 17 212 40 31 08 10 02 015 08 20 9Output1 1 2 2 1 1 0 1 1 2 5NoteThe solution for the first test case can look as follows:Blue squares represent empty spaces for icons, green squares represent $$$1 \\\\times 1$$$ icons, red squares represent $$$2 \\\\times 2$$$ iconsThe solution for the third test case can look as follows:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6a2963a1", "template_md5": "35d339e4", "result": "You are given two numbers,  $x$ and $y$.  $x$ represents the number of applications that take up 1x1 space on a screen, and $y$ represents the number of applications that take up 2x2 space on a screen. Each screen is a 5x3 grid.  \n\nDetermine the minimum number of screens needed to fit all the applications."}, {"prompt_md5": "46f27168", "template_md5": "465699a0", "result": "You are given the number of small and large application icons.  Find the minimum number of screens needed to place all the icons, where each screen is a 5x3 grid.  Each cell on a screen can hold only one icon. A small icon takes up 1 cell, and a large icon takes up 4 cells."}]}