{"uid": "1974-B", "url": "https://codeforces.com/contest/1974/problem/B", "tags": ["implementation", " sortings", " strings"], "title": "1974-B", "statement": "B. Symmetric Encodingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp has a string $$$s$$$, which consists of lowercase Latin letters. He encodes this string using the following algorithm:first, he constructs a new auxiliary string $$$r$$$, which consists of all distinct letters of the string $$$s$$$, written in alphabetical order;then the encoding happens as follows: each character in the string $$$s$$$ is replaced by its symmetric character from the string $$$r$$$ (the first character of the string $$$r$$$ will be replaced by the last, the second by the second from the end, and so on).For example, encoding the string $$$s$$$=\"codeforces\" happens as follows:the string $$$r$$$ is obtained as \"cdefors\";the first character $$$s_1$$$='c' is replaced by 's';the second character $$$s_2$$$='o' is replaced by 'e';the third character $$$s_3$$$='d' is replaced by 'r';...the last character $$$s_{10}$$$='s' is replaced by 'c'.The string $$$r$$$ and replacements for $$$s$$$=\"codeforces\".Thus, the result of encoding the string $$$s$$$=\"codeforces\" is the string \"serofedsoc\".Write a program that performs decoding — that is, restores the original string $$$s$$$ from the encoding result.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the length of the string $$$b$$$.The second line of each test case contains a string $$$b$$$ of length $$$n$$$, consisting of lowercase Latin letters — the result of encoding the original string $$$s$$$.It is guaranteed that the sum of the values of $$$n$$$ over all test cases in the test does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, output the string $$$s$$$ from which the encoding result $$$b$$$ was obtained.ExampleInput510serofedsoc3ttf9tlrhgmaoi1w15hnndledmnhlttinOutputcodeforces fft algorithm w meetinthemiddle", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6a12c754", "template_md5": "35d339e4", "result": "You are given a string $b$ that is the result of a special encoding process. The encoding process works as follows:\n\n1.  Find all the unique characters in the original string $s$.\n2.  Arrange these unique characters in alphabetical order to form a new string $r$.\n3.  Replace each character in the original string $s$ with the corresponding character from the end of string $r$. The first character of $r$ is replaced by the last character of $r$, the second character of $s$ is replaced by the second to last character of $r$, and so on.\n\nYour task is to write a program that takes the encoded string $b$ as input and outputs the original string $s$. \n\n**Input:**\n\n*   The first line contains an integer $t$ ($1 \\le t \\le 10^4$) representing the number of test cases.\n*   For each test case:\n    *   The first line contains an integer $n$ ($1 \\le n \\le 2 \\cdot 10^5$) representing the length of the encoded string $b$.\n    *   The second line contains the encoded string $b$ of length $n$, consisting of lowercase letters.\n\n**Output:**\n\nFor each test case, output the original string $s$."}, {"prompt_md5": "2b2766c2", "template_md5": "465699a0", "result": "You are given a string that has been encoded using a specific method. The method involves creating a new string with only the unique characters from the original string, sorted alphabetically. Then, each character in the original string is replaced with the corresponding character from the new string, starting from the end.  \n\nYour task is to reverse this process and recover the original string."}]}