{"uid": "1975-G", "url": "https://codeforces.com/contest/1975/problem/G", "tags": ["fft", " greedy", " math", " strings"], "title": "1975-G", "statement": "G. Zimpha Fan Clubtime limit per test12 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputOne day, Zimpha casually came up with a problem. As a member of \"Zimpha fan club\", you decided to solve that problem.You are given two strings $$$s$$$ and $$$t$$$ of length $$$n$$$ and $$$m$$$, respectively. Both strings only consist of lowercase English letters,-and*.You need to replace all occurrences of*and-, observing the following rules:For each-, you must replace it with any lowercase English letter.For each*, you must replace it with a string of any (possibly, zero) length which only consists of lowercase English letters.Note that you can replace two different instances of-with different characters. You can also replace each two different instances of*with different strings.Suppose $$$s$$$ and $$$t$$$ have been transformed into $$$s'$$$ and $$$t'$$$. Now you're wondering if there's a replacement that makes $$$s'=t'$$$.InputThe first line of input contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n, m \\\\leq 2 \\\\cdot 10^6$$$) — the length of the strings $$$s$$$ and $$$t$$$, respectively.The second line contains the string $$$s$$$ of length $$$n$$$. It is guaranteed that $$$s$$$ only consists of lowercase English letters,-and*.The third line contains the string $$$t$$$ of length $$$m$$$. It is guaranteed that $$$t$$$ only consists of lowercase English letters,-and*.OutputFor each test case, output \"Yes\" if there is a replacement that makes $$$s'=t'$$$, and output \"No\" otherwise.You can output \"Yes\" and \"No\" in any case (for example, strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive response).ExamplesInput10 10justmonikaj-stsayoriOutputNoInput7 8ttk-wxx*tt-l-xxOutputYesInput13 11asoulwangziji-soulg*z-y-OutputNoInput7 3abc*cbaa*cOutputNoInput20 18bulijiojio-dibuliduo*li*ji-*ox*i*-du*-OutputYesNoteIn the second test case, we can transform both strings intottklwxx. In $$$s$$$,-will be replaced withl. In $$$t$$$,*will be replaced by the empty string with the first and second-will be replaced withkandwrespectively.In the fifth test case, we can transform both strings intobulijiojioxdibuliduo.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "91054451", "template_md5": "35d339e4", "result": "You are given two strings, $s$ and $t$, of lengths $n$ and $m$ respectively. Both strings only contain lowercase letters, '-', and '*'.\n\nYou need to replace all occurrences of '-' with a lowercase letter, and all occurrences of '*' with a string of lowercase letters (possibly empty).\n\nDetermine if there is a way to replace the characters in $s$ and $t$ so that the resulting strings are equal. \n\nOutput \"Yes\" if it's possible, and \"No\" otherwise."}, {"prompt_md5": "70719b1f", "template_md5": "465699a0", "result": "You are given two strings of equal length. You can replace every \"-\" in the first string with a single letter, and every \"*\" in the first string with any sequence of letters. You can do the same for the second string.  Determine if it's possible to make the two strings identical after these replacements."}]}