{"uid": "1975-A", "url": "https://codeforces.com/contest/1975/problem/A", "tags": ["brute force", " greedy", " implementation", " sortings"], "title": "1975-A", "statement": "A. Bazoka and Mocha's Arraytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMocha likes arrays, so before her departure, Bazoka gave her an array $$$a$$$ consisting of $$$n$$$ positive integers as a gift.Now Mocha wants to know whether array $$$a$$$ could become sorted in non-decreasing order after performing the following operation some (possibly, zero) times:Split the array into two parts — a prefix and a suffix, then swap these two parts. In other words, let $$$a=x+y$$$. Then, we can set $$$a:= y+x$$$. Here $$$+$$$ denotes the array concatenation operation.For example, if $$$a=[3,1,4,1,5]$$$, we can choose $$$x=[3,1]$$$ and $$$y=[4,1,5]$$$, satisfying $$$a=x+y$$$. Then, we can set $$$a:= y + x = [4,1,5,3,1]$$$. We can also choose $$$x=[3,1,4,1,5]$$$ and $$$y=[\\\\,]$$$, satisfying $$$a=x+y$$$. Then, we can set $$$a := y+x = [3,1,4,1,5]$$$. Note that we are not allowed to choose $$$x=[3,1,1]$$$ and $$$y=[4,5]$$$, neither are we allowed to choose $$$x=[1,3]$$$ and $$$y=[5,1,4]$$$, as both these choices do not satisfy $$$a=x+y$$$.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1\\\\leq t\\\\leq 1000$$$). The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$2\\\\leq n\\\\leq 50$$$) — the length of the array $$$a$$$.The second line of each test case contains $$$n$$$ integers $$$a_1,a_2,\\\\ldots,a_n$$$ ($$$1\\\\leq a_i \\\\leq 10^6$$$) — the elements of array $$$a$$$.OutputFor each test case, output \"Yes\" if $$$a$$$ could become non-decreasing after performing the operation any number of times, and output \"No\" if not.You can output \"Yes\" and \"No\" in any case (for example, strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive response).ExampleInput361 1 4 5 1 457 9 2 2 331 2 3OutputNo Yes YesNoteIn the first test case, it can be proven that $$$a$$$ cannot become non-decreasing after performing the operation any number of times.In the second test case, we can perform the following operations to make $$$a$$$ sorted in non-decreasing order:Split the array into two parts: $$$x=[7]$$$ and $$$y=[9,2,2,3]$$$, then swap these two parts. The array will become $$$y+x = [9,2,2,3,7]$$$.Split the array into two parts: $$$x=[9]$$$ and $$$y=[2,2,3,7]$$$, then swap these two parts. The array will become $$$y+x=[2,2,3,7,9]$$$, which is non-decreasing.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f7917347", "template_md5": "35d339e4", "result": "You are given an array of $n$ positive integers.  You can perform the following operation any number of times:\n\n1. Split the array into two parts, a prefix ($x$) and a suffix ($y$).\n2. Swap the prefix and suffix, creating a new array $y+x$.\n\nDetermine if it is possible to make the array non-decreasing (each element is less than or equal to the next) after performing this operation zero or more times."}, {"prompt_md5": "acb3b2b5", "template_md5": "465699a0", "result": "You are given a list of numbers.  You can split the list into two parts and swap the order of the parts.  Determine if you can make the list sorted in non-decreasing order by doing this operation zero or more times."}]}