{"uid": "1977-A", "url": "https://codeforces.com/contest/1977/problem/A", "tags": ["math"], "title": "1977-A", "statement": "A. Little Nikitatime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe little boy Nikita was given some cubes as a present. He decided to build a tower out of them.Initially, the tower doesn't have any cubes. In one move, Nikita either puts exactly $$$1$$$ cube on top of the tower or removes exactly $$$1$$$ cube from the top of the tower. Is it possible that after $$$n$$$ moves, the resulting tower has exactly $$$m$$$ cubes?InputEach test contains multiple test cases. The first line of input contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 100$$$) — the number of test cases. The description of the test cases follows.The only line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n, m \\\\le 100$$$).OutputFor each test case, output \"Yes\" (without quotes) if Nikita can obtain a tower with $$$m$$$ cubes, and \"No\" (without quotes) otherwise.You can output each letter in any case (lowercase or uppercase). For example, the strings \"yEs\", \"yes\", \"Yes\", and \"YES\" will be accepted as a positive answer.ExampleInput33 32 45 3OutputYes No YesNoteIn the first test case, Nikita can put $$$1$$$ cube on top of the tower $$$3$$$ times in a row, so the answer is \"Yes\".In the second test case, Nikita can only end up with either a tower with no blocks or a tower with $$$2$$$ blocks, so the answer is \"No\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6ead83d8", "template_md5": "35d339e4", "result": "You are given two numbers, $n$ and $m$.  Determine if it is possible to end up with exactly $m$ cubes after performing $n$ operations. Each operation consists of either adding one cube to the top of a tower or removing one cube from the top of the tower. \n\nIf it is possible, output \"Yes\". Otherwise, output \"No\"."}, {"prompt_md5": "a84c037a", "template_md5": "465699a0", "result": "You can add or remove one item at a time from a pile.  Given a number of operations and a target number of items, is it possible to reach the target?"}]}