{"uid": "1979-C", "url": "https://codeforces.com/contest/1979/problem/C", "tags": ["binary search", " combinatorics", " constructive algorithms", " number theory"], "title": "1979-C", "statement": "C. Earning on Betstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have been offered to play a game. In this game, there are $$$n$$$ possible outcomes, and for each of them, you must bet a certainintegeramount of coins. In the event that the $$$i$$$-th outcome turns out to be winning, you will receive back the amount of coins equal to your bet on that outcome, multiplied by $$$k_i$$$. Note thatexactly oneof the $$$n$$$ outcomes will be winning.Your task is to determine how to distribute the coins in such a way that you will come out ahead in the event ofanywinning outcome. More formally, the total amount of coins you bet on all outcomes must bestrictly lessthan the number of coins received back for each possible winning outcome.InputEach test consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 50$$$) — the number of outcomes.The second line of each test case contains $$$n$$$ integers $$$k_1,k_2,\\\\ldots,k_n$$$ ($$$2 \\\\le k_i \\\\le 20$$$) — the multiplier for the amount of coins if the $$$i$$$-th outcome turns out to be winning.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, output $$$-1$$$ if there is no way to distribute the coins as required. Otherwise, output $$$n$$$ integers $$$x_1, x_2,\\\\ldots, x_n$$$ ($$$1 \\\\le x_i \\\\le 10^{9}$$$) — your bets on the outcomes.It can be shown that if a solution exists, there is always a solution that satisfies these constraints.If there are multiple suitable solutions, output any of them.ExampleInput633 2 723 355 5 5 5 567 9 3 17 9 1336 3 259 4 6 8 3Output27 41 12  1 1  -1 1989 1547 4641 819 1547 1071  -1 8 18 12 9 24NoteIn the first test case, the coins can be distributed as follows: $$$27$$$ coins on the first outcome, $$$41$$$ coins on the second outcome, $$$12$$$ coins on the third outcome. Then the total amount of coins bet on all outcomes is $$$27 + 41 + 12 = 80$$$ coins. If the first outcome turns out to be winning, you will receive back $$$3 \\\\cdot 27 = 81$$$ coins, if the second outcome turns out to be winning, you will receive back $$$2 \\\\cdot 41 = 82$$$ coins, if the third outcome turns out to be winning, you will receive back $$$7 \\\\cdot 12 = 84$$$ coins. All these values are strictly greater than $$$80$$$.In the second test case, one way is to bet one coin on each of the outcomes.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "950c93ef", "template_md5": "465699a0", "result": "You have multiple options, each with a different payout multiplier. You need to bet on some or all of the options, but the total amount you bet must be less than the payout for each winning option.  Find a way to bet so that you make a profit no matter which option wins. If no such strategy exists, say so."}, {"prompt_md5": "e9b927e2", "template_md5": "35d339e4", "result": "You are given $n$ possible outcomes, each with a multiplier $k_i$ associated with it.  Exactly one outcome will be winning. You need to bet a certain number of coins on each outcome.  \n\nYour goal is to figure out how to distribute the coins so that no matter which outcome wins, you make a profit (the coins you win back are strictly greater than the coins you bet).\n\n**Input:**\n\n* $t$: The number of test cases.\n* For each test case:\n    * $n$: The number of outcomes.\n    * $k_1, k_2, ..., k_n$: The multipliers for each outcome.\n\n**Output:**\n\n* For each test case:\n    * If it's impossible to make a profit, output $-1$.\n    * Otherwise, output $n$ numbers $x_1, x_2, ..., x_n$ representing the number of coins to bet on each outcome."}]}