{"uid": "1979-A", "url": "https://codeforces.com/contest/1979/problem/A", "tags": ["brute force", " greedy", " implementation"], "title": "1979-A", "statement": "A. Guess the Maximumtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob came up with a rather strange game. They have an array of integers $$$a_1, a_2,\\\\ldots, a_n$$$. Alice chooses a certain integer $$$k$$$ and tells it to Bob, then the following happens:Bob chooses two integers $$$i$$$ and $$$j$$$ ($$$1 \\\\le i < j \\\\le n$$$), and then finds the maximum among the integers $$$a_i, a_{i + 1},\\\\ldots, a_j$$$;If the obtained maximum isstrictly greaterthan $$$k$$$, Alice wins, otherwise Bob wins.Help Alice find the maximum $$$k$$$ at which she is guaranteed to win.InputEach test consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases. The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 5 \\\\cdot 10^4$$$) — the number of elements in the array.The second line of each test case contains $$$n$$$ integers $$$a_1, a_2,\\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — the elements of the array.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$5 \\\\cdot 10^4$$$.OutputFor each test case, output one integer — the maximum integer $$$k$$$ at which Alice is guaranteed to win.ExampleInput642 4 1 751 2 3 4 521 1337 8 16510 10 10 10 9103 12 9 5 2 3 2 9 8 2Output3 1 0 15 9 2NoteIn the first test case, all possible subsegments that Bob can choose look as follows: $$$[2, 4], [2, 4, 1], [2, 4, 1, 7], [4, 1], [4, 1, 7], [1, 7]$$$. The maximums on the subsegments are respectively equal to $$$4, 4, 7, 4, 7, 7$$$. It can be shown that $$$3$$$ is the largest integer such that any of the maximums will be strictly greater than it.In the third test case, the only segment that Bob can choose is $$$[1, 1]$$$. So the answer is $$$0$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9d98098e", "template_md5": "465699a0", "result": "You are given a list of numbers.  You need to find the largest number that, if chosen, guarantees that at least one sublist of the numbers will have a maximum value strictly larger than the chosen number."}, {"prompt_md5": "56079964", "template_md5": "35d339e4", "result": "You are given an array of integers $a_1, a_2, ..., a_n$.  \n\nDetermine the largest integer $k$ such that if a player chooses $k$, they are guaranteed to win the following game:\n\n* **Player 1 (Alice)** chooses an integer $k$.\n* **Player 2 (Bob)** chooses two indices $i$ and $j$ where $1 \\le i < j \\le n$.\n* Bob finds the maximum value in the subarray $a_i, a_{i+1}, ..., a_j$.\n* If the maximum value is strictly greater than $k$, Player 1 wins. Otherwise, Player 2 wins. \n\n\n\nInput:\n\n* The first line contains the number of test cases $t$.\n* For each test case:\n    * The first line contains the number of elements in the array $n$.\n    * The second line contains the $n$ integers of the array.\n\nOutput:\n\nFor each test case, output the largest $k$ such that Alice is guaranteed to win."}]}