{"uid": "198-E", "url": "https://codeforces.com/contest/198/problem/E", "tags": ["binary search", " data structures", " sortings"], "title": "198-E", "statement": "E. Gripping Storytime limit per test4 secondsmemory limit per test512 megabytesinputstdinoutputstdoutOne day Qwerty the Ranger witnessed two transport ships collide with each other. As a result, all contents of their cargo holds scattered around the space. And now Qwerty wants to pick as many lost items as possible to sell them later.The thing is, both ships had lots of new gravitational grippers, transported to sale. A gripper is a device that can be installed on a spaceship and than draw items in space to itself (\"grip\") and transport them to the ship's cargo hold.Overall the crashed ships lostngravitational grippers: thei-th gripper is located at a point with coordinates(xi,yi). Each gripper has two features —pi(the power) andri(the action radius) and can grip any items with mass of no more thanpiat distance no more thanri. A gripper itself is an item, too and it has its mass ofmi.Qwerty's ship is located at point(x,y)and has an old magnetic gripper installed, its characteristics arepandr. There are no other grippers in the ship's cargo holds.Find the largest number of grippers Qwerty can get hold of. As he picks the items, he can arbitrarily install any gripper in the cargo hold of the ship, including the gripper he has just picked. At any moment of time the ship can have only one active gripper installed. We consider all items and the Qwerty's ship immobile when the ranger picks the items, except for when the gripper moves an item — then the item moves to the cargo holds and the ship still remains immobile. We can assume that the ship's cargo holds have enough room for all grippers. Qwerty can use any gripper he finds or the initial gripper an arbitrary number of times.InputThe first line contains five integersx,y,p,randn(- 109≤x,y≤ 109,1 ≤p,r≤ 109,1 ≤n≤ 250000) — the ship's initial position, the initial gripper's features and the number of grippers that got into the space during the collision.Nextnlines contain the grippers' descriptions: thei-th line contains five integersxi,yi,mi,pi,ri(- 109≤xi,yi≤ 109,1 ≤mi,pi,ri≤ 109) — thei-th gripper's coordinates and features.It is guaranteed that all grippers are located at different points. No gripper is located at the same point with Qwerty's ship.OutputPrint a single number — the maximum number of grippers Qwerty can draw to his ship. You do not need to count the initial old magnet gripper.ExamplesInput0 0 5 10 55 4 7 11 5-7 1 4 7 80 2 13 5 62 -3 9 3 413 5 1 9 9Output3NoteIn the first sample you should get the second gripper, then use the second gripper to get the first one, then use the first gripper to get the fourth one. You cannot get neither the third gripper as it is too heavy, nor the fifth one as it is too far away.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2e05d740", "template_md5": "465699a0", "result": "You have a starting point and a tool with a limited reach and strength. There are many other tools scattered around with varying strengths and reaches.  You can pick up tools and use them to grab other tools that are within their reach and weight limit.  Find the maximum number of tools you can collect."}, {"prompt_md5": "d6b7b6bb", "template_md5": "35d339e4", "result": "A spaceship is located at coordinates $(x, y)$ with an initial gripper that has power $p$ and action radius $r$.  There are $n$ lost grippers scattered in space, each with coordinates $(x_i, y_i)$, mass $m_i$, power $p_i$, and action radius $r_i$.  \n\nA gripper can pick up any item with mass less than or equal to its power and within its action radius.  \n\nThe goal is to find the maximum number of grippers that can be collected by the spaceship. The spaceship can use any gripper it collects, including the initial one, to pick up other grippers.  \n\nInput:\n\n* Five integers: $x$, $y$, $p$, $r$, and $n$ (the spaceship's coordinates, the initial gripper's power and radius, and the number of lost grippers).\n* $n$ lines, each containing five integers: $x_i$, $y_i$, $m_i$, $p_i$, and $r_i$ (the coordinates and features of each lost gripper).\n\nOutput:\n\n* A single integer representing the maximum number of grippers that can be collected."}]}