{"uid": "198-A", "url": "https://codeforces.com/contest/198/problem/A", "tags": ["implementation", " math"], "title": "198-A", "statement": "A. About Bacteriatime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutQwerty the Ranger took up a government job and arrived on planet Mars. He should stay in the secret lab and conduct some experiments on bacteria that have funny and abnormal properties. The job isn't difficult, but the salary is high.At the beginning of the first experiment there is a single bacterium in the test tube. Every second each bacterium in the test tube divides itself intokbacteria. After that some abnormal effects createbmore bacteria in the test tube. Thus, if at the beginning of some second the test tube hadxbacteria, then at the end of the second it will havekx+bbacteria.The experiment showed that afternseconds there were exactlyzbacteria and the experiment ended at this point.For the second experiment Qwerty is going to sterilize the test tube and put theretbacteria. He hasn't started the experiment yet but he already wonders, how many seconds he will need to grow at leastzbacteria. The ranger thinks that the bacteria will divide by the same rule as in the first experiment.Help Qwerty and find the minimum number of seconds needed to get a tube with at leastzbacteria in the second experiment.InputThe first line contains four space-separated integersk,b,nandt(1 ≤k,b,n,t≤ 106)— the parameters of bacterial growth, the time Qwerty needed to growzbacteria in the first experiment and the initial number of bacteria in the second experiment, correspondingly.OutputPrint a single number — the minimum number of seconds Qwerty needs to grow at leastzbacteria in the tube.ExamplesInput3 1 3 5Output2Input1 4 4 7Output3Input2 2 4 100Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7e5fb118", "template_md5": "465699a0", "result": "You are given information about how bacteria grow in a test tube.  You need to figure out the minimum amount of time it takes for a starting number of bacteria to reach or exceed a target number, given the growth rules."}, {"prompt_md5": "b819ccca", "template_md5": "35d339e4", "result": "You are given four integers: $k$, $b$, $n$, and $t$.\n\n* $k$ is the number of bacteria a single bacterium divides into each second.\n* $b$ is the number of extra bacteria created each second.\n* $n$ is the number of seconds it took for a single bacterium to grow to $t$ bacteria in a previous experiment.\n* $t$ is the target number of bacteria for the new experiment.\n\nYou need to find the minimum number of seconds it will take for a single bacterium to grow to at least $t$ bacteria, given the same growth rules as the previous experiment."}]}