{"uid": "198-D", "url": "https://codeforces.com/contest/198/problem/D", "tags": ["constructive algorithms"], "title": "198-D", "statement": "D. Cube Snaketime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got ann×n×ncube, split into unit cubes. Your task is to number all unit cubes in this cube with positive integers from1ton3so that:each number was used as a cube's number exactly once;for each1 ≤i<n3, unit cubes with numbersiandi+ 1were neighbouring (that is, shared a side);for each1 ≤i<nthere were at least two different subcubes with sizesi×i×i, made from unit cubes, which are numbered with consecutive numbers. That is, there are such two numbersxandy, that the unit cubes of the first subcube are numbered by numbersx,x+ 1,...,x+i3- 1, and the unit cubes of the second subcube are numbered by numbersy,y+ 1,...,y+i3- 1.Find and print the required numeration of unit cubes of the cube.InputThe first line contains a single integern(1 ≤n≤ 50) — the size of the cube, whose unit cubes need to be numbered.OutputPrint all layers of the cube asnn×nmatrices. Separate them with new lines. Print the layers in the order in which they follow in the cube. See the samples for clarifications.It is guaranteed that there always is a solution that meets the conditions given in the problem statement.ExamplesInput3Output1 4 172 3 1827 26 198 5 167 6 1524 25 209 12 1310 11 1423 22 21NoteIn the sample the cubes with sizes2 × 2 × 2are numbered with integers1, ..., 8and5, ..., 12.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cbbc749e", "template_md5": "465699a0", "result": "You have a cube made of smaller cubes.  You need to number all the smaller cubes from 1 to $n^3$  so that:\n\n* Each smaller cube has a unique number.\n*  Numbers on adjacent smaller cubes (sharing a side) are consecutive.\n* For each size of smaller cube (1x1x1, 2x2x2, etc.), there are at least two groups of smaller cubes of that size that are numbered consecutively. \n\n\nOutput the numbering of the smaller cubes, layer by layer, as if you were looking at the cube."}, {"prompt_md5": "d585699c", "template_md5": "35d339e4", "result": "You have a cube with sides of length $n$. The cube is made up of smaller unit cubes. Your task is to number all the unit cubes from 1 to $n^3$  following these rules:\n\n1. Each unit cube must have a unique number.\n2.  Unit cubes with consecutive numbers ($i$ and $i+1$) must share a side.\n3. For each size $i$ ($1 \\le i < n$), there must be at least two groups of unit cubes of size $i \\times i \\times i$ that are numbered with consecutive numbers. \n\nPrint the numbering of the unit cubes, layer by layer, in the order they appear in the cube. \n\n**Input:**\n\nThe first line contains a single integer $n$ (1 ≤ $n$ ≤ 50), the size of the cube.\n\n**Output:**\n\nPrint the cube layer by layer as $n \\times n$ matrices. Separate the layers with new lines."}]}