{"uid": "198-C", "url": "https://codeforces.com/contest/198/problem/C", "tags": ["binary search", " geometry"], "title": "198-C", "statement": "C. Delivering Carcinogentime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutQwerty the Ranger arrived to the Diatar system with a very important task. He should deliver a special carcinogen for scientific research to planet Persephone. This is urgent, so Qwerty has to get to the planet as soon as possible. A lost day may fail negotiations as nobody is going to pay for an overdue carcinogen.You can consider Qwerty's ship, the planet Persephone and the star Diatar points on a plane. Diatar is located in the origin of coordinate axes — at point(0, 0). Persephone goes round Diatar along a circular orbit with radiusRin the counter-clockwise direction at constant linear speedvp(thus, for instance, a full circle around the star takesof time). At the initial moment of time Persephone is located at point(xp,yp).At the initial moment of time Qwerty's ship is at point(x,y). Qwerty can move in any direction at speed of at mostv(v>vp). The star Diatar is hot (as all stars), so Qwerty can't get too close to it. The ship's metal sheathing melts at distancer(r<R) from the star.Find the minimum time Qwerty needs to get the carcinogen to planet Persephone.InputThe first line contains space-separated integersxp,ypandvp(- 104≤xp,yp≤ 104,1 ≤vp< 104) — Persephone's initial position and the speed at which it goes round Diatar.The second line contains space-separated integersx,y,vandr(- 104≤x,y≤ 104,1 <v≤ 104,1 ≤r≤ 104) — The intial position of Qwerty's ship, its maximum speed and the minimum safe distance to star Diatar.It is guaranteed thatr2<x2+y2,r2<xp2+yp2andvp<v.OutputPrint a single real number — the minimum possible delivery time. The answer will be considered valid if its absolute or relative error does not exceed10- 6.ExamplesInput10 0 1-10 0 2 8Output9.584544103Input50 60 1050 60 20 40Output0.000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bfa57f8a", "template_md5": "465699a0", "result": "A spaceship needs to travel from a starting point to a planet orbiting a star. The planet moves at a constant speed around the star. The spaceship can travel faster than the planet but has a minimum safe distance from the star. Find the shortest time it takes for the spaceship to reach the planet."}, {"prompt_md5": "6ba716ea", "template_md5": "35d339e4", "result": "A planet ($P$) orbits a star ($S$) in a circle of radius $R$ at a constant speed $v_p$.  The planet is initially at position $(x_p, y_p)$. A spaceship ($Q$) is initially at position $(x, y)$ and can travel at a maximum speed $v$ ($v > v_p$). The spaceship cannot get closer than a distance $r$ to the star.\n\nFind the minimum time it takes for the spaceship to reach the planet."}]}