{"uid": "1989-C", "url": "https://codeforces.com/contest/1989/problem/C", "tags": ["greedy", " math"], "title": "1989-C", "statement": "C. Two Moviestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA movie company has released $$$2$$$ movies. These $$$2$$$ movies were watched by $$$n$$$ people. For each person, we know their attitude towards the first movie (liked it, neutral, or disliked it) and towards the second movie.If a person is asked to leave a review for the movie, then:if that person liked the movie, they will leave a positive review, and the movie's rating will increase by $$$1$$$;if that person disliked the movie, they will leave a negative review, and the movie's rating will decrease by $$$1$$$;otherwise, they will leave a neutral review, and the movie's rating will not change.Every person will review exactly one movie — and for every person, you can choose which movie they will review.The company's rating is the minimum of the ratings of the two movies. Your task is to calculate the maximum possible rating of the company.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$).The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$-1 \\\\le a_i \\\\le 1$$$), where $$$a_i$$$ is equal to $$$-1$$$ if the first movie was disliked by the $$$i$$$-th viewer; equal to $$$1$$$ if the first movie was liked; and $$$0$$$ if the attitude is neutral.The third line contains $$$n$$$ integers $$$b_1, b_2, \\\\dots, b_n$$$ ($$$-1 \\\\le b_i \\\\le 1$$$), where $$$b_i$$$ is equal to $$$-1$$$ if the second movie was disliked by the $$$i$$$-th viewer; equal to $$$1$$$ if the second movie was liked; and $$$0$$$ if the attitude is neutral.Additional constraint on the input: the sum of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, print a single integer — the maximum possible rating of the company, if for each person, choose which movie to leave a review on.ExampleInput42-1 1-1 -11-1-150 -1 1 0 1-1 1 0 0 14-1 -1 -1 1-1 1 1 1Output0 -1 1 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0d9e2a0e", "template_md5": "35d339e4", "result": "A company has released 2 movies.  $n$ people watched both movies. For each person, we know if they liked or disliked each movie.\n\nA person can review only one movie.  If they liked a movie, the movie's rating goes up by 1. If they disliked it, the rating goes down by 1. If they were neutral, the rating doesn't change.\n\nYou can choose which movie each person reviews. What is the highest possible combined rating of the two movies? \n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of people, $n$.\n    * The second line contains $n$ numbers, $a_1, a_2, ..., a_n$, where:\n        * $a_i = -1$ means the $i$-th person disliked the first movie.\n        * $a_i = 1$ means the $i$-th person liked the first movie.\n        * $a_i = 0$ means the $i$-th person was neutral about the first movie.\n    * The third line contains $n$ numbers, $b_1, b_2, ..., b_n$, where:\n        * $b_i = -1$ means the $i$-th person disliked the second movie.\n        * $b_i = 1$ means the $i$-th person liked the second movie.\n        * $b_i = 0$ means the $i$-th person was neutral about the second movie.\n\nOutput:\n\n* For each test case, print the maximum possible combined rating of the two movies."}, {"prompt_md5": "f40e3f8f", "template_md5": "465699a0", "result": "You have two products and a group of people who have opinions about each product (like, dislike, or neutral). Each person can review only one product.  Your goal is to figure out the best way to assign reviews to maximize the overall rating of the two products."}]}