{"uid": "1992-G", "url": "https://codeforces.com/contest/1992/problem/G", "tags": ["combinatorics", " dp", " math"], "title": "1992-G", "statement": "G. Ultra-Meowtime limit per test2.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputK1o0n gave you an array $$$a$$$ of length $$$n$$$, consisting of numbers $$$1, 2, \\\\ldots, n$$$. Accept it? Of course! But what to do with it? Of course, calculate $$$\\\\text{MEOW}(a)$$$.Let $$$\\\\text{MEX}(S, k)$$$ be the $$$k$$$-thpositive(strictly greater than zero) integer in ascending order that is not present in the set $$$S$$$. Denote $$$\\\\text{MEOW}(a)$$$ as the sum of $$$\\\\text{MEX}(b, |b| + 1)$$$, over alldistinctsubsets $$$b$$$ of the array $$$a$$$.Examples of $$$\\\\text{MEX}(S, k)$$$ values for sets:$$$\\\\text{MEX}(\\\\{3,2\\\\}, 1) = 1$$$, because $$$1$$$ is the first positive integer not present in the set;$$$\\\\text{MEX}(\\\\{4,2,1\\\\}, 2) = 5$$$, because the first two positive integers not present in the set are $$$3$$$ and $$$5$$$;$$$\\\\text{MEX}(\\\\{\\\\}, 4) = 4$$$, because there are no numbers in the empty set, so the first $$$4$$$ positive integers not present in it are $$$1, 2, 3, 4$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.In a single line of each test case, an integer $$$n$$$ ($$$1 \\\\le n \\\\le 5000$$$) is entered, the size of the array of gifted numbers.It is guaranteed that the sum of $$$n^2$$$ over all test cases does not exceed $$$25 \\\\cdot 10^6$$$.OutputFor each test case, output a single number — $$$\\\\text{MEOW}(a)$$$. Since it may be very large, output it modulo $$$10^9 + 7$$$.ExampleInput523499951Output12 31 354226409 184 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1c1eb958", "template_md5": "35d339e4", "result": "You are given an array of integers from 1 to n.  \n\nFor each unique subset of the array, calculate the k-th positive integer not present in the subset.  \n\nThe function MEX(S, k) returns this k-th missing positive integer for a subset S.\n\nFinally, sum up all the MEX(b, |b| + 1) values for all unique subsets b of the array.\n\nOutput this sum modulo 10^9 + 7."}, {"prompt_md5": "d7e05c69", "template_md5": "465699a0", "result": "You are given a list of numbers from 1 to n.  Calculate the sum of the k-th missing positive number for every possible subset of the list.  The k-th missing positive number for a set is the smallest positive integer not in the set that is greater than zero.  Output the final sum modulo 10^9 + 7."}]}