{"uid": "1994-F", "url": "https://codeforces.com/contest/1994/problem/F", "tags": ["constructive algorithms", " dfs and similar", " graphs", " trees"], "title": "1994-F", "statement": "F. Stardew Valleytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPelican Town represents $$$n$$$ houses connected by $$$m$$$ bidirectional roads. Some roads haveNPCsstanding on them. Farmer Buba needs to walk on each road with an NPC and talk to them.Help the farmer find a route satisfying the following properties:The route starts at some house, follows the roads, and ends at the same house.The route does not follow any road more than once (in both directions together).The route follows each road with an NPC exactly once.Note that the route can follow roads without NPCs, and you donotneed to minimize the length of the route.It isguaranteedthat you can reach any house from any other by walking on the roads with NPCs only.InputEach test consists of multiple test cases. The first line contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^{4}$$$) — the number of test cases. Then follows the description of the test cases.The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$2 \\\\leq n \\\\leq 5 \\\\cdot 10^5, 1 \\\\leq m \\\\leq 5 \\\\cdot 10^5$$$) — the number of houses and roads inPelican Townrespectively.In each of the next $$$m$$$ lines, three integers $$$u$$$, $$$v$$$, and $$$c$$$ ($$$1 \\\\leq u, v \\\\leq n, c = 0/1$$$) are given — the ends of the road and whether anNPCis on this road. If $$$c = 1$$$, then the road has an NPC. If $$$c = 0$$$, then the road has no NPC.The graph may contain multiple edges and loops, and if there are multiple edges withNPCsstanding on them, the route must follow each of these roads.It is guaranteed that you can reach any house from any other by walking on the roads with NPCs only.It is guaranteed that the sum of $$$n$$$ and $$$m$$$ for all test cases does not exceed $$$5 \\\\cdot 10^5$$$.OutputFor each test case, if there is no solution, then output \"No\" (without quotes).Otherwise, output \"Yes\" (without quotes), and then output $$$k$$$ — the number of roads in the route. In the next line, output $$$k + 1$$$ numbers — the houses of the route in the order of traversal. Note that the first house should match the last one, as the route is cyclic.If there are multiple answers, you can print any of them.You can output each letter in any case (for example, the strings \"yEs\", \"yes\", \"Yes\", and \"YES\" will be recognized as a positive answer).ExampleInput33 21 2 12 3 13 31 2 11 3 12 3 05 91 2 05 2 15 4 15 1 12 3 15 2 14 1 04 3 05 2 0OutputNO YES 3 1 2 3 1  YES 7 1 2 5 4 3 2 5 1NoteNote that in the third test case, there are multiple edges $$$(5, 2)$$$. You must walk on two of them.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5bf5e3c8", "template_md5": "35d339e4", "result": "You are given a town with $n$ houses connected by $m$ two-way roads. Some roads have a person standing on them.  You need to find a route that:\n\n* Starts at a house.\n* Visits each road with a person exactly once.\n* Returns to the starting house.\n* Does not repeat any road (in either direction).\n\nIf such a route exists, output \"Yes\" followed by the number of roads in the route and the list of houses visited in order. If no such route exists, output \"No\"."}, {"prompt_md5": "511ff8ce", "template_md5": "465699a0", "result": "You are given a map with houses connected by roads. Some roads have people on them. You need to find a path that starts and ends at the same house, visits every person exactly once, and doesn't repeat any roads. If such a path exists, output \"Yes\" followed by the number of roads in the path and the order of the houses visited. Otherwise, output \"No\"."}]}