{"uid": "1994-B", "url": "https://codeforces.com/contest/1994/problem/B", "tags": ["bitmasks", " constructive algorithms", " greedy", " math"], "title": "1994-B", "statement": "B. Fun Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVova really loves theXORoperation (denoted as $$$\\\\oplus$$$). Recently, when he was going to sleep, he came up with a fun game.At the beginning of the game, Vova chooses two binary sequences $$$s$$$ and $$$t$$$ of length $$$n$$$ and gives them to Vanya. A binary sequence is a sequence consisting only of the numbers $$$0$$$ and $$$1$$$. Vanya can choose integers $$$l, r$$$ such that $$$1 \\\\leq l \\\\leq r \\\\leq n$$$, and for all $$$l \\\\leq i \\\\leq r$$$simultaneouslyreplace $$$s_i$$$ with $$$s_i \\\\oplus s_{i - l + 1}$$$, where $$$s_i$$$ is the $$$i$$$-th element of the sequence $$$s$$$.In order for the game to beinteresting, there must be a possibility to win. Vanya wins if, with anunlimitednumber of actions, he can obtain the sequence $$$t$$$ from the sequence $$$s$$$. Determine if the game will beinterestingfor the sequences $$$s$$$ and $$$t$$$.InputEach test consists of multiple test cases. The first line contains an integer $$$q$$$ ($$$1 \\\\le q \\\\le 10^{4}$$$) — the number of test cases. Then follows the description of the test cases.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 2 \\\\cdot 10^5$$$) — the length of the sequences $$$s$$$ and $$$t$$$.The second line of each test case contains a binary sequence $$$s$$$ of length $$$n$$$.The third line of each test case contains a binary sequence $$$t$$$ of length $$$n$$$.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case, output \"Yes\" if the game will beinteresting, otherwise output \"No\".You can output each letter in any case (for example, the strings \"yEs\", \"yes\", \"Yes\", and \"YES\" will be recognized as a positive answer).ExampleInput6101701101000110100910010101010111111040011101140100000181011011101100000OutputNO YES YES NO YES YESNoteIn the first test case, Vanya will not be able to change the sequence $$$s$$$ with the only possible action of choosing $$$l = r = 1$$$.In the second test case, the sequences $$$s$$$ and $$$t$$$ are already equal.In the third test case, Vanya can act as follows:Choose $$$l = 3$$$ and $$$r = 5$$$, then $$$s$$$ will become $$$\\\\mathtt{101101010}$$$.Choose $$$l = 5$$$ and $$$r = 6$$$, then $$$s$$$ will become $$$\\\\mathtt{101111010}$$$.Choose $$$l = 7$$$ and $$$r = 7$$$, then $$$s$$$ will become $$$\\\\mathtt{101111110}$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "49d8db47", "template_md5": "35d339e4", "result": "You are given two binary sequences,  $s$ and $t$, both of length $n$.  \n\nA player can choose integers $l$ and $r$ where $1 \\le l \\le r \\le n$.  They can then perform the following operation on the sequence $s$: for each $i$ from $l$ to $r$, replace $s_i$ with $s_i \\oplus s_{i-l+1}$. Here, $\\oplus$ represents the bitwise XOR operation.\n\nDetermine if it is possible for the player to transform sequence $s$ into sequence $t$ through a series of these operations. If it is possible, output \"Yes\"; otherwise, output \"No\"."}, {"prompt_md5": "3ce9c933", "template_md5": "465699a0", "result": "Given two binary strings of the same length, determine if one string can be transformed into the other by repeatedly applying a specific operation. The operation involves choosing a segment of the string and XORing each element in the segment with the element at the beginning of the segment."}]}