{"uid": "1999-C", "url": "https://codeforces.com/contest/1999/problem/C", "tags": ["greedy", " implementation"], "title": "1999-C", "statement": "C. Showeringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAs a computer science student, Alex faces a hard challenge — showering. He tries to shower daily, but despite his best efforts there are always challenges. He takes $$$s$$$ minutes to shower and a day only has $$$m$$$ minutes!He already has $$$n$$$ tasks planned for the day. Task $$$i$$$ is represented as an interval $$$(l_i$$$, $$$r_i)$$$, which means that Alex is busy and can not take a shower in that time interval (at any point in time strictly between $$$l_i$$$ and $$$r_i$$$).No two tasks overlap.Given all $$$n$$$ time intervals, will Alex be able to shower that day? In other words, will Alex have a free time interval of length at least $$$s$$$?In the first test case, Alex can shower for the first $$$3$$$ minutes of the day and not miss any of the tasks.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\leq t \\\\leq 10^4$$$) — the number of test cases.The first line of each test case contains three integers $$$n$$$, $$$s$$$, and $$$m$$$ ($$$1 \\\\leq n \\\\leq 2 \\\\cdot 10^5$$$; $$$1 \\\\leq s, m \\\\leq 10^9$$$) — the number of time intervals Alex already has planned, the amount of time Alex takes to take a shower, and the amount of minutes a day has.Then $$$n$$$ lines follow, the $$$i$$$-th of which contains two integers $$$l_i$$$ and $$$r_i$$$ ($$$0 \\\\leq l_i < r_i \\\\leq m$$$) — the time interval of the $$$i$$$-th task. No two tasks overlap.Additional constraint on the input:$$$l_i > r_{i-1}$$$ for every $$$i > 1$$$.The sum of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each test case output \"YES\" (without quotes) if Alex can take a shower for that given test case, and \"NO\" (also without quotes) otherwise.You can output \"YES\" and \"NO\" in any case (for example, strings \"yEs\", \"yes\", and \"Yes\" will be recognized as a positive response).ExampleInput43 3 103 56 89 103 3 101 23 56 73 3 101 23 56 83 4 101 26 78 9OutputYES YES NO YES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "62ac527a", "template_md5": "35d339e4", "result": "You are given a number of time intervals, each representing a busy period.  You also have a desired shower time and the total number of minutes in a day.  \n\nDetermine if there is a free time interval of at least the desired shower time within the day, considering the busy periods.\n\n**Input:**\n\n*  $t$: The number of test cases.\n* For each test case:\n    * $n$: The number of busy time intervals.\n    * $s$: The desired shower time.\n    * $m$: The total number of minutes in a day.\n    * $n$ lines follow, each containing two integers $l_i$ and $r_i$, representing the start and end times of a busy interval.\n\n**Output:**\n\n* For each test case, output \"YES\" if a shower is possible, and \"NO\" otherwise."}, {"prompt_md5": "af901f9c", "template_md5": "465699a0", "result": "Given a fixed amount of time and a list of non-overlapping time intervals, determine if there is a free time slot of a specific length."}]}