{"uid": "20-C", "url": "https://codeforces.com/contest/20/problem/C", "tags": ["graphs", " shortest paths"], "title": "20-C", "statement": "C. Dijkstra?time limit per test1 secondmemory limit per test64 megabytesinputstdinoutputstdoutYou are given a weighted undirected graph. The vertices are enumerated from 1 ton. Your task is to find the shortest path between the vertex1and the vertexn.InputThe first line contains two integersnandm(2 ≤n≤ 105, 0 ≤m≤ 105), wherenis the number of vertices andmis the number of edges. Followingmlines contain one edge each in formai,biandwi(1 ≤ai,bi≤n, 1 ≤wi≤ 106), whereai,biare edge endpoints andwiis the length of the edge.It is possible that the graph has loops and multiple edges between pair of vertices.OutputWrite the only integer-1in case of no path. Write the shortest path in opposite case. If there are many solutions, print any of them.ExamplesInput5 61 2 22 5 52 3 41 4 14 3 33 5 1Output1 4 3 5Input5 61 2 22 5 52 3 41 4 14 3 33 5 1Output1 4 3 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a58ff351", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices (numbered from 1 to $n$) and $m$ edges. Each edge connects two vertices and has a weight.  \n\nYour task is to find the shortest path between vertex 1 and vertex $n$.  \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of vertices and edges, respectively.\n* The following $m$ lines each describe an edge with three integers: $a_i$, $b_i$, and $w_i$. These represent the two vertices connected by the edge ($a_i$ and $b_i$) and the weight of the edge ($w_i$).\n\n**Output:**\n\n* If there is no path between vertex 1 and vertex $n$, print `-1`.\n* Otherwise, print the shortest path from vertex 1 to vertex $n$. You can print any one of the shortest paths."}, {"prompt_md5": "c186c7aa", "template_md5": "465699a0", "result": "You are given a network of connected points.  Find the shortest path between the first and last point.  If there is no path, output -1."}]}