{"uid": "200-C", "url": "https://codeforces.com/contest/200/problem/C", "tags": ["brute force", " implementation"], "title": "200-C", "statement": "C. Football Championshiptime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAny resemblance to any real championship and sport is accidental.The Berland National team takes part in the local Football championship which now has a group stage. Let's describe the formal rules of the local championship:the team that kicked most balls in the enemy's goal area wins the game;the victory gives 3 point to the team, the draw gives 1 point and the defeat gives 0 points;a group consists of four teams, the teams are ranked by the results of six games: each team plays exactly once with each other team;the teams that get places 1 and 2 in the group stage results, go to the next stage of the championship.In the group stage the team's place is defined by the total number of scored points: the more points, the higher the place is. If two or more teams have the same number of points, then the following criteria are used (the criteria are listed in the order of falling priority, starting from the most important one):the difference between the total number of scored goals and the total number of missed goals in the championship: the team with a higher value gets a higher place;the total number of scored goals in the championship: the team with a higher value gets a higher place;the lexicographical order of the name of the teams' countries: the country with the lexicographically smaller name gets a higher place.The Berland team plays in the group where the results of 5 out of 6 games are already known. To be exact, there is the last game left. There the Berand national team plays with some other team. The coach asks you to find such scoreX:Y(whereXis the number of goals Berland scored andYis the number of goals the opponent scored in the game), that fulfills the following conditions:X>Y, that is, Berland is going to win this game;after the game Berland gets the 1st or the 2nd place in the group;if there are multiple variants, you should choose such scoreX:Y, where valueX-Yis minimum;if it is still impossible to come up with one score, you should choose the score where valueY(the number of goals Berland misses) is minimum.InputThe input has five lines.Each line describes a game as \"team1team2goals1:goals2\" (without the quotes), what means that teamteam1played a game with teamteam2, besides,team1scoredgoals1goals andteam2scoredgoals2goals. The names of teamsteam1andteam2are non-empty strings, consisting of uppercase English letters, with length of no more than 20 characters;goals1,goals2are integers from 0 to 9.The Berland team is called \"BERLAND\". It is guaranteed that the Berland team and one more team played exactly 2 games and the the other teams played exactly 3 games.OutputPrint the required score in the last game asX:Y, whereXis the number of goals Berland scored andYis the number of goals the opponent scored. If the Berland team does not get the first or the second place in the group, whatever this game's score is, then print on a single line \"IMPOSSIBLE\" (without the quotes).Note, that the result score can be very huge, 10:0 for example.ExamplesInputAERLAND DERLAND 2:1DERLAND CERLAND 0:3CERLAND AERLAND 0:1AERLAND BERLAND 2:0DERLAND BERLAND 4:0Output6:0InputAERLAND DERLAND 2:2DERLAND CERLAND 2:3CERLAND AERLAND 1:3AERLAND BERLAND 2:1DERLAND BERLAND 4:1OutputIMPOSSIBLENoteIn the first sample \"BERLAND\" plays the last game with team \"CERLAND\". If Berland wins with score 6:0, the results' table looks like that in the end:AERLAND (points: 9, the difference between scored and missed goals: 4, scored goals: 5)BERLAND (points: 3, the difference between scored and missed goals: 0, scored goals: 6)DERLAND (points: 3, the difference between scored and missed goals: 0, scored goals: 5)CERLAND (points: 3, the difference between scored and missed goals: -4, scored goals: 3)In the second sample teams \"AERLAND\" and \"DERLAND\" have already won 7 and 4 points, respectively. The Berland team wins only 3 points, which is not enough to advance to the next championship stage.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "14c5623b", "template_md5": "35d339e4", "result": "Four teams compete in a football group stage. Each team plays every other team once. \n\nTeams earn 3 points for a win, 1 point for a draw, and 0 points for a loss. \n\nThe top two teams advance to the next stage. \n\nIf teams are tied on points, the following tiebreakers are used in order:\n\n1. Goal difference (goals scored - goals conceded)\n2. Total goals scored\n3. Lexicographical order of team names\n\nYou are given the results of 5 out of 6 games. The last game is between Team A and Team B. \n\nFind a score (goals scored by Team A : goals scored by Team B) that satisfies the following:\n\n* Team A wins the game (Team A scores more goals than Team B).\n* Team A finishes in 1st or 2nd place after the last game.\n\nIf there are multiple possible scores, choose the one where the difference between goals scored and conceded by Team A is minimized. If there are still multiple options, choose the score where Team A concedes the fewest goals.\n\nIf it is impossible for Team A to finish in 1st or 2nd place, print \"IMPOSSIBLE\"."}, {"prompt_md5": "6798a4ba", "template_md5": "465699a0", "result": "Four teams play each other in a tournament.  The top two teams advance.  You know the results of five games.  You need to figure out a score for the last game so that your team finishes in first or second place.  If there are multiple ways to do this, choose the score where the difference between goals scored and goals allowed is smallest. If there are still multiple ways, choose the score where your team allows the fewest goals. If it's impossible to finish in the top two, say \"IMPOSSIBLE\"."}]}