{"uid": "2000-E", "url": "https://codeforces.com/contest/2000/problem/E", "tags": ["combinatorics", " data structures", " greedy", " math"], "title": "2000-E", "statement": "E. Photoshoot for Gorillastime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou really love gorillas, so you decided to organize a photoshoot for them. Gorillas live in the jungle. The jungle is represented as a grid of $$$n$$$ rows and $$$m$$$ columns. $$$w$$$ gorillas agreed to participate in the photoshoot, and the gorilla with index $$$i$$$ ($$$1 \\\\le i \\\\le w$$$) has aheightof $$$a_i$$$. You want to placeallthe gorillas in the cells of the grid such that there isno more than one gorillain each cell.Thespectacleof the arrangement is equal to the sum of thespectaclesof all sub-squares of the grid with a side length of $$$k$$$.Thespectacleof a sub-square is equal to the sum of theheightsof the gorillas in it.From all suitable arrangements, choose the arrangement with themaximumspectacle.InputThe first line contains an integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^3$$$) — the number of test cases.The descriptions of the test cases follow.The first line contains integers $$$n$$$, $$$m$$$, $$$k$$$ ($$$1 \\\\le n, m \\\\le 2 \\\\cdot 10^5$$$, $$$1 \\\\le n \\\\cdot m \\\\le 2 \\\\cdot 10^5$$$, $$$1 \\\\le k \\\\le \\\\min(n, m)$$$) — the dimensions of the grid and the side length of the square.The second line contains an integer $$$w$$$ ($$$1 \\\\le w \\\\le n \\\\cdot m$$$) — the number of gorillas.The third line contains $$$w$$$ integers $$$a_1, a_2, \\\\ldots, a_w$$$ ($$$1 \\\\le a_i \\\\le 10^9$$$) — theheightsof the gorillas.It is guaranteed that the sum of $$$n \\\\cdot m$$$ across all test cases does not exceed $$$2 \\\\cdot 10^5$$$. The same guarantee applies to $$$w$$$.OutputFor each test case, output a single integer — themaximumspectacleof a suitable arrangement.ExampleInput53 4 291 1 1 1 1 1 1 1 12 1 125 720 15 794 1 4 5 6 1 1000000000 898 7771984 1 145 4 1499 20049 5 566 7 14 16 16 6Output21 12 49000083104 3512 319NoteIn the first test case of the first input set, thespectacleof the following sub-squares is summed:Yellow color corresponds to the sub-squares, green — to the rest of the grid squares.The picture shows the optimal arrangement of the gorillas. Thespectacleof the arrangement is $$$4 + 4 + 3 + 3 + 4 + 3 = 21$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7f8c616f", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$ and $w$ gorillas, each with a height $a_i$.  You need to place the gorillas in the grid cells so that no two gorillas occupy the same cell.\n\nThe \"spectacle\" of a placement is calculated as the sum of the heights of gorillas in all sub-squares of the grid with side length $k$.\n\nFind the placement of gorillas that maximizes the spectacle. \n\n**Input:**\n\n* $t$ - the number of test cases\n* For each test case:\n    * $n$, $m$, $k$ - dimensions of the grid and side length of the sub-squares\n    * $w$ - number of gorillas\n    * $a_1, a_2, ..., a_w$ - heights of the gorillas\n\n**Output:**\n\n* For each test case, output the maximum spectacle achievable."}, {"prompt_md5": "a819bf35", "template_md5": "465699a0", "result": "You have a grid and a set of numbers.  You need to place the numbers into the grid so that each cell has at most one number.  The goal is to find a placement that maximizes the sum of the numbers in all possible sub-squares of a given size."}]}