{"uid": "2002-B", "url": "https://codeforces.com/contest/2002/problem/B", "tags": ["constructive algorithms", " games"], "title": "2002-B", "statement": "B. Removals Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice got a permutation $$$a_1, a_2, \\\\ldots, a_n$$$ of $$$[1,2,\\\\ldots,n]$$$, and Bob got another permutation $$$b_1, b_2, \\\\ldots, b_n$$$ of $$$[1,2,\\\\ldots,n]$$$. They are going to play a game with these arrays.In each turn, the following events happen in order:Alice chooses either the first or the last element of her array and removes it from the array;Bob chooses either the first or the last element of his array and removes it from the array.The game continues for $$$n-1$$$ turns, after which both arrays will have exactly one remaining element: $$$x$$$ in the array $$$a$$$ and $$$y$$$ in the array $$$b$$$.If $$$x=y$$$, Bob wins; otherwise, Alice wins. Find which player will win if both players play optimally.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1\\\\le t\\\\le10^4$$$). The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1\\\\le n\\\\le 3\\\\cdot 10^5$$$).The next line contains $$$n$$$ integers $$$a_1,a_2,\\\\ldots,a_n$$$ ($$$1\\\\le a_i\\\\le n$$$, all $$$a_i$$$ are distinct) — the permutation of Alice.The next line contains $$$n$$$ integers $$$b_1,b_2,\\\\ldots,b_n$$$ ($$$1\\\\le b_i\\\\le n$$$, all $$$b_i$$$ are distinct) — the permutation of Bob.It is guaranteed that the sum of all $$$n$$$ does not exceed $$$3\\\\cdot 10^5$$$.OutputFor each test case, print a single line with the name of the winner, assuming both players play optimally. If Alice wins, print $$$\\\\texttt{Alice}$$$; otherwise, print $$$\\\\texttt{Bob}$$$.ExampleInput221 21 231 2 32 3 1OutputBob AliceNoteIn the first test case, Bob can win the game by deleting the same element as Alice did.In the second test case, Alice can delete $$$3$$$ in the first turn, and then in the second turn, delete the element that is different from the one Bob deleted in the first turn to win the game.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ca67b24f", "template_md5": "35d339e4", "result": "Two players are given permutations of numbers from 1 to $n$.  They take turns removing either the first or last element from their permutation. The game ends after $n-1$ turns, leaving one element in each permutation. If the remaining elements are equal, Player 2 wins; otherwise, Player 1 wins.  Determine the winner if both players play optimally. \n\nInput:\n\n* $t$ - the number of test cases\n* For each test case:\n    * $n$ - the length of the permutations\n    * $a_1, a_2, ..., a_n$ - Player 1's permutation\n    * $b_1, b_2, ..., b_n$ - Player 2's permutation\n\nOutput:\n\n* For each test case, print \"Player 1\" if Player 1 wins, otherwise print \"Player 2\"."}, {"prompt_md5": "be6f6aa2", "template_md5": "465699a0", "result": "Two players take turns removing elements from the ends of their lists. The lists start with the same numbers in a different order. The player who has the same number remaining at the end wins. Determine the winner if both players play optimally."}]}