{"uid": "2004-D", "url": "https://codeforces.com/contest/2004/problem/D", "tags": ["binary search", " brute force", " data structures", " graphs", " greedy", " implementation", " shortest paths"], "title": "2004-D", "statement": "D. Colored Portalstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ cities located on a straight line. The cities are numbered from $$$1$$$ to $$$n$$$.Portals are used to move between cities. There are $$$4$$$ colors of portals: blue, green, red, and yellow. Each city has portals of two different colors. You can move from city $$$i$$$ to city $$$j$$$ if they have portals of the same color (for example, you can move between a \"blue-red\" city and a \"blue-green\" city). This movement costs $$$|i-j|$$$ coins.Your task is to answer $$$q$$$ independent queries: calculate the minimum cost to move from city $$$x$$$ to city $$$y$$$.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains two integers $$$n$$$ and $$$q$$$ ($$$1 \\\\le n, q \\\\le 2 \\\\cdot 10^5$$$) — the number of cities and the number of queries, respectively.The second line contains $$$n$$$ strings of the following types:BG,BR,BY,GR,GY, orRY; the $$$i$$$-th of them describes the portals located in the $$$i$$$-th city; the symbolBindicates that there is a blue portal in the city,G— green,R— red, andY— yellow.The $$$j$$$-th of the next $$$q$$$ lines contains two integers $$$x_j$$$ and $$$y_j$$$ ($$$1 \\\\le x_j, y_j \\\\le n$$$) — the description of the $$$j$$$-th query.Additional constraints on the input:the sum of $$$n$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$;the sum of $$$q$$$ over all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputFor each query, print a single integer — the minimum cost to move from city $$$x$$$ to city $$$y$$$ (or $$$-1$$$ if it is impossible).ExampleInput24 5BR BR GY GR1 23 14 41 44 22 1BG RY1 2Output1 4 0 3 2 -1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9afc4220", "template_md5": "35d339e4", "result": "There are $n$ cities arranged in a line. Each city has portals of two different colors: blue, green, red, or yellow. You can travel between cities if they have portals of the same color. The cost to travel between cities $i$ and $j$ is $|i-j|$.\n\nYou are given $q$ queries. Each query consists of two cities, $x$ and $y$. For each query, find the minimum cost to travel from city $x$ to city $y$. If it's impossible to travel between the cities, output $-1$. \n\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains two integers, $n$ (the number of cities) and $q$ (the number of queries).\n    * The second line contains $n$ strings, each representing the colors of portals in a city (e.g., \"BR\" means blue and red portals).\n    * The next $q$ lines each contain two integers, $x$ and $y$, representing a query.\n\n**Output:**\n\nFor each query, print the minimum cost to travel from city $x$ to city $y$. If it's impossible, print $-1$."}, {"prompt_md5": "856d641e", "template_md5": "465699a0", "result": "You are given a line with cities, each having two types of portals. You can travel between cities if they have the same portal type. The cost to travel is the distance between the cities.  Find the cheapest way to travel between given pairs of cities."}]}