{"uid": "2004-E", "url": "https://codeforces.com/contest/2004/problem/E", "tags": ["brute force", " games", " math", " number theory"], "title": "2004-E", "statement": "E. Not a Nim Problemtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputTwo players, Alice and Bob, are playing a game. They have $$$n$$$ piles of stones, with the $$$i$$$-th pile initially containing $$$a_i$$$ stones.On their turn, a player can choose any pile of stones and take any positive number of stones from it, with one condition:let the current number of stones in the pile be $$$x$$$. It is not allowed to take from the pile a number of stones $$$y$$$ such that the greatest common divisor of $$$x$$$ and $$$y$$$ is not equal to $$$1$$$.The player who cannot make a move loses. Both players play optimally (that is, if a player has a strategy that allows them to win, no matter how the opponent responds, they will win). Alice goes first.Determine who will win.InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.Each test case consists of two lines:the first line contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 3 \\\\cdot 10^5$$$);the second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^7$$$).Additional constraint on the input: the sum of $$$n$$$ across all test cases does not exceed $$$3 \\\\cdot 10^5$$$.OutputFor each test case, outputAliceif Alice wins, orBobif Bob wins.ExampleInput333 2 943 3 6 151 2 3 4 5OutputBob Alice Bob", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "015b83de", "template_md5": "35d339e4", "result": "There are $n$ piles of stones. Each pile has a certain number of stones. \n\nTwo players take turns. On their turn, a player can choose any pile and take out any positive number of stones from it.  However, the number of stones taken out must be relatively prime to the number of stones remaining in the pile (their greatest common divisor must be 1).\n\nThe first player to be unable to make a move loses.  Determine which player will win if both players play optimally.\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* Each test case has two lines:\n    * The first line contains the number of piles, $n$.\n    * The second line contains $n$ integers, $a_1, a_2, ..., a_n$, representing the number of stones in each pile.\n\nOutput:\n\nFor each test case, output \"Alice\" if Alice wins, or \"Bob\" if Bob wins."}, {"prompt_md5": "eee14d36", "template_md5": "465699a0", "result": "Two players take turns removing stones from piles. Each pile has a number of stones.  A player can remove any positive number of stones, but the number removed must be relatively prime to the number of stones remaining in the pile. The first player to be unable to make a move loses. Determine which player will win."}]}