{"uid": "2004-B", "url": "https://codeforces.com/contest/2004/problem/B", "tags": ["brute force", " greedy"], "title": "2004-B", "statement": "B. Game with Doorstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$100$$$ rooms arranged in a row and $$$99$$$ doors between them; the $$$i$$$-th door connects rooms $$$i$$$ and $$$i+1$$$. Each door can be either locked or unlocked. Initially, all doors are unlocked.We say that room $$$x$$$ is reachable from room $$$y$$$ if all doors between them are unlocked.You know that:Alice is in some room from the segment $$$[l, r]$$$;Bob is in some room from the segment $$$[L, R]$$$;Alice and Bob are in different rooms.However, you don't know the exact rooms they are in.You don't want Alice and Bob to be able to reach each other, so you are going to lock some doors to prevent that. What's the smallest number of doors you have to lock so that Alice and Bob cannot meet, regardless of their starting positions inside the given segments?InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains two integers $$$l$$$ and $$$r$$$ ($$$1 \\\\le l < r \\\\le 100$$$) — the bounds of the segment of rooms where Alice is located.The second line of each test case contains two integers $$$L$$$ and $$$R$$$ ($$$1 \\\\le L < R \\\\le 100$$$) — the bounds of the segment of rooms where Bob is located.OutputFor each test case, print a single integer — the smallest number of doors you have to lock so that Alice and Bob cannot meet, regardless of their starting positions inside the given segments.ExampleInput41 23 42 52 53 76 74 52 8Output1 3 2 3NoteIn the first test case, it is sufficient to lock the door between rooms $$$2$$$ and $$$3$$$.In the second test case, the following doors have to be locked: $$$(2,3)$$$, $$$(3,4)$$$, $$$(4,5)$$$.In the third test case, the following doors have to be locked: $$$(5, 6)$$$ and $$$(6,7)$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1650bac1", "template_md5": "35d339e4", "result": "There are 100 rooms arranged in a row with 99 doors connecting them. Initially, all doors are open.\n\nYou are given two segments of rooms:\n\n* Segment 1: Rooms from $l$ to $r$ (inclusive)\n* Segment 2: Rooms from $L$ to $R$ (inclusive)\n\nYou know that someone is in a room within Segment 1 and someone else is in a room within Segment 2.  \n\nYour goal is to find the minimum number of doors you need to close to ensure that the people in the two segments can never reach each other, no matter which room they start in. \n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains two integers, $l$ and $r$.\n    * The second line contains two integers, $L$ and $R$.\n\nOutput:\n\nFor each test case, print the minimum number of doors you need to close."}, {"prompt_md5": "9ecfca22", "template_md5": "465699a0", "result": "You have 100 rooms connected by 99 doors.  Two people are in different rooms within separate ranges of rooms.  You need to lock the minimum number of doors to prevent the two people from being able to reach each other, no matter where they start in their respective ranges."}]}