{"uid": "2008-B", "url": "https://codeforces.com/contest/2008/problem/B", "tags": ["brute force", " math", " strings"], "title": "2008-B", "statement": "B. Square or Nottime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA beautiful binary matrix is a matrix that has ones on its edges and zeros inside.Examples of four beautiful binary matrices.Today, Sakurako was playing with a beautiful binary matrix of size $$$r \\\\times c$$$ and created a binary string $$$s$$$ by writing down all the rows of the matrix, starting from the first and ending with the $$$r$$$-th. More formally, the element from the matrix in the $$$i$$$-th row and $$$j$$$-th column corresponds to the $$$((i-1)*c+j)$$$-th element of the string.You need to check whether the beautiful matrix from which the string $$$s$$$ was obtained could besquared. In other words, you need to check whether the string $$$s$$$ could have been build from asquarebeautiful binary matrix (i.e., one where $$$r=c$$$).InputThe first line contains a single integer $$$t$$$ ($$$1 \\\\le t \\\\le 10^4$$$) — the number of test cases.The first line of each test case contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the length of the string.The second line of each test case contains the string $$$s$$$ of length $$$n$$$.The string is always the result of writing out the strings of a beautiful matrix.It is guaranteed that the sum of $$$n$$$ across all test cases does not exceed $$$2 \\\\cdot 10^5$$$.OutputPrint \"Yes\", if the original matrix could have been square, and \"No\" otherwise.ExampleInput5211411119111101111911111111112111110011111OutputNo Yes Yes No NoNoteFor the second test case, string 1111 can be obtained from the matrix:$$$1$$$$$$1$$$$$$1$$$$$$1$$$For the third test case, string 111101111 can be obtained from the matrix:$$$1$$$$$$1$$$$$$1$$$$$$1$$$$$$0$$$$$$1$$$$$$1$$$$$$1$$$$$$1$$$There is no square matrix in the fourth case, such that the string can be obtained from it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d1a106ed", "template_md5": "35d339e4", "result": "You are given a binary string $s$ of length $n$.  Determine if $s$ could have been formed by reading the rows of a square binary matrix (where the number of rows equals the number of columns) where the matrix has ones on its edges and zeros inside.\n\nInput:\n\n* The first line contains an integer $t$ ($1 \\le t \\le 10^4$) representing the number of test cases.\n* For each test case:\n    * The first line contains an integer $n$ ($2 \\le n \\le 2 \\cdot 10^5$) representing the length of the string.\n    * The second line contains the binary string $s$ of length $n$.\n\nOutput:\n\nFor each test case, print \"Yes\" if the string could have been formed from a square matrix, and \"No\" otherwise."}, {"prompt_md5": "f36236d7", "template_md5": "465699a0", "result": "Given a binary string, determine if it can be formed from a square matrix where the edges are ones and the interior is zeros."}]}