{"uid": "2011-A", "url": "https://codeforces.com/contest/2011/problem/A", "tags": ["*special"], "title": "2011-A", "statement": "A. Problem Solvingtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputJane has decided to solve a list of $$$n$$$ problems on Codeforces. The $$$i$$$-th problem in her list has difficulty $$$d_i$$$, and the last problem in the list is the hardest one (for every problem $$$j < n$$$, $$$d_j < d_n$$$).Jane's problem-solving skill is some integer $$$x$$$ (unknown to you). If a problem's difficulty is greater than $$$x$$$, then Jane cannot solve it, otherwise she can solve it.Jane has solved all problems form the list, except for the last one — she found out that it was too difficult for her. Can you uniquely determine the value of $$$x$$$ — Jane's problem solving skill?InputThe first line contains one integer $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$) — the number of test cases.Each test case consists of two lines:the first line contains one integer $$$n$$$ ($$$2 \\\\le n \\\\le 50$$$) — the number of problems;the second line contains $$$n$$$ integers $$$d_1, d_2, \\\\dots, d_n$$$ ($$$1 \\\\le d_i \\\\le 50$$$).Additional constraint on the input: in every test case, the last problem is more difficult than every other problem (i. e. $$$d_n > d_j$$$ for every $$$j < n$$$). This means that at least one possible value of $$$x$$$ exists.OutputFor each test case, print one line:if you can determine the value of $$$x$$$ uniquely, print $$$x$$$;otherwise, printAmbiguous.The checking program is case-sensitive, so if you printambiguousorAMBIGUOUS,your answer will be considered wrong.ExampleInput351 2 3 4 588 8 5 3 4 6 8 1243 3 3 4Output4 Ambiguous 3NoteIn the second test case of the example, the value of $$$x$$$ could be $$$11$$$, but it also could be $$$10$$$ (other possible values for $$$x$$$ also exist).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b026045f", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers, $d_1, d_2, ..., d_n$, representing the difficulty of $n$ problems. The last problem is the hardest ($d_n > d_j$ for all $j < n$).  You know that all problems except the last one were solved.  \n\nDetermine the smallest integer $x$ such that all problems with difficulty less than or equal to $x$ can be solved. If there is more than one possible value for $x$, print \"Ambiguous\"."}, {"prompt_md5": "7b3a5243", "template_md5": "465699a0", "result": "You are given a list of numbers representing the difficulty of problems. The last number is the hardest.  You know that the person solved all but the last problem. Determine the minimum skill level required to solve all the problems. If there is more than one possible skill level, say \"Ambiguous\"."}]}