{"uid": "2013-A", "url": "https://codeforces.com/contest/2013/problem/A", "tags": ["constructive algorithms", " math"], "title": "2013-A", "statement": "A. Zhan's Blendertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputToday, a club fair was held at \"NSPhM\". In order to advertise his pastry club, Zhan decided to demonstrate the power of his blender.To demonstrate the power of his blender, Zhan has $$$n$$$ fruits.The blender can mix up to $$$x$$$ fruits per second.In each second, Zhan can put up to $$$y$$$ fruits into the blender. After that, the blender will blend $$$\\\\min(x, c)$$$ fruits, where $$$c$$$ is the number of fruits inside the blender. After blending, blended fruits are removed from the blender.Help Zhan determine the minimum amount of time required for Zhan to blend all fruits.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 1000$$$). The description of the test cases follows.The first line of each test case contains one integer $$$n$$$ ($$$0 \\\\le n \\\\le 10^9$$$) — the number of fruits Zhan has.The second line of each test case contains two integers $$$x$$$ and $$$y$$$ ($$$1 \\\\le x, y \\\\le 10^9$$$) — the number of fruits the blender can blend per second and the number of fruits Zhan can put into the blender per second.OutputFor each testcase, output a single integer — the minimum number of seconds to blend all fruits.ExampleInput553 431 264 31004 393 3Output2 3 2 34 3NoteIn the first example, you can first put $$$2$$$ fruits in the blender. After that, the blender will mix these $$$2$$$ fruits, and in the end, there will be $$$0$$$ fruits left in the blender. Then you can put $$$3$$$ fruits into the blender, after which the blender will mix these $$$3$$$ fruits.In the second example, you can put $$$1$$$ fruit into the blender $$$3$$$ times.In the third example, you can first put $$$3$$$ fruits into the blender, then add another $$$3$$$ fruits.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1c03cc34", "template_md5": "35d339e4", "result": "You are given a number of fruits  ($n$) and two integers, $x$ and $y$. \n\n* $x$ represents the maximum number of fruits the blender can blend per second.\n* $y$ represents the maximum number of fruits that can be put into the blender per second.\n\nThe blender blends a maximum of  $\\min(x, c)$ fruits in each second, where $c$ is the number of fruits currently inside the blender. After blending, the blended fruits are removed.\n\nFind the minimum time (in seconds) required to blend all the fruits."}, {"prompt_md5": "5d3d22a9", "template_md5": "465699a0", "result": "You have a number of items. You can put a certain number of items into a container each second. The container can process a certain number of items per second.  What is the minimum time to process all the items?"}]}