{"uid": "2018-E2", "url": "https://codeforces.com/contest/2018/problem/E2", "tags": ["binary search", " data structures", " divide and conquer", " dsu", " greedy", " math", " sortings"], "title": "2018-E2", "statement": "E2. Complex Segments (Hard Version)time limit per test13 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputKen Arai - COMPLEX⠀This is the hard version of the problem. In this version, the constraints on $$$n$$$ and the time limit are higher. You can make hacks only if both versions of the problem are solved.A set of (closed) segments iscomplexif it can be partitioned into some subsets such thatall the subsets have the same size; anda pair of segments intersectsif and only ifthe two segments are in the same subset.You are given $$$n$$$ segments $$$[l_1, r_1], [l_2, r_2], \\\\ldots, [l_n, r_n]$$$. Find the maximum size of acomplexsubset of these segments.InputEach test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\\\le t \\\\le 10^3$$$). The description of the test cases follows.The first line of each test case contains a single integer $$$n$$$ ($$$1 \\\\le n \\\\le 3 \\\\cdot 10^5$$$) — the number of segments.The second line of each test case contains $$$n$$$ integers $$$l_1, l_2, \\\\ldots, l_n$$$ ($$$1 \\\\le l_i \\\\le 2n$$$) — the left endpoints of the segments.The third line of each test case contains $$$n$$$ integers $$$r_1, r_2, \\\\ldots, r_n$$$ ($$$l_i \\\\leq r_i \\\\le 2n$$$) — the right endpoints of the segments.It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$3 \\\\cdot 10^5$$$.OutputFor each test case, output a single integer: the maximum size of acomplexsubset of the given segments.ExampleInput331 2 35 4 651 2 3 6 85 4 7 9 1053 1 4 1 57 2 6 5 10Output3 4 4NoteIn the first test case, all pairs of segments intersect, therefore it is optimal to form a single group containing all of the three segments.In the second test case, there is no valid partition for all of the five segments. A valid partition with four segments is the following: $$$\\\\{\\\\{ [1, 5], [2, 4] \\\\}, \\\\{ [6, 9], [8, 10] \\\\}\\\\}$$$.In the third test case, it is optimal to make a single group containing all the segments except the second.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d19898c7", "template_md5": "35d339e4", "result": "You are given a set of $n$ closed segments, where each segment is defined by its left endpoint ($l_i$) and right endpoint ($r_i$).  \n\nA set of segments is considered \"complex\" if:\n\n1. The segments can be divided into equal-sized subsets.\n2. Any two segments that belong to the same subset must intersect (meaning their ranges overlap).\n\nFind the largest possible size of a \"complex\" subset of these segments.\n\n**Input:**\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of segments, $n$.\n    * The second line contains $n$ integers, $l_1, l_2, ..., l_n$, representing the left endpoints of the segments.\n    * The third line contains $n$ integers, $r_1, r_2, ..., r_n$, representing the right endpoints of the segments.\n\n**Output:**\n\nFor each test case, output a single integer representing the maximum size of a \"complex\" subset of segments."}, {"prompt_md5": "e5d1daed", "template_md5": "465699a0", "result": "You are given a set of segments.  Segments can be grouped together if all pairs of segments within a group overlap. Find the largest possible group size."}]}