{"uid": "203-D", "url": "https://codeforces.com/contest/203/problem/D", "tags": ["geometry", " implementation", " math"], "title": "203-D", "statement": "D. Hit Balltime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutWhen Valera was playing football on a stadium, it suddenly began to rain. Valera hid in the corridor under the grandstand not to get wet. However, the desire to play was so great that he decided to train his hitting the ball right in this corridor. Valera went back far enough, put the ball and hit it. The ball bounced off the walls, the ceiling and the floor corridor and finally hit the exit door. As the ball was wet, it left a spot on the door. Now Valera wants to know the coordinates for this spot.Let's describe the event more formally. The ball will be considered a point in space. The door of the corridor will be considered a rectangle located on planexOz, such that the lower left corner of the door is located at point(0, 0, 0), and the upper right corner is located at point(a, 0,b). The corridor will be considered as a rectangular parallelepiped, infinite in the direction of increasing coordinates ofy. In this corridor the floor will be considered as planexOy, and the ceiling as plane, parallel toxOyand passing through point(a, 0,b). We will also assume that one of the walls is planeyOz, and the other wall is plane, parallel toyOzand passing through point(a, 0,b).We'll say that the ball hit the door when its coordinateywas equal to0. Thus the coordinates of the spot are point(x0, 0,z0), where0 ≤x0≤a, 0 ≤z0≤b. To hit the ball, Valera steps away from the door at distancemand puts the ball in the center of the corridor at point. After the hit the ball flies at speed(vx,vy,vz). This means that if the ball has coordinates(x,y,z), then after one second it will have coordinates(x+vx,y+vy,z+vz).See image in notes for clarification.When the ball collides with the ceiling, the floor or a wall of the corridor, it bounces off in accordance with the laws of reflection (the angle of incidence equals the angle of reflection). In the problem we consider the ideal physical model, so we can assume that there is no air resistance, friction force, or any loss of energy.InputThe first line contains three space-separated integersa,b,m(1 ≤a,b,m≤ 100). The first two integers specify point(a, 0,b), through which the ceiling and one of the corridor walls pass. The third integer is the distance at which Valera went away from the door.The second line has three space-separated integersvx,vy,vz(|vx|, |vy|, |vz| ≤ 100,vy< 0,vz≥ 0)— the speed of the ball after the hit.It is guaranteed that the ball hits the door.OutputPrint two real numbersx0,z0— thexandzcoordinates of point(x0, 0,z0), at which the ball hits the exit door. The answer will be considered correct, if its absolute or relative error does not exceed10- 6.ExamplesInput7 2 113 -11 2Output6.5000000000 2.0000000000Input7 2 114 -3 3Output4.1666666667 1.0000000000Note", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "67d8deb5", "template_md5": "35d339e4", "result": "A ball is hit inside a rectangular corridor. The corridor extends infinitely in the y-direction. The floor of the corridor is at $y=0$, the ceiling is parallel to the floor and at a height of $b$ units, and the walls are parallel to each other and extend infinitely in the $x$ and $z$ directions. One wall is at $z=0$ and the other is at $z=b$. The ball is hit at a distance $m$ from the door, which is a rectangle on the $xz$-plane with the bottom left corner at $(0,0,0)$ and the top right corner at $(a,0,b)$.\n\nThe ball is hit with an initial velocity $(vx, vy, vz)$.  \n\nGiven the dimensions of the corridor ($a$, $b$), the distance the ball is hit from the door ($m$), and the initial velocity of the ball ($vx$, $vy$, $vz$), find the coordinates $(x_0, 0, z_0)$ where the ball hits the door. \n\nAssume the ball bounces off the walls, ceiling, and floor according to the laws of reflection (angle of incidence equals angle of reflection)."}, {"prompt_md5": "b38e3346", "template_md5": "465699a0", "result": "A ball is launched in a rectangular room with a door at one end. The ball bounces off the walls and ceiling. Find the coordinates where the ball hits the door."}]}