{"uid": "203-A", "url": "https://codeforces.com/contest/203/problem/A", "tags": ["brute force", " implementation"], "title": "203-A", "statement": "A. Two Problemstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA boy Valera registered on siteCodeforcesasValera, and wrote his firstCodeforces Round #300. He boasted to a friend Arkady about winning as much asxpoints for his first contest. But Arkady did not believe his friend's words and decided to check whether Valera could have shown such a result.He knows that the contest number300was unusual because there were only two problems. The contest lasted fortminutes, the minutes are numbered starting from zero. The first problem had the initial cost ofapoints, and every minute its cost reduced bydapoints. The second problem had the initial cost ofbpoints, and every minute this cost reduced bydbpoints. Thus, as soon as the zero minute of the contest is over, the first problem will costa-dapoints, and the second problem will costb-dbpoints. It is guaranteed that at any moment of the contest each problem has a non-negative cost.Arkady asks you to find out whether Valera could have got exactlyxpoints for this contest. You should assume that Valera could have solved any number of the offered problems. You should also assume that for each problem Valera made no more than one attempt, besides, he could have submitted both problems at the same minute of the contest, starting with minute0and ending with minute numbert- 1. Please note that Valera can't submit a solution exactlytminutes after the start of the contest or later.InputThe single line of the input contains six integersx,t,a,b,da,db(0 ≤x≤ 600; 1 ≤t,a,b,da,db≤ 300)— Valera's result, the contest's duration, the initial cost of the first problem, the initial cost of the second problem, the number of points that the first and the second problem lose per minute, correspondingly.It is guaranteed that at each minute of the contest each problem has a non-negative cost, that is,a-i·da≥ 0andb-i·db≥ 0for all0 ≤i≤t- 1.OutputIf Valera could have earned exactlyxpoints at a contest, print \"YES\", otherwise print \"NO\" (without the quotes).ExamplesInput30 5 20 20 3 5OutputYESInput10 4 100 5 5 1OutputNONoteIn the first sample Valera could have acted like this: he could have submitted the first problem at minute0and the second problem — at minute2. Then the first problem brings him20points and the second problem brings him10points, that in total gives the required30points.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4ef56495", "template_md5": "35d339e4", "result": "You are given two problems with different initial costs and decreasing costs per minute. \n\n* Problem 1:\n    * Initial cost: $a$\n    * Cost reduction per minute: $d_a$\n* Problem 2:\n    * Initial cost: $b$\n    * Cost reduction per minute: $d_b$\n\nThe contest lasts for $t$ minutes.  \n\nDetermine if it is possible to earn exactly $x$ points by solving one or both problems at any point during the contest. You can solve each problem only once. \n\n**Input:**\n\n* $x$: The target number of points.\n* $t$: The contest duration in minutes.\n* $a$: The initial cost of Problem 1.\n* $b$: The initial cost of Problem 2.\n* $d_a$: The cost reduction per minute for Problem 1.\n* $d_b$: The cost reduction per minute for Problem 2.\n\n**Output:**\n\n* \"YES\" if it is possible to earn exactly $x$ points.\n* \"NO\" otherwise."}, {"prompt_md5": "09431bd4", "template_md5": "465699a0", "result": "You are given a target score and information about two problems in a contest. Each problem has a starting cost that decreases each minute.  You can solve each problem at most once. Determine if it's possible to achieve the target score by solving the problems."}]}