{"uid": "204-E", "url": "https://codeforces.com/contest/204/problem/E", "tags": ["data structures", " implementation", " string suffix structures", " two pointers"], "title": "204-E", "statement": "E. Little Elephant and Stringstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Little Elephant loves strings very much.He has an arrayafromnstrings, consisting of lowercase English letters. Let's number the elements of the array from 1 ton, then let's denote the element numberiasai. For each stringai(1 ≤i≤n)the Little Elephant wants to find the number of pairs of integerslandr(1 ≤l≤r≤ |ai|)such that substringai[l...r]is a substring to at leastkstrings from arraya(including thei-th string).Help the Little Elephant solve this problem.If you are not familiar with the basic notation in string problems, you can find the corresponding definitions in the notes.InputThe first line contains two space-separated integers —nandk(1 ≤n,k≤ 105). Nextnlines contain arraya. Thei-th line contains a non-empty stringai, consisting of lowercase English letter. The total length of all stringsaidoes not exceed105.OutputOn a single line printnspace-separated integers — thei-th number is the answer for stringai.Please, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.ExamplesInput3 1abcaabOutput6 1 3Input7 4rubikfurikababbabaaaabbbababaabababababazeroOutput1 0 9 9 21 30 0NoteLet's assume that you are given stringa=a1a2...a|a|, then let's denote the string's length as|a|and the string'si-th character asai.A substringa[l...r](1 ≤l≤r≤ |a|)of stringais stringalal+ 1...ar.Stringais a substring of stringb, if there exists such pair of integerslandr(1 ≤l≤r≤ |b|), thatb[l...r] =a.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7b99046b", "template_md5": "35d339e4", "result": "You are given an array of strings,  $a$, with $n$ strings.  For each string $a_i$ (where $1 \\le i \\le n$), find the number of pairs of integers $l$ and $r$ ($1 \\le l \\le r \\le |a_i|$) such that the substring $a_i[l...r]$ is a substring of at least $k$ other strings in the array $a$.\n\nOutput $n$ space-separated integers, where the $i$-th integer is the answer for string $a_i$."}, {"prompt_md5": "7a2bca7a", "template_md5": "465699a0", "result": "You are given a list of strings. For each string, count how many other strings in the list contain it as a substring."}]}