{"uid": "204-D", "url": "https://codeforces.com/contest/204/problem/D", "tags": ["dp"], "title": "204-D", "statement": "D. Little Elephant and Retro Stringstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Little Elephant has found a ragged old black-and-white stringson the attic.The characters of stringsare numbered from the left to the right from1to|s|, where|s|is the length of the string. Let's denote thei-th character of stringsassi. As the string is black-and-white, each character of the string is either letter \"B\", or letter \"W\". Unfortunately, the string is very old and some characters are damaged. The damaged positions are denoted as \"X\".The Little Elephant in determined to restore the string and hang it on the wall. For that he needs to replace each character \"X\" by a \"B\" or a \"W\". The string must look good on the wall, so it must bebeautiful. The Little Elephant considers a string beautiful if it has two non-intersecting substrings of a given lengthk, such that the left one fully consists of characters \"B\", and the right one fully consists of characters \"W\". More formally, there are four integersa,b,c,d(1 ≤a≤b<c≤d≤ |s|;b-a+ 1 =d-c+ 1 =k)such thatsi= \"B\"(a≤i≤b)andsj= \"W\"(c≤j≤d).Help the Little Elephant find the number of different beautiful strings he can obtain from strings. Two strings are considered different if there is such position, where the character in the first string differs from the corresponding character in the second string. If this string doesn't contain characters «X» and it is already beautiful — the answer is1.As the answer can be rather large, print it modulo1000000007(109+ 7).InputThe first line contains two space-separated integersnandk(1 ≤k≤n≤ 106). The second line contains strings. Stringshas lengthnand only consists of characters \"W\", \"B\" and \"X\".OutputOn a single line print an integer — the answer to the problem modulo1000000007(109+ 7).ExamplesInput3 2XXXOutput0Input4 2XXXXOutput1Input10 2XXBXXWXXXXOutput166", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "12820d64", "template_md5": "35d339e4", "result": "You are given a string of length $n$ consisting of characters 'B', 'W', and 'X'.  You need to replace all the 'X' characters with either 'B' or 'W' to make the string \"beautiful\". A string is considered beautiful if it can be divided into two non-overlapping substrings of length $k$, where one substring consists only of 'B's and the other consists only of 'W's.\n\nFind the number of different beautiful strings you can create.  Since the answer can be large, print it modulo 1000000007."}, {"prompt_md5": "420ccb75", "template_md5": "465699a0", "result": "You are given a string of length *n* containing only 'B', 'W', and 'X'.  You need to replace all 'X' with either 'B' or 'W' to create a string with two non-overlapping substrings of length *k*, one consisting only of 'B's and the other only of 'W's.  Find the number of different strings you can create."}]}