{"uid": "207-B3", "url": "https://codeforces.com/contest/207/problem/B3", "tags": [], "title": "207-B3", "statement": "B3. Military Trainingstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Smart Beaver from ABBYY started cooperating with the Ministry of Defence. Now they train soldiers to move armoured columns. The training involves testing a new type of tanks that can transmit information. To test the new type of tanks, the training has a special exercise, its essence is as follows.Initially, the column consists ofntanks sequentially numbered from1tonin the order of position in the column from its beginning to its end. During the whole exercise, exactlynmessages must be transferred from the beginning of the column to its end.Transferring one message is as follows. The tank that goes first in the column transmits the message to some tank in the column. The tank which received the message sends it further down the column. The process is continued until the last tank receives the message. It is possible that not all tanks in the column will receive the message — it is important that the last tank in the column should receive the message.After the last tank (tank numbern) receives the message, it moves to the beginning of the column and sends another message to the end of the column in the same manner. When the message reaches the last tank (tank numbern- 1), that tank moves to the beginning of the column and sends the next message to the end of the column, and so on. Thus, the exercise is completed when the tanks in the column return to their original order, that is, immediately after tank number1moves to the beginning of the column.If the tanks were initially placed in the column in the order1, 2, ...,n, then after the first message their order changes ton, 1, ...,n- 1, after the second message it changes ton- 1,n, 1, ...,n- 2, and so on.The tanks are constructed in a very peculiar way. The tank with numberiis characterized by one integerai, which is called themessage receiving radiusof this tank.Transferring a message between two tanks takes one second, however, not always one tank can transmit a message to another one. Let's consider two tanks in the column such that the first of them is thei-th in the column counting from the beginning, and the second one is thej-th in the column, and suppose the second tank has numberx. Then the first tank can transmit a message to the second tank ifi<jandi≥j-ax.The Ministry of Defense (and soon the Smart Beaver) faced the question of how to organize the training efficiently. The exercise should be finished as quickly as possible. We'll neglect the time that the tanks spend on moving along the column, since improving the tanks' speed is not a priority for this training.You are given the number of tanks, as well as the message receiving radii of all tanks. You must help the Smart Beaver and organize the transferring of messages in a way that makes the total transmission time of all messages as small as possible.InputThe first line contains integern— the number of tanks in the column. Each of the nextnlines contains one integerai(1 ≤ai≤ 250000,1 ≤i≤n) — the message receiving radii of the tanks in the order from tank1to tankn(let us remind you that initially the tanks are located in the column in ascending order of their numbers).To get the full points for the first group of tests it is sufficient to solve the problem with2 ≤n≤ 300.To get the full points for the second group of tests it is sufficient to solve the problem with2 ≤n≤ 10000.To get the full points for the third group of tests it is sufficient to solve the problem with2 ≤n≤ 250000.OutputPrint a single integer — the minimum possible total time of transmitting the messages.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput3211Output5Input522222Output10NoteIn the first sample the original order of tanks is1, 2, 3. The first tank sends a message to the second one, then the second tank sends it to the third one — it takes two seconds. The third tank moves to the beginning of the column and the order of tanks now is3, 1, 2. The third tank sends a message to the first one, then the first one sends it to the second one — it takes two more seconds. The second tank moves to the beginning and the order of the tanks is now2, 3, 1. With this arrangement, the second tank can immediately send a message to the first one, since the message receiving radius of the first tank is large enough — it takes one second. Finally, the tanks return to their original order1, 2, 3. In total, the exercise takes5seconds.In the second sample, all five tanks are the same and sending a single message takes two seconds, so in total the exercise takes10seconds.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d2ba3b24", "template_md5": "35d339e4", "result": "You are given a line of $n$ tanks, numbered from 1 to $n$. Each tank has a message receiving radius $a_i$.  \n\nThe goal is to send $n$ messages from the first tank to the last tank, with the following rules:\n\n* A tank can only send a message to another tank if the distance between them is less than or equal to the receiving radius of the receiving tank.\n* After the last tank receives a message, it moves to the front of the line and sends the next message. This continues until all tanks have returned to their original positions.\n\nFind the minimum time it takes to send all $n$ messages.\n\n**Input:**\n\n* The first line contains an integer $n$ (the number of tanks).\n* The next $n$ lines each contain an integer $a_i$ (the message receiving radius of tank $i$).\n\n**Output:**\n\n* A single integer representing the minimum time to send all messages."}, {"prompt_md5": "f0862868", "template_md5": "465699a0", "result": "You have a line of objects, each with a different range.  You need to send a signal from the beginning of the line to the end, and then back again, with each object passing the signal to another object within its range.  Find the minimum time it takes to complete this process."}]}