{"uid": "207-D6", "url": "https://codeforces.com/contest/207/problem/D6", "tags": [], "title": "207-D6", "statement": "D6. The Beaver's Problem - 3time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Smart Beaver from ABBYY came up with another splendid problem for the ABBYY Cup participants! This time the Beaver invites the contest participants to check out a problem on sorting documents by their subjects. Let's describe the problem:You've got some training set of documents. For each document you know its subject. The subject in this problem is an integer from1to3. Each of these numbers has a physical meaning. For instance, all documents with subject3are about trade.You can download the training set of documents at the following link:http://download4.abbyy.com/a2/X2RZ2ZWXBG5VYWAL61H76ZQM/train.zip. The archive contains three directories with names \"1\", \"2\", \"3\". Directory named \"1\" contains documents on the1-st subject, directory \"2\" contains documents on the2-nd subject, and directory \"3\" contains documents on the3-rd subject. Each document corresponds to exactly one file from some directory.All documents have the following format: the first line contains the document identifier, the second line contains the name of the document, all subsequent lines contain the text of the document. The document identifier is used to make installing the problem more convenient and has no useful information for the participants.You need to write a program that should indicate the subject for a given document. It is guaranteed that all documents given as input to your program correspond to one of the three subjects of the training set.InputThe first line contains integerid(0 ≤id≤ 106) — the document identifier. The second line contains the name of the document. The third and the subsequent lines contain the text of the document. It is guaranteed that the size of any given document will not exceed10kilobytes.The tests for this problem are divided into10groups. Documents of groups1and2are taken from the training set, but their identifiers will not match the identifiers specified in the training set. Groups from the3-rd to the10-th are roughly sorted by the author in ascending order of difficulty (these groups contain documents which aren't present in the training set).OutputPrint an integer from1to3, inclusive — the number of the subject the given document corresponds to.Examples", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f599126d", "template_md5": "35d339e4", "result": "You are given a set of documents, each categorized into one of three subjects (1, 2, or 3).  You are also given a new document. Your task is to determine the subject of the new document based on its content. \n\nYou have a training set of documents with known subjects to help you learn the patterns. The training set is organized into three folders, one for each subject.\n\n**Input:**\n\n* The first line contains a document identifier (a number).\n* The second line contains the document name.\n* The following lines contain the text of the document.\n\n**Output:**\n\n* Print a number from 1 to 3, representing the subject of the document."}, {"prompt_md5": "46a137c7", "template_md5": "465699a0", "result": "You are given a set of documents categorized by subject (1, 2, or 3). You need to write a program that can determine the subject of a new, unseen document based on its text."}]}