{"uid": "208-A", "url": "https://codeforces.com/contest/208/problem/A", "tags": ["strings"], "title": "208-A", "statement": "A. Dubsteptime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya works as a DJ in the best Berland nightclub, and he often uses dubstep music in his performance. Recently, he has decided to take a couple of old songs and make dubstep remixes from them.Let's assume that a song consists of some number of words. To make the dubstep remix of this song, Vasya inserts a certain number of words \"WUB\" before the first word of the song (the number may be zero), after the last word (the number may be zero), and between words (at least one between any pair of neighbouring words), and then the boy glues together all the words, including \"WUB\", in one string and plays the song at the club.For example, a song with words \"I AM X\" can transform into a dubstep remix as \"WUBWUBIWUBAMWUBWUBX\" and cannot transform into \"WUBWUBIAMWUBX\".Recently, Petya has heard Vasya's new dubstep track, but since he isn't into modern music, he decided to find out what was the initial song that Vasya remixed. Help Petya restore the original song.InputThe input consists of a single non-empty string, consisting only of uppercase English letters, the string's length doesn't exceed200characters. It is guaranteed that before Vasya remixed the song, no word contained substring \"WUB\" in it; Vasya didn't change the word order. It is also guaranteed that initially the song had at least one word.OutputPrint the words of the initial song that Vasya used to make a dubsteb remix. Separate the words with a space.ExamplesInputWUBWUBABCWUBOutputABCInputWUBWEWUBAREWUBWUBTHEWUBCHAMPIONSWUBMYWUBFRIENDWUBOutputWE ARE THE CHAMPIONS MY FRIENDNoteIn the first sample: \"WUBWUBABCWUB\" = \"WUB\" + \"WUB\" + \"ABC\" + \"WUB\". That means that the song originally consisted of a single word \"ABC\", and all words \"WUB\" were added by Vasya.In the second sample Vasya added a single word \"WUB\" between all neighbouring words, in the beginning and in the end, except for words \"ARE\" and \"THE\" — between them Vasya added two \"WUB\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "66a7297e", "template_md5": "35d339e4", "result": "Given a string consisting of uppercase English letters and the substring \"WUB\", find the original sequence of words that was used to create the string. \n\nThe rules for creating the string are:\n\n*  Zero or more \"WUB\"s can be added before the first word.\n*  Zero or more \"WUB\"s can be added after the last word.\n*  At least one \"WUB\" must be added between each pair of words.\n\nIt is guaranteed that:\n\n* The original words do not contain the substring \"WUB\".\n* The order of the words in the original sequence is preserved in the output string.\n* The input string has at least one word."}, {"prompt_md5": "a48a9258", "template_md5": "465699a0", "result": "Given a string of words with \"WUB\" inserted between and around them, find the original sequence of words."}]}