{"uid": "208-C", "url": "https://codeforces.com/contest/208/problem/C", "tags": ["dp", " graphs", " shortest paths"], "title": "208-C", "statement": "C. Police Stationtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Berland road network consists ofncities and ofmbidirectional roads. The cities are numbered from 1 ton, where the main capital city has numbern, and the culture capital — number1. The road network is set up so that it is possible to reach any city from any other one by the roads. Moving on each road in any direction takes the same time.All residents of Berland are very lazy people, and so when they want to get from cityvto cityu, they always choose one of the shortest paths (no matter which one).The Berland government wants to make this country's road network safer. For that, it is going to put a police station in one city. The police station has a rather strange property: when a citizen of Berland is driving along the road with a police station at one end of it, the citizen drives more carefully, so all such roads are considered safe. The roads, both ends of which differ from the city with the police station, are dangerous.Now the government wonders where to put the police station so that the average number of safe roads forallthe shortest paths from the cultural capital to the main capital would take the maximum value.InputThe first input line contains two integersnandm(2 ≤n≤ 100,) — the number of cities and the number of roads in Berland, correspondingly. Nextmlines contain pairs of integersvi,ui(1 ≤vi,ui≤n,vi≠ui) — the numbers of cities that are connected by thei-th road. The numbers on a line are separated by a space.It is guaranteed that each pair of cities is connected with no more than one road and that it is possible to get from any city to any other one along Berland roads.OutputPrint the maximum possible value of the average number of safe roads among all shortest paths from the culture capital to the main one. The answer will be considered valid if its absolute or relative inaccuracy does not exceed10- 6.ExamplesInput4 41 22 41 33 4Output1.000000000000Input11 141 21 32 43 44 54 65 116 111 88 99 711 71 1010 4Output1.714285714286NoteIn the first sample you can put a police station in one of the capitals, then each path will have exactly one safe road. If we place the station not in the capital, then the average number of safe roads will also make.In the second sample we can obtain the maximum sought value if we put the station in city4, then6paths will have2safe roads each, and one path will have0safe roads, so the answer will equal.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ddaf69ee", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ roads connecting them.  Each road connects two cities and can be traveled in both directions.  \n\nThe government wants to place a police station in one city to make the roads safer.  Roads with a police station at one end are considered safe.\n\nYou need to find the city where the government should place the police station so that the average number of safe roads is maximized for all the shortest paths between city 1 (the culture capital) and city $n$ (the main capital). \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, the number of cities and roads, respectively.\n* The next $m$ lines each contain two integers, $v_i$ and $u_i$, representing a road connecting cities $v_i$ and $u_i$.\n\n**Output:**\n\n* Print the maximum possible average number of safe roads for all shortest paths from city 1 to city $n$."}, {"prompt_md5": "411db8be", "template_md5": "465699a0", "result": "You have a network of cities connected by roads.  You need to place a single police station in one city to make the roads safer.  The goal is to place the police station so that the average number of safe roads (roads with the police station at one end) along the shortest paths between two specific cities is maximized."}]}