{"uid": "209-B", "url": "https://codeforces.com/contest/209/problem/B", "tags": ["constructive algorithms", " math"], "title": "209-B", "statement": "B. Pixelstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutFlatland is inhabited by pixels of three colors: red, green and blue. We know that if two pixels of different colors meet in a violent fight, only one of them survives the fight (that is, the total number of pixels decreases by one). Besides, if pixels of colorsxandy(x≠y)meet in a violent fight, then the pixel that survives the fight immediately changes its color toz(z≠x;z≠y). Pixels of the same color are friends, so they don't fight.The King of Flatland knows that his land will be peaceful and prosperous when the pixels are of the same color. For each of the three colors you know the number of pixels of this color that inhabit Flatland. Help the king and determine whether fights can bring peace and prosperity to the country and if it is possible, find the minimum number of fights needed to make the land peaceful and prosperous.InputThe first line contains three space-separated integersa,bandc(0 ≤a,b,c≤ 231;a+b+c> 0)— the number of red, green and blue pixels, correspondingly.OutputPrint a single number — the minimum number of pixel fights before the country becomes peaceful and prosperous. If making the country peaceful and prosperous is impossible, print-1.ExamplesInput1 1 1Output1Input3 1 0Output3NoteIn the first test sample the country needs only one fight to achieve peace and prosperity. Besides, it can be any fight whatsoever. For example, let's assume that the green and the blue pixels fight, then the surviving pixel will be red. As a result, after the fight there are two red pixels. There won't be other pixels.In the second sample the following sequence of fights is possible: red and blue, green and red, red and blue. As a result, after all fights there is one green pixel left.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fab27773", "template_md5": "35d339e4", "result": "There are three types of pixels: red, green, and blue.  Pixels of different colors fight, and only one survives. The survivor changes color to a third color different from both original colors. Pixels of the same color do not fight.\n\nGiven the number of each color of pixel, determine the minimum number of fights needed for all pixels to be the same color. If this is impossible, output -1."}, {"prompt_md5": "72e08055", "template_md5": "465699a0", "result": "You are given the number of red, green, and blue objects. Objects of different colors fight, and the winner changes color to a third color.  Objects of the same color do not fight. Determine the minimum number of fights needed for all objects to be the same color, or if it's impossible."}]}