{"uid": "21-A", "url": "https://codeforces.com/contest/21/problem/A", "tags": ["implementation", " strings"], "title": "21-A", "statement": "A. Jabber IDtime limit per test0.5 secondmemory limit per test256 megabytesinputstdinoutputstdoutJabber ID on the national Berland service «Babber» has a form<username>@<hostname>[/resource], where<username>— is a sequence of Latin letters (lowercase or uppercase), digits or underscores characters «_», the length of<username>is between 1 and 16, inclusive.<hostname>— is a sequence of word separated by periods (characters «.»), where each word should contain only characters allowed for<username>, the length of each word is between 1 and 16, inclusive. The length of<hostname>is between 1 and 32, inclusive.<resource>— is a sequence of Latin letters (lowercase or uppercase), digits or underscores characters «_», the length of<resource>is between 1 and 16, inclusive.The content of square brackets is optional — it can be present or can be absent.There are the samples of correct Jabber IDs:[email protected],[email protected]/contest.Your task is to write program which checks if given string is a correct Jabber ID.InputThe input contains of a single line. The line has the length between 1 and 100 characters, inclusive. Each characters has ASCII-code between 33 and 127, inclusive.OutputPrintYESorNO.ExamplesInput[email protected]OutputYESInput[email protected]/contest.icpc/12OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "43f556c8", "template_md5": "35d339e4", "result": "You are given a string.  Determine if the string is a valid Jabber ID.\n\nA Jabber ID has the following format:\n\n*  `<username>@<hostname>[/resource]`\n\nWhere:\n\n* `<username>` is a sequence of letters (uppercase or lowercase), numbers, or underscores, with a length between 1 and 16 characters.\n* `<hostname>` is a sequence of words separated by periods (.), where each word follows the same rules as `<username>`, and the total length of `<hostname>` is between 1 and 32 characters.\n* `<resource>` is a sequence of letters, numbers, or underscores, with a length between 1 and 16 characters. The square brackets containing `<resource>` are optional.\n\n**Examples:**\n\n* `user@host.com` - **Valid**\n* `user@host.com/resource` - **Valid**\n* `invalid_id` - **Invalid** \n\n\n\nYour program should output \"YES\" if the input string is a valid Jabber ID, and \"NO\" otherwise."}, {"prompt_md5": "01c7552d", "template_md5": "465699a0", "result": "Determine if a given string is a valid username followed by a hostname and optional resource, following specific rules for each part."}]}