{"uid": "21-C", "url": "https://codeforces.com/contest/21/problem/C", "tags": ["binary search", " dp", " sortings"], "title": "21-C", "statement": "C. Stripe 2time limit per test1 secondmemory limit per test64 megabytesinputstdinoutputstdoutOnce Bob took a paper stripe of n squares (the height of the stripe is 1 square). In each square he wrote an integer number, possibly negative. He became interested in how many ways exist to cut this stripe into three pieces so that the sum of numbers from each piece is equal to the sum of numbers from any other piece, and each piece contains positive integer amount of squares. Would you help Bob solve this problem?InputThe first input line contains integern(1 ≤n≤ 105) — amount of squares in the stripe. The second line contains n space-separated numbers — they are the numbers written in the squares of the stripe. These numbers are integer and do not exceed 10000 in absolute value.OutputOutput the amount of ways to cut the stripe into three non-empty pieces so that the sum of numbers from each piece is equal to the sum of numbers from any other piece. Don't forget that it's allowed to cut the stripe along the squares' borders only.ExamplesInput41 2 3 3Output1Input51 2 3 4 5Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ec0b25f7", "template_md5": "35d339e4", "result": "You are given a line of $n$ numbers.  Find the number of ways to divide the line into three non-empty parts such that the sum of the numbers in each part is equal. \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the number of numbers in the line.\n* The second line contains $n$ space-separated integers representing the numbers in the line. Each number is between -10000 and 10000.\n\nOutput:\n\n* Output the number of ways to divide the line into three parts as described above."}, {"prompt_md5": "ab663fd5", "template_md5": "465699a0", "result": "You are given a line of numbers.  Find how many ways you can divide the line into three parts so that the sum of the numbers in each part is the same."}]}