{"uid": "213-D", "url": "https://codeforces.com/contest/213/problem/D", "tags": ["constructive algorithms", " geometry"], "title": "213-D", "statement": "D. Starstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutFurik loves painting stars. A star is a shape that results if we take a regular pentagon and paint all diagonals in it.Recently he decided to teach Rubik to paint stars. After many years of training Rubik could paint stars easily. But now Furik decided to test Rubik and complicated the task. Rubik must paintnstars, observing the following rules:all stars must be painted in a single move (i.e. it is forbidden to take the pen away from the paper);it is forbidden to paint the same segment of non-zero length more than once;the stars can intersect only in their vertexes;the length of a side of the regular pentagon, in which Rubik paints each star, must equal 10.Help Rubik to cope with this hard task.InputA single line contains an integer(1 ≤n≤ 100)— the number of stars to paint.OutputOn the first line print an integerm(1 ≤m≤ 5·n). On the nextmlines print coordinates ofmdistinct points with accuracy of at least9and at most100digits after decimal point. All coordinates should not exceed5000in their absolute value. On each of the nextnlines print5integers — the indexes of the points that form the given star in the clockwise or counterclockwise order. On the next line print5·n+ 1integers — the numbers of points in the order, in which Rubik paints stars. That is, if number with indexiisai, and number with indexi+ 1isai+ 1, then points with indexesaiandai+ 1will have a segment painted between them.You can consider allmprinted points indexed from 1 tomin the order, in which they occur in the output. Separate the numbers on the lines with whitespaces.Note that the answer has an imprecise validation. Try to obtain as accurate a solution as possible. The validator performs all calculations considering that the absolute error of a participant's answer is not more than10- 8.ExamplesInput1Output53.830127018922193 3.366025403784439-3.601321235851749 10.0573314673730210.466045194906253 19.19278604379903010.411264148588986 18.14750141112249512.490381056766580 8.3660254037844391 2 3 4 51 3 5 2 4 1NoteThe initial position of points in the sample is:The order in which Rubik can paint segments is:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e599c6fc", "template_md5": "35d339e4", "result": "You are given an integer $n$ representing the number of stars to be painted.  \n\nEach star is formed by connecting the vertices of a regular pentagon with line segments.  \n\nThe rules are:\n\n* All stars must be painted in a single continuous stroke.\n* No line segment can be painted more than once.\n* Stars can only intersect at their vertices.\n* The side length of each pentagon is 10.\n\nYour task is to output:\n\n1. An integer $m$ representing the number of points needed to paint all the stars.\n2. The coordinates of these $m$ points.\n3. For each star, a list of 5 point indices that form the star in clockwise or counterclockwise order.\n4. A list of $5n+1$ integers representing the order in which to paint the line segments connecting the points to form all the stars."}, {"prompt_md5": "6c82aa9b", "template_md5": "465699a0", "result": "You are given a number of stars to draw. Each star is made by connecting the points of a pentagon with lines.  You must draw all the stars in one continuous motion, without lifting your pen, and without drawing any line segment more than once. The stars can only touch at their corners.  \n\nYou need to output the coordinates of the points and the order in which to draw the lines to form the stars."}]}