{"uid": "215-D", "url": "https://codeforces.com/contest/215/problem/D", "tags": ["greedy"], "title": "215-D", "statement": "D. Hot Daystime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe official capital and the cultural capital of Berland are connected by a single road running throughnregions. Each region has a unique climate, so thei-th(1 ≤i≤n)region has a stable temperature oftidegrees in summer.This summer a group ofmschoolchildren wants to get from the official capital to the cultural capital to visit museums and sights. The trip organizers transport the children between the cities in buses, but sometimes it is very hot. Specifically, if the bus is driving through thei-th region and haskschoolchildren, then the temperature inside the bus isti+kdegrees.Of course, nobody likes it when the bus is hot. So, when the bus drives through thei-th region, if it has more thanTidegrees inside, each of the schoolchild in the bus demands compensation for the uncomfortable conditions. The compensation is as large asxirubles and it is charged in each region where the temperature in the bus exceeds the limit.To save money, the organizers of the trip may arbitrarily add or remove extra buses in the beginning of the trip, and between regions (of course, they need at least one bus to pass any region). The organizers can also arbitrarily sort the children into buses, however, each of buses in thei-th region will cost the organizerscostirubles. Please note that sorting children into buses takes no money.Your task is to find the minimum number of rubles, which the organizers will have to spend to transport all schoolchildren.InputThe first input line contains two integersnandm(1 ≤n≤ 105;1 ≤m≤ 106)— the number of regions on the way and the number of schoolchildren in the group, correspondingly. Nextnlines contain four integers each: thei-th line containsti,Ti,xiandcosti(1 ≤ti,Ti,xi,costi≤ 106). The numbers in the lines are separated by single spaces.OutputPrint the only integer — the minimum number of roubles the organizers will have to spend to transport all schoolchildren.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use cin, cout streams or the%I64dspecifier.ExamplesInput2 1030 35 1 10020 35 10 10Output120Input3 10010 30 1000 15 10 1000 310 40 1000 100000Output200065NoteIn the first sample the organizers will use only one bus to travel through the first region. However, the temperature in the bus will equal30 + 10 = 40degrees and each of10schoolchildren will ask for compensation. Only one bus will transport the group through the second region too, but the temperature inside won't exceed the limit. Overall, the organizers will spend100 + 10 + 10 = 120rubles.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3aec1bd6", "template_md5": "35d339e4", "result": "There are $n$ regions along a road connecting two cities. Each region has a base temperature $t_i$.  A group of $m$ people need to travel from one city to the other.\n\nBuses can be used to transport the people.  The temperature inside a bus carrying $k$ people in region $i$ is $t_i + k$.\n\nIf the temperature inside a bus exceeds $T_i$ in region $i$, each person in the bus must be compensated $x_i$ rubles.\n\nThe organizers can:\n\n* Add or remove buses at the start of the trip.\n* Split people into different buses.\n\nThe cost of using a bus in region $i$ is $c_i$.\n\nFind the minimum amount of money the organizers need to spend to transport everyone, considering compensation costs and bus usage costs."}, {"prompt_md5": "72564b6a", "template_md5": "465699a0", "result": "You have to transport a group of people across multiple locations. Each location has a temperature limit. The temperature inside a vehicle increases based on the number of people inside and the location's temperature.  If the temperature exceeds the limit, each person demands compensation. You can add or remove vehicles and split people into different vehicles. Your goal is to find the minimum cost to transport everyone while minimizing compensation payments."}]}