{"uid": "216-C", "url": "https://codeforces.com/contest/216/problem/C", "tags": ["greedy"], "title": "216-C", "statement": "C. Hiring Stafftime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA new Berland businessman Vitaly is going to open a household appliances' store. All he's got to do now is to hire the staff.The store will work seven days a week, but not around the clock. Every day at leastkpeople must work in the store.Berland has a law that determines the order of working days and non-working days. Namely, each employee must work for exactlynconsecutive days, then rest for exactlymdays, then work fornmore days and rest formmore, and so on. Vitaly doesn't want to break the law. Fortunately, there is a loophole: the law comes into force on the day when the employee is hired. For example, if an employee is hired on dayx, then he should work on days[x,x+ 1, ...,x+n- 1],[x+m+n,x+m+n+ 1, ...,x+m+ 2n- 1], and so on. Dayxcan be chosen arbitrarily by Vitaly.There is one more thing: the key to the store. Berland law prohibits making copies of keys, so there is only one key. Vitaly is planning to entrust the key to the store employees. At the same time on each day the key must be with an employee who works that day — otherwise on this day no one can get inside the store. During the day the key holder can give the key to another employee, if he also works that day. The key will handed to the first hired employee at his first working day.Each employee has to be paid salary. Therefore, Vitaly wants to hire as few employees as possible provided that the store can operate normally on each day from1to infinity. In other words, on each day with index from1to infinity, the store must have at leastkworking employees, and one of the working employees should have the key to the store.Help Vitaly and determine the minimum required number of employees, as well as days on which they should be hired.InputThe first line contains three integersn,mandk(1 ≤m≤n≤ 1000,n≠ 1,1 ≤k≤ 1000).OutputIn the first line print a single integerz— the minimum required number of employees.In the second line printzpositive integers, separated by spaces: thei-th integerai(1 ≤ai≤ 104) should represent the number of the day, on which Vitaly should hire thei-th employee.If there are multiple answers, print any of them.ExamplesInput4 3 2Output41 1 4 5Input3 3 1Output31 3 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "932feac3", "template_md5": "35d339e4", "result": "There is a store that needs to be staffed with employees.  The store must have at least $k$ employees working each day. Employees work for $n$ days, then have $m$ days off, and repeat this cycle.  \n\nThe store has only one key, and an employee with the key must be present each day the store is open.  \n\nFind the minimum number of employees needed to staff the store, and the days on which to hire them. \n\n\nInput:\n\n* $n$: Number of consecutive days an employee works.\n* $m$: Number of days an employee is off after working $n$ days.\n* $k$: Minimum number of employees needed each day.\n\nOutput:\n\n* $z$: Minimum number of employees needed.\n* $a_1, a_2, ..., a_z$: The days on which to hire each employee."}, {"prompt_md5": "5fa0ff20", "template_md5": "465699a0", "result": "You need to hire the minimum number of workers to staff a store that must have at least k workers present each day. Workers work for n days, then have m days off, and repeat.  You can hire workers on any day, and the key to the store must always be with a working employee.  Output the minimum number of workers needed and the days to hire them."}]}