{"uid": "216-D", "url": "https://codeforces.com/contest/216/problem/D", "tags": ["binary search", " sortings", " two pointers"], "title": "216-D", "statement": "D. Spider's Webtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPaw the Spider is making a web. Web-making is a real art, Paw has been learning to do it his whole life. Let's consider the structure of the web.There arenmainthreads going from the center of the web. All main threads are located in one plane and divide it intonequal infinitesectors. The sectors are indexed from1tonin the clockwise direction. Sectorsiandi+ 1areadjacentfor everyi,1 ≤i<n. In addition, sectors1andnare also adjacent.Some sectors havebridge threads. Each bridge connects the two main threads that make up this sector. The points at which the bridge is attached to the main threads will be calledattachment points. Both attachment points of a bridge are at the same distance from the center of the web. At each attachment point exactly one bridge is attached. The bridges areadjacentif they are in the same sector, and there are no other bridges between them.Acellof the web is a trapezoid, which is located in one of the sectors and is bounded by two main threads and two adjacent bridges. You can see that the sides of the cell may have the attachment points of bridges from adjacent sectors. If the number of attachment points on one side of the cell is not equal to the number of attachment points on the other side, it creates an imbalance of pulling forces on this cell and this may eventually destroy the entire web. We'll call such a cellunstable. The perfect web does not contain unstable cells.Unstable cells are marked red in the figure. Stable cells are marked green.Paw the Spider isn't a skillful webmaker yet, he is only learning to make perfect webs. Help Paw to determine the number of unstable cells in the web he has just spun.InputThe first line contains integern(3 ≤n≤ 1000) — the number of main threads.Thei-th of followingnlines describe the bridges located in thei-th sector: first it contains integerki(1 ≤ki≤ 105) equal to the number of bridges in the given sector. Then followkidifferent integerspij(1 ≤pij≤ 105; 1 ≤j≤ki). Numberpijequals the distance from the attachment points of thej-th bridge of thei-th sector to the center of the web.It is guaranteed that any two bridges between adjacent sectors are attached at a different distance from the center of the web. It is guaranteed that the total number of the bridges doesn't exceed105.OutputPrint a single integer — the number of unstable cells in Paw the Spider's web.ExamplesInput73 1 6 74 3 5 2 92 8 14 3 7 6 43 2 5 93 6 3 83 4 2 9Output6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bd56ce1b", "template_md5": "35d339e4", "result": "A spider is making a web with $n$ main threads, dividing a plane into $n$ equal sectors. Each sector can have bridges connecting the two main threads.  \n\n* Bridges are attached to the main threads at points equidistant from the center of the web.\n* A \"cell\" is a trapezoid formed by two main threads and two adjacent bridges.\n* A cell is unstable if the number of bridge attachment points on one side doesn't equal the number on the other side.\n\nGiven the number of bridges and their distances from the center for each sector, determine the number of unstable cells in the web."}, {"prompt_md5": "f71f7b15", "template_md5": "465699a0", "result": "You are given a web with a certain number of main threads dividing a plane into sectors. Each sector can have bridges connecting the main threads.  Determine the number of cells in the web that are unstable due to an imbalance of forces. A cell is unstable if the number of bridge attachment points on one side is different from the number on the other side."}]}