{"uid": "217-C", "url": "https://codeforces.com/contest/217/problem/C", "tags": ["divide and conquer", " dp", " expression parsing"], "title": "217-C", "statement": "C. Formurosatime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe Bytelandian Institute for Biological Research (BIBR) is investigating the properties of two species of bacteria, named simply 0 and 1. Even under a microscope, bacteria of those two species are very difficult to distinguish. In fact, the only thing the scientists possess that is able to differentiate between them is a plant called Formurosa.If the scientists place a sample of colonies of bacteria on each on Formurosa's leaves, it will activate a complicated nutrition process. During that process color of Formurosa changes to reflect the result of a — possibly very complicated — logical formula on the species of bacteria, involving constants and the operators|(OR),&(AND) and^(XOR). If it is 0, the plant will turn red, otherwise — it will turn blue.For example, if the nutrition process of Formurosa is described by the formula:(((?^?)|?)&(1^?)); then Formurosa has four leaves (the \"?\" signs denote the leaves). If we place0, 1, 0, 0on the respective leaves, the result of the nutrition process will be(((0^1)|0)&(1^0)) = 1, therefore the plant will turn blue.The scientists havencolonies of bacteria. They do not know their types; the only thing they know for sure is thatnot all colonies are of the same type. They want to attempt to determine the bacteria's species by repeated evaluations with Formurosa. During each evaluation they must place exactly one sample on every leaf of the plant. However, they may use multiple samples of one colony during a single evaluation; they can even cover the whole plant with bacteria from one colony!Is it possible for them to always determine the species of each colony, no matter what they are (assuming they are not all the same)?InputThe first line of input contains a single integern(2 ≤n≤ 106) — the number of colonies of bacteria.The second line contains the formula describing the nutrition process of Formurosa. This line contains only characters «0», «1», «?», «|», «&», «^», «(», «)» and complies with the following grammar:s→ 0|1|?|(s|s)|(s&s)|(s^s)The formula consists of no more than106characters.OutputIf it is always possible to determine the species of each colony, output \"YES\" (without quotes). Otherwise, output \"NO\" (without quotes).ExamplesInput2(?^?)OutputNOInput10?OutputYESInput2((?^?)&?)OutputYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a8a4f79a", "template_md5": "35d339e4", "result": "You are given a formula that describes how a plant changes color based on the types of bacteria placed on its leaves. The formula uses the following:\n\n* 0 and 1 represent the two types of bacteria.\n* ? represents an empty leaf.\n* | represents the OR operation.\n* & represents the AND operation.\n* ^ represents the XOR operation.\n* ( ) are used for grouping.\n\nThe plant turns blue if the formula evaluates to 1, and red if it evaluates to 0.\n\nYou are given a number of bacteria colonies, and you know that not all colonies are the same type. You can use the plant to test the bacteria by placing one sample from each colony on each leaf.\n\n**The problem:**\n\nGiven the formula and the number of colonies, determine if it is always possible to figure out the type of each bacteria colony."}, {"prompt_md5": "fc27a26e", "template_md5": "465699a0", "result": "You are given a set of items and a rule that combines them in a specific way.  You can use any number of the same item in a single combination.  Can you always determine the type of each individual item based on the results of applying the rule to different combinations?"}]}