{"uid": "217-D", "url": "https://codeforces.com/contest/217/problem/D", "tags": ["bitmasks", " brute force", " combinatorics", " dfs and similar", " math"], "title": "217-D", "statement": "D. Bitonix' Patroltime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutByteland is trying to send a space mission onto the Bit-X planet. Their task is complicated by the fact that the orbit of the planet is regularly patrolled by Captain Bitonix, the leader of the space forces of Bit-X.There arenstations around Bit-X numbered clockwise from 1 ton. The stations are evenly placed on a circular orbit, so the stations numberiandi+ 1(1 ≤i<n), and the stations number 1 andn, are neighboring. The distance between every pair of adjacent stations is equal tomspace miles. To go on a patrol, Captain Bitonix jumps in his rocket at one of the stations and flies in a circle, covering a distance of at least one space mile, before finishing in some (perhaps the starting) station.Bitonix' rocket moves by burning fuel tanks. After Bitonix attaches anx-liter fuel tank and chooses the direction (clockwise or counter-clockwise), the rocket flies exactlyxspace miles along a circular orbit in the chosen direction. Note that the rocket has no brakes; it is not possible for the rocket to stop before depleting a fuel tank.For example, assume thatn= 3andm= 60and Bitonix has fuel tanks with volumes of 10, 60, 90 and 100 liters. If Bitonix starts from station 1, uses the 100-liter fuel tank to go clockwise, then uses the 90-liter fuel tank to go clockwise, and then uses the 10-liter fuel tank to go counterclockwise, he will finish back at station 1. This constitutes a valid patrol. Note that Bitonix does not have to use all available fuel tanks. Another valid option for Bitonix in this example would be to simply use the 60-liter fuel tank to fly to either station 2 or 3.However, ifnwas equal to 3,mwas equal to 60 and the only fuel tanks available to Bitonix were one 10-liter tank and one 100-liter tank, he would have no way of completing a valid patrol (he wouldn't be able to finish any patrol exactly at the station).The Byteland space agency wants to destroy some of Captain Bitonix' fuel tanks so that he cannot to complete any valid patrol. Find how many different subsets of the tanks the agency can destroy to prevent Captain Bitonix from completing a patrol and output the answer modulo1000000007(109+ 7).InputThe first line of the input contains three integersn(2 ≤n≤ 1000) — the number of stations,m(1 ≤m≤ 120) — the distance between adjacent stations, andt(1 ≤t≤ 10000) — the number of fuel tanks owned by Captain Bitonix.The second line of the input containstspace-separated integers between1and109, inclusive — the volumes of Bitonix' fuel tanks.OutputOutput a single number — the number of distinct subsets of tanks that the Bytelandian space agency can destroy in order to prevent Captain Bitonix from completing a patrol, modulo109+ 7.ExamplesInput7 6 55 4 12 6 5Output6Input3 60 210 100Output4NoteAll the fuel tanks are distinct, even if some of them have the same capacity.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ea53de02", "template_md5": "35d339e4", "result": "There are $n$ stations arranged in a circle, with a distance of $m$ miles between each station.  \n\nYou are given $t$ fuel tanks, each with a different capacity.  \n\nYou can use a fuel tank to travel a distance of $x$ miles in a circle, where $x$ is the capacity of the tank. You can travel in either direction (clockwise or counter-clockwise).\n\nThe goal is to find the number of different subsets of fuel tanks that you can remove so that it becomes impossible to travel a full circle (i.e., return to the starting station).\n\nOutput the answer modulo $10^9 + 7$."}, {"prompt_md5": "839dbf13", "template_md5": "465699a0", "result": "You are given a number of stations arranged in a circle.  A person has a set of fuel tanks of different sizes. Each tank allows the person to travel a certain distance around the circle.  The goal is to find how many sets of fuel tanks can be removed so that the person can no longer travel a full circle."}]}