{"uid": "218-B", "url": "https://codeforces.com/contest/218/problem/B", "tags": ["implementation"], "title": "218-B", "statement": "B. Airporttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLolek and Bolek are about to travel abroad by plane. The local airport has a special \"Choose Your Plane\" offer. The offer's conditions are as follows:it is up to a passenger to choose a plane to fly on;if the chosen plane hasx(x> 0)empty seats at the given moment, then the ticket for such a plane costsxzlotys (units of Polish currency).The only ticket office of the airport already has a queue ofnpassengers in front of it. Lolek and Bolek have not stood in the queue yet, but they are already wondering what is the maximum and the minimum number of zlotys the airport administration can earn if allnpassengers buy tickets according to the conditions of this offer?The passengers buy tickets in turn, the first person in the queue goes first, then goes the second one, and so on up ton-th person.InputThe first line contains two integersnandm(1 ≤n,m≤ 1000)— the number of passengers in the queue and the number of planes in the airport, correspondingly. The next line containsmintegersa1,a2, ...,am(1 ≤ai≤ 1000)—aistands for the number of empty seats in thei-th plane before the ticket office starts selling tickets.The numbers in the lines are separated by a space. It is guaranteed that there are at leastnempty seats in total.OutputPrint two integers — the maximum and the minimum number of zlotys that the airport administration can earn, correspondingly.ExamplesInput4 32 1 1Output5 5Input4 32 2 2Output7 6NoteIn the first test sample the number of passengers is equal to the number of empty seats, so regardless of the way the planes are chosen, the administration will earn the same sum.In the second sample the sum is maximized if the 1-st person in the queue buys a ticket to the 1-st plane, the 2-nd person — to the 2-nd plane, the 3-rd person — to the 3-rd plane, the 4-th person — to the 1-st plane. The sum is minimized if the 1-st person in the queue buys a ticket to the 1-st plane, the 2-nd person — to the 1-st plane, the 3-rd person — to the 2-nd plane, the 4-th person — to the 2-nd plane.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bd467a48", "template_md5": "35d339e4", "result": "There are $n$ people waiting in line to buy plane tickets. There are $m$ planes, and each plane has a certain number of empty seats. The price of a ticket is equal to the number of empty seats on the plane multiplied by the number of passengers. \n\nThe people buy tickets in the order they are in line.  \n\nFind the maximum and minimum amount of money the airport can make from selling all the tickets. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 1000$), representing the number of people in line and the number of planes, respectively.\n* The second line contains $m$ integers, $a_1, a_2, ..., a_m$ ($1 \\le a_i \\le 1000$), representing the number of empty seats on each plane.\n\n**Output:**\n\n* Print two integers, the maximum and minimum amount of money the airport can make."}, {"prompt_md5": "04ac13a0", "template_md5": "465699a0", "result": "There are people waiting in a line to buy tickets. Each ticket has a different price based on the number of empty seats on the plane.  You need to figure out the maximum and minimum amount of money the airport can make from selling all the tickets."}]}