{"uid": "22-B", "url": "https://codeforces.com/contest/22/problem/B", "tags": ["brute force", " dp"], "title": "22-B", "statement": "B. Bargaining Tabletime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBob wants to put a new bargaining table in his office. To do so he measured the office room thoroughly and drew its plan: Bob's office room is a rectangular roomn×mmeters. Each square meter of the room is either occupied by some furniture, or free. A bargaining table is rectangular, and should be placed so, that its sides are parallel to the office walls. Bob doesn't want to change or rearrange anything, that's why all the squares that will be occupied by the table should be initially free. Bob wants the new table to sit as many people as possible, thus its perimeter should be maximal. Help Bob find out the maximum possible perimeter of a bargaining table for his office.InputThe first line contains 2 space-separated numbersnandm(1 ≤n,m≤ 25) — the office room dimensions. Then there follownlines withmcharacters 0 or 1 each. 0 stands for a free square meter of the office room. 1 stands for an occupied square meter. It's guaranteed that at least one square meter in the room is free.OutputOutput one number — the maximum possible perimeter of a bargaining table for Bob's office room.ExamplesInput3 3000010000Output8Input5 411000000000000000000Output16", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3552b903", "template_md5": "35d339e4", "result": "You are given the dimensions of a rectangular room ($n \\times m$). The room is represented by a grid where each cell is either 0 (free) or 1 (occupied).  \n\nFind the largest possible perimeter of a rectangular table that can fit entirely within the free cells of the room. The table's sides must be parallel to the room's walls."}, {"prompt_md5": "a68e8118", "template_md5": "465699a0", "result": "You are given a rectangular room with some areas blocked. Find the largest possible perimeter of a rectangular table that can fit entirely within the free areas of the room."}]}