{"uid": "22-C", "url": "https://codeforces.com/contest/22/problem/C", "tags": ["graphs"], "title": "22-C", "statement": "C. System Administratortime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutBob got a job as a system administrator in X corporation. His first task was to connectnservers with the help ofmtwo-way direct connection so that it becomes possible to transmit data from one server to any other server via these connections. Each direct connection has to link two different servers, each pair of servers should have at most one direct connection. Y corporation, a business rival of X corporation, made Bob an offer that he couldn't refuse: Bob was asked to connect the servers in such a way, that when server with indexvfails, the transmission of data between some other two servers becomes impossible, i.e. the system stops being connected. Help Bob connect the servers.InputThe first input line contains 3 space-separated integer numbersn,m,v(3 ≤n≤ 105, 0 ≤m≤ 105, 1 ≤v≤n),n— amount of servers,m— amount of direct connections,v— index of the server that fails and leads to the failure of the whole system.OutputIf it is impossible to connect the servers in the required way, output-1. Otherwise outputmlines with 2 numbers each — description of all the direct connections in the system. Each direct connection is described by two numbers — indexes of two servers, linked by this direct connection. The servers are numbered from 1. If the answer is not unique, output any.ExamplesInput5 6 3Output1 22 33 44 51 33 5Input6 100 1Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4bb52be1", "template_md5": "35d339e4", "result": "You are given $n$ servers and $m$ connections.  Each connection links two different servers.  You need to connect the servers so that if server $v$ fails, then no two other servers can communicate.\n\nOutput the connections as pairs of server numbers. If it's impossible to connect the servers this way, output -1."}, {"prompt_md5": "00e5e323", "template_md5": "465699a0", "result": "You need to connect a number of devices with direct links.  Each link connects two different devices, and each pair of devices can have at most one link. The goal is to make the system so that if a specific device fails, no two other devices can communicate. If this is impossible, output -1. Otherwise, list all the links."}]}