{"uid": "220-D", "url": "https://codeforces.com/contest/220/problem/D", "tags": ["geometry", " math"], "title": "220-D", "statement": "D. Little Elephant and Triangletime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Little Elephant is playing with the Cartesian coordinates' system. Most of all he likes playing with integer points. The Little Elephant defines an integer point as a pair of integers(x;y), such that0 ≤x≤wand0 ≤y≤h. Thus, the Little Elephant knows only(w+ 1)·(h+ 1)distinct integer points.The Little Elephant wants to paint a triangle with vertexes at integer points, the triangle's area must be a positive integer. For that, he needs to find the number of groups of three points that form such triangle. At that, the order of points in a group matters, that is, the group of three points(0;0),(0;2),(2;2)isn't equal to the group(0;2),(0;0),(2;2).Help the Little Elephant to find the number of groups of three integer points that form a nondegenerate triangle with integer area.InputA single line contains two integerswandh(1 ≤w,h≤ 4000).OutputIn a single output line print an integer — the remainder of dividing the answer to the problem by1000000007(109+ 7).ExamplesInput2 1Output36Input2 2Output240", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7b1b1496", "template_md5": "35d339e4", "result": "Given two integers $w$ and $h$ (where $1 \\le w, h \\le 4000$), find the number of groups of three distinct integer points $(x, y)$ such that $0 \\le x \\le w$ and $0 \\le y \\le h$, that form a non-degenerate triangle with integer area. The order of the points in a group matters.  Output the remainder when the answer is divided by $10^9 + 7$."}, {"prompt_md5": "3be1fea1", "template_md5": "465699a0", "result": "Given two numbers w and h, count the number of groups of three points within a grid of size w x h that form a triangle with a whole number area.  The points in each group must be distinct.  The answer should be the remainder when the count is divided by 1000000007."}]}