{"uid": "221-A", "url": "https://codeforces.com/contest/221/problem/A", "tags": ["implementation", " math"], "title": "221-A", "statement": "A. Little Elephant and Functiontime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Little Elephant enjoys recursive functions.This time he enjoys the sorting function. Letais a permutation of an integers from 1 ton, inclusive, andaidenotes thei-th element of the permutation. The Little Elephant's recursive functionf(x), that sorts the firstxpermutation's elements, works as follows:Ifx= 1, exit the function.Otherwise, callf(x- 1), and then makeswap(ax- 1,ax)(swap thex-th and(x- 1)-th elements ofa).The Little Elephant's teacher believes that this function does not work correctly. But that-be do not get an F, the Little Elephant wants to show the performance of its function. Help him, find a permutation of numbers from 1 ton, such that after performing the Little Elephant's function (that is callf(n)), the permutation will be sorted in ascending order.InputA single line contains integern(1 ≤n≤ 1000)— the size of permutation.OutputIn a single line printndistinct integers from 1 ton— the required permutation. Numbers in a line should be separated by spaces.It is guaranteed that the answer exists.ExamplesInput1Output1Input2Output2 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a253caa4", "template_md5": "35d339e4", "result": "Given an integer $n$ (1 ≤ $n$ ≤ 1000), find a permutation of numbers from 1 to $n$ such that after applying a specific sorting algorithm, the permutation will be sorted in ascending order. \n\nThe sorting algorithm works as follows:\n\n1. If $x = 1$, stop.\n2. Otherwise, recursively call the algorithm with $x-1$.\n3. Swap the $x$-th and $(x-1)$-th elements of the permutation. \n\n\nOutput the permutation as a single line of $n$ distinct integers separated by spaces."}, {"prompt_md5": "eee39b06", "template_md5": "465699a0", "result": "Given a number *n*, find a list of *n* distinct numbers from 1 to *n* that, when sorted using a specific recursive algorithm, will result in a sorted list."}]}