{"uid": "222-A", "url": "https://codeforces.com/contest/222/problem/A", "tags": ["brute force", " implementation"], "title": "222-A", "statement": "A. Shooshuns and Sequencetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day shooshuns found a sequence ofnintegers, written on a blackboard. The shooshuns can perform one operation with it, the operation consists of two steps:Find the number that goesk-th in the current sequence and add the same number to the end of the sequence;Delete the first number of the current sequence.The shooshuns wonder after how many operations all numbers on the board will be the same and whether all numbers will ever be the same.InputThe first line contains two space-separated integersnandk(1 ≤k≤n≤ 105).The second line containsnspace-separated integers:a1,a2, ...,an(1 ≤ai≤ 105) — the sequence that the shooshuns found.OutputPrint the minimum number of operations, required for all numbers on the blackboard to become the same. If it is impossible to achieve, print -1.ExamplesInput3 23 1 1Output1Input3 13 1 1Output-1NoteIn the first test case after the first operation the blackboard will have sequence[1, 1, 1]. So, one operation is enough to make all numbers the same. Thus, the answer equals one.In the second test case the sequence will never consist of the same numbers. It will always contain at least two distinct numbers 3 and 1. Thus, the answer equals -1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d32b41b4", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers. You can perform the following operation on the sequence:\n\n1. Find the $k$-th element in the sequence.\n2. Add that element to the end of the sequence.\n3. Remove the first element of the sequence.\n\nDetermine the minimum number of operations required to make all elements in the sequence equal. If it is impossible to make all elements equal, output -1."}, {"prompt_md5": "fb6f3135", "template_md5": "465699a0", "result": "You are given a list of numbers. You can repeatedly take the k-th number in the list, add it to the end, and remove the first number.  What is the fewest times you need to do this to make all the numbers in the list the same? If it's impossible, say -1."}]}