{"uid": "223-E", "url": "https://codeforces.com/contest/223/problem/E", "tags": ["flows", " geometry", " graphs"], "title": "223-E", "statement": "E. Planar Graphtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA graph is calledplanar, if it can be drawn in such a way that its edges intersect only at their vertexes.Anarticulation pointis such a vertex of an undirected graph, that when removed increases the number of connected components of the graph.Abridgeis such an edge of an undirected graph, that when removed increases the number of connected components of the graph.You've got a connected undirected planar graph consisting ofnvertexes, numbered from1ton, drawn on the plane. The graph has no bridges, articulation points, loops and multiple edges. You are also givenqqueries. Each query is a cycle in the graph. The query response is the number of graph vertexes, which (if you draw a graph and the cycle on the plane) are located either inside the cycle, or on it. Write a program that, given the graph and the queries, will answer each query.InputThe first line contains two space-separated integersnandm(3 ≤n,m≤ 105) — the number of vertexes and edges of the graph. Nextmlines contain the edges of the graph: thei-th line contains two space-separated integersuiandvi(1 ≤ui,vi≤n) — the numbers of vertexes, connecting thei-th edge. The nextnlines contain the positions of the planar graph vertexes on the plane: thei-th line contains a pair of space-separated integersxiandyi(|xi|, |yi| ≤ 109)— the coordinates of thei-th vertex of the graph on the plane.The next line contains integerq(1 ≤q≤ 105) — the number of queries. Then followqlines that describe the queries: thei-th line contains the sequence of space-separated integerski,a1,a2, ...,aki(1 ≤aj≤n;ki> 2), wherekiis the cycle length in thei-th query,ajare numbers of the vertexes that form a cycle. The numbers of vertexes in the cycle are given in the clockwise or counterclockwise order. The given cycles are simple, that is they cannot go through a graph vertex more than once. The total length of all cycles in all queries does not exceed105.It is guaranteed that the given graph contains no bridges, articulation points, loops and multiple edges. It is guaranteed that the edge segments can have common points only at the graph's vertexes.OutputFor each query print a single integer — the number of vertexes inside the cycle or on it. Print the answers in the order, in which the queries follow in the input. Separate the numbers by spaces.ExamplesInput3 31 22 33 10 01 00 113 1 2 3Output3Input5 81 22 33 44 11 52 53 54 50 02 02 20 21 114 1 2 3 4Output5Input4 51 22 33 44 12 40 01 01 10 133 1 2 43 4 2 34 1 2 3 4Output334", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f38d5abf", "template_md5": "35d339e4", "result": "You are given a connected undirected planar graph with $n$ vertices and $m$ edges. The graph has no bridges, articulation points, loops, or multiple edges.  You are also given $q$ queries. Each query is a cycle in the graph. \n\nFor each query, determine the number of vertices that are either inside the cycle or on the cycle when the graph is drawn on a plane.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($3 \\le n, m \\le 10^5$), representing the number of vertices and edges, respectively.\n* The next $m$ lines each contain two integers, $u_i$ and $v_i$ ($1 \\le u_i, v_i \\le n$), representing an edge between vertices $u_i$ and $v_i$.\n* The next $n$ lines each contain two integers, $x_i$ and $y_i$ ($|x_i|, |y_i| \\le 10^9$), representing the coordinates of vertex $i$ on the plane.\n* The next line contains an integer $q$ ($1 \\le q \\le 10^5$), representing the number of queries.\n* The next $q$ lines each contain a sequence of integers describing a cycle. The $i$-th query has length $k_i$ ($k_i > 2$) and is represented by $k_i$ integers $a_1, a_2, ..., a_{k_i}$ ($1 \\le a_j \\le n$), where the vertices are listed in clockwise or counterclockwise order.\n\n**Output:**\n\nFor each query, print a single integer representing the number of vertices inside or on the cycle. Print the answers in the order they appear in the input."}, {"prompt_md5": "7d8f0eb4", "template_md5": "465699a0", "result": "You are given a connected graph with no special features (like bridges or loops).  You are also given a list of cycles within the graph. For each cycle, determine how many vertices are either inside the cycle or on the cycle itself."}]}