{"uid": "223-C", "url": "https://codeforces.com/contest/223/problem/C", "tags": ["combinatorics", " math", " number theory"], "title": "223-C", "statement": "C. Partial Sumstime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got an arraya, consisting ofnintegers. The array elements are indexed from 1 ton. Let's determine a two step operation like that:First we build by the arrayaan arraysof partial sums, consisting ofnelements. Element numberi(1 ≤i≤n) of arraysequals. The operationxmodymeans that we take the remainder of the division of numberxby numbery.Then we write the contents of the arraysto the arraya. Element numberi(1 ≤i≤n) of the arraysbecomes thei-th element of the arraya(ai=si).You task is to find arrayaafter exactlykdescribed operations are applied.InputThe first line contains two space-separated integersnandk(1 ≤n≤ 2000,0 ≤k≤ 109). The next line containsnspace-separated integersa1,a2, ...,an— elements of the arraya(0 ≤ai≤ 109).OutputPrintnintegers  — elements of the arrayaafter the operations are applied to it. Print the elements in the order of increasing of their indexes in the arraya. Separate the printed numbers by spaces.ExamplesInput3 11 2 3Output1 3 6Input5 03 14 15 92 6Output3 14 15 92 6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "498c1047", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers.  You will perform $k$ operations on this array.  \n\nEach operation has the following form:\n\n1. Calculate the partial sums of the array. The $i$-th partial sum is the sum of the first $i$ elements of the array.\n\n2. Replace each element of the array with the remainder when the corresponding partial sum is divided by the element's original value.\n\nFind the contents of the array after exactly $k$ operations.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($1 \\le n \\le 2000$, $0 \\le k \\le 10^9$).\n* The second line contains $n$ integers, representing the elements of the array ($0 \\le a_i \\le 10^9$).\n\n**Output:**\n\nPrint $n$ integers, representing the elements of the array after $k$ operations."}, {"prompt_md5": "b90918a4", "template_md5": "465699a0", "result": "You are given a list of numbers. You perform a series of operations on the list. Each operation takes a number from the list and calculates the remainder when that number is divided by another number.  After each operation, the list is updated with the results of these calculations.  Find the list of numbers after a specific number of these operations."}]}