{"uid": "223-B", "url": "https://codeforces.com/contest/223/problem/B", "tags": ["data structures", " dp", " strings"], "title": "223-B", "statement": "B. Two Stringstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAsubsequenceof length|x|of strings=s1s2...s|s|(where|s|is the length of strings) is a stringx=sk1sk2...sk|x|(1 ≤k1<k2< ... <k|x|≤ |s|).You've got two strings —sandt. Let's consider all subsequences of strings, coinciding with stringt. Is it true that each character of stringsoccurs in at least one of these subsequences? In other words, is it true that for alli(1 ≤i≤ |s|), there is such subsequencex=sk1sk2...sk|x|of strings, thatx=tand for somej(1 ≤j≤ |x|)kj=i.InputThe first line contains strings, the second line contains stringt. Each line consists only of lowercase English letters. The given strings are non-empty, the length of each string does not exceed2·105.OutputPrint \"Yes\" (without the quotes), if each character of the stringsoccurs in at least one of the described subsequences, or \"No\" (without the quotes) otherwise.ExamplesInputabababOutputYesInputabacabaabaOutputNoInputabcbaOutputNoNoteIn the first sample stringtcan occur in the stringsas a subsequence in three ways:abab,ababandabab. In these occurrences each character of stringsoccurs at least once.In the second sample the 4-th character of the stringsdoesn't occur in any occurrence of stringt.In the third sample there is no occurrence of stringtin strings.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bdd32701", "template_md5": "35d339e4", "result": "You are given two strings,  *s* and *t*.  A subsequence of *s* is a sequence of characters from *s* where the characters appear in the same order but not necessarily consecutively.\n\nDetermine if every character in string *s* appears in at least one subsequence of *s* that is equal to string *t*.\n\n**Input:**\n\n* The first line contains string *s*.\n* The second line contains string *t*.\n\n**Output:**\n\n* Print \"Yes\" if every character in *s* appears in at least one subsequence of *s* that is equal to *t*.\n* Print \"No\" otherwise."}, {"prompt_md5": "85028b84", "template_md5": "465699a0", "result": "You have two strings.  Determine if every character in the first string appears in at least one subsequence of the first string that matches the second string."}]}