{"uid": "224-B", "url": "https://codeforces.com/contest/224/problem/B", "tags": ["bitmasks", " implementation", " two pointers"], "title": "224-B", "statement": "B. Arraytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got an arraya, consisting ofnintegers:a1,a2, ...,an. Your task is to find a minimal by inclusion segment[l,r](1 ≤l≤r≤n)such, that among numbersal,al+ 1,  ...,arthere are exactlykdistinct numbers.Segment[l,r](1 ≤l≤r≤n;l,rare integers) of lengthm=r-l+ 1, satisfying the given property, is calledminimal by inclusion, if there is no segment[x,y]satisfying the property and less thenmin length, such that1 ≤l≤x≤y≤r≤n. Note that the segment[l,r]doesn't have to be minimal in length among all segments, satisfying the given property.InputThe first line contains two space-separated integers:nandk(1 ≤n,k≤ 105). The second line containsnspace-separated integersa1,a2, ...,an— elements of the arraya(1 ≤ai≤ 105).OutputPrint a space-separated pair of integerslandr(1 ≤l≤r≤n) such, that the segment[l,r]is the answer to the problem. If the sought segment does not exist, print \"-1 -1\" without the quotes. If there are multiple correct answers, print any of them.ExamplesInput4 21 2 2 3Output1 2Input8 31 1 2 2 3 3 4 5Output2 5Input7 44 7 7 4 7 4 7Output-1 -1NoteIn the first sample among numbersa1anda2there are exactly two distinct numbers.In the second sample segment[2, 5]is a minimal by inclusion segment with three distinct numbers, but it is not minimal in length among such segments.In the third sample there is no segment with four distinct numbers.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0d9ccc4a", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers: $a_1, a_2, ..., a_n$.  Find the smallest segment of the array, $[l, r]$, where $1 \\le l \\le r \\le n$, that contains exactly $k$ distinct numbers. \n\nIf no such segment exists, print \"-1 -1\". If there are multiple solutions, print any one."}, {"prompt_md5": "bf2074fa", "template_md5": "465699a0", "result": "You are given a list of numbers. Find the smallest section of the list that contains exactly a specific number of unique numbers. If no such section exists, output -1 -1."}]}