{"uid": "225-C", "url": "https://codeforces.com/contest/225/problem/C", "tags": ["dp", " matrices"], "title": "225-C", "statement": "C. Barcodetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got ann×mpixel picture. Each pixel can be white or black. Your task is to change the colors of as few pixels as possible to obtain a barcode picture.A picture is a barcode if the following conditions are fulfilled:All pixels in each column are of the same color.The width of each monochrome vertical line is at leastxand at mostypixels. In other words, if we group all neighbouring columns of the pixels with equal color, the size of each group can not be less thanxor greater thany.InputThe first line contains four space-separated integersn,m,xandy(1 ≤n,m,x,y≤ 1000;x≤y).Then follownlines, describing the original image. Each of these lines contains exactlymcharacters. Character \".\" represents a white pixel and \"#\" represents a black pixel. The picture description doesn't have any other characters besides \".\" and \"#\".OutputIn the first line print the minimum number of pixels to repaint. It is guaranteed that the answer exists.ExamplesInput6 5 1 2##.#..###.###..#...#.##.####..Output11Input2 5 1 1#####.....Output5NoteIn the first test sample the picture after changing some colors can looks as follows:.##...##...##...##...##...##..In the second test sample the picture after changing some colors can looks as follows:.#.#..#.#.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4fd86d55", "template_md5": "35d339e4", "result": "You have a picture made up of $n$ rows and $m$ columns of pixels. Each pixel is either white (\".\") or black (\"#\").  Your goal is to change the fewest pixels possible to make the picture look like a barcode.\n\nA barcode picture has these rules:\n\n* Every column must have the same color (all white or all black).\n* Each group of continuous columns with the same color must be between $x$ and $y$ columns wide. \n\nThe input will give you the picture and the values for $n$, $m$, $x$, and $y$.  Output the minimum number of pixels you need to change to make the picture a barcode."}, {"prompt_md5": "bb4f2b15", "template_md5": "465699a0", "result": "You have a rectangular image made of black and white pixels.  Change as few pixels as possible to make it a barcode. A barcode has vertical stripes of the same color, where each stripe is at least a certain width and at most another certain width."}]}