{"uid": "225-A", "url": "https://codeforces.com/contest/225/problem/A", "tags": ["constructive algorithms", " greedy"], "title": "225-A", "statement": "A. Dice Towertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA dice is a cube, its faces contain distinct integers from 1 to 6 as black points. The sum of numbers at the opposite dice faces always equals 7. Please note that there are only two dice (these dices are mirror of each other) that satisfy the given constraints (both of them are shown on the picture on the left).Alice and Bob play dice. Alice has built a tower fromndice. We know that in this tower the adjacent dice contact with faces with distinct numbers. Bob wants to uniquely identify the numbers written on the faces of all dice, from which the tower is built. Unfortunately, Bob is looking at the tower from the face, and so he does not see all the numbers on the faces. Bob sees the number on the top of the tower and the numbers on the two adjacent sides (on the right side of the picture shown what Bob sees).Help Bob, tell whether it is possible to uniquely identify the numbers on the faces of all the dice in the tower, or not.InputThe first line contains a single integern(1 ≤n≤ 100) — the number of dice in the tower.The second line contains an integerx(1 ≤x≤ 6)— the number Bob sees at the top of the tower. Nextnlines contain two space-separated integers each: thei-th line contains numbersai,bi(1 ≤ai,bi≤ 6;ai≠bi)— the numbers Bob sees on the two sidelong faces of thei-th dice in the tower.Consider the dice in the tower indexed from top to bottom from 1 ton. That is, the topmost dice has index 1 (the dice whose top face Bob can see). It is guaranteed that it is possible to make a dice tower that will look as described in the input.OutputPrint \"YES\" (without the quotes), if it is possible to to uniquely identify the numbers on the faces of all the dice in the tower. If it is impossible, print \"NO\" (without the quotes).ExamplesInput363 25 42 4OutputYESInput332 64 15 3OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "70265925", "template_md5": "35d339e4", "result": "You are given a tower of $n$ dice ($1 \\le n \\le 100$).  You know the number on the top face of the tower ($x$, where $1 \\le x \\le 6$) and the numbers on the two side faces of each die in the tower.  \n\nDetermine if it is possible to uniquely identify the numbers on all the faces of the dice in the tower based on this information.\n\n**Input:**\n\n* The first line contains the number of dice, $n$.\n* The second line contains the number on the top face of the tower, $x$.\n* The following $n$ lines each contain two space-separated integers, representing the numbers on the two side faces of a die.\n\n**Output:**\n\n* Print \"YES\" if it is possible to uniquely identify all the numbers on the dice faces.\n* Print \"NO\" if it is not possible."}, {"prompt_md5": "4cca5679", "template_md5": "465699a0", "result": "You are given a tower of dice. You can see the top die and the two sides of each die in the tower.  Determine if there is enough information to figure out the number on each face of every die in the tower."}]}