{"uid": "226-C", "url": "https://codeforces.com/contest/226/problem/C", "tags": ["data structures", " implementation", " math", " matrices", " number theory"], "title": "226-C", "statement": "C. Anniversarytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere are less than 60 years left till the 900-th birthday anniversary of a famous Italian mathematician Leonardo Fibonacci. Of course, such important anniversary needs much preparations.Dima is sure that it'll be great to learn to solve the following problem by the Big Day: You're given a setA, consisting of numbersl,l+ 1,l+ 2,...,r; let's consider all itsk-element subsets; for each such subset let's find the largest common divisor of Fibonacci numbers with indexes, determined by the subset elements. Among all found common divisors, Dima is interested in the largest one.Dima asked to remind you that Fibonacci numbers are elements of a numeric sequence, whereF1= 1,F2= 1,Fn=Fn- 1+Fn- 2forn≥ 3.Dima has more than half a century ahead to solve the given task, but you only have two hours. Count the residue from dividing the sought largest common divisor bym.InputThe first line contains four space-separated integersm,l,randk(1 ≤m≤ 109; 1 ≤l<r≤ 1012; 2 ≤k≤r-l+ 1).Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to usecin,coutstreams or the%I64dspecifier.OutputPrint a single integer — the residue from dividing the sought greatest common divisor bym.ExamplesInput10 1 8 2Output3Input10 1 8 3Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "37e8b214", "template_md5": "35d339e4", "result": "You are given a set of integers from $l$ to $r$ inclusive.  For each subset of $k$ elements from this set, find the largest common divisor of the Fibonacci numbers at the indices given by the subset elements.  The largest common divisor found across all subsets is the answer.  Output the remainder when this largest common divisor is divided by $m$.\n\nInput:\n\n* $m$\n* $l$\n* $r$\n* $k$\n\nOutput:\n\n* The remainder when the largest common divisor is divided by $m$."}, {"prompt_md5": "c872ba24", "template_md5": "465699a0", "result": "You are given a range of numbers.  Find the largest number that divides the greatest common divisor of all possible subsets of size k from that range.  Output the remainder when this largest number is divided by m."}]}