{"uid": "226-D", "url": "https://codeforces.com/contest/226/problem/D", "tags": ["constructive algorithms", " greedy"], "title": "226-D", "statement": "D. The tabletime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutHarry Potter has a difficult homework. Given a rectangular table, consisting ofn×mcells. Each cell of the table contains the integer. Harry knows how to use two spells: the first spell change the sign of the integers in the selected row, the second — in the selected column. Harry's task is to make non-negative the sum of the numbers in each row and each column using these spells.Alone, the boy can not cope. Help the young magician!InputThe first line contains two integersnandm(1 ≤n,m≤ 100)— the number of rows and the number of columns.Nextnlines follow, each containsmintegers:j-th integer in thei-th line isai,j(|ai,j| ≤ 100), the number in thei-th row andj-th column of the table.The rows of the table numbered from 1 ton. The columns of the table numbered from 1 tom.OutputIn the first line print the numbera— the number of required applications of the first spell. Next printaspace-separated integers — the row numbers, you want to apply a spell. These row numbers must be distinct!In the second line print the numberb— the number of required applications of the second spell. Next printbspace-separated integers — the column numbers, you want to apply a spell. These column numbers must be distinct!If there are several solutions are allowed to print any of them.ExamplesInput4 1-1-1-1-1Output4 1 2 3 40Input2 4-1 -1 -1 21 1 1 1Output1 11 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f60f0a52", "template_md5": "35d339e4", "result": "You are given a rectangular table with $n$ rows and $m$ columns. Each cell in the table contains an integer. You have two operations:\n\n1. Change the sign of all the integers in a selected row.\n2. Change the sign of all the integers in a selected column.\n\nYour goal is to use these operations to make the sum of integers in each row and each column non-negative. \n\nFind the minimum number of operations required to achieve this, and list the rows and columns you would modify. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 100$), representing the number of rows and columns.\n* The next $n$ lines each contain $m$ integers, representing the values in each cell of the table.\n\n**Output:**\n\n* The first line contains an integer, $a$, representing the minimum number of times you need to apply operation 1 (changing the sign of a row).\n* The second line contains $a$ space-separated integers, representing the row numbers you would modify using operation 1.\n* The third line contains an integer, $b$, representing the minimum number of times you need to apply operation 2 (changing the sign of a column).\n* The fourth line contains $b$ space-separated integers, representing the column numbers you would modify using operation 2."}, {"prompt_md5": "296f7b1b", "template_md5": "465699a0", "result": "You are given a grid of numbers. You can change the sign of all numbers in a row or a column.  Find the minimum number of row and column operations needed to make the sum of numbers in each row and column non-negative."}]}