{"uid": "226-B", "url": "https://codeforces.com/contest/226/problem/B", "tags": ["greedy"], "title": "226-B", "statement": "B. Naughty Stone Pilestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arenpiles of stones of sizesa1,a2, ...,anlying on the table in front of you.During one move you can take one pile and add it to the other. As you add pileito pilej, the size of pilejincreases by the current size of pilei, and pileistops existing. The cost of the adding operation equals the size of the added pile.Your task is to determine the minimum cost at which you can gather all stones in one pile.To add some challenge, the stone piles built up conspiracy and decided that each pile will let you add to it not more thanktimes (after that it can only be added to another pile).Moreover, the piles decided to puzzle you completely and told youqvariants (not necessarily distinct) of whatkmight equal.Your task is to find the minimum cost for each ofqvariants.InputThe first line contains integern(1 ≤n≤ 105)— the number of stone piles. The second line containsnspace-separated integers:a1,a2, ...,an(1 ≤ai≤ 109)— the initial sizes of the stone piles.The third line contains integerq(1 ≤q≤ 105)— the number of queries. The last line containsqspace-separated integersk1,k2, ...,kq(1 ≤ki≤ 105)— the values of numberkfor distinct queries. Note that numberskican repeat.OutputPrintqwhitespace-separated integers — the answers to the queries in the order, in which the queries are given in the input.Please, do not use the%lldspecifier to read or write 64-bit integers in C++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput52 3 4 1 122 3Output9 8NoteIn the first sample one way to get the optimal answer goes like this: we add in turns the4-th and the5-th piles to the2-nd one; then we add the1-st pile to the3-rd one; we add the2-nd pile to the3-rd one. The first two operations cost1each; the third one costs2, the fourth one costs5(the size of the2-nd pile after the first two operations is not3, it already is5).In the second sample you can add the2-nd pile to the3-rd one (the operations costs3); then the1-st one to the3-th one (the cost is2); then the5-th one to the4-th one (the costs is1); and at last, the4-th one to the3-rd one (the cost is2).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dbe72375", "template_md5": "35d339e4", "result": "You are given $n$ piles of stones with sizes $a_1, a_2, ..., a_n$. You can merge two piles by adding the smaller pile's stones to the larger pile.  The cost of merging piles is equal to the size of the smaller pile.\n\nEach pile has a limit $k$ on how many times it can be merged.  You are given $q$ different values for $k$.\n\nFor each value of $k$, find the minimum cost to merge all the stones into a single pile. \n\n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "72b96490", "template_md5": "465699a0", "result": "You have multiple piles of objects. You can merge two piles by adding the smaller pile to the larger one, costing the size of the smaller pile.  You are given multiple limits on how many times each pile can be merged. Find the minimum cost to merge all piles into one."}]}