{"uid": "228-B", "url": "https://codeforces.com/contest/228/problem/B", "tags": ["brute force", " implementation"], "title": "228-B", "statement": "B. Two Tablestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got two rectangular tables with sizesna×maandnb×mbcells. The tables consist of zeroes and ones. We will consider the rows and columns of both tables indexed starting from 1. Then we will define the element of the first table, located at the intersection of thei-th row and thej-th column, asai,j; we will define the element of the second table, located at the intersection of thei-th row and thej-th column, asbi,j.We will call the pair of integers(x,y)ashiftof the second table relative to the first one. We'll call theoverlap factorof the shift(x,y)value:where the variablesi,jtake only such values, in which the expressionai,j·bi+x,j+ymakes sense. More formally, inequalities1 ≤i≤na, 1 ≤j≤ma, 1 ≤i+x≤nb, 1 ≤j+y≤mbmust hold. If there are no values of variablesi,j, that satisfy the given inequalities, the value of the sum is considered equal to 0.Your task is to find the shift with the maximum overlap factor among all possible shifts.InputThe first line contains two space-separated integersna,ma(1 ≤na,ma≤ 50)— the number of rows and columns in the first table. Thennalines containmacharacters each — the elements of the first table. Each character is either a \"0\", or a \"1\".The next line contains two space-separated integersnb,mb(1 ≤nb,mb≤ 50)— the number of rows and columns in the second table. Then follow the elements of the second table in the format, similar to the first table.It is guaranteed that the first table has at least one number \"1\". It is guaranteed that the second table has at least one number \"1\".OutputPrint two space-separated integersx,y(|x|, |y| ≤ 109)— a shift with maximum overlap factor. If there are multiple solutions, print any of them.ExamplesInput3 20110002 3001111Output0 1Input3 30000100001 11Output-1 -1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b9751e04", "template_md5": "35d339e4", "result": "You are given two rectangular tables of numbers. The first table has $n_a$ rows and $m_a$ columns, and the second table has $n_b$ rows and $m_b$ columns. Each cell in the tables contains either a 0 or a 1.\n\nYou want to find a shift for the second table relative to the first table. A shift is defined by two integers, $x$ and $y$.  The shifted second table is obtained by moving it $x$ rows down and $y$ columns to the right.\n\nThe *overlap factor* of a shift $(x, y)$ is the sum of the products of corresponding cells in the two tables, where the corresponding cells exist after the shift.  \n\nFormally, the overlap factor is:\n\n$$\\sum_{i=1}^{n_a} \\sum_{j=1}^{m_a} a_{i,j} \\cdot b_{i+x, j+y}$$\n\nwhere $a_{i,j}$ is the element in the first table at row $i$ and column $j$, and $b_{i+x, j+y}$ is the element in the second table at row $i+x$ and column $j+y$ (after the shift).  The sum is only taken over pairs $(i,j)$ where the corresponding cells exist in both tables after the shift.\n\nFind the shift $(x, y)$ that maximizes the overlap factor. If there are multiple shifts with the same maximum overlap factor, print any one of them."}, {"prompt_md5": "1e275511", "template_md5": "465699a0", "result": "You have two grids of numbers, one smaller than the other.  You can slide the smaller grid over the larger grid.  Find the position that gives the highest sum of matching \"1\"s in the two grids."}]}