{"uid": "228-D", "url": "https://codeforces.com/contest/228/problem/D", "tags": ["data structures"], "title": "228-D", "statement": "D. Zigzagtime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe court wizard Zigzag wants to become a famous mathematician. For that, he needs his own theorem, like the Cauchy theorem, or his sum, like the Minkowski sum. But most of all he wants to have his sequence, like the Fibonacci sequence, and his function, like the Euler's totient function.The Zigag's sequence with the zigzag factor z is an infinite sequenceSiz(i≥ 1;z≥ 2), that is determined as follows:Siz= 2, when;, when;, when.Operationmeans taking the remainder from dividing numberxby numbery. For example, the beginning of sequenceSi3(zigzag factor 3) looks as follows: 1, 2, 3, 2, 1, 2, 3, 2, 1.Let's assume that we are given an arraya, consisting ofnintegers. Let's define element numberi(1 ≤i≤n)of the array asai. The Zigzag function is function, wherel,r,zsatisfy the inequalities1 ≤l≤r≤n,z≥ 2.To become better acquainted with the Zigzag sequence and the Zigzag function, the wizard offers you to implement the following operations on the given arraya.The assignment operation. The operation parameters are(p,v). The operation denotes assigning valuevto thep-th array element. After the operation is applied, the value of the array elementapequalsv.The Zigzag operation. The operation parameters are(l,r,z). The operation denotes calculating the Zigzag functionZ(l,r,z).Explore the magical powers of zigzags, implement the described operations.InputThe first line contains integern(1 ≤n≤ 105)— The number of elements in arraya. The second line containsnspace-separated integers:a1,a2, ...,an(1 ≤ai≤ 109)— the elements of the array.The third line contains integerm(1 ≤m≤ 105)— the number of operations. Nextmlines contain the operations' descriptions. An operation's description starts with integerti(1 ≤ti≤ 2)— the operation type.Ifti= 1(assignment operation), then on the line follow two space-separated integers:pi,vi(1 ≤pi≤n; 1 ≤vi≤ 109)— the parameters of the assigning operation.Ifti= 2(Zigzag operation), then on the line follow three space-separated integers:li,ri,zi(1 ≤li≤ri≤n; 2 ≤zi≤ 6)— the parameters of the Zigzag operation.You should execute the operations in the order, in which they are given in the input.OutputFor each Zigzag operation print the calculated value of the Zigzag function on a single line. Print the values for Zigzag functions in the order, in which they are given in the input.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to usecin,coutstreams or the%I64dspecifier.ExamplesInput52 3 1 5 542 2 3 22 1 5 31 3 52 1 5 3Output52638NoteExplanation of the sample test:Result of the first operation isZ(2, 3, 2) = 3·1 + 1·2 = 5.Result of the second operation isZ(1, 5, 3) = 2·1 + 3·2 + 1·3 + 5·2 + 5·1 = 26.After the third operation arrayais equal to2, 3, 5, 5, 5.Result of the forth operation isZ(1, 5, 3) = 2·1 + 3·2 + 5·3 + 5·2 + 5·1 = 38.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b50cb584", "template_md5": "35d339e4", "result": "You are given an array of integers. You need to implement two operations:\n\n1. **Assignment:** Change the value of a specific element in the array.\n2. **Zigzag:** Calculate a value based on a subarray and a given integer $z$.\n\nThe Zigzag function $Z(l, r, z)$ is calculated as follows:\n\n$Z(l, r, z) = \\sum_{i=l}^{r} a_i \\cdot i \\pmod{z}$\n\nwhere $a_i$ is the $i$-th element of the array.\n\n**Input:**\n\n* The first line contains the number of elements in the array $n$.\n* The second line contains the $n$ elements of the array.\n* The third line contains the number of operations $m$.\n* Each of the following $m$ lines describes an operation:\n    * If the operation is an assignment, it contains two integers $p$ and $v$, indicating that the $p$-th element should be assigned the value $v$.\n    * If the operation is a Zigzag operation, it contains three integers $l$, $r$, and $z$, indicating that you should calculate $Z(l, r, z)$.\n\n**Output:**\n\nFor each Zigzag operation, print the calculated value of the Zigzag function on a single line."}, {"prompt_md5": "5cd92650", "template_md5": "465699a0", "result": "You are given an array of numbers. You can perform two types of operations:\n\n1. **Assignment:** Change the value of a specific element in the array.\n2. **Zigzag:** Calculate a sum based on a subarray and a given factor. The sum is calculated by iterating through the subarray and applying a specific formula involving the factor and the element values.\n\nYou need to implement these operations and calculate the result of each Zigzag operation."}]}