{"uid": "229-E", "url": "https://codeforces.com/contest/229/problem/E", "tags": ["combinatorics", " dp", " math", " probabilities"], "title": "229-E", "statement": "E. Giftstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOnce upon a time an old man and his wife lived by the great blue sea. One day the old man went fishing and caught a real live gold fish. The fish said: \"Oh ye, old fisherman! Pray set me free to the ocean and I will grant you withngifts, any gifts you wish!\". Then the fish gave the old man a list of gifts and their prices. Some gifts on the list can have the same names but distinct prices. However, there can't be two gifts with the same names and the same prices. Also, there can be gifts with distinct names and the same prices. The old man can ask fornnames of items from the list. If the fish's list haspoccurrences of the given name, then the old man can't ask for this name of item more thanptimes.The old man knows that if he asks forsgifts of the same name, the fish will randomly (i.e. uniformly amongst all possible choices) choosesgifts of distinct prices with such name from the list. The old man wants to please his greedy wife, so he will choose thennames in such a way that he can getngifts with the maximum price. Besides, he isn't the brightest of fishermen, so if there are several such ways, he chooses one of them uniformly.The old man wondered, what is the probability that he can getnmost expensive gifts. As the old man isn't good at probability theory, he asks you to help him.InputThe first line contains two space-separated integersnandm(1 ≤n,m≤ 1000) — the number of the old man's wishes and the number of distinct names in the goldfish's list, correspondingly. Thenmlines follow: thei-th line first contains integerki(ki> 0)— the number of distinct prices of gifts with thei-th name, thenkidistinct space-separated integerscij(1 ≤cij≤ 109), the gifts' prices.It is guaranteed that the sum of allkidoesn't exceed 1000. It is guaranteed thatnis not greater than the total number of the gifts.OutputOn a single line print one real number — the probability of gettingnmost valuable gifts. The answer will be considered correct if its absolute or relative error does not exceed10- 9.ExamplesInput3 13 10 20 30Output1.000000000Input3 21 404 10 20 30 40Output0.166666667", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3f3c6959", "template_md5": "35d339e4", "result": "You are given a list of $n$ gifts with $m$ distinct names. Each name has a different number of prices associated with it.  The prices for each name are distinct.\n\nYou can choose $n$ gifts from the list.  \n\n* You can choose the same gift name multiple times, but the fish will randomly select a different price for each instance of that name.\n* If a name appears $k$ times in the list, you can only choose it at most $k$ times.\n\nWhat is the probability that you can choose $n$ gifts with the highest possible total price? \n\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 1000$), representing the number of gifts you want to choose and the number of distinct gift names, respectively.\n* The next $m$ lines each contain two integers:\n    * The first integer, $k_i$, represents the number of prices associated with the $i$-th gift name.\n    * The next $k_i$ integers represent the distinct prices for the $i$-th gift name.\n\n**Output:**\n\n* Print a single real number representing the probability of choosing $n$ gifts with the highest possible total price."}, {"prompt_md5": "9f5f135c", "template_md5": "465699a0", "result": "You have a set of items with different prices. You can choose a number of items, but each item name can only be chosen a limited number of times.  What is the probability that you can choose the items that add up to the highest total price?"}]}