{"uid": "229-B", "url": "https://codeforces.com/contest/229/problem/B", "tags": ["binary search", " data structures", " graphs", " shortest paths"], "title": "229-B", "statement": "B. Planetstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutGoa'uld Apophis captured Jack O'Neill's team again! Jack himself was able to escape, but by that time Apophis's ship had already jumped to hyperspace. But Jack knows on what planet will Apophis land. In order to save his friends, Jack must repeatedly go through stargates to get to this planet.Overall the galaxy hasnplanets, indexed with numbers from 1 ton. Jack is on the planet with index 1, and Apophis will land on the planet with indexn. Jack can move between some pairs of planets through stargates (he can move in both directions); the transfer takes a positive, and, perhaps, for different pairs of planets unequal number of seconds. Jack begins his journey at time 0.It can be that other travellers are arriving to the planet where Jack is currently located. In this case, Jack has to wait for exactly 1 second before he can use the stargate. That is, if at timetanother traveller arrives to the planet, Jack can only pass through the stargate at timet+ 1, unless there are more travellers arriving at timet+ 1to the same planet.Knowing the information about travel times between the planets, and the times when Jack would not be able to use the stargate on particular planets, determine the minimum time in which he can get to the planet with indexn.InputThe first line contains two space-separated integers:n(2 ≤n≤ 105), the number of planets in the galaxy, andm(0 ≤m≤ 105) — the number of pairs of planets between which Jack can travel using stargates. Thenmlines follow, containing three integers each: thei-th line contains numbers of planetsaiandbi(1 ≤ai,bi≤n,ai≠bi), which are connected through stargates, and the integer transfer time (in seconds)ci(1 ≤ci≤ 104) between these planets. It is guaranteed that between any pair of planets there is at most one stargate connection.Thennlines follow: thei-th line contains an integerki(0 ≤ki≤ 105) that denotes the number of moments of time when other travellers arrive to the planet with indexi. Thenkidistinct space-separated integerstij(0 ≤tij< 109) follow, sorted in ascending order. An integertijmeans that at timetij(in seconds) another traveller arrives to the planeti. It is guaranteed that the sum of allkidoes not exceed105.OutputPrint a single number — the least amount of time Jack needs to get from planet 1 to planetn. If Jack can't get to planetnin any amount of time, print number -1.ExamplesInput4 61 2 21 3 31 4 82 3 42 4 53 4 301 32 3 40Output7Input3 11 2 301 30Output-1NoteIn the first sample Jack has three ways to go from planet 1. If he moves to planet 4 at once, he spends 8 seconds. If he transfers to planet 3, he spends 3 seconds, but as other travellers arrive to planet 3 at time 3 and 4, he can travel to planet 4 only at time 5, thus spending 8 seconds in total. But if Jack moves to planet 2, and then — to planet 4, then he spends a total of only2 + 5 = 7seconds.In the second sample one can't get from planet 1 to planet 3 by moving through stargates.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ab92e439", "template_md5": "35d339e4", "result": "There are $n$ planets numbered from 1 to $n$. You start on planet 1 and need to reach planet $n$.  You can travel between some pairs of planets using stargates. Each stargate has a travel time.\n\nYou can only use a stargate if no other travelers are arriving at that planet at the same time. If a traveler arrives at a planet, you must wait 1 second before using the stargate.\n\nThe input describes:\n\n* $n$: The number of planets.\n* $m$: The number of stargates.\n* For each stargate:\n    * The two planets it connects.\n    * The travel time.\n* For each planet:\n    * The number of times travelers arrive at that planet.\n    * The times when travelers arrive.\n\nFind the minimum time it takes to reach planet $n$. If it's impossible to reach planet $n$, output -1."}, {"prompt_md5": "b7c42c4c", "template_md5": "465699a0", "result": "You are given a graph representing connections between planets with travel times. Some planets have times when other travelers arrive, preventing immediate travel. Find the shortest time to travel from planet 1 to planet n. If it's impossible, return -1."}]}