{"uid": "229-D", "url": "https://codeforces.com/contest/229/problem/D", "tags": ["dp", " greedy", " two pointers"], "title": "229-D", "statement": "D. Towerstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe city of D consists ofntowers, built consecutively on a straight line. The height of the tower that goesi-th (from left to right) in the sequence equalshi. The city mayor decided to rebuild the city to make itbeautiful. In abeautifulcity all towers are are arranged in non-descending order of their height from left to right.The rebuilding consists of performing several (perhaps zero) operations. An operation constitutes using a crane to take any tower and put it altogether on the top of some other neighboring tower. In other words, we can take the tower that standsi-th and put it on the top of either the(i- 1)-th tower (if it exists), or the(i+ 1)-th tower (of it exists). The height of the resulting tower equals the sum of heights of the two towers that were put together. After that the two towers can't be split by any means, but more similar operations can be performed on the resulting tower. Note that after each operation the total number of towers on the straight line decreases by 1.Help the mayor determine the minimum number of operations required to make the city beautiful.InputThe first line contains a single integern(1 ≤n≤ 5000) — the number of towers in the city. The next line containsnspace-separated integers: thei-th numberhi(1 ≤hi≤ 105) determines the height of the tower that isi-th (from left to right) in the initial tower sequence.OutputPrint a single integer — the minimum number of operations needed to make the city beautiful.ExamplesInput58 2 7 3 1Output3Input35 2 1Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "adbe94cf", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ towers, each with a height $h_i$. The goal is to arrange the towers in non-decreasing order of height. You can perform the following operation:\n\n* Take any tower and place it on top of a neighboring tower (either the tower to its left or right). This creates a new tower with the sum of the heights of the two original towers.\n\nFind the minimum number of operations required to arrange the towers in non-decreasing order."}, {"prompt_md5": "d2076d72", "template_md5": "465699a0", "result": "You are given a sequence of numbers representing the heights of towers.  You can merge any two adjacent towers by placing one on top of the other, creating a new tower with the sum of their heights.  Find the fewest merges needed to arrange the towers in non-decreasing order."}]}