{"uid": "23-E", "url": "https://codeforces.com/contest/23/problem/E", "tags": ["dp"], "title": "23-E", "statement": "E. Treetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutRecently Bob invented a new game with a tree (we should remind you, that a tree is a connected graph without cycles): he deletes any (possibly, zero) amount of edges of the tree, and counts the product of sizes of the connected components left after the deletion. Your task is to find out the maximum number that Bob can get in his new game for a given tree.InputThe first input line contains integer numbern(1 ≤n≤ 700) — amount of vertices in the tree. The followingn- 1lines contain the description of the edges. Each line contains the pair of vertices' indexes, joined by an edge,ai,bi(1 ≤ai,bi≤n). It's guaranteed that the graph described in the input is a tree.OutputOutput the only number — the maximum product of sizes of the connected components, that Bob can get after deleting some of the tree's edges.ExamplesInput51 22 33 44 5Output6Input81 21 32 42 53 63 76 8Output18Input31 21 3Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1d871bd6", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices.  A tree is a connected graph with no cycles.  \n\nYou can remove any number of edges from the tree.  \n\nFind the largest possible product of the sizes of the connected components that remain after you remove edges.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 700), the number of vertices in the tree.\n* The next $n-1$ lines each contain two integers $a_i$ and $b_i$ (1 ≤ $a_i$, $b_i$ ≤ $n$), representing an edge between vertices $a_i$ and $b_i$.\n\n**Output:**\n\n* Output a single integer, the maximum product of the sizes of the connected components after removing edges."}, {"prompt_md5": "2f95def0", "template_md5": "465699a0", "result": "You are given a connected network of points.  You can remove some of the connections between the points. What is the largest possible product you can get by multiplying the number of points in each remaining group of connected points?"}]}