{"uid": "232-D", "url": "https://codeforces.com/contest/232/problem/D", "tags": ["binary search", " data structures", " string suffix structures"], "title": "232-D", "statement": "D. Fencetime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutJohn Doe has a crooked fence, consisting ofnrectangular planks, lined up from the left to the right: the plank that goesi-th(1 ≤i≤n)(from left to right) has width 1 and heighthi. We will assume that the plank that goesi-th(1 ≤i≤n)(from left to right) has indexi.Apiece of the fencefromltor(1 ≤l≤r≤n)is a sequence of planks of wood with indices fromltorinclusive, that is, planks with indicesl,l+ 1, ...,r. The width of the piece of the fence fromltoris valuer-l+ 1.Two pieces of the fence froml1tor1and froml2tor2are called matching, if the following conditions hold:the pieces do not intersect, that is, there isn't a single plank, such that it occurs in both pieces of the fence;the pieces are of the same width;for alli(0 ≤i≤r1-l1)the following condition holds:hl1+i+hl2+i=hl1+hl2.John chose a few pieces of the fence and now wants to know how many distinct matching pieces are for each of them. Two pieces of the fence are distinct if there is a plank, which belongs to one of them and does not belong to the other one.InputThe first line contains integern(1 ≤n≤ 105) — the number of wood planks in the fence. The second line containsnspace-separated integersh1,h2, ...,hn(1 ≤hi≤ 109) — the heights of fence planks.The third line contains integerq(1 ≤q≤ 105) — the number of queries. Nextqlines contain two space-separated integersliandri(1 ≤li≤ri≤n) — the boundaries of thei-th piece of the fence.OutputFor each query on a single line print a single integer — the number of pieces of the fence that match the given one. Print the answers to the queries in the order, in which the queries are given in the input.ExamplesInput101 2 2 1 100 99 99 100 100 10061 41 23 41 59 1010 10Output122029", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e3f7cb01", "template_md5": "35d339e4", "result": "You are given a fence made up of $n$ rectangular planks. Each plank has a width of 1 and a height of $h_i$ where $1 \\le i \\le n$.  \n\nA piece of the fence from $l$ to $r$ ($1 \\le l \\le r \\le n$) is a sequence of planks with indices from $l$ to $r$ inclusive. The width of this piece is $r-l+1$.\n\nTwo pieces of the fence are considered matching if:\n\n* They do not overlap.\n* They have the same width.\n* For all $i$ from 0 to the width of the piece minus 1, the following holds: $h_{l_1 + i} + h_{l_2 + i} = h_{l_1 + i + l_2}$.\n\nYou are given $q$ queries, each consisting of two integers $l$ and $r$. For each query, determine the number of distinct matching pieces of the fence. Two pieces are distinct if they contain at least one plank that the other does not.\n\n\n\nLet me know if you'd like me to clarify any part of the problem statement."}, {"prompt_md5": "619ce044", "template_md5": "465699a0", "result": "You are given a sequence of bars with different heights.  You need to find how many other non-overlapping sequences of bars have the same total width and where the sum of the heights at each corresponding position is the same."}]}