{"uid": "234-F", "url": "https://codeforces.com/contest/234/problem/F", "tags": ["dp"], "title": "234-F", "statement": "F. Fencetime limit per test2 secondsmemory limit per test256 megabytesinputinput.txtoutputoutput.txtVasya should paint a fence in front of his own cottage. The fence is a sequence ofnwooden boards arranged in a single row. Each board is a1centimeter wide rectangle. Let's number the board fence using numbers1, 2, ...,nfrom left to right. The height of thei-th board ishicentimeters.Vasya has a1centimeter wide brush and the paint of two colors, red and green. Of course, the amount of the paint is limited. Vasya counted the area he can paint each of the colors. It turned out that he can not paint overasquare centimeters of the fence red, and he can not paint overbsquare centimeters green. Each board of the fence should be painted exactly one of the two colors. Perhaps Vasya won't need one of the colors.In addition, Vasya wants his fence to look smart. To do this, he should paint the fence so as to minimize the value that Vasya called the fenceunattractivenessvalue. Vasya believes that two consecutive fence boards, painted different colors, look unattractive. Theunattractivenessvalue of a fence is the total length of contact between the neighboring boards of various colors. To make the fence look nice, you need to minimize the value as low as possible. Your task is to find what is the minimum unattractiveness Vasya can get, if he paints his fence completely.The picture shows the fence, where the heights of boards (from left to right) are 2,3,2,4,3,1. The first and the fifth boards are painted red, the others are painted green. The first and the second boards have contact length 2, the fourth and fifth boards have contact length 3, the fifth and the sixth have contact length 1. Therefore, theunattractivenessof the given painted fence is 2+3+1=6.InputThe first line contains a single integern(1 ≤n≤ 200) — the number of boards in Vasya's fence.The second line contains two integersaandb(0 ≤a,b≤ 4·104) — the area that can be painted red and the area that can be painted green, correspondingly.The third line contains a sequence ofnintegersh1,h2, ...,hn(1 ≤hi≤ 200)— the heights of the fence boards.All numbers in the lines are separated by single spaces.OutputPrint a single number — the minimumunattractivenessvalue Vasya can get if he paints his fence completely. If it is impossible to do, print- 1.ExamplesInput45 73 3 4 1Output3Input32 31 3 1Output2Input33 32 2 2Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "be43cbd8", "template_md5": "35d339e4", "result": "You are given a fence with $n$ boards. Each board has a height of $h_i$ centimeters. You have two colors of paint, red and green, with a limited amount of each. You can paint a maximum of $a$ square centimeters red and $b$ square centimeters green.  \n\nThe goal is to paint the fence with these colors in a way that minimizes the \"unattractiveness\" of the fence. The unattractiveness is defined as the total length of contact between boards painted with different colors.  \n\nFor example, if two boards are painted with different colors and they touch for a length of 2 centimeters, that contributes 2 to the unattractiveness.\n\nDetermine the minimum possible unattractiveness of the fence. If it's impossible to paint the fence with the given constraints, output -1."}, {"prompt_md5": "510673b3", "template_md5": "465699a0", "result": "You have a fence made of boards of different heights. You have a limited amount of red and green paint. You need to paint each board either red or green, and minimize the total length of contact between boards of different colors.  What is the minimum total contact length possible?"}]}