{"uid": "235-C", "url": "https://codeforces.com/contest/235/problem/C", "tags": ["data structures", " string suffix structures", " strings"], "title": "235-C", "statement": "C. Cyclical Questtime limit per test3 secondsmemory limit per test512 megabytesinputstdinoutputstdoutSome days ago, WJMZBMR learned how to answer the query \"how many times does a stringxoccur in a strings\" quickly by preprocessing the strings. But now he wants to make it harder.So he wants to ask \"how many consecutive substrings ofsare cyclical isomorphic to a given stringx\". You are given stringsandnstringsxi, for each stringxifind, how many consecutive substrings ofsare cyclical isomorphic toxi.Two strings are calledcyclical isomorphicif one can rotate one string to get the other one. 'Rotate' here means 'to take some consecutive chars (maybe none) from the beginning of a string and put them back at the end of the string in the same order'. For example, string \"abcde\" can be rotated to string \"deabc\". We can take characters \"abc\" from the beginning and put them at the end of \"de\".InputThe first line contains a non-empty strings. The length of stringsis not greater than106characters.The second line contains an integern(1 ≤n≤ 105) — the number of queries. Thennlines follow: thei-th line contains the stringxi— the string for thei-th query. The total length ofxiis less than or equal to106characters.In this problem, strings only consist of lowercase English letters.OutputFor each queryxiprint a single integer that shows how many consecutive substrings ofsare cyclical isomorphic toxi. Print the answers to the queries in the order they are given in the input.ExamplesInputbaabaabaaa5ababaaaabaaaabaOutput75735Inputaabbaa3aaaabbabbaOutput233", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "695773a6", "template_md5": "35d339e4", "result": "You are given a string $s$ and $n$ other strings $x_1, x_2, ..., x_n$.  For each $x_i$, find the number of consecutive substrings of $s$ that are cyclically isomorphic to $x_i$.\n\nTwo strings are cyclically isomorphic if one can be obtained from the other by rotating it.  For example, \"abcde\" is cyclically isomorphic to \"deabc\".\n\nOutput the number of cyclically isomorphic substrings for each $x_i$."}, {"prompt_md5": "789337e8", "template_md5": "465699a0", "result": "You are given a long string and a list of shorter strings. For each shorter string, count how many times it appears as a cyclically repeating pattern within the long string.  A cyclically repeating pattern means you can rotate the shorter string and it will match a section of the long string."}]}