{"uid": "238-C", "url": "https://codeforces.com/contest/238/problem/C", "tags": ["dfs and similar", " dp", " greedy", " trees"], "title": "238-C", "statement": "C. World Eater Brotherstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou must have heard of the two brothers dreaming of ruling the world. With all their previous plans failed, this time they decided to cooperate with each other in order to rule the world.As you know there arencountries in the world. These countries are connected byn- 1directed roads. If you don't consider direction of the roads there is a unique path between every pair of countries in the world, passing through each road at most once.Each of the brothers wants to establish his reign in some country, then it's possible for him to control the countries that can be reached from his country using directed roads.The brothers can rule the world if there exists at most two countries for brothers to choose (and establish their reign in these countries) so that any other country is under control of at least one of them. In order to make this possible they want to change the direction of minimum number of roads. Your task is to calculate this minimum number of roads.InputThe first line of input contains an integern(1 ≤n≤ 3000). Each of the nextn- 1lines contains two space-separated integersaiandbi(1 ≤ai,bi≤n;ai≠bi)saying there is a road from countryaito countrybi.Consider that countries are numbered from 1 ton. It's guaranteed that if you don't consider direction of the roads there is a unique path between every pair of countries in the world, passing through each road at most once.OutputIn the only line of output print the minimum number of roads that their direction should be changed so that the brothers will be able to rule the world.ExamplesInput42 13 14 1Output1Input52 12 34 34 5Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5adbbb55", "template_md5": "35d339e4", "result": "There are $n$ countries connected by $n-1$ directed roads.  Each road goes from one country to another.  You can think of the countries as numbered 1 through $n$.  \n\nTwo people want to rule the world.  Each person can choose a country to rule.  If a person rules a country, they also control all the other countries that can be reached by following the roads from their chosen country.\n\nThe people can rule the world if and only if there are at most two countries that they choose to rule, and every other country is controlled by at least one of them.\n\nThe people can change the direction of some roads.  What is the minimum number of roads they need to change so that they can rule the world?"}, {"prompt_md5": "41bfb4f0", "template_md5": "465699a0", "result": "You are given a network of connected cities.  Some roads have a direction.  Two people want to control the network so that every city is controlled by at least one of them. They can change the direction of some roads. Find the minimum number of roads they need to change."}]}