{"uid": "238-E", "url": "https://codeforces.com/contest/238/problem/E", "tags": ["dp", " graphs", " shortest paths"], "title": "238-E", "statement": "E. Meeting Hertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutUrpal lives in a big city. He has planned to meet his lover tonight.The city hasnjunctions numbered from1ton. The junctions are connected bymdirected streets, all the roads have equal length. Urpal lives in junctionaand the date is planned in a restaurant in junctionb. He wants to use public transportation to get to junctionb. There arekbus transportation companies. At the beginning of every second, a bus from thei-th company chooses a random shortest path between junctionsiand junctiontiand passes through it. There might be no path fromsitoti. In that case no bus will leave fromsitoti. If a bus passes through a junction where Urpal stands, he can get on the bus. He can also get o\u001bff the bus at any junction along the path.Now Urpal wants to know if it's possible to go to the date using public transportation in a \u001cfinite amount of time (the time of travel is the sum of length of the traveled roads) and what is the minimum number of buses he should take in the worst case.At any moment Urpal knows only his own position and the place where the date will be. When he gets on the bus he knows only the index of the company of this bus. Of course Urpal knows the city map and the the pairs(si,ti)for each company.Note that Urpal doesn't know buses velocity.InputThe \u001cfirst line of the input contains four integersn,m,a,b(2 ≤n≤ 100; 0 ≤m≤n·(n- 1); 1 ≤a,b≤n;a≠b).The nextmlines contain two integers eachuiandvi(1 ≤ui,vi≤n;ui≠vi)describing a directed road from junctionuito junctionvi. All roads in the input will be distinct.The next line contains an integerk(0 ≤k≤ 100). There will beklines after this, each containing two integerssiandti(1 ≤si,ti≤n;si≠ti)saying there is a bus route starting atsiand ending atti. Please note that there might be no path fromsitoti, this case is described in the problem statement.OutputIn the only line of output print the minimum number of buses Urpal should get on on his way in the worst case. If it's not possible to reach the destination in the worst case print -1.ExamplesInput7 8 1 71 21 32 43 44 64 56 75 732 71 45 7Output2Input4 4 1 21 21 32 43 411 4Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8a02cedb", "template_md5": "35d339e4", "result": "There are $n$ junctions in a city, numbered from 1 to $n$.  There are $m$ roads connecting these junctions, each with equal length.  \n\nYou start at junction $a$ and want to reach junction $b$.  There are $k$ bus companies. Each second, each company chooses a random shortest path between two junctions and a bus travels along that path.  A bus may not travel between junctions if there is no path.\n\nYou can get on a bus at any junction it passes through and get off at any junction along its path. You know the city map and the starting and ending junctions for each bus route. You do not know the bus speeds.\n\nDetermine if it is possible to reach junction $b$ using buses and, if so, the minimum number of buses you must take in the worst-case scenario. If it is not possible to reach junction $b$, output -1."}, {"prompt_md5": "843cb0c7", "template_md5": "465699a0", "result": "You are given a map of cities connected by one-way roads. You start at one city and need to reach another. Buses travel randomly between cities along these roads.  You can get on and off buses at any time.  Find the minimum number of buses you need to take to reach your destination in the worst-case scenario. If it's impossible to reach your destination, output -1."}]}