{"uid": "24-B", "url": "https://codeforces.com/contest/24/problem/B", "tags": ["implementation"], "title": "24-B", "statement": "B. F1 Championstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutFormula One championship consists of series of races called Grand Prix. After every race drivers receive points according to their final position. Only the top 10 drivers receive points in the following order 25, 18, 15, 12, 10, 8, 6, 4, 2, 1. At the conclusion of the championship the driver with most points is the champion. If there is a tie, champion is the one with most wins (i.e. first places). If a tie still exists, it is chosen the one with most second places, and so on, until there are no more place to use for compare.Last year another scoring system was proposed but rejected. In it the champion is the one with most wins. If there is tie, champion is the one with most points. If a tie still exists it is proceeded the same way as in the original scoring system, that is comparing number of second, third, forth, and so on, places.You are given the result of all races during the season and you are to determine the champion according to both scoring systems. It is guaranteed, that both systems will produce unique champion.InputThe first line contain integert(1 ≤t≤ 20), wheretis the number of races. After that all races are described one by one. Every race description start with an integern(1 ≤n≤ 50) on a line of itself, wherenis the number of clasified drivers in the given race. After thatnlines follow with the classification for the race, each containing the name of a driver. The names of drivers are given in order from the first to the last place. The name of the driver consists of lowercase and uppercase English letters and has length at most 50 characters. Comparing of names should be case-sensetive.OutputYour output should contain exactly two line. On the first line is the name of the champion according to the original rule, and on the second line the name of the champion according to the alternative rule.ExamplesInput33HamiltonVettelWebber2WebberVettel2HamiltonVettelOutputVettelHamiltonInput27ProstSurteesNakajimaSchumacherButtonDeLaRosaBuemi8AlonsoProstNinoFarinaJimClarkDeLaRosaNakajimaPatreseSurteesOutputProstProstNoteIt is not guaranteed that the same drivers participate in all races. For the championship consider every driver that has participated in at least one race. The total number of drivers during the whole season is not more then50.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "664b1ae8", "template_md5": "35d339e4", "result": "You are given the results of a racing championship with multiple races.  Each race has a set number of drivers who finish, and points are awarded to the top 10 drivers in each race according to the following system:\n\n* 1st place: 25 points\n* 2nd place: 18 points\n* 3rd place: 15 points\n* 4th place: 12 points\n* 5th place: 10 points\n* 6th place: 8 points\n* 7th place: 6 points\n* 8th place: 4 points\n* 9th place: 2 points\n* 10th place: 1 point\n\nThere are two ways to determine the overall champion:\n\n**System 1 (Original):**\n\n1.  Calculate the total points for each driver across all races.\n2.  The driver with the most points is the champion.\n3.  If there is a tie in points, the driver with the most first-place finishes is the champion.\n4.  If there is still a tie, the driver with the most second-place finishes is the champion, and so on, until a clear champion is determined.\n\n**System 2 (Alternative):**\n\n1.  Calculate the total number of first-place finishes for each driver across all races.\n2.  The driver with the most first-place finishes is the champion.\n3.  If there is a tie in first-place finishes, the driver with the most total points is the champion.\n4.  If there is still a tie, the tie is broken the same way as in System 1 (comparing second-place finishes, third-place finishes, and so on).\n\n**Input:**\n\n* The first line contains the number of races.\n* Each race is described on a separate line, starting with the number of drivers who finished.\n* The following lines list the drivers in order of finish (1st to last) for that race.\n\n**Output:**\n\n* Print the name of the champion according to System 1 on the first line.\n* Print the name of the champion according to System 2 on the second line."}, {"prompt_md5": "1cb25b34", "template_md5": "465699a0", "result": "You are given the results of a series of races.  Each race has a list of drivers ranked from first to last.  Points are awarded to the top 10 drivers in each race.  \n\nDetermine the champion based on two different rules:\n\n1.  The driver with the most points wins. If there is a tie, the driver with the most first-place finishes wins. If there is still a tie, the driver with the most second-place finishes wins, and so on.\n2.  The driver with the most first-place finishes wins. If there is a tie, the driver with the most points wins. If there is still a tie, the driver with the most second-place finishes wins, and so on. \n\n\nOutput the name of the champion according to each rule."}]}