{"uid": "24-D", "url": "https://codeforces.com/contest/24/problem/D", "tags": ["dp", " math", " probabilities"], "title": "24-D", "statement": "D. Broken robottime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou received as a gift a very clever robot walking on a rectangular board. Unfortunately, you understood that it is broken and behaves rather strangely (randomly). The board consists ofNrows andMcolumns of cells. The robot is initially at some cell on thei-th row and thej-th column. Then at every step the robot could go to some another cell. The aim is to go to the bottommost (N-th) row. The robot can stay at it's current cell, move to the left, move to the right, or move to the cell below the current. If the robot is in the leftmost column it cannot move to the left, and if it is in the rightmost column it cannot move to the right. At every step all possible moves are equally probable. Return the expected number of step to reach the bottommost row.InputOn the first line you will be given two space separated integersNandM(1 ≤N,M≤ 1000). On the second line you will be given another two space separated integersiandj(1 ≤i≤N, 1 ≤j≤M) — the number of the initial row and the number of the initial column. Note that,(1, 1)is the upper left corner of the board and(N,M)is the bottom right corner.OutputOutput the expected number of steps on a line of itself with at least4digits after the decimal point.ExamplesInput10 1010 4Output0.0000000000Input10 145 14Output18.0038068653", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0dca269e", "template_md5": "35d339e4", "result": "You have a robot on a rectangular board with $N$ rows and $M$ columns. The robot starts at a specific cell in row $i$ and column $j$.  The robot can move:\n\n* Up\n* Down\n* Left\n* Right\n\nThe robot can't move outside the board (e.g., it can't move left if it's already in the leftmost column).  At each step, the robot chooses a valid move with equal probability.\n\nWhat is the average number of steps the robot needs to take to reach the bottom row (row $N$)? \n\n\nInput:\n\n* Two integers $N$ and $M$ (the number of rows and columns).\n* Two integers $i$ and $j$ (the starting row and column).\n\nOutput:\n\n* The average number of steps to reach the bottom row, rounded to 8 decimal places."}, {"prompt_md5": "7b4e1947", "template_md5": "465699a0", "result": "A robot is on a grid and needs to reach the bottom. It can move left, right, or down, but not off the grid.  At each step, it chooses a move randomly. What is the average number of steps it takes to reach the bottom?"}]}