{"uid": "24-E", "url": "https://codeforces.com/contest/24/problem/E", "tags": ["binary search"], "title": "24-E", "statement": "E. Berland collidertime limit per test1.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutRecently the construction of Berland collider has been completed. Collider can be represented as a long narrow tunnel that containsnparticles. We associate with collider 1-dimensional coordinate system, going from left to right. For each particle we know its coordinate and velocity at the moment of start of the collider. The velocities of the particles don't change after the launch of the collider. Berland scientists think that the big bang will happen at the first collision of particles, whose velocities differs in directions. Help them to determine how much time elapses after the launch of the collider before the big bang happens.InputThe first line contains single integern(1 ≤n≤ 5·105) — amount of particles in the collider. Nextnlines contain description of particles. Each particle is described by two integersxi,vi(- 109≤xi,vi≤ 109,vi≠ 0) — coordinate and velocity respectively. All the coordinates are distinct. The particles are listed in order of increasing of coordinates. All the coordinates are in meters, and all the velocities — in meters per second. The negative velocity means that after the start of collider the particle will move to the left, and the positive — that the particle will move to the right.OutputIf there will be no big bang, output-1. Otherwise output one number — how much time in seconds elapses after the launch of the collider before the big bang happens. Your answer must have a relative or absolute error less than10- 9.ExamplesInput3-5 90 15 -1Output1.00000000000000000000Input61 32 33 34 -35 -16 -100Output0.02912621359223301065", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d9742e84", "template_md5": "35d339e4", "result": "You are given a list of $n$ particles, each with a position $x_i$ and a velocity $v_i$. The particles are moving in a straight line.  Determine the time it takes for the first two particles to collide, where the particles are moving in opposite directions. If no such collision occurs, output -1. \n\nThe velocities are given as integers, and the positions are distinct."}, {"prompt_md5": "035f90ce", "template_md5": "465699a0", "result": "You are given a list of objects moving at different speeds in a straight line.  Determine the time it takes for two objects moving in opposite directions to collide. If no collision occurs, output -1."}]}