{"uid": "241-F", "url": "https://codeforces.com/contest/241/problem/F", "tags": ["brute force", " implementation"], "title": "241-F", "statement": "F. Racetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Old City is a rectangular city represented as anm×ngrid of blocks. This city contains many buildings, straight two-way streets and junctions. Each junction and each building is exactly one block. All the streets have width of one block and are either vertical or horizontal. There is a junction on both sides of each street. We call two blocks adjacent if and only if they share a common side. No two blocks of different streets are adjacent and no two junctions are adjacent.There is an annual festival and as a part of it, The Old Peykan follows a special path in the city. This path starts from a block in a street, continues with many junctions and ends in a block of some street. For each street block, we know how much time it takes for the Old Peykan to go from this block to an adjacent block. Also the Old Peykan can go from each junction to its adjacent street blocks in one minute. Of course Old Peykan can't go to building blocks.We know the initial position of the Old Peykan and the sequence of junctions that it passes to reach its destination. After passing all the junctions and reaching the destination, it will stay there forever. Your task is to find out where will the Old Peykan bekminutes after it starts moving. Consider that The Old Peykan always follows the shortest path that passes through the given sequence of junctions and reaches the destination.Note that the Old Peykan may visit some blocks more than once.InputThe first line of input contains three integersm,nandk(3 ≤m,n≤ 100, 1 ≤k≤ 100000). Nextmlines are representing the city's map. Each of them containtsncharacters, each character is a block:Character \"#\" represents a building.Digits \"1\", \"2\",..., \"9\" represent a block of an street and this digit means the number of minutes it takes for the Old Peykan to pass this block.Characters \"a\", \"b\",..., \"z\" means that this block is a junction and this character is it's name. All the junction names are unique.Consider that all blocks have the coordinates: thej-th in thei-th line have coordinates(i,j)(1 ≤i≤m, 1 ≤j≤n).The(m+ 2)th line contains two integersrsandcs(1 ≤rs≤m, 1 ≤cs≤n), stringsand another two integersreandce(1 ≤re≤m, 1 ≤ce≤n). The path starts from block(rs,cs), continues through junctions in the order that is specified bysand will end in block(re,ce). Length ofsis between1and1000.It's guaranteed that stringsdenotes a correct path from the start position to the end position and stringsdoesn't contain two consecutive equal letters. Also start position(rs,cs)and the end position(re,ce)are street blocks.OutputIn a single line print two integersrfandcf— (rf,cf) being the position of the Old Peykan after exactlykminutes.ExamplesInput3 10 12###########z1a1111b###########2 3 ab 2 8Output2 8Input10 3 5####w##1##a##1##1##1##1##b####3 2 abababababababab 6 2Output8 2Input3 10 6###########z1a1311b###########2 3 ab 2 8Output2 7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "33a55f5d", "template_md5": "465699a0", "result": "A rectangular grid represents a city with streets and junctions.  The grid has a starting point and a destination.  You are given a sequence of junctions to visit.  The time it takes to travel between blocks is known.  Find the location of the traveler after a specific number of minutes."}, {"prompt_md5": "0ba49de3", "template_md5": "35d339e4", "result": "You are given a grid of size $m \\times n$ representing a city. \n\n* '#' represents a building.\n* Digits '1' to '9' represent street blocks, with the digit indicating the time it takes to travel through that block.\n* Letters 'a' to 'z' represent junctions.\n\nThe city has a path that starts at a specific street block $(r_s, c_s)$ and goes through a sequence of junctions (specified by a string of letters) before ending at a specific street block $(r_e, c_e)$.\n\nThe path always takes the shortest route through the junctions.\n\nGiven the grid, the starting block, the sequence of junctions, the ending block, and a time $k$, determine the coordinates $(r_f, c_f)$ of the location after $k$ minutes."}]}