{"uid": "241-B", "url": "https://codeforces.com/contest/241/problem/B", "tags": ["binary search", " bitmasks", " data structures", " math"], "title": "241-B", "statement": "B. Friendstime limit per test6 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou havenfriends and you want to takempictures of them. Exactly two of your friends should appear in each picture and no two pictures should contain the same pair of your friends. So if you haven= 3friends you can take3different pictures, each containing a pair of your friends.Each of your friends has an attractiveness level which is specified by the integer numberaifor thei-th friend. You know that the attractiveness of a picture containing thei-th and thej-th friends is equal to the exclusive-or (xoroperation) of integersaiandaj.You want to take pictures in a way that the total sum of attractiveness of your pictures is maximized. You have to calculate this value. Since the result may not fit in a 32-bit integer number, print it modulo1000000007(109+ 7).InputThe first line of input contains two integersnandm— the number of friends and the number of pictures that you want to take.Next line containsnspace-separated integersa1,a2, ...,an(0 ≤ai≤ 109) — the values of attractiveness of the friends.OutputThe only line of output should contain an integer — the optimal total sum of attractiveness of your pictures.ExamplesInput3 11 2 3Output3Input3 21 2 3Output5Input3 31 2 3Output6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac23c7f6", "template_md5": "35d339e4", "result": "You have $n$ friends, and you want to take $m$ pictures. Each picture must have exactly two friends in it, and no two pictures can have the same two friends. \n\nThe attractiveness of a picture with friends $i$ and $j$ is the bitwise XOR of their attractiveness values ($a_i \\oplus a_j$).\n\nYou want to choose the friends for each picture so that the total attractiveness of all the pictures is as high as possible.  Calculate this maximum total attractiveness modulo $10^9 + 7$. \n\n**Input:**\n\n* The first line contains two integers, $n$ (the number of friends) and $m$ (the number of pictures).\n* The second line contains $n$ space-separated integers, $a_1, a_2, ..., a_n$ (the attractiveness of each friend).\n\n**Output:**\n\n* The only line of output should contain the maximum total attractiveness modulo $10^9 + 7$."}, {"prompt_md5": "94cc6a9f", "template_md5": "465699a0", "result": "You have a group of people, each with a unique score. You want to take pairs of pictures of these people.  The score of a picture is the sum of the scores of the two people in it.  Find the best set of pairs to take pictures of to maximize the total score of all the pictures."}]}