{"uid": "241-C", "url": "https://codeforces.com/contest/241/problem/C", "tags": ["geometry", " implementation"], "title": "241-C", "statement": "C. Mirror Boxtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutMirror Box is a name of a popular game in the Iranian National Amusement Park (INAP). There is a wooden box,105cm long and100cm high in this game. Some parts of the box's ceiling and floor are covered by mirrors. There are two negligibly small holes in the opposite sides of the box at heightshlandhrcentimeters above the floor. The picture below shows what the box looks like.In the game, you will be given a laser gun to shoot once. The laser beam must enter from one hole and exit from the other one. Each mirror has a preset numbervi, which shows the number of points players gain if their laser beam hits that mirror. Also — to make things even funnier — the beam mustnothit any mirror more than once.Given the information about the box, your task is to find the maximum score a player may gain. Please note that the reflection obeys the law \"the angle of incidence equals the angle of reflection\".InputThe first line of the input contains three space-separated integershl,hr,n(0 <hl,hr< 100,0 ≤n≤ 100) — the heights of the holes and the number of the mirrors.Nextnlines contain the descriptions of the mirrors. Thei-th line contains space-separatedvi,ci,ai,bi; the integervi(1 ≤vi≤ 1000) is the score for thei-th mirror; the charactercidenotesi-th mirror's position — the mirror is on the ceiling ifciequals \"T\" and on the floor ifciequals \"F\"; integersaiandbi(0 ≤ai<bi≤ 105) represent thex-coordinates of the beginning and the end of the mirror.No two mirrors will share a common point. Consider that thexcoordinate increases in the direction from left to right, so the border with the hole at heighthlhas thexcoordinate equal to 0 and the border with the hole at heighthrhas thexcoordinate equal to105.OutputThe only line of output should contain a single integer — the maximum possible score a player could gain.ExamplesInput50 50 710 F 1 8000020 T 1 8000030 T 81000 8200040 T 83000 8400050 T 85000 8600060 T 87000 8800070 F 81000 89000Output100Input80 72 915 T 8210 1567910 F 11940 2239950 T 30600 4478950 F 32090 365795 F 45520 48519120 F 49250 552298 F 59700 8060935 T 61940 649392 T 92540 97769Output120NoteThe second sample is depicted above. The red beam gets10 + 50 + 5 + 35 + 8 + 2 = 110points and the blue one gets120.The red beam on the picture given in the statement shows how the laser beam can go approximately, this is just illustration how the laser beam can gain score. So for the second sample there is no such beam that gain score 110.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dae4b2fe", "template_md5": "35d339e4", "result": "You are given a rectangular box with two holes on opposite sides at heights $h_l$ and $h_r$ centimeters above the floor.  Some parts of the ceiling and floor of the box are covered by mirrors. Each mirror has a score $v_i$ associated with it.\n\nA laser beam can be shot from one hole and must exit through the other hole, hitting mirrors along the way.  The beam can only hit each mirror once.\n\nThe goal is to find the maximum score a player can achieve by shooting the laser beam in a way that hits the mirrors and follows the law of reflection (angle of incidence equals angle of reflection).\n\n**Input:**\n\n* $h_l$, $h_r$, $n$: The heights of the holes and the number of mirrors.\n* For each mirror: $v_i$, $c_i$, $a_i$, $b_i$: The score, whether it's on the ceiling (\"T\") or floor (\"F\"), and the x-coordinates of the beginning and end of the mirror.\n\n**Output:**\n\n* The maximum possible score."}, {"prompt_md5": "674db912", "template_md5": "465699a0", "result": "You have a box with two holes at different heights. Mirrors are placed on the ceiling and floor of the box. Each mirror has a point value. You need to shoot a laser beam from one hole to the other, making it hit as many mirrors as possible, each mirror only once, to get the highest possible score."}]}