{"uid": "243-D", "url": "https://codeforces.com/contest/243/problem/D", "tags": ["data structures", " dp", " geometry", " two pointers"], "title": "243-D", "statement": "D. Cubestime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day Petya got a set of wooden cubes as a present from his mom. Petya immediately built a whole city from these cubes.The base of the city is ann×nsquare, divided into unit squares. The square's sides are parallel to the coordinate axes, the square's opposite corners have coordinates(0, 0)and(n,n). On each of the unit squares Petya built a tower of wooden cubes. The side of a wooden cube also has a unit length.After that Petya went an infinitely large distance away from his masterpiece and looked at it in the direction of vectorv= (vx,vy, 0). Petya wonders, how many distinct cubes are visible from this position. Help him, find this number.Each cube includes the border. We think that a cube is visible if there is a ray emanating from some pointp, belonging to the cube, in the direction of vector-v, that doesn't contain any points, belonging to other cubes.InputThe first line contains three integersn,vxandvy(1 ≤n≤ 103,|vx|, |vy| ≤ |104|,|vx| + |vy| > 0).Nextnlines containnintegers each: thej-th integer in thei-th lineaij(0 ≤aij≤ 109,1 ≤i,j≤n)represents the height of the cube tower that stands on the unit square with opposite corners at points(i- 1,j- 1)and(i,j).OutputPrint a single integer — the number of visible cubes.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput5 -1 25 0 0 0 10 0 0 0 20 0 0 1 20 0 0 0 22 2 2 2 3Output20Input5 1 -25 0 0 0 10 0 0 0 20 0 0 1 20 0 0 0 22 2 2 2 3Output15", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "41f1b2e2", "template_md5": "465699a0", "result": "You are given a square grid of cells. Each cell contains a tower of a certain height.  You are looking at the grid from a specific direction.  Count how many towers are visible from that direction."}, {"prompt_md5": "995a05c8", "template_md5": "35d339e4", "result": "You are given a square grid of size $n \\times n$. Each cell in the grid has a tower of cubes with a certain height.  You are also given a direction vector $v = (vx, vy, 0)$.\n\nFind the number of cubes that are visible from a point infinitely far away in the direction of vector $v$. A cube is considered visible if there is a line from any point inside the cube that goes in the direction of $v$ without intersecting any other cubes."}]}