{"uid": "244-A", "url": "https://codeforces.com/contest/244/problem/A", "tags": ["implementation"], "title": "244-A", "statement": "A. Dividing Orangetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day Ms Swan bought an orange in a shop. The orange consisted ofn·ksegments, numbered with integers from 1 ton·k.There werekchildren waiting for Ms Swan at home. The children have recently learned about the orange and they decided to divide it between them. For that each child took a piece of paper and wrote the number of the segment that he would like to get: thei-th(1 ≤i≤k)child wrote the numberai(1 ≤ai≤n·k). All numbersaiaccidentally turned out to be different.Now the children wonder, how to divide the orange so as to meet these conditions:each child gets exactlynorange segments;thei-th child gets the segment with numberaifor sure;no segment goes to two children simultaneously.Help the children, divide the orange and fulfill the requirements, described above.InputThe first line contains two integersn,k(1 ≤n,k≤ 30). The second line containskspace-separated integersa1,a2, ...,ak(1 ≤ai≤n·k), whereaiis the number of the orange segment that thei-th child would like to get.It is guaranteed that all numbersaiare distinct.OutputPrint exactlyn·kdistinct integers. The firstnintegers represent the indexes of the segments the first child will get, the secondnintegers represent the indexes of the segments the second child will get, and so on. Separate the printed numbers with whitespaces.You can print a child's segment indexes in any order. It is guaranteed that the answer always exists. If there are multiple correct answers, print any of them.ExamplesInput2 24 1Output2 41 3Input3 12Output3 2 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0c6ff401", "template_md5": "465699a0", "result": "You are given a number of items and a number of people. Each person wants a specific item.  You need to divide the items among the people so that each person gets the same number of items and each person gets their desired item.  Output one way to divide the items."}, {"prompt_md5": "fdd3955a", "template_md5": "35d339e4", "result": "You are given an orange divided into $n \\cdot k$ segments, numbered from 1 to $n \\cdot k$.  There are $k$ children, each wanting a specific segment.  The $i$-th child wants segment number $a_i$.  \n\nYour task is to divide the orange so that:\n\n* Each child gets exactly $n$ segments.\n* The $i$-th child gets segment number $a_i$.\n* No segment is given to more than one child.\n\nOutput a list of $n \\cdot k$ integers representing the segments each child receives."}]}