{"uid": "245-G", "url": "https://codeforces.com/contest/245/problem/G", "tags": ["brute force", " graphs"], "title": "245-G", "statement": "G. Suggested Friendstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPolycarpus works as a programmer in a start-up social network. His boss gave his a task to develop a mechanism for determining suggested friends. Polycarpus thought much about the task and came to the folowing conclusion.Let's say that all friendship relationships in a social network are given asmusername pairsai,bi(ai≠bi). Each pairai,bimeans that usersaiandbiare friends. Friendship is symmetric, that is, ifaiis friends withbi, thenbiis also friends withai. Useryis asuggested friendfor userx, if the following conditions are met:x≠y;xandyaren't friends;among all network users who meet the first two conditions, useryhas most of all common friends with userx. Userzis a common friend of userxand usery(z≠x,z≠y), ifxandzare friends, andyandzare also friends.Your task is to help Polycarpus to implement a mechanism for determining suggested friends.InputThe first line contains a single integerm(1 ≤m≤ 5000)— the number of pairs of friends in the social network. Nextmlines contain pairs of names of the users who are friends with each other. Thei-th line contains two space-separated namesaiandbi(ai≠bi). The users' names are non-empty and consist of at most 20 uppercase and lowercase English letters.It is guaranteed that each pair of friends occurs only once in the input. For example, the input can't containx,yandy,xat the same time. It is guaranteed that distinct users have distinct names. It is guaranteed that each social network user has at least one friend. The last thing guarantees that each username occurs at least once in the input.OutputIn the first line print a single integern— the number of network users. In nextnlines print the number of suggested friends for each user. In thei-th line print the name of the userciand the number of his suggested friendsdiafter a space.You can print information about the users in any order.ExamplesInput5Mike GeraldKate MikeKate TankGerald TankGerald DavidOutput5Mike 1Gerald 1Kate 1Tank 1David 2Input4valera vanyavalera edikpasha valeraigor valeraOutput5valera 0vanya 3edik 3pasha 3igor 3NoteIn the first test case consider user David. Users Mike and Tank have one common friend (Gerald) with David. User Kate has no common friends with David. That's why David's suggested friends are users Mike and Tank.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "163d544b", "template_md5": "35d339e4", "result": "You are given a list of friendships between users in a social network.  Each friendship is represented by a pair of user names.  \n\nYour task is to determine for each user, the number of \"suggested friends\" they have. A suggested friend for a user is another user who:\n\n* Is not the user themselves\n* Is not already friends with the user\n* Has the most common friends with the user, among all users who meet the first two conditions.\n\n**Input:**\n\n* The first line contains an integer $m$ (1 ≤ $m$ ≤ 5000), the number of friendships.\n* The next $m$ lines each contain two space-separated user names, representing a friendship.\n\n**Output:**\n\n* The first line contains an integer $n$, the number of users.\n* The next $n$ lines each contain a user name followed by an integer, representing the number of suggested friends for that user."}, {"prompt_md5": "8be74fc7", "template_md5": "465699a0", "result": "Given a list of friendships between people, find for each person the person they are most connected to who is not already their friend.  \"Connected\" means they have the most friends in common."}]}