{"uid": "246-D", "url": "https://codeforces.com/contest/246/problem/D", "tags": ["brute force", " dfs and similar", " graphs"], "title": "246-D", "statement": "D. Colorful Graphtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got an undirected graph, consisting ofnvertices andmedges. We will consider the graph's vertices numbered with integers from 1 ton. Each vertex of the graph has a color. The color of thei-th vertex is an integerci.Let's consider all vertices of the graph, that are painted some colork. Let's denote a set of such asV(k). Let's denote the value of theneighbouring color diversityfor colorkas the cardinality of the setQ(k) = {cu:cu≠kand there is vertexvbelonging to setV(k)such that nodesvanduare connected by an edge of the graph}.Your task is to find such colork, which makes the cardinality of setQ(k)maximum. In other words, you want to find the color that has the most diverse neighbours. Please note, that you want to find such colork, that the graph has at least one vertex with such color.InputThe first line contains two space-separated integersn,m(1 ≤n,m≤ 105)— the number of vertices end edges of the graph, correspondingly. The second line contains a sequence of integersc1,c2, ...,cn(1 ≤ci≤ 105)— the colors of the graph vertices. The numbers on the line are separated by spaces.Nextmlines contain the description of the edges: thei-th line contains two space-separated integersai,bi(1 ≤ai,bi≤n;ai≠bi)— the numbers of the vertices, connected by thei-th edge.It is guaranteed that the given graph has no self-loops or multiple edges.OutputPrint the number of the color which has the set of neighbours with the maximum cardinality. It there are multiple optimal colors, print the color with the minimum number. Please note, that you want to find such color, that the graph has at least one vertex with such color.ExamplesInput6 61 1 2 3 5 81 23 21 44 34 54 6Output3Input5 64 2 5 2 41 22 33 15 35 43 4Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "51c70541", "template_md5": "35d339e4", "result": "You are given an undirected graph with $n$ vertices and $m$ edges. Each vertex has a color, represented by an integer $c_i$ where $1 \\le c_i \\le 10^5$.\n\nFor each color $k$, find the set of vertices $V(k)$ that have color $k$.  Then, find the set $Q(k)$ of colors that are neighbors of vertices in $V(k)$ but are different from $k$. The cardinality of $Q(k)$ is the number of distinct colors in this set.\n\nYour task is to find the color $k$ that maximizes the cardinality of $Q(k)$. If there are multiple colors that achieve the maximum cardinality, choose the color with the smallest value. \n\n**Input:**\n\n* The first line contains two integers $n$ and $m$, the number of vertices and edges, respectively.\n* The second line contains $n$ integers, the colors of the vertices.\n* The following $m$ lines each contain two integers, representing an edge between those vertices.\n\n**Output:**\n\nPrint the color $k$ that maximizes the cardinality of $Q(k)$."}, {"prompt_md5": "4fa76bd8", "template_md5": "465699a0", "result": "You are given a graph with colored nodes.  Find the color that appears on the most diverse set of connected nodes."}]}