{"uid": "246-C", "url": "https://codeforces.com/contest/246/problem/C", "tags": ["brute force", " constructive algorithms", " greedy"], "title": "246-C", "statement": "C. Beauty Pageanttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutGeneral Payne has a battalion ofnsoldiers. The soldiers' beauty contest is coming up, it will last forkdays. Payne decided that his battalion will participate in the pageant. Now he has choose the participants.All soldiers in the battalion have different beauty that is represented by a positive integer. The valueairepresents the beauty of thei-th soldier.On each ofkdays Generals has to send a detachment of soldiers to the pageant. The beauty of the detachment is the sum of the beauties of the soldiers, who are part of this detachment. Payne wants to surprise the jury of the beauty pageant, so each ofkdays the beauty of the sent detachment should be unique. In other words, allkbeauties of the sent detachments must be distinct numbers.Help Payne choosekdetachments of different beauties for the pageant. Please note that Payne cannot just forget to send soldiers on one day, that is, the detachment of soldiers he sends to the pageant should never be empty.InputThe first line contains two integersn,k(1 ≤n≤ 50;1 ≤k≤) — the number of soldiers and the number of days in the pageant, correspondingly. The second line contains space-separated integersa1,a2, ...,an(1 ≤ai≤ 107)— the beauties of the battalion soldiers.It is guaranteed that Payne's battalion doesn't have two soldiers with the same beauty.OutputPrintklines: in thei-th line print the description of the detachment that will participate in the pageant on thei-th day. The description consists of integerci(1 ≤ci≤n)— the number of soldiers in the detachment on thei-th day of the pageant andcidistinct integersp1,i,p2,i, ...,pci,i— the beauties of the soldiers in the detachment on thei-th day of the pageant. The beauties of the soldiers are allowed to print in any order.Separate numbers on the lines by spaces. It is guaranteed that there is the solution that meets the problem conditions. If there are multiple solutions, print any of them.ExamplesInput3 31 2 3Output1 11 22 3 2Input2 17 12Output1 12", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "33635c70", "template_md5": "35d339e4", "result": "You are given a list of $n$ positive integers, representing the beauty of $n$ soldiers. You need to choose $k$ subsets of these soldiers, where each subset represents a group of soldiers sent to a beauty pageant on a different day. \n\nThe key constraint is that the sum of the beauties of the soldiers in each subset must be unique across all $k$ days.  \n\nOutput the $k$ subsets, where each subset is represented by the number of soldiers in the subset and the list of their beauties."}, {"prompt_md5": "f3d131db", "template_md5": "465699a0", "result": "You have a group of people with unique scores.  You need to choose groups of these people each day for  days, with each day's group having a unique total score.  Each day's group must have at least one person.  List the people chosen for each day."}]}