{"uid": "246-B", "url": "https://codeforces.com/contest/246/problem/B", "tags": ["greedy", " math"], "title": "246-B", "statement": "B. Increase and Decreasetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPolycarpus has an array, consisting ofnintegersa1,a2, ...,an. Polycarpus likes it when numbers in an array match. That's why he wants the array to have as many equal numbers as possible. For that Polycarpus performs the following operation multiple times:he chooses two elements of the arrayai,aj(i≠j);he simultaneously increases numberaiby1and decreases numberajby1, that is, executesai=ai+ 1andaj=aj- 1.The given operation changes exactly two distinct array elements. Polycarpus can apply the described operation an infinite number of times.Now he wants to know what maximum number of equal array elements he can get if he performs an arbitrary number of such operation. Help Polycarpus.InputThe first line contains integern(1 ≤n≤ 105) — the array size. The second line contains space-separated integersa1,a2, ...,an(|ai| ≤ 104) — the original array.OutputPrint a single integer — the maximum number of equal array elements he can get if he performs an arbitrary number of the given operation.ExamplesInput22 1Output1Input31 4 1Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b44d34cd", "template_md5": "35d339e4", "result": "You are given an array of integers. You can perform the following operation any number of times:\n\n* Choose two distinct elements in the array.\n* Increase the first element by 1 and decrease the second element by 1.\n\nWhat is the maximum number of equal elements you can achieve in the array after performing these operations?"}, {"prompt_md5": "2183946e", "template_md5": "465699a0", "result": "You are given a list of numbers. You can repeatedly choose two different numbers from the list and increase one by 1 while decreasing the other by 1. What is the largest number of identical numbers you can create in the list?"}]}