{"uid": "250-E", "url": "https://codeforces.com/contest/250/problem/E", "tags": ["brute force"], "title": "250-E", "statement": "E. Mad Joetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutJoe has been hurt on the Internet. Now he is storming around the house, destroying everything in his path.Joe's house hasnfloors, each floor is a segment ofmcells. Each cell either contains nothing (it is an empty cell), or has a brick or a concrete wall (always something one of three). It is believed that each floor is surrounded by a concrete wall on the left and on the right.Now Joe is on then-th floor and in the first cell, counting from left to right. At each moment of time, Joe has the direction of his gaze, to the right or to the left (always one direction of the two). Initially, Joe looks to the right.Joe moves by a particular algorithm. Every second he makes one of the following actions:If the cell directly under Joe is empty, then Joe falls down. That is, he moves to this cell, the gaze direction is preserved.Otherwise consider the next cell in the current direction of the gaze.If the cell is empty, then Joe moves into it, the gaze direction is preserved.If this cell has bricks, then Joe breaks them with his forehead (the cell becomes empty), and changes the direction of his gaze to the opposite.If this cell has a concrete wall, then Joe just changes the direction of his gaze to the opposite (concrete can withstand any number of forehead hits).Joe calms down as soon as he reachesanycell of the first floor.The figure below shows an example Joe's movements around the house.Determine how many seconds Joe will need to calm down.InputThe first line contains two integersnandm(2 ≤n≤ 100,1 ≤m≤ 104).Nextnlines contain the description of Joe's house. Thei-th of these lines contains the description of the(n-i+ 1)-th floor of the house — a line that consists ofmcharacters: \".\" means an empty cell, \"+\" means bricks and \"#\" means a concrete wall.It is guaranteed that the first cell of then-th floor is empty.OutputPrint a single number — the number of seconds Joe needs to reach the first floor; or else, print word \"Never\" (without the quotes), if it can never happen.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput3 5..+.##+..++.#+.Output14Input4 10...+.##+.++#++..+++#++.#++++...+##.++#.+Output42Input2 2..++OutputNever", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "90f26ec6", "template_md5": "35d339e4", "result": "There are $n$ floors in a house, each floor has $m$ cells. Each cell can be empty (.), have bricks (+), or a concrete wall (#).  \n\nYou start on the $n$-th floor, in the first cell, looking to the right.\n\nHere's how you move:\n\n* If the cell below you is empty, you fall down.\n* Otherwise, look at the next cell in your current direction.\n* If it's empty, you move there.\n* If it has bricks, you break them and change direction.\n* If it's a concrete wall, you just change direction.\n\nYou stop moving when you reach any cell on the first floor.\n\nGiven the layout of the house, determine the minimum number of seconds it takes to reach the first floor. If it's impossible, print \"Never\"."}, {"prompt_md5": "6bee447e", "template_md5": "465699a0", "result": "A house has multiple floors. Each floor is a line of cells that can be empty, have bricks, or be a wall. You start on the top floor, in the first cell, facing right. You can move down to an empty cell below, or right or left to an adjacent cell. If you hit a wall, you change direction. If you hit bricks, you break them and change direction.  Find the minimum time to reach the bottom floor."}]}