{"uid": "250-B", "url": "https://codeforces.com/contest/250/problem/B", "tags": ["implementation", " strings"], "title": "250-B", "statement": "B. Restoring IPv6time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAn IPv6-address is a 128-bit number. For convenience, this number is recorded in blocks of 16 bits in hexadecimal record, the blocks are separated by colons — 8 blocks in total, each block has four hexadecimal digits. Here is an example of the correct record of a IPv6 address: \"0124:5678:90ab:cdef:0124:5678:90ab:cdef\". We'll call such format of recording an IPv6-addressfull.Besides the full record of an IPv6 address there is ashortrecord format. The record of an IPv6 address can be shortened by removing one or more leading zeroes at the beginning of each block. However, each block should contain at least one digit in the short format. For example, the leading zeroes can be removed like that: \"a56f:00d3:0000:0124:0001:f19a:1000:0000\"→\"a56f:d3:0:0124:01:f19a:1000:00\". There are more ways to shorten zeroes in this IPv6 address.Some IPv6 addresses contain long sequences of zeroes. Continuous sequences of 16-bit zero blocks can be shortened to \"::\". A sequence can consist of one or severalconsecutive blocks, with all 16 bits equal to 0.You can see examples of zero block shortenings below:\"a56f:00d3:0000:0124:0001:0000:0000:0000\"→\"a56f:00d3:0000:0124:0001::\";\"a56f:0000:0000:0124:0001:0000:1234:0ff0\"→\"a56f::0124:0001:0000:1234:0ff0\";\"a56f:0000:0000:0000:0001:0000:1234:0ff0\"→\"a56f:0000::0000:0001:0000:1234:0ff0\";\"a56f:00d3:0000:0124:0001:0000:0000:0000\"→\"a56f:00d3:0000:0124:0001::0000\";\"0000:0000:0000:0000:0000:0000:0000:0000\"→\"::\".It is not allowed to shorten zero blocks in the address more than once. This means that the short record can't contain the sequence of characters \"::\" more than once. Otherwise, it will sometimes be impossible to determine the number of zero blocks, each represented by a double colon.The format of the record of the IPv6 address after removing the leading zeroes and shortening the zero blocks is calledshort.You've got several short records of IPv6 addresses. Restore their full record.InputThe first line contains a single integern— the number of records to restore (1 ≤n≤ 100).Each of the followingnlines contains a string — the short IPv6 addresses. Each string only consists of string characters \"0123456789abcdef:\".It is guaranteed that each short address is obtained by the way that is described in the statement from some full IPv6 address.OutputFor each short IPv6 address from the input print its full record on a separate line. Print the full records for the short IPv6 addresses in the order, in which the short records follow in the input.ExamplesInput6a56f:d3:0:0124:01:f19a:1000:00a56f:00d3:0000:0124:0001::a56f::0124:0001:0000:1234:0ff0a56f:0000::0000:0001:0000:1234:0ff0::0ea::4d:f4:6:0Outputa56f:00d3:0000:0124:0001:f19a:1000:0000a56f:00d3:0000:0124:0001:0000:0000:0000a56f:0000:0000:0124:0001:0000:1234:0ff0a56f:0000:0000:0000:0001:0000:1234:0ff00000:0000:0000:0000:0000:0000:0000:000000ea:0000:0000:0000:004d:00f4:0006:0000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ce5d5a51", "template_md5": "35d339e4", "result": "You are given a list of shortened IPv6 addresses.  Each shortened address is formed by removing leading zeros from each 16-bit block and replacing sequences of zero blocks with \"::\".  \n\nYour task is to reconstruct the full IPv6 address for each shortened address.  \n\n**Input:**\n\n* The first line contains an integer *n* representing the number of shortened addresses.\n* Each of the following *n* lines contains a single shortened IPv6 address.\n\n**Output:**\n\n* For each shortened IPv6 address, print its full IPv6 address on a separate line.\n\n**Constraints:**\n\n* $1 \\le n \\le 100$ \n\n\n\nLet me know if you'd like me to elaborate on any aspect of IPv6 addresses or the shortening rules."}, {"prompt_md5": "8fa69dd5", "template_md5": "465699a0", "result": "You are given shortened versions of IPv6 addresses.  Restore them to their full, unshortened form.  \n\nRules for shortening:\n\n* Leading zeros can be removed from each 16-bit block.\n* A sequence of consecutive zero blocks can be replaced with \"::\". \n* Each shortened address must be unique and cannot have \"::\" repeated more than once."}]}