{"uid": "251-D", "url": "https://codeforces.com/contest/251/problem/D", "tags": ["bitmasks", " math"], "title": "251-D", "statement": "D. Two Setstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya likes numbers a lot. Recently his mother has presented him a collection ofnnon-negative integers. There's only one thing Petya likes more than numbers: playing with little Masha. He immediately decided to give a part of his new collection to her. To make the game even more interesting, Petya decided to give Masha such collection of numbers for which the following conditions fulfill:Let's introducex1to denote thexorof all numbers Petya has got left; and let's introducex2to denote thexorof all numbers he gave to Masha. Value(x1+x2)must be as large as possible.If there are multiple ways to divide the collection so that the previous condition fulfilled, then Petya minimizes the valuex1.Thexoroperation is a bitwise excluding \"OR\", that is denoted as \"xor\" in the Pascal language and \"^\" in C/C++/Java.Help Petya divide the collection as described above. If there are multiple suitable ways to divide it, find any of them. Please note that after Petya gives a part of his numbers to Masha, he may have no numbers left. The reverse situation is also possible, when Petya gives nothing to Masha. In both cases we must assume that thexorof an empty set of numbers equals 0.InputThe first line contains integern(1 ≤n≤ 105), showing how many numbers Petya's mother gave him. The second line contains the actual space-separated numbers. They are all integer, non-negative and do not exceed1018.OutputPrintnspace-separated integers, thei-th of them should equal either 1, if Petya keeps the number that followsi-th in his collection, or it should equal 2, if Petya gives the corresponding number to Masha. The numbers are indexed in the order in which they are given in the input.ExamplesInput61 2 3 4 5 6Output2 2 2 2 2 2Input31000000000000 1000000000000 1000000000000Output2 2 2Input81 1 2 2 3 3 4 4Output1 2 1 2 2 2 1 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2583fa09", "template_md5": "35d339e4", "result": "You are given a collection of $n$ non-negative integers.  You need to divide these integers into two sets, one for you to keep and one to give away.  The goal is to maximize the sum of the bitwise XOR of the two sets.  \n\nThe bitwise XOR of a set of numbers is calculated as follows:\n\n* The XOR of an empty set is 0.\n* The XOR of a set with one element is that element.\n* The XOR of two sets is calculated by XORing each corresponding element.\n\nIf there are multiple ways to divide the collection that achieve the maximum sum, you should choose the division that minimizes the XOR of the set you keep.\n\nOutput your answer as a sequence of 1s and 2s, where 1 indicates that the corresponding number is kept and 2 indicates that it is given away."}, {"prompt_md5": "e6847166", "template_md5": "465699a0", "result": "You are given a list of numbers.  You need to divide the list into two parts. The goal is to maximize the sum of the XOR of the two parts. If there are multiple ways to divide the list that achieve the maximum sum, choose the division that results in the smallest XOR for the first part."}]}