{"uid": "251-E", "url": "https://codeforces.com/contest/251/problem/E", "tags": ["dfs and similar", " dp", " implementation", " trees"], "title": "251-E", "statement": "E. Tree and Tabletime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya likes trees a lot. Recently his mother has presented him a tree with2nnodes. Petya immediately decided to place this tree on a rectangular table consisting of 2 rows andncolumns so as to fulfill the following conditions:Each cell of the table corresponds to exactly one tree node and vice versa, each tree node corresponds to exactly one table cell.If two tree nodes are connected by an edge, then the corresponding cells have a common side.Now Petya wonders how many ways are there to place his tree on the table. He calls two placements distinct if there is a tree node which corresponds to distinct table cells in these two placements. Since large numbers can scare Petya, print the answer modulo1000000007(109+ 7).InputThe first line contains a single integern(1 ≤n≤ 105). Next(2n- 1)lines contain two integers eachaiandbi(1 ≤ai,bi≤ 2n;ai≠bi)that determine the numbers of the vertices connected by the corresponding edge.Consider the tree vertexes numbered by integers from1to2n. It is guaranteed that the graph given in the input is a tree, that is, a connected acyclic undirected graph.OutputPrint a single integer — the required number of ways to place the tree on the table modulo1000000007(109+ 7).ExamplesInput31 32 34 35 16 2Output12Input41 22 33 44 55 66 77 8Output28Input21 23 24 2Output0NoteNote to the first sample (all 12 variants to place the tree on the table are given below):1-3-2    2-3-1    5 4 6    6 4 5| | |    | | |    | | |    | | |5 4 6    6 4 5    1-3-2    2-3-14-3-2    2-3-4    5-1 6    6 1-5| |    | |        | |    | |5-1 6    6 1-5    4-3-2    2-3-41-3-4    4-3-1    5 2-6    6-2 5| |        | |    | |        | |5 2-6    6-2 5    1-3-4    4-3-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2e66ccfc", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes.  You need to place this tree on a rectangular table with 2 rows and $n$ columns so that:\n\n* Each cell of the table corresponds to exactly one tree node, and vice versa.\n* If two tree nodes are connected by an edge, then the corresponding cells have a common side.\n\nHow many distinct ways are there to place the tree on the table? Two placements are distinct if there is at least one tree node that corresponds to different table cells in the two placements.  The answer should be given modulo $10^9 + 7$.\n\nThe input consists of:\n\n* The first line contains a single integer $n$ ($1 \\le n \\le 10^5$).\n* The next $(2n-1)$ lines contain two integers each, $a_i$ and $b_i$ ($1 \\le a_i, b_i \\le 2n; a_i \\neq b_i$), representing the numbers of the vertices connected by an edge.\n\nIt is guaranteed that the graph given in the input is a tree."}, {"prompt_md5": "fd8aacb7", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes.  You need to figure out how many ways you can arrange the tree's nodes on a 2xN grid so that connected nodes touch.  Two arrangements are different if even a single node is in a different spot.  The answer should be the number of arrangements modulo 1000000007."}]}