{"uid": "252-A", "url": "https://codeforces.com/contest/252/problem/A", "tags": ["brute force", " implementation"], "title": "252-A", "statement": "A. Little Xortime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya likes arrays that consist of non-negative integers a lot. Recently his mom has presented him one such array consisting ofnelements. Petya immediately decided to find there a segment of consecutive elements, such that thexorof all numbers from this segment was maximal possible. Help him with that.Thexoroperation is the bitwise exclusive \"OR\", that is denoted as \"xor\" in Pascal and \"^\" in C/C++/Java.InputThe first line contains integern(1 ≤n≤ 100) — the number of elements in the array. The second line contains the space-separated integers from the array. All numbers are non-negative integers strictly less than230.OutputPrint a single integer — the required maximalxorof a segment of consecutive elements.ExamplesInput51 2 1 1 2Output3Input31 2 7Output7Input44 2 4 8Output14NoteIn the first sample one of the optimal segments is the segment that consists of the first and the second array elements, if we consider the array elements indexed starting from one.The second sample contains only one optimal segment, which contains exactly one array element (element with index three).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "13e86852", "template_md5": "35d339e4", "result": "You are given an array of non-negative integers. Find the maximum possible XOR of any contiguous subarray within the array.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), the number of elements in the array.\n* The second line contains $n$ space-separated integers representing the array elements. All numbers are non-negative integers less than 230.\n\n**Output:**\n\n* Print a single integer representing the maximum XOR value of any contiguous subarray."}, {"prompt_md5": "ce3f2697", "template_md5": "465699a0", "result": "Find the largest possible sum of pairwise exclusive OR operations on a consecutive sequence of numbers in a given list of numbers."}]}