{"uid": "253-D", "url": "https://codeforces.com/contest/253/problem/D", "tags": ["brute force", " two pointers"], "title": "253-D", "statement": "D. Table with Letters - 2time limit per test2 secondsmemory limit per test256 megabytesinputinput.txtoutputoutput.txtVasya has recently started to learn English. Now he needs to remember how to write English letters. He isn't sure about some of them, so he decided to train a little.He found a sheet of squared paper and began writing arbitrary English letters there. In the end Vasya wrotenlines containingmcharacters each. Thus, he got a rectangularn×mtable, each cell of the table contained some English letter. Let's number the table rows from top to bottom with integers from 1 ton, and columns — from left to right with integers from 1 tom.After that Vasya looked at the resulting rectangular table and wondered, how many subtables are there, that matches both following conditions:the subtable contains at mostkcells with \"a\" letter;all letters, located in all four corner cells of the subtable, are equal.Formally, a subtable's definition is as follows. It is defined by four integersx1,y1,x2,y2such that1 ≤x1<x2≤n,1 ≤y1<y2≤m. Then the subtable contains all such cells(x,y)(xis the row number,yis the column number), for which the following inequality holdsx1≤x≤x2,y1≤y≤y2. The corner cells of the table are cells(x1,y1),(x1,y2),(x2,y1),(x2,y2).Vasya is already too tired after he's been writing letters to a piece of paper. That's why he asks you to count the value he is interested in.InputThe first line contains three integersn,m,k(2 ≤n,m≤ 400; 0 ≤k≤n·m).Nextnlines containmcharacters each — the given table. Each character of the table is a lowercase English letter.OutputPrint a single integer — the number of required subtables.ExamplesInput3 4 4aabbbaabbaabOutput2Input4 5 1ababaccacaccacbcbabcOutput1NoteThere are two suitable subtables in the first sample: the first one's upper left corner is cell(2, 2)and lower right corner is cell(3, 3), the second one's upper left corner is cell(2, 1)and lower right corner is cell(3, 4).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d8f7d589", "template_md5": "35d339e4", "result": "Given a rectangular grid of letters, find the number of subgrids that meet the following conditions:\n\n* The subgrid has at most $k$ cells containing the letter 'a'.\n* All four corner cells of the subgrid contain the same letter.\n\nThe grid has $n$ rows and $m$ columns. \n\n\nInput:\n\n* The first line contains three integers: $n$, $m$, and $k$.\n* The next $n$ lines each contain $m$ lowercase English letters representing the grid.\n\nOutput:\n\n* A single integer representing the number of valid subgrids."}, {"prompt_md5": "7893b0cd", "template_md5": "465699a0", "result": "You are given a grid of letters.  Find the number of rectangular subgrids where:\n\n* The subgrid has at most *k* 'a' letters.\n* All four corner letters of the subgrid are the same."}]}