{"uid": "254-C", "url": "https://codeforces.com/contest/254/problem/C", "tags": ["greedy", " strings"], "title": "254-C", "statement": "C. Anagramtime limit per test1 secondmemory limit per test256 megabytesinputinput.txtoutputoutput.txtStringxis ananagramof stringy, if we can rearrange the letters in stringxand get exact stringy. For example, strings \"DOG\" and \"GOD\" are anagrams, so are strings \"BABA\" and \"AABB\", but strings \"ABBAC\" and \"CAABA\" are not.You are given two stringssandtof the same length, consisting of uppercase English letters. You need to get the anagram of stringtfrom strings. You are permitted to perform the replacing operation: every operation is replacing some character from the stringsby any other character. Get the anagram of stringtin the least number of replacing operations. If you can get multiple anagrams of stringtin the least number of operations, get the lexicographically minimal one.The lexicographic order of strings is the familiar to us \"dictionary\" order. Formally, the stringpof lengthnis lexicographically smaller than stringqof the same length, ifp1=q1,p2=q2, ...,pk- 1=qk- 1,pk<qkfor somek(1 ≤k≤n). Here characters in the strings are numbered from 1. The characters of the strings are compared in the alphabetic order.InputThe input consists of two lines. The first line contains strings, the second line contains stringt. The strings have the same length (from1to105characters) and consist of uppercase English letters.OutputIn the first line printz— the minimum number of replacement operations, needed to get an anagram of stringtfrom strings. In the second line print the lexicographically minimum anagram that could be obtained inzoperations.ExamplesInputABACBAOutput1ABCInputCDBABCADCABDOutput2ADBADCNoteThe second sample has eight anagrams of stringt, that can be obtained from stringsby replacing exactly two letters: \"ADBADC\", \"ADDABC\", \"CDAABD\", \"CDBAAD\", \"CDBADA\", \"CDDABA\", \"DDAABC\", \"DDBAAC\". These anagrams are listed in the lexicographical order. The lexicographically minimum anagram is \"ADBADC\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "53f81eb1", "template_md5": "35d339e4", "result": "You are given two strings,  $s$ and $t$, of the same length.  Both strings are made up of uppercase English letters.\n\nYour goal is to transform string $s$ into an anagram of string $t$ by replacing characters.  \n\n* An anagram is a word or phrase formed by rearranging the letters of a different word or phrase.\n\nYou want to do this in the fewest number of replacements possible. If there are multiple ways to do this with the same minimum number of replacements, you want the lexicographically smallest anagram (the one that comes first in alphabetical order).\n\nOutput:\n\n1. The minimum number of replacements needed.\n2. The lexicographically smallest anagram of $t$ that can be created from $s$ using the minimum number of replacements. \n\n\n\nLet me know if you'd like help with any specific part of the problem or have any other questions!"}, {"prompt_md5": "f47829d0", "template_md5": "465699a0", "result": "You are given two words of the same length.  You can change any letter in the first word to any other letter.  Find the fewest changes needed to make the first word the same as the second word. If there are multiple ways to do this with the same number of changes, choose the word that comes first alphabetically."}]}