{"uid": "254-E", "url": "https://codeforces.com/contest/254/problem/E", "tags": ["dp", " implementation"], "title": "254-E", "statement": "E. Dormitorytime limit per test1 secondmemory limit per test256 megabytesinputinput.txtoutputoutput.txtStudent Vasya came to study in Berland State University from the country, so he is living in a dormitory. A semester hasndays, and in each of those days his parents send him some food. In the morning of thei-th day he receivesaikilograms of food that can be eaten on that day and on the next one (then the food goes bad and becomes unfit for consumption).Every day Vasya eatsvkilograms of food. It is known that Vasya's parents do not allow him to starve, so there always is enough food for Vasya. Vasya hasmfriends who sometimes live with him. Let's index the friends from 1 tom. Friend numberjlives with Vasya from dayljto dayrj, inclusive. Also, thej-th friend requiresfjkilograms of food per day. Usually Vasya's friends eat in the canteen, but sometimes generous Vasya feeds some of them. Every day Vasya can feed some friends who live with him this day (or may feed nobody).Every time Vasya feeds his friend, he gives him as much food as the friend needs for the day, and Vasya's popularity rating at the University increases by one. Vasya cannot feed the same friend multiple times in one day. In addition, he knows that eating habits must be regular, so he always eatsvkilograms of food per day.Vasya wants so choose whom he will feed each day of the semester to make his rating as high as possible. Originally Vasya's rating is 0 because he is a freshman.InputThe first line contains two integersnandv(1 ≤n,v≤ 400). The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 400), separated by single spaces. Valueaimeans that in the morning of thei-th dayaikilograms of food come, the food is good for eating on dayiand/or on dayi+ 1(then the food goes bad). It is guaranteed that if Vasya doesn't feed anyone, there is a way for him to eat so as to consumevkilograms of food every day.The third line contains integerm(1 ≤m≤ 400). Each of the followingmlines describes one Vasya's friend: thej-th of these lines contains three integerslj,rj,fj(1 ≤lj≤rj≤n, 1 ≤fj≤ 400), separated by single spaces.OutputIn the first line print the highest rating Vasya can reach. In the nextnlines print, which friends Vasya needs to feed on each day. In thei-th of these lines first print the number of friends to feed on thei-th day, and then list the indexes of these friends. Print the friends in these lists in any order. If there are multiple optimal solutions, print any of them.ExamplesInput4 13 2 5 431 3 21 4 13 4 2Output71 21 23 2 1 32 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fce04794", "template_md5": "35d339e4", "result": "There are $n$ days in a semester. Each day, $a_i$ kilograms of food arrive, which can be eaten on that day or the next.  Each day, $v$ kilograms of food must be eaten.\n\nThere are $m$ friends who will live with the person for a period of time. The $j$-th friend lives from day $l_j$ to day $r_j$ inclusive and eats $f_j$ kilograms of food per day.\n\nThe person can choose to feed some of their friends each day, giving them as much food as they need. Feeding a friend increases the person's rating by 1. The person cannot feed the same friend multiple times in one day.\n\nThe person wants to maximize their rating by choosing which friends to feed each day.\n\n**Input:**\n\n* The first line contains two integers $n$ and $v$.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$.\n* The third line contains an integer $m$.\n* The following $m$ lines each contain three integers $l_j$, $r_j$, and $f_j$.\n\n**Output:**\n\n* The first line contains the maximum achievable rating.\n* The following $n$ lines each contain the number of friends fed on that day, followed by the indices of those friends."}, {"prompt_md5": "82ac4eee", "template_md5": "465699a0", "result": "You have a set number of days. Each day, a certain amount of food arrives. You need to eat a fixed amount of food each day. Some friends visit for different periods of time and need food. You can choose to feed your friends each day, increasing your rating.  Find the maximum rating you can achieve by deciding who to feed each day."}]}