{"uid": "255-A", "url": "https://codeforces.com/contest/255/problem/A", "tags": ["implementation"], "title": "255-A", "statement": "A. Greg's Workouttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutGreg is a beginner bodybuilder. Today the gym coach gave him the training plan. All it had wasnintegersa1,a2, ...,an. These numbers mean that Greg needs to do exactlynexercises today. Besides, Greg should repeat thei-th in order exerciseaitimes.Greg now only does three types of exercises: \"chest\" exercises, \"biceps\" exercises and \"back\" exercises. Besides, his training is cyclic, that is, the first exercise he does is a \"chest\" one, the second one is \"biceps\", the third one is \"back\", the fourth one is \"chest\", the fifth one is \"biceps\", and so on to then-th exercise.Now Greg wonders, which muscle will get the most exercise during his training. We know that the exercise Greg repeats the maximum number of times, trains the corresponding muscle the most. Help Greg, determine which muscle will get the most training.InputThe first line contains integern(1 ≤n≤ 20). The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 25)— the number of times Greg repeats the exercises.OutputPrint word \"chest\" (without the quotes), if the chest gets the most exercise, \"biceps\" (without the quotes), if the biceps gets the most exercise and print \"back\" (without the quotes) if the back gets the most exercise.It is guaranteed that the input is such that the answer to the problem isunambiguous.ExamplesInput22 8OutputbicepsInput35 1 10OutputbackInput73 3 2 7 9 6 8OutputchestNoteIn the first sample Greg does 2 chest, 8 biceps and zero back exercises, so the biceps gets the most exercises.In the second sample Greg does 5 chest, 1 biceps and 10 back exercises, so the back gets the most exercises.In the third sample Greg does 18 chest, 12 biceps and 8 back exercises, so the chest gets the most exercise.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a687fcff", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers, $a_1, a_2, ..., a_n$.  These represent the number of times to repeat each of $n$ exercises.  \n\nThe exercises are performed in a cycle: chest, biceps, back, chest, biceps, back, and so on.\n\nDetermine which muscle group (chest, biceps, or back) will be exercised the most times. \n\n\nOutput the name of the muscle group that gets the most exercise."}, {"prompt_md5": "a71750bb", "template_md5": "465699a0", "result": "You are given a list of numbers representing how many times to repeat each of three types of exercises.  Determine which exercise type is repeated the most."}]}