{"uid": "256-D", "url": "https://codeforces.com/contest/256/problem/D", "tags": ["dp"], "title": "256-D", "statement": "D. Liars and Sergetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThere arenpeople, sitting in a line at the table. For each person we know that he always tells either the truth or lies.Little Serge asked them: how many of you always tell the truth? Each of the people at the table knows everything (who is an honest person and who is a liar) about all the people at the table. The honest people are going to say the correct answer, the liars are going to say any integer from 1 ton, which is not the correct answer. Every liar chooses his answer, regardless of the other liars, so two distinct liars may give distinct answer.Serge does not know any information about the people besides their answers to his question. He took a piece of paper and wrotenintegersa1,a2, ...,an, whereaiis the answer of thei-th person in the row. Given this sequence, Serge determined that exactlykpeople sitting at the tableapparently lie.Serge wonders, how many variants of people's answers (sequences of answersaof lengthn) there are where one can say that exactlykpeople sitting at the table apparently lie. As there can be rather many described variants of answers, count the remainder of dividing the number of the variants by777777777.InputThe first line contains two integersn,k,(1 ≤k≤n≤ 28). It is guaranteed thatn— is the power of number 2.OutputPrint a single integer — the answer to the problem modulo777777777.ExamplesInput1 1Output0Input2 1Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "698f072b", "template_md5": "35d339e4", "result": "There are $n$ people sitting in a line. Each person always tells the truth or lies.  \n\nThey are asked: \"How many of you always tell the truth?\"\n\n* Truth-tellers will answer with the correct number of truth-tellers.\n* Liars will answer with any integer between 1 and $n$, excluding the correct number.\n\nYou are given a sequence of $n$ answers, $a_1, a_2, ..., a_n$. You know that exactly $k$ people lied.\n\nHow many different sequences of answers are possible, given this information?  \n\nOutput the remainder when the number of possible sequences is divided by 777777777."}, {"prompt_md5": "1dead193", "template_md5": "465699a0", "result": "You have a line of people. Some always tell the truth, some always lie.  Each person is asked \"How many people in this line always tell the truth?\".  You know that exactly *k* people lied.  How many different ways could the people have answered?"}]}