{"uid": "256-E", "url": "https://codeforces.com/contest/256/problem/E", "tags": ["data structures"], "title": "256-E", "statement": "E. Lucky Arraystime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Maxim loves interesting problems. He decided to share one such problem with you.Initially there is an arraya, consisting ofnzeroes. The elements of the array are indexed, starting from 1. Then follow queries to change arraya. Each query is characterized by two integersvi,ti. In the answer to the query we should make thevi-th array element equalti(avi=ti; 1 ≤vi≤n).Maxim thinks that some pairs of integers(x,y)are good and some are not. Maxim thinks that arraya, consisting ofnintegers, is lucky, if for all integeri,(1 ≤i≤n- 1)the pair of integers(ai,ai+ 1)— is good. Note that the order of numbers in the pairs is important, that is, specifically,(1, 2) ≠ (2, 1).After each query to change arrayaMaxim wants to know, how many ways there are to replace all zeroes in arrayawith integers from one to three so as to make the resulting array (without zeroes) lucky. Of course, distinct zeroes can be replaced by distinct integers.Maxim told you the sequence of queries and all pairs of integers he considers lucky. Help Maxim, solve this problem for him.InputThe first line contains integersnandm(1 ≤n,m≤ 77777)— the number of elements in the array and the number of commands.The next three lines contain matrixw, consisting only of zeroes and ones; thej-th number in thei-th of these lines —wi,j. Ifwi,j= 1(1 ≤i,j≤ 3), then pair(i,j)is good, otherwise it is not good. Matrix does not have to be symmetric relative to the main diagonal.Nextmlines contain pairs of integersvi,ti(1 ≤vi≤n, 0 ≤ti≤ 3)— the queries to change the array.OutputPrintmintegers — thei-th number should equal to the number of ways to replace all zeroes in arraya(changed after thei-th query) by integers from one to three so as to make the resulting array (without zeroes) lucky. Separate the numbers by whitespaces. As the answers can be rather large, print the remainder from dividing them by777777777.ExamplesInput3 101 1 01 0 01 1 11 11 32 23 02 13 03 12 03 11 0Output3611221336", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "666b4b20", "template_md5": "35d339e4", "result": "You are given an array of $n$ zeroes. There are $m$ queries, each query is defined by two integers $v_i$ and $t_i$. The $v_i$-th element of the array will be changed to $t_i$.\n\nYou are also given a 3x3 matrix $w$ where $w_{i,j} = 1$ if the pair $(i,j)$ is considered \"good\" and $0$ otherwise.  A pair of integers $(x,y)$ is considered \"good\" if it meets a specific condition (defined by the matrix).\n\nAfter each query, you need to find the number of ways to replace all the zeroes in the array with integers from 1 to 3 such that the resulting array (without zeroes) satisfies the \"good\" pair condition for all consecutive elements.  \n\nPrint the number of ways to do this for each query, modulo 777777777. \n\n\n\nLet me know if you'd like me to elaborate on any specific part of the problem."}, {"prompt_md5": "dada0e21", "template_md5": "465699a0", "result": "You are given an array of zeros. You can change some of the zeros to numbers from 1 to 3.  You are also given a list of pairs of numbers that are considered \"good\".  A sequence of numbers is considered \"lucky\" if every pair of consecutive numbers in the sequence is good.\n\nAfter each change to the array, count how many ways you can fill in the remaining zeros with numbers from 1 to 3 to make the resulting array lucky."}]}