{"uid": "257-A", "url": "https://codeforces.com/contest/257/problem/A", "tags": ["greedy", " implementation", " sortings"], "title": "257-A", "statement": "A. Socketstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya has got many devices that work on electricity. He's gotnsupply-line filters to plug the devices, thei-th supply-line filter hasaisockets.Overall Vasya has gotmdevices andkelectrical sockets in his flat, he can plug the devices or supply-line filters directly. Of course, he can plug the supply-line filter to any other supply-line filter. The device (or the supply-line filter) is considered plugged to electricity if it is either plugged to one ofkelectrical sockets, or if it is plugged to some supply-line filter that is in turn plugged to electricity.What minimum number of supply-line filters from the given set will Vasya need to plug all the devices he has to electricity? Note that all devices and supply-line filters take one socket for plugging and that he can use one socket to plug either one device or one supply-line filter.InputThe first line contains three integersn,m,k(1 ≤n,m,k≤ 50) — the number of supply-line filters, the number of devices and the number of sockets that he can plug to directly, correspondingly. The second line containsnspace-separated integersa1,a2, ...,an(1 ≤ai≤ 50) — numberaistands for the number of sockets on thei-th supply-line filter.OutputPrint a single number — the minimum number of supply-line filters that is needed to plug all the devices to electricity. If it is impossible to plug all the devices even using all the supply-line filters, print -1.ExamplesInput3 5 33 1 2Output1Input4 7 23 3 2 4Output2Input5 5 11 3 1 2 1Output-1NoteIn the first test case he can plug the first supply-line filter directly to electricity. After he plug it, he get 5 (3 on the supply-line filter and 2 remaining sockets for direct plugging) available sockets to plug. Thus, one filter is enough to plug 5 devices.One of the optimal ways in the second test sample is to plug the second supply-line filter directly and plug the fourth supply-line filter to one of the sockets in the second supply-line filter. Thus, he gets exactly 7 sockets, available to plug: one to plug to the electricity directly, 2 on the second supply-line filter, 4 on the fourth supply-line filter. There's no way he can plug 7 devices if he use one supply-line filter.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1ba585ae", "template_md5": "35d339e4", "result": "You have $n$ supply-line filters. The $i$-th supply-line filter has $a_i$ sockets. You also have $m$ devices and $k$ electrical sockets. \n\nYou can plug devices or supply-line filters directly into the electrical sockets. You can also plug supply-line filters into each other.\n\nA device (or supply-line filter) is considered plugged in if it is plugged into an electrical socket or a supply-line filter that is plugged in.\n\nWhat is the minimum number of supply-line filters needed to plug in all $m$ devices? If it's impossible to plug in all the devices, print -1."}, {"prompt_md5": "82dbb3b6", "template_md5": "465699a0", "result": "You have a set of items, each with a certain number of slots. You also have a limited number of connections.  You need to determine the minimum number of items you need to connect to the connections to ensure all items have at least one connection. If it's impossible to connect all items, output -1."}]}