{"uid": "257-D", "url": "https://codeforces.com/contest/257/problem/D", "tags": ["greedy", " math"], "title": "257-D", "statement": "D. Sumtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya has found a piece of paper with an array written on it. The array consists ofnintegersa1,a2, ...,an. Vasya noticed that the following condition holds for the arrayai≤ai+ 1≤ 2·aifor any positive integeri(i<n).Vasya wants to add either a \"+\" or a \"-\" before each number of array. Thus, Vasya will get an expression consisting ofnsummands. The value of the resulting expression is the sum of all its elements. The task is to add signs \"+\" and \"-\" before each number so that the value of expressionsmeets the limits0 ≤s≤a1. Print a sequence of signs \"+\" and \"-\", satisfying the given limits. It is guaranteed that the solution for the problem exists.InputThe first line contains integern(1 ≤n≤ 105) — the size of the array. The second line contains space-separated integersa1,a2, ...,an(0 ≤ai≤ 109) — the original array.It is guaranteed that the conditionai≤ai+ 1≤ 2·aifulfills for any positive integeri(i<n).OutputIn a single line print the sequence ofncharacters \"+\" and \"-\", where thei-th character is the sign that is placed in front of numberai. The value of the resulting expressionsmust fit into the limits0 ≤s≤a1. If there are multiple solutions, you are allowed to print any of them.ExamplesInput41 2 3 5Output+++-Input33 3 5Output++-", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "685a6318", "template_md5": "35d339e4", "result": "You are given an array of integers $a_1, a_2, ..., a_n$ where $a_i \\le a_{i+1} \\le 2a_i$ for all $i$ from 1 to $n-1$.  \n\nYour task is to add either a \"+\" or a \"-\" sign in front of each number in the array. The goal is to find a sequence of signs that results in a sum between 0 and $a_1$ inclusive. \n\nOutput the sequence of signs. \n\n**Example:**\n\nInput:\n```\n4\n1 2 3 5\n```\n\nOutput:\n```\n+++- \n```"}, {"prompt_md5": "2360e86e", "template_md5": "465699a0", "result": "You are given a list of numbers.  You can add a \"+\" or \"-\" before each number.  Find a way to add the signs so that the sum of the resulting numbers is between 0 and the first number in the list."}]}