{"uid": "258-B", "url": "https://codeforces.com/contest/258/problem/B", "tags": ["brute force", " combinatorics", " dp"], "title": "258-B", "statement": "B. Little Elephant and Electionstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere have recently been elections in the zoo. Overall there were7main political parties: one of them is the Little Elephant Political Party,6other parties have less catchy names.Political parties find their number in the ballot highly important. Overall there arempossible numbers:1, 2, ...,m. Each of these7parties is going to be assigned in some way to exactly one number, at that, two distinct parties cannot receive the same number.The Little Elephant Political Party members believe in the lucky digits4and7. They want to evaluate their chances in the elections. For that, they need to find out, how many correct assignments are there, such that the number of lucky digits in the Little Elephant Political Party ballot number is strictly larger than the total number of lucky digits in the ballot numbers of 6 other parties.Help the Little Elephant Political Party, calculate this number. As the answer can be rather large, print the remainder from dividing it by1000000007(109+ 7).InputA single line contains a single positive integerm(7 ≤m≤ 109)— the number of possible numbers in the ballot.OutputIn a single line print a single integer — the answer to the problem modulo1000000007(109+ 7).ExamplesInput7Output0Input8Output1440", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7af59e39", "template_md5": "35d339e4", "result": "There are $m$ possible numbers for a ballot ($7 \\le m \\le 10^9$). 7 parties will be assigned one of these numbers each, with no repeats.  \n\nA party wants to know how many ways the numbers can be assigned so that the number assigned to the party in question has more lucky digits (4 or 7) than the sum of lucky digits in the numbers assigned to the other 6 parties.\n\nOutput the number of valid assignments modulo $10^9 + 7$."}, {"prompt_md5": "b562e3be", "template_md5": "465699a0", "result": "You are given a set of numbers. 7 groups need to be assigned one number each from this set, with no repeats.  Two numbers are considered \"lucky\".  How many ways can you assign the numbers so that the lucky number count for one specific group is strictly higher than the total lucky number count for the other 6 groups?"}]}