{"uid": "258-C", "url": "https://codeforces.com/contest/258/problem/C", "tags": ["binary search", " combinatorics", " dp", " math"], "title": "258-C", "statement": "C. Little Elephant and LCMtime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Little Elephant loves the LCM (least common multiple) operation of a non-empty set of positive integers. The result of the LCM operation ofkpositive integersx1,x2, ...,xkis the minimum positive integer that is divisible by each of numbersxi.Let's assume that there is a sequence of integersb1,b2, ...,bn. Let's denote their LCMs aslcm(b1,b2, ...,bn)and the maximum of them asmax(b1,b2, ...,bn). The Little Elephant considers a sequencebgood, iflcm(b1,b2, ...,bn) =max(b1,b2, ...,bn).The Little Elephant has a sequence of integersa1,a2, ...,an. Help him find the number of good sequences of integersb1,b2, ...,bn, such that for alli(1 ≤i≤n)the following condition fulfills:1 ≤bi≤ai. As the answer can be rather large, print the remainder from dividing it by1000000007(109+ 7).InputThe first line contains a single positive integern(1 ≤n≤ 105)— the number of integers in the sequencea. The second line containsnspace-separated integersa1,a2, ...,an(1 ≤ai≤ 105)— sequencea.OutputIn the single line print a single integer — the answer to the problem modulo1000000007(109+ 7).ExamplesInput41 4 3 2Output15Input26 3Output13", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c0b38701", "template_md5": "465699a0", "result": "You are given a sequence of numbers.  Find the number of ways to create a new sequence from the given sequence where each number in the new sequence is less than or equal to the corresponding number in the original sequence, and the least common multiple of the new sequence is equal to the largest number in the new sequence.  The answer should be the remainder when divided by 1000000007."}, {"prompt_md5": "306db295", "template_md5": "35d339e4", "result": "You are given a sequence of integers $a_1, a_2, ..., a_n$.  \n\nFind the number of ways to create a new sequence $b_1, b_2, ..., b_n$ where:\n\n* $1 \\le b_i \\le a_i$ for all $i$\n* The least common multiple of $b_1, b_2, ..., b_n$ is equal to the maximum of $b_1, b_2, ..., b_n$.\n\nThe answer should be the remainder when the count is divided by $10^9 + 7$."}]}