{"uid": "260-C", "url": "https://codeforces.com/contest/260/problem/C", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "260-C", "statement": "C. Balls and Boxestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutLittle Vasya hadnboxes with balls in the room. The boxes stood in a row and were numbered with numbers from 1 tonfrom left to right.Once Vasya chose one of the boxes, let's assume that its number isi, took all balls out from it (it is guaranteed that this box originally had at least one ball), and began putting balls (one at a time) to the boxes with numbersi+ 1,i+ 2,i+ 3and so on. If Vasya puts a ball into the box numbern, then the next ball goes to box1, the next one goes to box2and so on. He did it until he had no balls left in his hands. It is possible that Vasya puts multiple balls to the same box, and it is also possible that one or more balls will go to the box numberi. Ifi=n, Vasya puts the first ball into the box number1, then the next ball goes to box2and so on.For example, let's suppose that initially Vasya had four boxes, and the first box had3balls, the second one had2, the third one had5and the fourth one had4balls. Then, ifi= 3, then Vasya will take all five balls out of the third box and put them in the boxes with numbers:4, 1, 2, 3, 4. After all Vasya's actions the balls will lie in the boxes as follows: in the first box there are4balls,3in the second one,1in the third one and6in the fourth one.At this point Vasya has completely forgotten the original arrangement of the balls in the boxes, but he knows how they are arranged now, and the numberx— the number of the box, where he put the last of the taken out balls.He asks you to help to find the initial arrangement of the balls in the boxes.InputThe first line of the input contains two integersnandx(2 ≤n≤ 105,1 ≤x≤n), that represent the number of the boxes and the index of the box that got the last ball from Vasya, correspondingly. The second line containsnspace-separated integersa1,a2, ...,an, where integerai(0 ≤ai≤ 109,ax≠ 0) represents the number of balls in the box with indexiafter Vasya completes all the actions.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the%I64dspecifier.OutputPrintnintegers, where thei-th one represents the number of balls in the box numberibefore Vasya starts acting. Separate the numbers in the output by spaces. If there are multiple correct solutions, you are allowed to print any of them.ExamplesInput4 44 3 1 6Output3 2 5 4Input5 23 2 0 2 7Output2 1 4 1 6Input3 32 3 1Output1 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5bc5426a", "template_md5": "35d339e4", "result": "You are given $n$ boxes numbered from 1 to $n$.  Each box contains a certain number of balls.  \n\nYou perform the following operation repeatedly:\n\n1. Choose a box $i$.\n2. Take all the balls out of box $i$.\n3. Place each ball into boxes numbered $i+1$, $i+2$, $i+3$, and so on, wrapping around to box 1 if necessary.\n\nYou know the final number of balls in each box after all the operations are complete, and you also know the box number $x$ that received the last ball.  \n\nYour task is to determine the original number of balls in each box.\n\n**Input:**\n\n* Two integers $n$ and $x$ ($2 \\le n \\le 10^5$, $1 \\le x \\le n$)\n* $n$ integers $a_1$, $a_2$, ..., $a_n$ ($0 \\le a_i \\le 10^9$, $a_x \\neq 0$) representing the number of balls in each box after the operations.\n\n**Output:**\n\n* $n$ integers representing the original number of balls in each box."}, {"prompt_md5": "4fab0258", "template_md5": "465699a0", "result": "You are given the number of boxes and the box that received the last ball. You are also given the number of balls in each box after a series of moves.  Determine the original number of balls in each box."}]}