{"uid": "260-D", "url": "https://codeforces.com/contest/260/problem/D", "tags": ["constructive algorithms", " dsu", " graphs", " greedy", " trees"], "title": "260-D", "statement": "D. Black and White Treetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe board has got a painted tree graph, consisting ofnnodes. Let us remind you that a non-directed graph is called a tree if it is connected and doesn't contain any cycles.Each node of the graph is painted black or white in such a manner that there aren't two nodes of the same color, connected by an edge. Each edge contains its value written on it as a non-negative integer.A bad boy Vasya came up to the board and wrote numbersvnear each nodev— the sum of values of all edges that are incident to this node. Then Vasya removed the edges and their values from the board.Your task is to restore the original tree by the node colors and numberssv.InputThe first line of the input contains a single integern(2 ≤n≤ 105) — the number of nodes in the tree. Nextnlines contain pairs of space-separated integersci,si(0 ≤ci≤ 1,0 ≤si≤ 109), wherecistands for the color of thei-th vertex (0 is for white, 1 is for black), andsirepresents the sum of values of the edges that are incident to thei-th vertex of the tree that is painted on the board.OutputPrint the description ofn- 1edges of the tree graph. Each description is a group of three integersvi,ui,wi(1 ≤vi,ui≤n,vi≠ui,0 ≤wi≤ 109), whereviandui— are the numbers of the nodes that are connected by thei-th edge, andwiis its value. Note that the following condition must fulfillcvi≠cui.It is guaranteed that for any input data there exists at least one graph that meets these data. If there are multiple solutions, print any of them. You are allowed to print the edges in any order. As you print the numbers, separate them with spaces.ExamplesInput31 31 20 5Output3 1 33 2 2Input61 00 31 80 20 30 0Output2 3 35 3 34 3 21 6 02 1 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bab220ca", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes ($2 \\le n \\le 10^5$). Each node is colored either black or white.  No two connected nodes have the same color. Each edge has a non-negative integer value.\n\nYou are also given a list of $n$ numbers, where the $i$-th number represents the sum of the values of all edges connected to the $i$-th node.\n\nYour task is to reconstruct the original tree based on the node colors and the given sums. \n\nOutput the tree by listing $n-1$ edges. Each edge is represented by three integers: the numbers of the two nodes connected by the edge, and the value of the edge.  \n\n**Constraints:**\n\n* $1 \\le vi, ui \\le n$\n* $vi \\neq ui$\n* $0 \\le wi \\le 10^9$"}, {"prompt_md5": "027095fe", "template_md5": "465699a0", "result": "You are given a tree with nodes colored black or white. Each node has a number representing the sum of values on the edges connected to it.  You need to reconstruct the tree, including the values on the edges, based only on the node colors and their corresponding numbers."}]}