{"uid": "261-E", "url": "https://codeforces.com/contest/261/problem/E", "tags": ["brute force", " dp", " two pointers"], "title": "261-E", "statement": "E. Maxim and Calculatortime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutMaxim has got a calculator. The calculator has two integer cells. Initially, the first cell contains number1, and the second cell contains number0. In one move you can perform one of the following operations:Let's assume that at the current time the first cell contains numbera, and the second cell contains numberb. Write to the second cell numberb+ 1;Let's assume that at the current time the first cell contains numbera, and the second cell contains numberb. Write to the first cell numbera·b.Maxim is wondering, how many integersx(l≤x≤r)are there, such that we can write the numberxto the first cell of the calculator, having performed at mostpmoves.InputThe first line contains three integers:l,r,p(2 ≤l≤r≤ 109, 1 ≤p≤ 100).The numbers in the line are separated by single spaces.OutputIn a single line print a single integer — the answer to the problem.ExamplesInput2 10 3Output1Input2 111 100Output106Input2 111 11Output47", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5018904b", "template_md5": "35d339e4", "result": "You are given three integers $l$, $r$, and $p$.  \n\nThere is a calculator with two cells. The first cell starts with the number $l$ and the second cell starts with the number 0.\n\nYou can perform the following operations on the calculator:\n\n* Add 1 to the number in the second cell.\n* Multiply the number in the first cell by the number in the second cell, and write the result in the first cell.\n\nFind the number of integers $x$ between $l$ and $r$ (inclusive) that can be written in the first cell of the calculator after performing at most $p$ operations. \n\n\nOutput this number."}, {"prompt_md5": "e3ef8145", "template_md5": "465699a0", "result": "Given a range of numbers (l to r) and a maximum number of operations (p), find how many numbers in the range can be reached by repeatedly performing two operations: increment the second number by 1 or multiply the first number by the second number."}]}