{"uid": "262-B", "url": "https://codeforces.com/contest/262/problem/B", "tags": ["greedy"], "title": "262-B", "statement": "B. Roma and Changing Signstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutRoma works in a company that sells TVs. Now he has to prepare a report for the last year.Roma has got a list of the company's incomes. The list is a sequence that consists ofnintegers. The total income of the company is the sum of all integers in sequence. Roma decided to perform exactlykchanges of signs of several numbers in the sequence. He can also change the sign of a number one, two or more times.The operation of changing a number's sign is the operation of multiplying this number by -1.Help Roma perform the changes so as to make the total income of the company (the sum of numbers in the resulting sequence) maximum. Note that Roma should performexactlykchanges.InputThe first line contains two integersnandk(1 ≤n,k≤ 105), showing, how many numbers are in the sequence and how many swaps are to be made.The second line contains anon-decreasingsequence, consisting ofnintegersai(|ai| ≤ 104).The numbers in the lines are separated by single spaces. Please note that the given sequence is sorted in non-decreasing order.OutputIn the single line print the answer to the problem — the maximum total income that we can obtain after exactlykchanges.ExamplesInput3 2-1 -1 1Output3Input3 1-1 -1 1Output1NoteIn the first sample we can get sequence[1, 1, 1], thus the total income equals3.In the second test, the optimal strategy is to get sequence[-1, 1, 1], thus the total income equals1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b02eeaeb", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers. You can change the sign of any number in the sequence (multiply it by -1) exactly $k$ times.  What is the maximum possible sum of the numbers in the sequence after making these changes?\n\nInput:\n\n* The first line contains two integers $n$ and $k$ (1 ≤ $n$, $k$ ≤ 10⁵), representing the number of integers in the sequence and the number of sign changes allowed.\n* The second line contains $n$ non-decreasing integers $a_i$ (|a_i| ≤ 10⁴), representing the sequence.\n\nOutput:\n\n* Print the maximum possible sum of the integers in the sequence after making the sign changes."}, {"prompt_md5": "ba2eca3e", "template_md5": "465699a0", "result": "You are given a list of numbers. You can change the sign of any number in the list a total of k times. What is the largest possible sum of all the numbers in the list after making these changes?"}]}