{"uid": "264-A", "url": "https://codeforces.com/contest/264/problem/A", "tags": ["constructive algorithms", " data structures", " implementation", " two pointers"], "title": "264-A", "statement": "A. Escape from Stonestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSquirrel Liss lived in a forest peacefully, but unexpected trouble happens. Stones fall from a mountain. Initially Squirrel Liss occupies an interval[0, 1]. Next,nstones will fall and Liss will escape from the stones. The stones are numbered from 1 tonin order.The stones always fall to the center of Liss's interval. When Liss occupies the interval[k-d,k+d]and a stone falls tok, she will escape to the left or to the right. If she escapes to the left, her new interval will be[k-d,k]. If she escapes to the right, her new interval will be[k,k+d].You are given a stringsof lengthn. If thei-th character ofsis \"l\" or \"r\", when thei-th stone falls Liss will escape to the left or to the right, respectively. Find the sequence of stones' numbers from left to right after all thenstones falls.InputThe input consists of only one line. The only line contains the strings(1 ≤ |s| ≤ 106). Each character inswill be either \"l\" or \"r\".OutputOutputnlines — on thei-th line you should print thei-th stone's number from the left.ExamplesInputllrlrOutput35421InputrrlllOutput12543InputlrlrrOutput24531NoteIn the first example, the positions of stones 1, 2, 3, 4, 5 will be, respectively. So you should print the sequence: 3, 5, 4, 2, 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "72b3ea95", "template_md5": "35d339e4", "result": "You are given a string of length $n$ where each character is either 'l' or 'r'.  \n\nA squirrel is initially located in the interval $[0, 1]$.  \n\n* If the $i$-th character in the string is 'l', the squirrel moves its location to the left.\n* If the $i$-th character in the string is 'r', the squirrel moves its location to the right.\n\nEach move causes the squirrel to shift its location based on the current interval.  \n\nDetermine the final order of $n$ stones after the squirrel moves based on the given string."}, {"prompt_md5": "a7d9c135", "template_md5": "465699a0", "result": "You are given a sequence of 'l' and 'r' characters. Each character represents the direction a stone will move a region.  'l' means the region moves left, 'r' means the region moves right.  Determine the final order of the stones after they have all moved the region."}]}