{"uid": "264-B", "url": "https://codeforces.com/contest/264/problem/B", "tags": ["dp", " number theory"], "title": "264-B", "statement": "B. Good Sequencestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSquirrel Liss is interested in sequences. She also has preferences of integers. She thinksnintegersa1,a2, ...,anaregood.Now she is interested in good sequences. A sequencex1,x2, ...,xkis calledgoodif it satisfies the following three conditions:The sequence is strictly increasing, i.e.xi<xi+ 1for eachi(1 ≤i≤k- 1).No two adjacent elements are coprime, i.e.gcd(xi,xi+ 1) > 1for eachi(1 ≤i≤k- 1)(wheregcd(p,q)denotes the greatest common divisor of the integerspandq).All elements of the sequence are good integers.Find the length of the longest good sequence.InputThe input consists of two lines. The first line contains a single integern(1 ≤n≤ 105) — the number of good integers. The second line contains a single-space separated list of good integersa1,a2, ...,anin strictly increasing order (1 ≤ai≤ 105;ai<ai+ 1).OutputPrint a single integer — the length of the longest good sequence.ExamplesInput52 3 4 6 9Output4Input91 2 3 5 6 7 8 9 10Output4NoteIn the first example, the following sequences are examples of good sequences: [2; 4; 6; 9], [2; 4; 6], [3; 9], [6]. The length of the longest good sequence is 4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "31686f2f", "template_md5": "35d339e4", "result": "You are given a list of integers in strictly increasing order.  Find the length of the longest subsequence where:\n\n1. The integers in the subsequence are strictly increasing.\n2. No two adjacent integers in the subsequence are coprime (their greatest common divisor is greater than 1). \n\n\nInput:\n\n* The first line contains the number of integers in the list.\n* The second line contains the list of integers.\n\nOutput:\n\n* The length of the longest good subsequence."}, {"prompt_md5": "6f0ec23c", "template_md5": "465699a0", "result": "Given a list of numbers in increasing order, find the longest sequence of numbers where each pair of consecutive numbers has a common divisor greater than 1."}]}