{"uid": "264-C", "url": "https://codeforces.com/contest/264/problem/C", "tags": ["dp"], "title": "264-C", "statement": "C. Choosing Ballstime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arenballs. They are arranged in a row. Each ball has a color (for convenience an integer) and an integer value. The color of thei-th ball isciand the value of thei-th ball isvi.Squirrel Liss chooses some balls and makes a new sequence without changing the relative order of the balls. She wants to maximize the value of this sequence.The value of the sequence is defined as the sum of following values for each ball (whereaandbare given constants):If the ball is not in the beginning of the sequence and the color of the ball is same as previous ball's color, add (the value of the ball)×a.Otherwise, add (the value of the ball)×b.You are givenqqueries. Each query contains two integersaiandbi. For each query find the maximal value of the sequence she can make whena=aiandb=bi.Note that the new sequence can beempty, and the value of an empty sequence is defined as zero.InputThe first line contains two integersnandq(1 ≤n≤ 105; 1 ≤q≤ 500). The second line containsnintegers:v1,v2, ...,vn(|vi| ≤ 105). The third line containsnintegers:c1,c2, ...,cn(1 ≤ci≤n).The followingqlines contain the values of the constantsaandbfor queries. Thei-th of these lines contains two integersaiandbi(|ai|, |bi| ≤ 105).In each line integers are separated by single spaces.OutputFor each query, output a line containing an integer — the answer to the query. Thei-th line contains the answer to thei-th query in the input order.Please, do not write the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput6 31 -2 3 4 0 -11 2 1 2 1 15 1-2 11 0Output2094Input4 1-3 6 -1 21 2 3 11 -1Output5NoteIn the first example, to achieve the maximal value:In the first query, you should select 1st, 3rd, and 4th ball.In the second query, you should select 3rd, 4th, 5th and 6th ball.In the third query, you should select 2nd and 4th ball.Note that there may be other ways to achieve the maximal value.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ade6c12d", "template_md5": "465699a0", "result": "You are given a sequence of items, each with a value and a color. You can choose any subset of these items and arrange them in any order. The value of the chosen subset is calculated based on the values of the items and the colors of adjacent items.  \n\nFor each query, you are given two numbers, 'a' and 'b'.  Find the maximum value you can achieve for the subset, given these rules:\n\n* If an item's color is the same as the previous item's color, its value is multiplied by 'a'.\n* Otherwise, its value is multiplied by 'b'."}, {"prompt_md5": "b4d80f31", "template_md5": "35d339e4", "result": "You are given an array of $n$ balls, each with a color ($c_i$) and a value ($v_i$).  You can choose any subset of these balls and arrange them in a new sequence without changing the relative order.\n\nThe value of the sequence is calculated as follows:\n\n* For each ball in the sequence, if it's not the first ball and its color is the same as the previous ball's color, add  $a \\cdot v_i$ to the total value.\n* Otherwise, add $b \\cdot v_i$ to the total value.\n\nYou are given $q$ queries, each with two integers $a$ and $b$. For each query, find the maximum value of the sequence that can be achieved using the given values of $a$ and $b$.\n\n**Input:**\n\n* The first line contains two integers $n$ and $q$ ($1 \\le n \\le 10^5$, $1 \\le q \\le 500$).\n* The second line contains $n$ integers: $v_1, v_2, ..., v_n$ ($|v_i| \\le 10^5$).\n* The third line contains $n$ integers: $c_1, c_2, ..., c_n$ ($1 \\le c_i \\le n$).\n* The following $q$ lines contain the values of $a$ and $b$ for each query.\n\n**Output:**\n\nFor each query, output a line containing an integer — the maximum value of the sequence."}]}