{"uid": "265-B", "url": "https://codeforces.com/contest/265/problem/B", "tags": ["greedy", " implementation"], "title": "265-B", "statement": "B. Roadside Trees (Simplified Edition)time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSquirrel Liss loves nuts. There arentrees (numbered1tonfrom west to east) along a street and there is a delicious nut on the top of each tree. The height of the treeiishi. Liss wants to eat all nuts.Now Liss is on the root of the tree with the number1. In one second Liss can perform one of the following actions:Walk up or down one unit on a tree.Eat a nut on the top of the current tree.Jump to the next tree. In this action the height of Liss doesn't change. More formally, when Liss is at heighthof the treei(1 ≤i≤n- 1), she jumps to heighthof the treei+ 1. This action can't be performed ifh>hi+ 1.Compute the minimal time (in seconds) required to eat all nuts.InputThe first line contains an integern(1  ≤n≤ 105) — the number of trees.Nextnlines contains the height of trees:i-th line contains an integerhi(1 ≤hi≤ 104) — the height of the tree with the numberi.OutputPrint a single integer — the minimal time required to eat all nuts in seconds.ExamplesInput212Output5Input521211Output14", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f3cfe4e2", "template_md5": "35d339e4", "result": "There are $n$ trees ($1 \\le n \\le 10^5$) lined up in a row. Each tree has a nut on top, and the height of each tree is given as $h_i$ ($1 \\le h_i \\le 10^4$). You start at the base of the first tree.\n\nYou can perform the following actions:\n\n* Walk up or down one unit on a tree.\n* Eat the nut on the top of the current tree.\n* Jump to the next tree if you are at a height less than or equal to the height of the next tree.\n\nFind the minimum time (in seconds) it takes to eat all the nuts."}, {"prompt_md5": "f2beea16", "template_md5": "465699a0", "result": "You have a row of trees, each with a different height. You start at the first tree and need to eat a nut from the top of each tree. You can move up or down one tree at a time, or jump to the next tree if it's lower than your current height. What is the fastest way to eat all the nuts?"}]}