{"uid": "266-D", "url": "https://codeforces.com/contest/266/problem/D", "tags": ["graphs", " math", " shortest paths"], "title": "266-D", "statement": "D. BerDonaldstime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBerDonalds, a well-known fast food restaurant, is going to open a cafe in Bertown. The important thing is to choose the new restaurant's location so that it would be easy to get there. The Bertown road system is represented bynjunctions, connected bymbidirectional roads. For each road we know its length. We also know that we can get from any junction to any other one, moving along the roads.Your task is to find such location of the restaurant, that the shortest distance along the roads from the cafe to the farthest junction would be minimum. Note that the restaurant can be located not only on the junction, but at any point of any road.InputThe first line contains two integersnandm() — the number of junctions and the number of roads, correspondingly. Thenmlines follow, describing all Bertown roads. Each road is described by three integersai,bi,wi(1 ≤ai,bi≤n,ai≠bi; 1 ≤wi≤ 105), whereaiandbiare the numbers of the junctions, connected by thei-th road, andwiis the length of thei-th road.It is guaranteed that each road connects two distinct junctions, there is at most one road between any two junctions, and you can get from any junction to any other one.OutputPrint a single real number — the shortest distance from the optimal restaurant location to the farthest junction. The answer will be considered correct, if its absolute or relative error doesn't exceed10- 9.ExamplesInput2 11 2 1Output0.50Input3 31 2 12 3 11 3 1Output1.00Input3 21 2 1002 3 1Output50.50", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cfbfdbec", "template_md5": "35d339e4", "result": "There are $n$ junctions and $m$ roads in a town. Each road connects two distinct junctions and has a length of $w_i$.  You need to find the shortest distance from a restaurant location to the farthest junction. The restaurant can be located anywhere along any road, not just at a junction.\n\nOutput the shortest possible distance."}, {"prompt_md5": "87dcc506", "template_md5": "465699a0", "result": "You are given a map with cities connected by roads of varying lengths.  Find the best location to build a store so that the furthest city is as close as possible. The store can be built anywhere along a road, not just at a city."}]}