{"uid": "266-C", "url": "https://codeforces.com/contest/266/problem/C", "tags": ["constructive algorithms", " greedy", " math"], "title": "266-C", "statement": "C. Below the Diagonaltime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are given a square matrix consisting ofnrows andncolumns. We assume that the rows are numbered from1tonfrom top to bottom and the columns are numbered from1tonfrom left to right. Some cells (n- 1cells in total) of the the matrix are filled with ones, the remaining cells are filled with zeros. We can apply the following operations to the matrix:Swapi-th andj-th rows of the matrix;Swapi-th andj-th columns of the matrix.You are asked to transform the matrix into a special form using these operations. In that special form all the ones must be in the cells that lie below the main diagonal. Cell of the matrix, which is located on the intersection of thei-th row and of thej-th column, lies below the main diagonal ifi>j.InputThe first line contains an integern(2 ≤n≤ 1000)— the number of rows and columns. Then follown- 1lines that contain one's positions, one per line. Each position is described by two integersxk,yk(1 ≤xk,yk≤n), separated by a space. A pair(xk,yk)means that the cell, which is located on the intersection of thexk-th row and of theyk-th column, contains one.It is guaranteed that all positions are distinct.OutputPrint the description of your actions. These actions should transform the matrix to the described special form.In the first line you should print a non-negative integerm(m≤ 105)— the number of actions. In each of the nextmlines print three space-separated integerst,i,j(1 ≤t≤ 2, 1 ≤i,j≤n,i≠j), wheret= 1if you want to swap rows,t= 2if you want to swap columns, andiandjdenote the numbers of rows or columns respectively.Please note, that you do not need to minimize the number of operations, but their number should not exceed105. If there are several solutions, you may print any of them.ExamplesInput21 2Output22 1 21 1 2Input33 11 3Output32 2 31 1 31 1 2Input32 13 2Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e995f8b7", "template_md5": "35d339e4", "result": "You are given a square matrix of size $n x n$.  Some cells in the matrix are filled with ones, and the rest are filled with zeros. You can perform the following operations on the matrix:\n\n* Swap any two rows.\n* Swap any two columns.\n\nYour goal is to transform the matrix so that all the ones are located below the main diagonal (where the diagonal elements are from top-left to bottom-right).\n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 1000), representing the size of the matrix.\n* The next $n-1$ lines each contain two integers $x_k$ and $y_k$ (1 ≤ $x_k$, $y_k$ ≤ $n$), representing the coordinates of a cell containing a one.\n\n**Output:**\n\n* The first line contains an integer $m$ ( $m$ ≤ 10⁵), representing the number of operations you will perform.\n* Each of the next $m$ lines contains three integers $t$, $i$, and $j$ (1 ≤ $t$ ≤ 2, 1 ≤ $i$, $j$ ≤ $n$, $i$ ≠ $j$), where:\n    * $t = 1$ means you will swap rows $i$ and $j$.\n    * $t = 2$ means you will swap columns $i$ and $j$.\n\n\n\nYou do not need to find the minimum number of operations, but the number should not exceed 10⁵."}, {"prompt_md5": "d7e34175", "template_md5": "465699a0", "result": "You are given a square grid of cells. Some cells are marked with a 1, others with a 0. You can swap rows or columns of the grid.  Your goal is to rearrange the grid so that all the 1s are below the main diagonal (where the top-left to bottom-right cells are 1). Describe the swaps you need to make."}]}