{"uid": "267-C", "url": "https://codeforces.com/contest/267/problem/C", "tags": ["math", " matrices"], "title": "267-C", "statement": "C. Berland Traffictime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBerland traffic is very different from traffic in other countries. The capital of Berland consists ofnjunctions andmroads. Each road connects a pair of junctions. There can be multiple roads between a pair of junctions. For each road we know its capacity: valueciis the maximum number of cars that can drive along a road in any direction per a unit of time. For each road, the cars can drive along it in one of two direction. That it, the cars can't simultaneously move in both directions. A road's traffic is the number of cars that goes along it per a unit of time. For road (ai,bi) this value is negative, if the traffic moves frombitoai. A road's traffic can be a non-integer number.The capital has two special junctions — the entrance to the city (junction 1) and the exit from the city (junctionn). For all other junctions it is true that the traffic is not lost there. That is, for all junctions except for 1 andnthe incoming traffic sum equals the outgoing traffic sum.Traffic has an unusual peculiarity in the capital of Berland — for any pair of junctions (x,y) the sum of traffics along any path fromxtoydoesn't change depending on the choice of the path. Such sum includes traffic along all roads on the path (possible with the \"minus\" sign, if the traffic along the road is directed against the direction of the road on the path fromxtoy).Your task is to find the largest traffic that can pass trough the city per one unit of time as well as the corresponding traffic for each road.InputThe first line contains a positive integern— the number of junctions (2 ≤n≤ 100). The second line contains integerm(1 ≤m≤ 5000) — the number of roads. Nextmlines contain the roads' descriptions. Each road contains a group of three numbersai,bi,ci, whereai,biare the numbers of junctions, connected by the given road, andci(1 ≤ai,bi≤n;ai≠bi;0 ≤ci≤ 10000) is the largest permissible traffic along this road.OutputIn the first line print the required largest traffic across the city. Then printmlines, on each line print the speed, at which the traffic moves along the corresponding road. If the direction doesn't match the order of the junctions, given in the input, then print the traffic with the minus sign. Print the numbers with accuracy of at least five digits after the decimal point.If there are many optimal solutions, print any of them.ExamplesInput231 2 21 2 42 1 1000Output6.000002.000002.00000-2.00000Input7111 2 71 2 71 3 71 4 72 3 72 5 73 6 74 7 75 4 75 6 76 7 7Output13.000002.000002.000003.000006.000001.000003.000004.000007.000001.000002.000006.00000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4174bda9", "template_md5": "35d339e4", "result": "There are $n$ junctions and $m$ roads in a city. Each road connects two junctions and has a capacity $c_i$ representing the maximum number of cars that can travel on it per unit of time in one direction.  \n\nThe traffic on a road is the number of cars traveling on it per unit of time. Traffic can be positive or negative, indicating the direction of flow.\n\nThe city has two special junctions: the entrance (junction 1) and the exit (junction $n$). Traffic is conserved at all junctions except for the entrance and exit.\n\nA key property of this city's traffic is that the total traffic along any path between two junctions is the same, regardless of the path taken.\n\nYour task is to find the maximum possible traffic that can flow through the city per unit of time, and the corresponding traffic on each road. \n\n**Input:**\n\n* The first line contains $n$ (the number of junctions).\n* The second line contains $m$ (the number of roads).\n* Each of the following $m$ lines describes a road with three integers: $a_i$, $b_i$, and $c_i$ (the junctions connected by the road and the road's capacity).\n\n**Output:**\n\n* The first line should contain the maximum traffic that can flow through the city.\n* The following $m$ lines should each contain the traffic on a road, with the sign indicating the direction of flow."}, {"prompt_md5": "def24fc7", "template_md5": "465699a0", "result": "You are given a network of junctions connected by roads. Each road has a capacity representing the maximum number of cars that can travel on it in one direction per unit of time.  The goal is to find the maximum amount of traffic that can flow through the network from a starting junction to an ending junction, and the traffic flow on each road that achieves this maximum."}]}