{"uid": "267-B", "url": "https://codeforces.com/contest/267/problem/B", "tags": ["dfs and similar", " graphs"], "title": "267-B", "statement": "B. Dominoestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou have a set of dominoes. Each domino is a rectangular tile with a line dividing its face into two square ends. Can you put all dominoes in a line one by one from left to right so that any two dominoes touched with the sides that had the same number of points? You can rotate the dominoes, changing the left and the right side (domino \"1-4\" turns into \"4-1\").InputThe first line contains numbern(1  ≤n≤  100). Nextnlines contains the dominoes. Each of these lines contains two numbers — the number of points (spots) on the left and the right half, correspondingly. The numbers of points (spots) are non-negative integers from 0 to 6.OutputPrint \"No solution\", if it is impossible to arrange the dominoes in the required manner. If the solution exists, then describe any way to arrange the dominoes. You put the dominoes from left to right. In each ofnlines print the index of the domino to put in the corresponding position and then, after a space, character \"+\" (if you don't need to turn the domino) or \"–\" (if you need to turn it).ExamplesInput51 22 42 46 42 1Output2 -1 -5 -3 +4 -", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cdc0eb02", "template_md5": "35d339e4", "result": "You have a set of dominoes. Each domino has two sides with a different number of dots (spots).  You need to arrange the dominoes in a line, so that the side with the same number of dots on each domino touches. You can rotate the dominoes.\n\n**Input:**\n\n* The first line contains the number of dominoes ($n$).\n* The next $n$ lines each contain two numbers, representing the number of dots on each side of a domino.\n\n**Output:**\n\n* If it's impossible to arrange the dominoes, print \"No solution\".\n* If it's possible, print a list of the dominoes to place in the line, along with a \"+\" if the domino is placed without rotation, or a \"-\" if it needs to be rotated."}, {"prompt_md5": "59cd5cf9", "template_md5": "465699a0", "result": "You have a set of dominoes, each with two sides with a different number of dots.  Can you arrange them in a line so that touching dominoes have sides with the same number of dots? You can flip the dominoes. If it's possible, show one way to arrange them."}]}