{"uid": "268-A", "url": "https://codeforces.com/contest/268/problem/A", "tags": ["brute force"], "title": "268-A", "statement": "A. Gamestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutManao works on a sports TV. He's spent much time watching the football games of some country. After a while he began to notice different patterns. For example, each team has two sets of uniforms: home uniform and guest uniform. When a team plays a game at home, the players put on the home uniform. When a team plays as a guest on somebody else's stadium, the players put on the guest uniform. The only exception to that rule is: when the home uniform color of the host team matches the guests' uniform, the host team puts on its guest uniform as well. For each team the color of the home and guest uniform is different.There arenteams taking part in the national championship. The championship consists ofn·(n- 1)games: each team invites each other team to its stadium. At this point Manao wondered: how many times during the championship is a host team going to put on the guest uniform? Note that the order of the games does not affect this number.You know the colors of the home and guest uniform for each team. For simplicity, the colors are numbered by integers in such a way that no two distinct colors have the same number. Help Manao find the answer to his question.InputThe first line contains an integern(2 ≤n≤ 30). Each of the followingnlines contains a pair of distinct space-separated integershi,ai(1 ≤hi,ai≤ 100) — the colors of thei-th team's home and guest uniforms, respectively.OutputIn a single line print the number of games where the host team is going to play in the guest uniform.ExamplesInput31 22 43 4Output1Input4100 4242 1005 42100 5Output5Input21 21 2Output0NoteIn the first test case the championship consists of 6 games. The only game with the event in question is the game between teams 2 and 1 on the stadium of team 2.In the second test sample the host team will have to wear guest uniform in the games between teams: 1 and 2, 2 and 1, 2 and 3, 3 and 4, 4 and 2 (the host team is written first).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dcef4a46", "template_md5": "35d339e4", "result": "There are $n$ teams participating in a championship. Each team has a home uniform and a guest uniform, with different colors.  A team wears its home uniform when playing at home and its guest uniform when playing away. \n\nHowever, if the home team's home uniform color matches the visiting team's uniform color, the home team will wear its guest uniform.\n\nDetermine the number of games where the home team will wear its guest uniform. \n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 30), representing the number of teams.\n* Each of the following $n$ lines contains a pair of distinct integers $h_i$ and $a_i$ (1 ≤ $h_i$, $a_i$ ≤ 100), representing the colors of the $i$-th team's home and guest uniforms, respectively.\n\n**Output:**\n\n* Print a single line containing the number of games where the home team will wear its guest uniform."}, {"prompt_md5": "e723e081", "template_md5": "465699a0", "result": "You are given a list of teams, each with a home and away uniform color.  Determine how many games will have a team wear their away uniform at home because their home color matches the visiting team's uniform."}]}