{"uid": "268-D", "url": "https://codeforces.com/contest/268/problem/D", "tags": ["dp"], "title": "268-D", "statement": "D. Wall Barstime limit per test4 secondsmemory limit per test512 megabytesinputstdinoutputstdoutManao is working for a construction company. Recently, an order came to build wall bars in a children's park. Manao was commissioned to develop a plan of construction, which will enable the company to save the most money.After reviewing the formal specifications for the wall bars, Manao discovered a number of controversial requirements and decided to treat them to the company's advantage. His resulting design can be described as follows:Let's introduce some unit of length. The construction center is a pole of heightn.At heights1, 2, ...,nexactly one horizontal bar sticks out from the pole. Each bar sticks in one of four pre-fixed directions.A child can move from one bar to another if the distance between them does not exceedhand they stick in the same direction. If a child is on the ground, he can climb onto any of the bars at height between1andh. In Manao's construction a child should be able to reach at least one of the bars at heightsn-h+ 1,n-h+ 2, ...,nif he begins at the ground.The figure to the left shows what a common set of wall bars looks like. The figure to the right shows Manao's constructionManao is wondering how many distinct construction designs that satisfy his requirements exist. As this number can be rather large, print the remainder after dividing it by1000000009 (109+ 9). Two designs are considered distinct if there is such heighti, that the bars on the heightiin these designs don't stick out in the same direction.InputA single line contains two space-separated integers,nandh(1 ≤n≤ 1000,1 ≤h≤min(n, 30)).OutputIn a single line print the remainder after dividing the number of designs by1000000009 (109+ 9).ExamplesInput5 1Output4Input4 2Output148Input4 3Output256Input5 2Output376NoteConsider several designs forh= 2. A design with the first bar sticked out in directiond1, the second — in directiond2and so on (1 ≤di≤ 4) is denoted as stringd1d2...dn.Design \"1231\" (the first three bars are sticked out in different directions, the last one — in the same as first). A child can reach neither the bar at height 3 nor the bar at height 4.Design \"414141\". A child can reach the bar at height 5. To do this, he should first climb at the first bar, then at the third and then at the fifth one. He can also reach bar at height 6 by the route second→fourth→sixth bars.Design \"123333\". The child can't reach the upper two bars.Design \"323323\". The bar at height 6 can be reached by the following route: first→third→fourth→sixth bars.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5d5332e9", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $h$.  \n\nThere is a pole of height $n$ with horizontal bars sticking out at heights 1 through $n$. Each bar can stick out in one of four directions.\n\nA child can move between bars if the distance between them is less than or equal to $h$ and they are pointing in the same direction. A child on the ground can climb onto any bar between height 1 and $h$.\n\nYou need to find how many different ways you can arrange the bars so that a child can reach at least one bar at heights $n-h+1$ through $n$ starting from the ground.  \n\nPrint the remainder when the number of possible arrangements is divided by $10^9 + 9$. \n\n\nTwo arrangements are different if there is a height $i$ where the bars at that height point in different directions."}, {"prompt_md5": "12bd524d", "template_md5": "465699a0", "result": "You are given a height  'n' and a distance 'h'.  You need to figure out how many different ways you can arrange bars at heights 1 to 'n' so that a person can reach at least one bar at heights 'n-h+1' to 'n' starting from the ground.  Each bar can point in one of four directions.  The person can move between bars if they are within distance 'h' and point in the same direction."}]}