{"uid": "269-B", "url": "https://codeforces.com/contest/269/problem/B", "tags": ["dp"], "title": "269-B", "statement": "B. Greenhouse Effecttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutEmuskald is an avid horticulturist and owns the world's longest greenhouse — it is effectively infinite in length.Over the years Emuskald has cultivatednplants in his greenhouse, ofmdifferent plant species numbered from 1 tom. His greenhouse is very narrow and can be viewed as an infinite line, with each plant occupying a single point on that line.Emuskald has discovered that each species thrives at a different temperature, so he wants to arrangem- 1borders that would divide the greenhouse intomsections numbered from 1 tomfrom left to right with each section housing a single species. He is free to place the borders, but in the end all of thei-th species plants must reside ini-th section from the left.Of course, it is not always possible to place the borders in such way, so Emuskald needs to replant some of his plants. He can remove each plant from its position and place it anywhere in the greenhouse (atanyreal coordinate) with no plant already in it. Since replanting is a lot of stress for the plants, help Emuskald find the minimum number of plants he has to replant to be able to place the borders.InputThe first line of input contains two space-separated integersnandm(1 ≤n,m≤ 5000,n≥m), the number of plants and the number of different species. Each of the followingnlines contain two space-separated numbers: one integer numbersi(1 ≤si≤m), and one real numberxi(0 ≤xi≤ 109), the species and position of thei-th plant. Eachxiwill contain no more than 6 digits after the decimal point.It is guaranteed that allxiare different; there is at least one plant of each species; the plants are given in order \"from left to the right\", that is in the ascending order of theirxicoordinates(xi<xi+ 1, 1 ≤i<n).OutputOutput a single integer — the minimum number of plants to be replanted.ExamplesInput3 22 11 2.01 3.100Output1Input3 31 5.02 5.53 6.0Output0Input6 31 14.2842352 17.9213821 20.3281723 20.8423311 25.7901451 27.204125Output2NoteIn the first test case, Emuskald can replant the first plant to the right of the last plant, so the answer is 1.In the second test case, the species are already in the correct order, so no replanting is needed.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a9adf604", "template_md5": "35d339e4", "result": "You are given $n$ plants and $m$ different species. Each plant belongs to one species and has a position on a line.  \n\nThe goal is to divide the line into $m$ sections, with each section containing plants of a single species. You can move plants to any position on the line to achieve this.\n\nFind the minimum number of plants that need to be moved. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 5000$, $n \\ge m$).\n* The following $n$ lines each contain two numbers: the species number ($1 \\le si \\le m$) and the position ($0 \\le xi \\le 10^9$) of the $i$-th plant.\n\n**Output:**\n\n* A single integer representing the minimum number of plants to move."}, {"prompt_md5": "201b08b9", "template_md5": "465699a0", "result": "You have a line and need to divide it into sections.  You have a set of items that need to be placed in these sections according to their type.  You can move items along the line to achieve the desired arrangement. Find the minimum number of items that need to be moved."}]}