{"uid": "269-E", "url": "https://codeforces.com/contest/269/problem/E", "tags": ["geometry", " math", " strings"], "title": "269-E", "statement": "E. String Theorytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutEmuskald is an innovative musician and always tries to push the boundaries of music production. Now he has come up with an idea for a revolutionary musical instrument — a rectangular harp.A rectangular harp is a rectanglen×mconsisting ofnrows andmcolumns. The rows are numbered 1 tonfrom top to bottom. Similarly the columns are numbered 1 tomfrom left to right. String pins are spaced evenly across every side, one per unit. Thus there arenpins on the left and right sides of the harp andmpins on its top and bottom. The harp has exactlyn+mdifferent strings, each string connecting two different pins, each on a different side of the harp.Emuskald has ordered his apprentice to construct the first ever rectangular harp. However, he didn't mention that no two strings can cross, otherwise it would be impossible to play the harp. Two strings cross if the segments connecting their pins intersect. To fix the harp, Emuskald can perform operations of two types:pick two different columns and swap their pins on each side of the harp, not changing the pins that connect each string;pick two different rows and swap their pins on each side of the harp, not changing the pins that connect each string;In the following example, he can fix the harp by swapping two columns:Help Emuskald complete his creation and find the permutations how the rows and columns of the harp need to be rearranged, or tell that it is impossible to do so. He can detach and reattach each string to its pins, so the physical layout of the strings doesn't matter.InputThe first line of input contains two space-separated integers numbersnandm(1 ≤n,m≤ 105), the height and width of the harp in units. Each of the followingn+mlines contains 4 space-separated tokens, describing a single string: two symbolsai,biand two integer numberspi,qi. The pairai,pidescribes the first pin, and the pairbi,qidescribes the second pin of the string;A pairs,xdescribes the position of a single pin in a following way:sis equal to one of the symbols \"L\", \"T\", \"R\" or \"B\" (without quotes), which means that the pin is positioned on the left, top, right or bottom side of the harp accordingly;xis equal to the number of the row, if the pin is on the left or right border of the harp, and to the number of the column, if the pin is on the top or bottom border of the harp.It is guaranteed that no two different strings are connected to the same pin.OutputIf it is possible to rearrange the rows and columns to fix the harp, on the first line outputnspace-separated integers — the old numbers of rows now placed from top to bottom in the fixed harp. On the second line, outputmspace-separated integers — the old numbers of columns now placed from left to right in the fixed harp.If it is impossible to rearrange the rows and columns to fix the harp, output \"No solution\" (without quotes).ExamplesInput3 4L T 1 3L B 2 2L B 3 3T R 1 2T B 2 1T R 4 1B R 4 3Output1 2 33 2 1 4Input3 3L T 1 1T R 3 1R B 3 3B L 1 3L R 2 2T B 2 2OutputNo solution", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "857ad6b5", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$.  There are $n+m$ strings, each connecting two points on the grid, one on the left/right edge and one on the top/bottom edge.  \n\nYou can perform two types of operations:\n\n1. Swap the left/right pins for two columns.\n2. Swap the top/bottom pins for two rows.\n\nDetermine if it is possible to rearrange the rows and columns so that no two strings intersect. If it is possible, output the new order of the rows and columns. If it is not possible, output \"No solution\"."}, {"prompt_md5": "124535a0", "template_md5": "465699a0", "result": "You are given a rectangular grid with strings connecting points on opposite sides.  Determine if it's possible to rearrange the rows and columns of the grid so that no two strings intersect. If possible, output the new order of the rows and columns. If not, output \"No solution\"."}]}