{"uid": "27-D", "url": "https://codeforces.com/contest/27/problem/D", "tags": ["2-sat", " dfs and similar", " dsu", " graphs"], "title": "27-D", "statement": "D. Ring Road 2time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIt is well known that Berland hasncities, which form the Silver ring — citiesiandi+ 1(1 ≤i<n) are connected by a road, as well as the citiesnand1. The goverment have decided to buildmnew roads. The list of the roads to build was prepared. Each road will connect two cities. Each road should be a curve which lies inside or outside the ring. New roads will have no common points with the ring (except the endpoints of the road).Now the designers of the constructing plan wonder if it is possible to build the roads in such a way that no two roads intersect (note that the roads may intersect at their endpoints). If it is possible to do, which roads should be inside the ring, and which should be outside?InputThe first line contains two integersnandm(4 ≤n≤ 100, 1 ≤m≤ 100). Each of the followingmlines contains two integersaiandbi(1 ≤ai,bi≤n,ai≠bi). No two cities will be connected by more than one road in the list. The list will not contain the roads which exist in the Silver ring.OutputIf it is impossible to build the roads in such a way that no two roads intersect, outputImpossible. Otherwise printmcharacters.i-th character should bei, if the road should be inside the ring, andoif the road should be outside the ring. If there are several solutions, output any of them.ExamplesInput4 21 32 4OutputioInput6 31 33 55 1Outputooo", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "80d03b95", "template_md5": "35d339e4", "result": "There are $n$ cities arranged in a ring.  The government wants to build $m$ new roads connecting pairs of cities.  Each new road must be a curve that lies either entirely inside or entirely outside the ring.  Roads cannot intersect except at their endpoints.\n\nDetermine if it is possible to build the roads without any intersections. If possible, indicate for each road whether it should be built inside or outside the ring. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($4 \\le n \\le 100$, $1 \\le m \\le 100$).\n* Each of the following $m$ lines contains two integers, $a_i$ and $b_i$ ($1 \\le a_i, b_i \\le n$, $a_i \\neq b_i$), representing a road to be built between cities $a_i$ and $b_i$.\n\n**Output:**\n\n* If it is impossible to build the roads without intersections, output \"Impossible\".\n* Otherwise, output a string of $m$ characters. The $i$-th character should be 'i' if the $i$-th road should be built inside the ring, and 'o' if it should be built outside the ring."}, {"prompt_md5": "b2aa396b", "template_md5": "465699a0", "result": "You are given a ring of cities and a list of roads to build between cities.  Determine if it's possible to build all the roads without any intersections, and if so, specify which roads should be built inside the ring and which outside."}]}