{"uid": "272-E", "url": "https://codeforces.com/contest/272/problem/E", "tags": ["combinatorics", " constructive algorithms", " graphs"], "title": "272-E", "statement": "E. Dima and Horsestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDima came to the horse land. There arenhorses living in the land. Each horse in the horse land has several enemies (enmity is a symmetric relationship). The horse land isn't very hostile, so the number of enemies of each horse is at most 3.Right now the horse land is going through an election campaign. So the horses trusted Dima to split them into two parts. At that the horses want the following condition to hold: a horse shouldn't have more than one enemy in its party.Help Dima split the horses into parties. Note that one of the parties can turn out to be empty.InputThe first line contains two integersn,m— the number of horses in the horse land and the number of enemy pairs.Nextmlines define the enemy pairs. Thei-th line contains integersai,bi(1 ≤ai,bi≤n;ai≠bi), which mean that horseaiis the enemy of horsebi.Consider the horses indexed in some way from 1 ton. It is guaranteed that each horse has at most three enemies. No pair of enemies occurs more than once in the input.OutputPrint a line, consisting ofncharacters: thei-th character of the line must equal \"0\", if the horse numberineeds to go to the first party, otherwise this character should equal \"1\".If there isn't a way to divide the horses as required, print-1.ExamplesInput3 31 23 23 1Output100Input2 12 1Output00Input10 61 21 31 42 32 43 4Output0110000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "40d14e45", "template_md5": "35d339e4", "result": "You are given a list of $n$ horses and $m$ pairs of enemies. Each horse has at most 3 enemies.  \n\nYour task is to divide the horses into two groups (let's call them Group A and Group B) such that:\n\n* No horse in a group has more than one enemy in the same group.\n\nIf it's impossible to divide the horses according to these rules, output -1.\n\nOtherwise, output a string of length $n$ where:\n\n*  '0' represents a horse in Group A\n*  '1' represents a horse in Group B"}, {"prompt_md5": "85aee5d2", "template_md5": "465699a0", "result": "You are given a list of pairs of numbers representing enemies.  Divide the numbers into two groups so that no number in a group has more than one enemy in the same group. If this is not possible, output -1."}]}