{"uid": "273-D", "url": "https://codeforces.com/contest/273/problem/D", "tags": ["dp"], "title": "273-D", "statement": "D. Dima and Figuretime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDima loves making pictures on a piece of squared paper. And yet more than that Dima loves the pictures that depict one of his favorite figures.A piece of squared paper of sizen×mis represented by a table, consisting ofnrows andmcolumns. All squares are white on blank squared paper. Dima defines apictureas an image on a blank piece of paper, obtained by painting some squares black.The picture portrays one of Dima's favorite figures, if the following conditions hold:The picture contains at least one painted cell;All painted cells form a connected set, that is, you can get from any painted cell to any other one (you can move from one cell to a side-adjacent one);The minimum number of moves needed to go from the painted cell at coordinates(x1,y1)to the painted cell at coordinates(x2,y2), moving only through the colored cells, equals|x1-x2| + |y1-y2|.Now Dima is wondering: how many paintings are on ann×mpiece of paper, that depict one of his favorite figures? Count this number modulo1000000007 (109+ 7).InputThe first line contains two integersnandm— the sizes of the piece of paper(1 ≤n,m≤ 150).OutputIn a single line print the remainder after dividing the answer to the problem by number1000000007 (109+ 7).ExamplesInput2 2Output13Input3 4Output571", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5d56f67a", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$.  A picture is formed by coloring some of the squares black.  \n\nA picture is valid if:\n\n* At least one square is colored black.\n* All colored squares are connected (you can move from any colored square to any other colored square by moving to an adjacent square).\n* The minimum number of moves to get from one colored square to another colored square is equal to the Manhattan distance between them ($|x_1 - x_2| + |y_1 - y_2|$).\n\nFind the number of valid pictures on an $n \\times m$ grid, modulo $10^9 + 7$."}, {"prompt_md5": "112b2de8", "template_md5": "465699a0", "result": "Count the number of ways to color some squares on a grid so that:\n\n* At least one square is colored.\n* All colored squares are connected (you can move between them by going to a side neighbor).\n* The shortest distance between any two colored squares is the same as the straight-line distance between them. \n\nThe grid has size n x m.  The answer should be the remainder when divided by 1000000007."}]}