{"uid": "273-E", "url": "https://codeforces.com/contest/273/problem/E", "tags": ["dp", " games"], "title": "273-E", "statement": "E. Dima and Gametime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDima and Anya love playing different games. Now Dima has imagined a new game that he wants to play with Anya.Dima writesnpairs of integers on a piece of paper(li,ri)(1 ≤li<ri≤p). Then players take turns. On his turn the player can do the following actions:choose the number of the pairi(1 ≤i≤n), such thatri-li> 2;replace pair numberiby pairor by pair. Notation⌊x⌋means rounding down to the closest integer.The player who can't make a move loses.Of course, Dima wants Anya, who will move first, to win. That's why Dima should write out suchnpairs of integers(li,ri)(1 ≤li<ri≤p), that if both players play optimally well, the first one wins. Count the number of ways in which Dima can do it. Print the remainder after dividing the answer by number1000000007 (109+ 7).Two ways are considered distinct, if theorderedsequences of the written pairs are distinct.InputThe first line contains two integersn,p(1 ≤n≤ 1000, 1 ≤p≤ 109). The numbers are separated by a single space.OutputIn a single line print the remainder after dividing the answer to the problem by number1000000007 (109+ 7).ExamplesInput2 2Output0Input4 4Output520Input100 1000Output269568947", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "525484ea", "template_md5": "35d339e4", "result": "You are given two integers $n$ and $p$ ($1 \\le n \\le 1000$, $1 \\le p \\le 10^9$).  \n\nThe goal is to determine the number of ways to choose $n$ pairs of integers $(l_i, r_i)$ ($1 \\le l_i < r_i \\le p$) such that:\n\n*  $r_i - l_i > 2$ for all $i$.\n\n* If two players take turns, with the first player choosing a pair $(l_i, r_i)$ and replacing it with either $( \\lfloor \\frac{l_i + r_i}{2} \\rfloor, r_i)$ or $(l_i, \\lfloor \\frac{l_i + r_i}{2} \\rfloor)$, the first player can always force a win.\n\nOutput the number of valid ways, modulo $10^9 + 7$."}, {"prompt_md5": "2a9f2908", "template_md5": "465699a0", "result": "You are given two numbers, n and p.  You need to find the number of ways to choose n pairs of numbers (each pair has two numbers, the first is smaller than the second) where the difference between the second number and the first number in each pair is greater than 2.  The pairs must be chosen from the range 1 to p.  \n\nThe goal is to find a set of pairs such that the first player, who goes first, can always win a game based on the following rules:\n\n* Players take turns.\n* On a turn, a player can choose a pair and replace it with two new pairs, where the difference between the numbers in each new pair is greater than 2. \n\n\nThe answer should be the remainder when the number of valid sets of pairs is divided by 1000000007."}]}