{"uid": "274-C", "url": "https://codeforces.com/contest/274/problem/C", "tags": ["brute force", " geometry"], "title": "274-C", "statement": "C. The Last Hole!time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLuyi hasncircles on the plane. Thei-th circle is centered at(xi,yi). At the time zero circles start to grow simultaneously. In other words, the radius of each circle at timet(t> 0)is equal tot. The circles are drawn as black discs on an infinite white plane. So at each moment the plane consists of several black and white regions. Note that the circles may overlap while growing.We define aholeas a closed, connected white region. For instance, the figure contains two holes shown by red border. During growing some holes may be created and it is easy to see that each created hole will disappear eventually. Luyi asks you to find moment of time such that the last hole disappears. In other words, you should find the first moment such that no hole can be seen after that.InputThe first line of the input contains integern(1 ≤n≤ 100). Each of the nextnlines contains two integersxiandyi(- 104≤xi,yi≤ 104), indicating the location ofi-th circle.It's guaranteed that no two circles are centered at the same point.OutputPrint the moment where the last hole disappears. If there exists no moment in which we can find holes print-1.The answer will be considered correct if the absolute or relative error does not exceed10- 4.ExamplesInput30 01 12 2Output-1Input40 00 22 22 0Output1.414214Input40 10 -1-2 04 0Output2.125000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "707ecaea", "template_md5": "35d339e4", "result": "You are given $n$ circles on a plane, each with a center at $(x_i, y_i)$.  At time $t=0$, all circles start growing simultaneously. The radius of each circle at time $t$ is equal to $t$.\n\nAs the circles grow, they may overlap, creating white regions between them. A \"hole\" is a closed, connected white region.\n\nYour task is to find the first moment in time when there are no holes left on the plane.  If there is never a time when there are no holes, output -1. \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), the number of circles.\n* Each of the next $n$ lines contains two integers $x_i$ and $y_i$ (-10⁴ ≤ $x_i$, $y_i$ ≤ 10⁴), the coordinates of the center of the $i$-th circle.\n\n**Output:**\n\n* Print the moment in time when the last hole disappears.  If there is never a time when there are no holes, output -1."}, {"prompt_md5": "ba5f05b0", "template_md5": "465699a0", "result": "You are given a set of circles on a plane. Each circle starts growing from its center at the same time.  The circles overlap as they grow.  Find the time when there are no more empty spaces (holes) left on the plane. If this never happens, output -1."}]}