{"uid": "274-E", "url": "https://codeforces.com/contest/274/problem/E", "tags": ["data structures", " implementation"], "title": "274-E", "statement": "E. Mirror Roomtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutImagine ann×mgrid with some blocked cells. The top left cell in the grid has coordinates(1, 1)and the bottom right cell has coordinates(n,m). There arekblocked cells in the grid and others are empty. You flash a laser beam from the center of an empty cell(xs,ys)in one of the diagonal directions (i.e. north-east, north-west, south-east or south-west). If the beam hits a blocked cell or the border of the grid it will reflect. The behavior of the beam reflection in different situations is depicted in the figure below.After a while the beam enters an infinite cycle. Count the number of empty cells that the beam goes through at least once. We consider that the beam goes through cell if it goes through its center.InputThe first line of the input contains three integersn,mandk(1 ≤n,m≤ 105, 0 ≤k≤ 105). Each of the nextklines contains two integersxiandyi(1 ≤xi≤n, 1 ≤yi≤m)indicating the position of thei-th blocked cell.The last line containsxs,ys(1 ≤xs≤n, 1 ≤ys≤m)and the flash direction which is equal to \"NE\", \"NW\", \"SE\" or \"SW\". These strings denote directions( - 1, 1),( - 1,  - 1),(1, 1),(1,  - 1).It's guaranteed that no two blocked cells have the same coordinates.OutputIn the only line of the output print the number of empty cells that the beam goes through at least once.Please, do not write the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput3 3 01 2 SWOutput6Input7 5 33 34 35 32 1 SEOutput14", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d0091196", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$ with some cells blocked.  You start a laser beam at a given empty cell $(x_s, y_s)$ and fire it in one of four diagonal directions:\n\n* North-East:  ($-1, 1$)\n* North-West:  ($-1, -1$)\n* South-East: ($1, 1$)\n* South-West: ($1, -1$)\n\nThe laser beam reflects off the edges of the grid and blocked cells.  \n\nFind the total number of empty cells the laser beam passes through at least once before entering an infinite cycle. \n\n**Input:**\n\n* The first line contains three integers: $n$, $m$, and $k$ ($1 \\le n, m \\le 10^5$, $0 \\le k \\le 10^5$).\n* The next $k$ lines each contain two integers: $x_i$ and $y_i$ ($1 \\le x_i \\le n$, $1 \\le y_i \\le m$), representing the coordinates of a blocked cell.\n* The last line contains $x_s$, $y_s$ and the direction of the laser beam.\n\n**Output:**\n\n* Print a single integer representing the number of empty cells the laser beam passes through at least once."}, {"prompt_md5": "201a8b68", "template_md5": "465699a0", "result": "You have a grid of cells. Some cells are blocked. You start a laser beam in an empty cell and it reflects off blocked cells and the edges of the grid. The beam eventually enters a repeating pattern. Count how many empty cells the beam passes through at least once."}]}