{"uid": "274-B", "url": "https://codeforces.com/contest/274/problem/B", "tags": ["dfs and similar", " dp", " greedy", " trees"], "title": "274-B", "statement": "B. Zero Treetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAtreeis a graph withnvertices and exactlyn- 1edges; this graph should meet the following condition: there exists exactly one shortest (by number of edges) path between any pair of its vertices.Asubtreeof a treeTis a tree with both vertices and edges as subsets of vertices and edges ofT.You're given a tree withnvertices. Consider its vertices numbered with integers from 1 ton. Additionally an integer is written on every vertex of this tree. Initially the integer written on thei-th vertex is equal tovi. In one move you can apply the following operation:Select the subtree of the given tree that includes the vertex with number 1.Increase (or decrease) by one all the integers which are written on the vertices of that subtree.Calculate the minimum number of moves that is required to make all the integers written on the vertices of the given tree equal to zero.InputThe first line of the input containsn(1 ≤n≤ 105). Each of the nextn- 1lines contains two integersaiandbi(1 ≤ai,bi≤n;ai≠bi) indicating there's an edge between verticesaiandbi. It's guaranteed that the input graph is a tree.The last line of the input contains a list ofnspace-separated integersv1,v2, ...,vn(|vi| ≤ 109).OutputPrint the minimum number of operations needed to solve the task.Please, do not write the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput31 21 31 -1 1Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c702cb72", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices. Each vertex has an integer value associated with it.  You can perform the following operation:\n\n* Select any subtree of the tree (including the root).\n* Increase or decrease the value of every vertex in that subtree by 1.\n\nFind the minimum number of operations needed to make the value of every vertex in the tree equal to 0.\n\n**Input:**\n\n* The first line contains $n$ (the number of vertices).\n* The next $n-1$ lines each contain two integers $a_i$ and $b_i$ representing an edge between vertices $a_i$ and $b_i$.\n* The last line contains $n$ space-separated integers $v_1, v_2, ..., v_n$ representing the initial values of the vertices.\n\n**Output:**\n\n* Print the minimum number of operations required."}, {"prompt_md5": "cceaae13", "template_md5": "465699a0", "result": "You have a tree-shaped structure with numbered nodes. Each node has a value. You can repeatedly choose a subtree (including the root node) and change the value of all nodes in that subtree by adding or subtracting 1. Find the fewest operations needed to make all node values zero."}]}