{"uid": "275-B", "url": "https://codeforces.com/contest/275/problem/B", "tags": ["constructive algorithms", " implementation"], "title": "275-B", "statement": "B. Convex Shapetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutConsider ann×mgrid. Initially all the cells of the grid are colored white. Lenny has painted some of the cells (at least one) black. We call a painted gridconvexif one can walk fromanyblack cell toany anotherblack cell using a path of side-adjacent black cells changing his direction at most once during the path. In the figure below, the left grid is convex while the right one is not convex, because there exist two cells which need more than one time to change direction in their path.You're given a painted grid in the input. Tell Lenny if the grid is convex or not.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 50)— the size of the grid. Each of the nextnlines containsmcharacters \"B\" or \"W\". Character \"B\" denotes a black cell of the grid and \"W\" denotes a white cell of the grid.It's guaranteed that the grid has at least one black cell.OutputOn the only line of the output print \"YES\" if the grid is convex, otherwise print \"NO\". Do not print quotes.ExamplesInput3 4WWBWBWWWWWWBOutputNOInput3 1BBWOutputYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2961d55a", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$ where each cell is either black (\"B\") or white (\"W\").  Determine if the black cells form a convex shape. A shape is convex if you can walk from any black cell to any other black cell by only moving to adjacent cells (up, down, left, right) and changing direction at most once.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, the dimensions of the grid.\n* The next $n$ lines each contain $m$ characters, \"B\" or \"W\", representing the grid.\n\n**Output:**\n\n* Print \"YES\" if the black cells form a convex shape, otherwise print \"NO\"."}, {"prompt_md5": "77c11ea1", "template_md5": "465699a0", "result": "You are given a grid of squares. Some squares are black, and some are white.  Determine if you can travel from any black square to any other black square, only moving to adjacent squares (up, down, left, right), and changing direction at most once."}]}