{"uid": "275-A", "url": "https://codeforces.com/contest/275/problem/A", "tags": ["implementation"], "title": "275-A", "statement": "A. Lights Outtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLenny is playing a game on a3 × 3grid of lights. In the beginning of the game all lights are switched on. Pressing any of the lights will toggle it and all side-adjacent lights. The goal of the game is to switch all the lights off. We consider the toggling as follows: if the light was switched on then it will be switched off, if it was switched off then it will be switched on.Lenny has spent some time playing with the grid and by now he has pressed each light a certain number of times. Given the number of times each light is pressed, you have to print the current state of each light.InputThe input consists of three rows. Each row contains three integers each between 0 to 100 inclusive. Thej-th number in thei-th row is the number of times thej-th light of thei-th row of the grid is pressed.OutputPrint three lines, each containing three characters. Thej-th character of thei-th line is \"1\" if and only if the corresponding light is switched on, otherwise it's \"0\".ExamplesInput1 0 00 0 00 0 1Output001010100Input1 0 18 8 82 0 3Output010011100", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1237d8e1", "template_md5": "35d339e4", "result": "You are given a 3x3 grid of lights. Each light can be either on (1) or off (0).  Each light has a number associated with it representing how many times it has been toggled (turned on or off).  \n\nGiven the number of times each light has been toggled, determine the current state (on or off) of each light. \n\n**Rules:**\n\n* Toggling a light also toggles the lights directly next to it (horizontally and vertically).\n\n\n**Input:**\n\nThree rows of three numbers each. Each number represents the number of times a light has been toggled.\n\n**Output:**\n\nThree rows of three characters. Each character is either \"1\" (on) or \"0\" (off)."}, {"prompt_md5": "5aa39c55", "template_md5": "465699a0", "result": "You are given a 3x3 grid of lights. Each light can be on or off.  You know how many times each light has been toggled (turned on/off). Determine the current state (on or off) of each light."}]}