{"uid": "276-A", "url": "https://codeforces.com/contest/276/problem/A", "tags": ["implementation"], "title": "276-A", "statement": "A. Lunch Rushtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutHaving written another programming contest, three Rabbits decided to grab some lunch. The coach gave the team exactlyktime units for the lunch break.The Rabbits have a list ofnrestaurants to lunch in: thei-th restaurant is characterized by two integersfiandti. Valuetishows the time the Rabbits need to lunch in thei-th restaurant. If timetiexceeds the timekthat the coach has given for the lunch break, then the Rabbits' joy from lunching in this restaurant will equalfi- (ti-k). Otherwise, the Rabbits get exactlyfiunits of joy.Your task is to find the value of the maximum joy the Rabbits can get from the lunch, depending on the restaurant. The Rabbits must chooseexactlyone restaurant to lunch in. Note that the joy value isn't necessarily a positive value.InputThe first line contains two space-separated integers —n(1 ≤n≤ 104) andk(1 ≤k≤ 109) — the number of restaurants in the Rabbits' list and the time the coach has given them to lunch, correspondingly. Each of the nextnlines contains two space-separated integers —fi(1 ≤fi≤ 109) andti(1 ≤ti≤ 109) — the characteristics of thei-th restaurant.OutputIn a single line print a single integer — the maximum joy value that the Rabbits will get from the lunch.ExamplesInput2 53 34 5Output4Input4 65 83 62 32 2Output3Input1 51 7Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "19561e92", "template_md5": "35d339e4", "result": "You are given a list of $n$ restaurants, each with a joy value ($f_i$) and a lunch time ($t_i$). You have $k$ time units for lunch.  \n\nFor each restaurant, if the lunch time ($t_i$) is less than or equal to the available time ($k$), the joy value is $f_i$. \n\nIf the lunch time ($t_i$) is greater than the available time ($k$), the joy value is $f_i - (t_i - k)$.\n\nFind the maximum joy value you can get from choosing one restaurant."}, {"prompt_md5": "e0dd8ea9", "template_md5": "465699a0", "result": "You have a list of places to eat, each with a joy value and a time it takes to eat there. You have a limited amount of time to eat.  What is the highest joy value you can get by choosing one place to eat?"}]}