{"uid": "276-C", "url": "https://codeforces.com/contest/276/problem/C", "tags": ["data structures", " greedy", " implementation", " sortings"], "title": "276-C", "statement": "C. Little Girl and Maximum Sumtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe little girl loves the problems on array queries very much.One day she came across a rather well-known problem: you've got an array of $$$n$$$ elements (the elements of the array are indexed starting from 1); also, there are $$$q$$$ queries, each one is defined by a pair of integers $$$l_i$$$, $$$r_i$$$ $$$(1 \\\\le l_i \\\\le r_i \\\\le n)$$$. You need to find for each query the sum of elements of the array with indexes from $$$l_i$$$ to $$$r_i$$$, inclusive.The little girl found the problem rather boring. She decided to reorder the array elements before replying to the queries in a way that makes the sum of query replies maximum possible. Your task is to find the value of this maximum sum.InputThe first line contains two space-separated integers $$$n$$$ ($$$1 \\\\le n \\\\le 2\\\\cdot10^5$$$) and $$$q$$$ ($$$1 \\\\le q \\\\le 2\\\\cdot10^5$$$) — the number of elements in the array and the number of queries, correspondingly.The next line contains $$$n$$$ space-separated integers $$$a_i$$$ ($$$1 \\\\le a_i \\\\le 2\\\\cdot10^5$$$) — the array elements.Each of the following $$$q$$$ lines contains two space-separated integers $$$l_i$$$ and $$$r_i$$$ ($$$1 \\\\le l_i \\\\le r_i \\\\le n$$$) — the $$$i$$$-th query.OutputIn a single line print, a single integer — the maximum sum of query replies after the array elements are reordered.Please, do not use the%lldspecifier to read or write 64-bit integers in C++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput3 35 3 21 22 31 3Output25Input5 35 2 4 1 31 52 32 3Output33", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "08eb8520", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers and $q$ queries. Each query is defined by two integers $l_i$ and $r_i$, representing a subarray from index $l_i$ to $r_i$ (inclusive). \n\nYour task is to rearrange the elements of the array to maximize the sum of the results of all the queries.  \n\nFor each query, the result is the sum of the elements in the specified subarray.\n\nOutput the maximum possible sum of all query results after rearranging the array."}, {"prompt_md5": "5b9ca430", "template_md5": "465699a0", "result": "You are given a list of numbers and a set of ranges. Rearrange the list to maximize the sum of the numbers within each range. Output the maximum possible sum."}]}