{"uid": "276-B", "url": "https://codeforces.com/contest/276/problem/B", "tags": ["games", " greedy"], "title": "276-B", "statement": "B. Little Girl and Gametime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Little Girl loves problems on games very much. Here's one of them.Two players have got a strings, consisting of lowercase English letters. They play a game that is described by the following rules:The players move in turns; In one move the player can remove an arbitrary letter from strings.If the player before his turn can reorder the letters in stringsso as to get a palindrome, this player wins. A palindrome is a string that reads the same both ways (from left to right, and vice versa). For example, string \"abba\" is a palindrome and string \"abc\" isn't.Determine which player will win, provided that both sides play optimally well — the one who moves first or the one who moves second.InputThe input contains a single line, containing strings(1 ≤ |s|  ≤  103). Stringsconsists of lowercase English letters.OutputIn a single line print word \"First\" if the first player wins (provided that both players play optimally well). Otherwise, print word \"Second\". Print the words without the quotes.ExamplesInputabaOutputFirstInputabcaOutputSecond", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e2fdd820", "template_md5": "35d339e4", "result": "Two players take turns removing one letter at a time from two strings of lowercase English letters. The first player to be able to rearrange the remaining letters in their string to form a palindrome wins. A palindrome is a word that reads the same backward as forward (e.g., \"racecar\").  Determine which player will win if both players play optimally. \n\n\nInput: Two strings.\nOutput: \"First\" if the first player wins, \"Second\" if the second player wins."}, {"prompt_md5": "e0317449", "template_md5": "465699a0", "result": "Two players take turns removing letters from a string. The first player to make the string a palindrome wins. Determine which player has the winning strategy if both play perfectly."}]}