{"uid": "277-E", "url": "https://codeforces.com/contest/277/problem/E", "tags": ["flows", " trees"], "title": "277-E", "statement": "E. Binary Tree on Planetime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA root tree is a directed acyclic graph that contains one node (root), from which there is exactly one path to any other node.A root tree is binary if each node has at most two outgoing arcs.When a binary tree is painted on the plane, all arcs should be directed from top to bottom. That is, each arc going fromutovmust meet the conditionyu>yv.You've been given the coordinates of all tree nodes. Your task is to connect these nodes by arcs so as to get the binary root tree and make the total length of the arcs minimum. All arcs of the built tree must be directed from top to bottom.InputThe first line contains a single integern(2 ≤n≤ 400) — the number of nodes in the tree. Then follownlines, two integers per line:xi,yi(|xi|, |yi| ≤ 103) — coordinates of the nodes. It is guaranteed that all points are distinct.OutputIf it is impossible to build a binary root tree on the given points, print \"-1\". Otherwise, print a single real number — the total length of the arcs in the minimum binary tree. The answer will be considered correct if the absolute or relative error doesn't exceed10- 6.ExamplesInput30 01 02 1Output3.650281539872885Input40 01 02 12 0Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "64477125", "template_md5": "35d339e4", "result": "You are given the coordinates of $n$ points on a plane ($2 \\le n \\le 400$).  Your task is to connect these points to form a binary tree.  \n\n* A binary tree is a tree where each node has at most two outgoing edges.\n* The edges must point downwards, meaning the y-coordinate of the starting point must be greater than the y-coordinate of the ending point.\n\nIf it is possible to form a binary tree with these points, output the shortest total length of all the edges. If it is not possible, output -1."}, {"prompt_md5": "19a2aec8", "template_md5": "465699a0", "result": "You are given a set of points on a plane.  Your task is to connect these points to form a tree where:\n\n* Each point has at most two connections to other points.\n* The connections must go downwards (from a higher point to a lower point).\n\nFind the shortest possible total length of all the connections. If it's impossible to form such a tree, output -1."}]}