{"uid": "277-D", "url": "https://codeforces.com/contest/277/problem/D", "tags": ["dp", " probabilities"], "title": "277-D", "statement": "D. Google Code Jamtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutMany of you must be familiar with the Google Code Jam round rules. Let us remind you of some key moments that are crucial to solving this problem. During the round, the participants are suggested to solve several problems, each divided into two subproblems: an easy one with small limits (Small input), and a hard one with large limits (Large input). You can submit a solution for Large input only after you've solved the Small input for this problem. There are no other restrictions on the order of solving inputs. In particular, the participant can first solve the Small input, then switch to another problem, and then return to the Large input. Solving each input gives the participant some number of points (usually different for each problem). This takes into account only complete solutions that work correctly on all tests of the input. The participant gets the test result of a Small input right after he submits it, but the test result of a Large input are out only after the round's over. In the final results table the participants are sorted by non-increasing of received points. If the points are equal, the participants are sorted by ascending of time penalty. By the Google Code Jam rules the time penalty is thetime when the last correct solution was submitted.Vasya decided to check out a new tactics on another round. As soon as the round begins, the boy quickly read all the problems and accurately evaluated the time it takes to solve them. Specifically, for each one of thenproblems Vasya knows five values:Solving the Small input of thei-th problem gives to the participantscoreSmallipoints, and solving the Large input givesscoreLargeimore points. That is, the maximum number of points you can get for thei-th problem equalsscoreSmalli+scoreLargei.Writing the solution for the Small input of thei-th problem takes exactlytimeSmalliminutes for Vasya. Improving this code and turning it into the solution of the Large input takes anothertimeLargeiminutes.Vasya's had much practice, so he solves all Small inputs from the first attempt. But it's not so easy with the Large input: there is theprobFailiprobability that the solution to the Large input will turn out to be wrong at the end of the round. Please keep in mind that these solutions do not affect the participants' points and the time penalty.A round lasts fortminutes. The time for reading problems and submitting solutions can be considered to equal zero. Vasya is allowed to submit a solution exactly at the moment when the round ends.Vasya wants to choose a set of inputs and the order of their solution so as to make the expectation of the total received points maximum possible. If there are multiple ways to do this, he needs to minimize the expectation of the time penalty. Help Vasya to cope with this problem.InputThe first line contains two integersnandt(1 ≤n≤ 1000, 1 ≤t≤ 1560). Then follownlines, each containing 5 numbers:scoreSmalli,scoreLargei,timeSmalli,timeLargei,probFaili(1 ≤scoreSmalli,scoreLargei≤ 109, 1 ≤timeSmalli,timeLargei≤ 1560, 0 ≤probFaili≤ 1).probFailiare real numbers, given with at most 6 digits after the decimal point. All other numbers in the input are integers.OutputPrint two real numbers — the maximum expectation of the total points and the corresponding minimum possible time penalty expectation. The answer will be considered correct if the absolute or relative error doesn't exceed10- 9.ExamplesInput3 4010 20 15 4 0.54 100 21 1 0.991 4 1 1 0.25Output24.0 18.875Input1 1100000000 200000000 1 1 0Output100000000 1NoteIn the first sample one of the optimal orders of solving problems is:The Small input of the third problem.The Small input of the first problem.The Large input of the third problem.The Large input of the first problem.Note that if you solve the Small input of the second problem instead of two inputs of the third one, then total score expectation will be the same but the time penalty expectation will be worse (38).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4f0bdf5c", "template_md5": "465699a0", "result": "You have a set of tasks, each with a small and a large version.  Solving the small version is faster but gives fewer points. Solving the large version takes longer but gives more points. There's a chance the large version solution will be incorrect. You have a limited amount of time to complete as many tasks as possible.  \n\nWhat is the best strategy to maximize your expected total points, while minimizing the expected time penalty if you don't finish everything?"}, {"prompt_md5": "f6c91530", "template_md5": "35d339e4", "result": "There are $n$ programming problems. Each problem has two parts: a small input and a large input. \n\n* Solving the small input of the $i$-th problem gives $score_{Smalli}$ points and takes $time_{Smalli}$ minutes.\n* Solving the large input of the $i$-th problem gives $score_{Largei}$ points and takes $time_{Largei}$ minutes.\n* There is a probability $prob_{Fail i}$ that the solution to the large input of the $i$-th problem will be incorrect.\n\nA round lasts for $t$ minutes. You can submit a solution exactly at the end of the round.\n\nYou want to choose a set of inputs and the order of their solution to maximize the expected total points. If there are multiple ways to do this, you need to minimize the expected time penalty.\n\nThe time penalty is the time when the last correct solution was submitted.\n\n**Input:**\n\n* The first line contains two integers $n$ and $t$ (1 ≤ $n$ ≤ 1000, 1 ≤ $t$ ≤ 1560).\n* Then follow $n$ lines, each containing 5 numbers: $score_{Smalli}$, $score_{Largei}$, $time_{Smalli}$, $time_{Largei}$, $prob_{Fail i}$ (1 ≤ $score_{Smalli}$, $score_{Largei}$ ≤ 10⁹, 1 ≤ $time_{Smalli}$, $time_{Largei}$ ≤ 1560, 0 ≤ $prob_{Fail i}$ ≤ 1). $prob_{Fail i}$ are real numbers, given with at most 6 digits after the decimal point. All other numbers in the input are integers.\n\n**Output:**\n\nPrint two real numbers — the maximum expectation of the total points and the corresponding minimum possible time penalty expectation. The answer will be considered correct if the absolute or relative error doesn't exceed 10⁻⁹."}]}