{"uid": "277-A", "url": "https://codeforces.com/contest/277/problem/A", "tags": ["dfs and similar", " dsu"], "title": "277-A", "statement": "A. Learning Languagestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe \"BerCorp\" company has gotnemployees. These employees can usemapproved official languages for the formal correspondence. The languages are numbered with integers from1tom. For each employee we have the list of languages, which he knows. This list could be empty, i. e. an employee may know no official languages. But the employees are willing to learn any number of official languages, as long as the company pays their lessons. A study course in one language for one employee costs1berdollar.Find the minimum sum of money the company needs to spend so as any employee could correspond to any other one (their correspondence can be indirect, i. e. other employees can help out translating).InputThe first line contains two integersnandm(2 ≤n,m≤ 100) — the number of employees and the number of languages.Thennlines follow — each employee's language list. At the beginning of thei-th line is integerki(0 ≤ki≤m) — the number of languages thei-th employee knows. Next, thei-th line containskiintegers —aij(1 ≤aij≤m) — the identifiers of languages thei-th employee knows. It is guaranteed that all the identifiers in one list are distinct. Note that an employee may know zero languages.The numbers in the lines are separated by single spaces.OutputPrint a single integer — the minimum amount of money to pay so that in the end every employee could write a letter to every other one (other employees can help out translating).ExamplesInput5 51 22 2 32 3 42 4 51 5Output0Input8 703 1 2 31 12 5 42 6 71 32 7 41 1Output2Input2 21 20Output1NoteIn the second sample the employee1can learn language2, and employee8can learn language4.In the third sample employee2must learn language2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "246934d0", "template_md5": "35d339e4", "result": "There are $n$ employees and $m$ languages. Each employee knows a set of languages.  Find the minimum amount of money needed to teach each employee all the languages so that any employee can communicate with any other employee (they can communicate indirectly through other employees who know the necessary languages). Each language course costs $1$ dollar. \n\nInput:\n\n* The first line contains two integers, $n$ and $m$ ($2 \\le n, m \\le 100$), representing the number of employees and languages.\n* The next $n$ lines describe each employee's known languages. \n    * The first number on each line is $k_i$ ($0 \\le k_i \\le m$), the number of languages the $i$-th employee knows.\n    * The following $k_i$ numbers are the identifiers of the languages the $i$-th employee knows.\n\nOutput:\n\n* Print a single integer representing the minimum cost to teach all employees all the languages."}, {"prompt_md5": "bff79a37", "template_md5": "465699a0", "result": "You have a group of people and a set of languages. Each person knows some of the languages.  Find the minimum cost to teach each person all the languages so that any person can communicate with any other person (they can communicate indirectly through other people who know the necessary languages)."}]}