{"uid": "277-C", "url": "https://codeforces.com/contest/277/problem/C", "tags": ["games", " implementation"], "title": "277-C", "statement": "C. Gametime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTwo players play the following game. Initially, the players have a knife and a rectangular sheet of paper, divided into equal square grid cells of unit size. The players make moves in turn, the player who can't make a move loses. In one move, a player can take the knife and cut the paper along any segment of the grid line (not necessarily from border to border). The part of the paper, that touches the knife at least once, is considered cut. There is one limit not to turn the game into an infinite cycle: each move has to cut the paper, that is the knife has to touch the part of the paper that is not cut before.Obviously, the game ends when the entire sheet is cut into1 × 1blocks. During the game, the pieces of the sheet are not allowed to move. It is also prohibited to cut along the border. The coordinates of the ends of each cut must be integers.You are given ann×mpiece of paper, somebody has already madekcuts there. Your task is to determine who will win if the players start to play on this sheet. You can consider that both players play optimally well. If the first player wins, you also need to find the winning first move.InputThe first line contains three integersn,m,k(1 ≤n,m≤ 109, 0 ≤k≤ 105) — the sizes of the piece of paper and the number of cuts. Then followklines, each containing 4 integersxbi,ybi,xei,yei(0 ≤xbi,xei≤n, 0 ≤ybi,yei≤m) — the coordinates of the ends of the existing cuts.It is guaranteed that each cut has a non-zero length, is either vertical or horizontal and doesn't go along the sheet border.The cuts may intersect, overlap and even be the same. That is, it is not guaranteed that the cuts were obtained during any correct game.OutputIf the second player wins, print \"SECOND\". Otherwise, in the first line print \"FIRST\", and in the second line print any winning move of the first player (the coordinates of the cut ends, follow input format to print them).ExamplesInput2 1 0OutputFIRST1 0 1 1Input2 2 40 1 2 10 1 2 11 2 1 01 1 1 2OutputSECOND", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "648f2e8c", "template_md5": "35d339e4", "result": "You are given a rectangular piece of paper with dimensions $n \\times m$.  There are already $k$ cuts on the paper.  Two players take turns making cuts on the paper.  \n\n* A cut can be made along any horizontal or vertical line of grid cells.\n* A cut cannot be made along the border of the paper.\n* A cut must intersect uncut paper.\n\nThe game ends when the entire paper is cut into $1 \\times 1$ squares. The first player to make a move that leaves the opponent with no legal moves wins.\n\nDetermine who will win if both players play optimally. If the first player wins, also provide a winning move for the first player."}, {"prompt_md5": "61e00ffd", "template_md5": "465699a0", "result": "Two players take turns cutting a rectangular grid into smaller pieces.  Each cut must intersect uncut parts of the grid. The first player to be unable to make a cut loses. Given a grid with some pre-existing cuts, determine who will win if both players play optimally and, if the first player wins, find a winning move."}]}