{"uid": "278-B", "url": "https://codeforces.com/contest/278/problem/B", "tags": ["brute force", " strings"], "title": "278-B", "statement": "B. New Problemtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutComing up with a new problem isn't as easy as many people think. Sometimes it is hard enough to name it. We'll consider a titleoriginalif it doesn't occur as a substring in any titles of recent Codeforces problems.You've got the titles ofnlast problems — the strings, consisting of lowercase English letters. Your task is to find the shortest original title for the new problem. If there are multiple such titles, choose the lexicographically minimum one. Note, that title of the problem can't be an empty string.Asubstrings[l...r](1 ≤l≤r≤ |s|)of strings=s1s2...s|s|(where|s|is the length of strings) is stringslsl+ 1...sr.Stringx=x1x2...xpislexicographically smallerthan stringy=y1y2...yq, if eitherp<qandx1=y1,x2=y2, ... ,xp=yp, or there exists such numberr(r<p,r<q), thatx1=y1,x2=y2, ... ,xr=yrandxr+ 1<yr+ 1. The string characters are compared by their ASCII codes.InputThe first line contains integern(1 ≤n≤ 30) — the number of titles you've got to consider. Then follownproblem titles, one per line. Each title only consists of lowercase English letters (specifically, it doesn't contain any spaces) and has the length from 1 to 20, inclusive.OutputPrint a string, consisting of lowercase English letters — the lexicographically minimum shortest original title.ExamplesInput5threehorsesgoodsubstringssecretprimematrixbeautifulyearOutputjInput4aabdefghijklmnopqrstuvwxyzcOutputabNoteIn the first sample the first 9 letters of the English alphabet (a, b, c, d, e, f, g, h, i) occur in the problem titles, so the answer is letterj.In the second sample the titles contain 26 English letters, so the shortest original title cannot have length 1. Titleaaoccurs as a substring in the first title.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "68f55073", "template_md5": "35d339e4", "result": "You are given $n$ problem titles, each consisting of lowercase English letters.  Find the shortest title that is not a substring of any of the given titles. If there are multiple shortest titles, choose the one that comes first alphabetically. \n\nThe title cannot be an empty string."}, {"prompt_md5": "b14316e8", "template_md5": "465699a0", "result": "You are given a list of problem titles. Find the shortest title that is not a substring of any of the given titles. If there are multiple shortest titles, choose the one that comes first alphabetically."}]}