{"uid": "279-C", "url": "https://codeforces.com/contest/279/problem/C", "tags": ["dp", " implementation", " two pointers"], "title": "279-C", "statement": "C. Laddertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got an array, consisting ofnintegersa1,a2, ...,an. Also, you've gotmqueries, thei-th query is described by two integersli,ri. Numbersli,ridefine a subsegment of the original array, that is, the sequence of numbersali,ali+ 1,ali+ 2, ...,ari. For each query you should check whether the corresponding segment is a ladder.Aladderis a sequence of integersb1,b2, ...,bk, such that it first doesn't decrease, then doesn't increase. In other words, there is such integerx(1 ≤x≤k), that the following inequation fulfills:b1≤b2≤ ... ≤bx≥bx+ 1≥bx+ 2... ≥bk. Note that the non-decreasing and the non-increasing sequences are also considered ladders.InputThe first line contains two integersnandm(1 ≤n,m≤ 105)— the number of array elements and the number of queries. The second line contains the sequence of integersa1,a2, ...,an(1 ≤ai≤ 109), where numberaistands for thei-th array element.The followingmlines contain the description of the queries. Thei-th line contains the description of thei-th query, consisting of two integersli,ri(1 ≤li≤ri≤n)— the boundaries of the subsegment of the initial array.The numbers in the lines are separated by single spaces.OutputPrintmlines, in thei-th line print word \"Yes\" (without the quotes), if the subsegment that corresponds to thei-th query is the ladder, or word \"No\" (without the quotes) otherwise.ExamplesInput8 61 2 1 3 3 5 2 11 32 32 48 81 45 8OutputYesYesNoYesNoYes", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bd0f8c6e", "template_md5": "35d339e4", "result": "You are given an array of integers. You need to answer multiple queries. Each query consists of two indices,  $l$ and $r$. For each query, you need to determine if the subarray from index $l$ to $r$ (inclusive) is a \"ladder\".\n\nA ladder is a sequence of numbers that first doesn't decrease, then doesn't increase.  Formally, there exists an index $x$ such that:\n\n$a_l \\le a_{l+1} \\le ... \\le a_x \\ge a_{x+1} \\ge ... \\ge a_r$\n\nFor each query, print \"Yes\" if the subarray is a ladder, and \"No\" otherwise."}, {"prompt_md5": "03619853", "template_md5": "465699a0", "result": "You are given a list of numbers. You need to determine if certain sublists within the larger list are \"ladders\". A ladder is a list of numbers that first go up and then go down, or stay the same."}]}