{"uid": "279-D", "url": "https://codeforces.com/contest/279/problem/D", "tags": ["bitmasks", " dp"], "title": "279-D", "statement": "D. The Minimum Number of Variablestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou've got a positive integer sequencea1,a2, ...,an. All numbers in the sequence are distinct. Let's fix the set of variablesb1,b2, ...,bm. Initially each variablebi(1 ≤i≤m)contains the value of zero. Consider the following sequence, consisting ofnoperations.The first operation is assigning the value ofa1to some variablebx(1 ≤x≤m). Each of the followingn- 1operations is assigning to some variablebythe value that is equal to the sum of values that are stored in the variablesbiandbj(1 ≤i,j,y≤m). At that, the value that is assigned on thet-th operation, must equalat. For each operation numbersy,i,jare chosen anew.Your task is to find the minimum number of variablesm, such that those variables can help you perform the described sequence of operations.InputThe first line contains integern(1 ≤n≤ 23). The second line containsnspace-separated integersa1,a2, ...,an(1 ≤ak≤ 109).It is guaranteed that all numbers in the sequence are distinct.OutputIn a single line print a single number — the minimum number of variablesm, such that those variables can help you perform the described sequence of operations.If you cannot perform the sequence of operations at anym, print-1.ExamplesInput51 2 3 6 8Output2Input33 6 5Output-1Input62 4 8 6 10 18Output3NoteIn the first sample, you can use two variablesb1andb2to perform the following sequence of operations.b1:=1;b2:=b1+b1;b1:=b1+b2;b1:=b1+b1;b1:=b1+b2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "02a6b6ce", "template_md5": "35d339e4", "result": "You are given a sequence of distinct positive integers $a_1, a_2, ..., a_n$. You can use a set of variables $b_1, b_2, ..., b_m$ where each variable initially holds the value 0. \n\nYou can perform the following operations:\n\n1. Assign the value of $a_1$ to some variable $b_x$ (where $1 \\le x \\le m$).\n2. For each subsequent integer $i$ from 2 to $n$, assign the sum of the values in two variables $b_i$ and $b_j$ (where $1 \\le i, j \\le m$) to a variable $b_y$ (where $1 \\le y \\le m$). The value assigned in each operation must equal $a_i$.\n\nFind the minimum number of variables $m$ required to perform all these operations. If it's impossible to perform all operations with any number of variables, output -1."}, {"prompt_md5": "243b9929", "template_md5": "465699a0", "result": "You are given a sequence of distinct numbers. You can use a set of variables, initially all set to zero.  You can assign numbers from the sequence to the variables.  You can also add the values stored in two variables and assign the result to a third variable.  Find the fewest variables needed to perform all the assignments described."}]}