{"uid": "28-E", "url": "https://codeforces.com/contest/28/problem/E", "tags": ["geometry", " math"], "title": "28-E", "statement": "E. DravDe saves the worldtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutHow horrible! The empire of galactic chickens tries to conquer a beautiful city \"Z\", they have built a huge incubator that produces millions of chicken soldiers a day, and fenced it around. The huge incubator looks like a polygon on the planeOxywithnvertices. Naturally, DravDe can't keep still, he wants to destroy the chicken empire. For sure, he will start with the incubator.DravDe is strictly outside the incubator's territory in pointA(xa,ya), and wants to get inside and kill all the chickens working there. But it takes a lot of doing! The problem is that recently DravDe went roller skating and has broken both his legs. He will get to the incubator's territory in his jet airplane LEVAP-41.LEVAP-41 flies at speedV(xv,yv,zv). DravDe can get on the plane in pointA, fly for some time, and then air drop himself. DravDe is very heavy, that's why he falls vertically at speedFdown, but in each point of his free fall DravDe can open his parachute, and from that moment he starts to fall at the wind speedU(xu,yu,zu)until he lands. Unfortunately, DravDe isn't good at mathematics. Would you help poor world's saviour find such an air dropping plan, that allows him to land on the incubator's territory? If the answer is not unique, DravDe wants to find the plan with the minimum time of his flight on the plane. If the answers are still multiple, he wants to find the one with the minimum time of his free fall before opening his parachuteInputThe first line contains the numbern(3 ≤n≤ 104) — the amount of vertices of the fence. Then there follownlines containing the coordinates of these vertices (two integer numbersxi,yi) in clockwise or counter-clockwise order. It's guaranteed, that the fence does not contain self-intersections.The following four lines contain coordinates of pointA(xa,ya), speedsV(xv,yv,zv),Fdownand speedU(xu,yu,zu). All the input numbers are integer. All the coordinates don't exceed104in absolute value. It's guaranteed, thatzv> 0andFdown,zu< 0, and pointAis strictly outside the incubator's territory.OutputIn the first line output two numberst1,t2such, that if DravDe air drops at timet1(counting from the beginning of the flight), he lands on the incubator's territory (landing on the border is regarder as landing on the territory). If DravDe doesn't open his parachute, the second number should be equal to the duration of DravDe's falling down. If it's impossible for DravDe to get to the incubator's territory, output-1 -1. If the answer is not unique, output the answer with the minimumt1. If the answers are still multiple, output the answer with the minimumt2. Your answer must have an absolute or relative error less than10- 6.ExamplesInput40 01 01 10 10 -11 0 1-10 1 -1Output1.00000000 0.00000000Input40 00 11 11 00 -1-1 -1 1-10 1 -1Output-1.00000000 -1.00000000Input40 01 01 10 10 -11 1 1-11 1 -1Output0.50000000 0.00000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9e44ff70", "template_md5": "35d339e4", "result": "Given a polygon representing a fenced area, find the shortest flight path for a plane to drop a person inside the polygon. \n\nThe plane can fly at a constant speed ($v_x$, $v_y$, $v_z$) and the person can freefall at a constant speed ($F_{down}$) before opening a parachute and falling at a different constant speed ($u_x$, $u_y$, $u_z$).\n\nThe person starts at a point outside the polygon ($x_a$, $y_a$) and needs to land inside the polygon. \n\nOutput the time the plane should fly ($t_1$) before dropping the person and the time the person spends falling before opening the parachute ($t_2$). If landing inside the polygon is impossible, output -1 -1. If multiple solutions exist, choose the one with the shortest flight time ($t_1$) and, if still multiple, the shortest freefall time ($t_2$)."}, {"prompt_md5": "14123b44", "template_md5": "465699a0", "result": "Given a polygon representing a fenced area and a starting point outside the area, find the shortest flight path for a plane to drop a person inside the polygon. The person can open a parachute to slow their descent.  If no path exists, output -1."}]}