{"uid": "280-C", "url": "https://codeforces.com/contest/280/problem/C", "tags": ["implementation", " math", " probabilities", " trees"], "title": "280-C", "statement": "C. Game on Treetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMomiji has got a rooted tree, consisting ofnnodes. The tree nodes are numbered by integers from1ton. The root has number1. Momiji decided to play a game on this tree.The game consists of several steps. On each step, Momiji chooses one of the remaining tree nodes (let's denote it byv) and removes all the subtree nodes with the root in nodevfrom the tree. Nodevgets deleted as well. The game finishes when the tree has no nodes left. In other words, the game finishes after the step that chooses the node number1.Each time Momiji chooses a new node uniformly among all the remaining nodes. Your task is to find the expectation of the number of steps in the described game.InputThe first line contains integern(1 ≤n≤ 105)— the number of nodes in the tree. The nextn- 1lines contain the tree edges. Thei-th line contains integersai,bi(1 ≤ai,bi≤n;ai≠bi)— the numbers of the nodes that are connected by thei-th edge.It is guaranteed that the given graph is a tree.OutputPrint a single real number — the expectation of the number of steps in the described game.The answer will be considered correct if the absolute or relative error doesn't exceed10- 6.ExamplesInput21 2Output1.50000000000000000000Input31 21 3Output2.00000000000000000000NoteIn the first sample, there are two cases. One is directly remove the root and another is remove the root after one step. Thus the expected steps are:1 × (1 / 2) + 2 × (1 / 2) = 1.5In the second sample, things get more complex. There are two cases that reduce to the first sample, and one case cleaned at once. Thus the expected steps are:1 × (1 / 3) + (1 + 1.5) × (2 / 3) = (1 / 3) + (5 / 3) = 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ad81c782", "template_md5": "35d339e4", "result": "You are given a rooted tree with $n$ nodes.  Each node is numbered from 1 to $n$, with node 1 being the root.\n\nThe game works as follows:\n\n1.  Choose a node in the tree (uniformly at random).\n2.  Remove that node and all of its descendants from the tree.\n\nThe game continues until only the root node remains.\n\nWhat is the expected number of steps it takes to finish the game?\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the number of nodes in the tree.\n* The next $n-1$ lines each contain two integers $a_i$ and $b_i$ (1 ≤ $a_i$, $b_i$ ≤ $n$; $a_i$ ≠ $b_i$) representing an edge between nodes $a_i$ and $b_i$.\n\n**Output:**\n\nPrint a single real number representing the expected number of steps in the game.  The answer will be considered correct if the absolute or relative error does not exceed 10⁻⁶."}, {"prompt_md5": "757be574", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes.  You repeatedly remove a node and all of its connected nodes from the tree until only one node remains.  Each time you remove a node, you choose a random remaining node. What is the average number of times you need to remove a node?"}]}