{"uid": "282-B", "url": "https://codeforces.com/contest/282/problem/B", "tags": ["greedy", " math"], "title": "282-B", "statement": "B. Painting Eggstime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Bitlandians are quite weird people. They have very peculiar customs.As is customary, Uncle J. wants to haveneggs painted for Bitruz (an ancient Bitland festival). He has asked G. and A. to do the work.The kids are excited because just as is customary, they're going to be paid for the job!Overall uncle J. has gotneggs. G. named his price for painting each egg. Similarly, A. named his price for painting each egg. It turns out that for each egg the sum of the money both A. and G. want for the painting equals1000.Uncle J. wants to distribute the eggs between the children so as to give each egg to exactly one child. Also, Uncle J. wants the total money paid to A. to be different from the total money paid to G. by no more than500.Help Uncle J. Find the required distribution of eggs or otherwise say that distributing the eggs in the required manner is impossible.InputThe first line contains integern(1 ≤n≤ 106)— the number of eggs.Nextnlines contain two integersaiandgieach(0 ≤ai,gi≤ 1000;ai+gi= 1000):aiis the price said by A. for thei-th egg andgiis the price said by G. for thei-th egg.OutputIf it is impossible to assign the painting, print \"-1\" (without quotes).Otherwise print a string, consisting ofnletters \"G\" and \"A\". Thei-th letter of this string should represent the child who will get thei-th egg in the required distribution. Letter \"A\" represents A. and letter \"G\" represents G. If we denote the money Uncle J. must pay A. for the painting asSa, and the money Uncle J. must pay G. for the painting asSg, then this inequality must hold:|Sa-Sg|  ≤  500.If there are several solutions, you are allowed to print any of them.ExamplesInput21 999999 1OutputAGInput3400 600400 600400 600OutputAGA", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "69a3d26c", "template_md5": "35d339e4", "result": "You are given $n$ eggs. For each egg, there are two prices: $a_i$ and $g_i$, representing the price each of two people wants to paint it.  The sum of these prices for each egg is always 1000 ($a_i + g_i = 1000$).\n\nYou need to assign each egg to one of the two people. The goal is to find a way to assign the eggs so that:\n\n* Each egg is assigned to exactly one person.\n* The total amount paid to one person is no more than 500 dollars different from the total amount paid to the other person.\n\nIf it's impossible to assign the eggs this way, output \"-1\". Otherwise, output a string of \"A\"s and \"G\"s, where \"A\" represents the person who gets the egg and \"G\" represents the other person."}, {"prompt_md5": "ac23297f", "template_md5": "465699a0", "result": "You are given a number of items and two prices for each item.  The total price for each item is always the same. You need to divide the items between two people in a way that the total price paid to each person is as close as possible, with the difference being no more than a given amount. Output the assignment of items to people, or say it's impossible."}]}