{"uid": "282-D", "url": "https://codeforces.com/contest/282/problem/D", "tags": ["dp", " games"], "title": "282-D", "statement": "D. Yet Another Number Gametime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSince most contestants do not read this part, I have to repeat that Bitlandians are quite weird. They have their own jobs, their own working method, their own lives, their own sausages and their own games!Since you are so curious about Bitland, I'll give you the chance of peeking at one of these games.BitLGM and BitAryo are playing yet another of their crazy-looking genius-needed Bitlandish games. They've got a sequence ofnnon-negative integersa1,a2, ...,an. The players make moves in turns. BitLGM moves first. Each player can and must do one of the two following actions in his turn:Take one of the integers (we'll denote it asai). Choose integerx(1 ≤x≤ai). And then decreaseaibyx, that is, apply assignment:ai=ai-x.Choose integerx. And then decrease allaibyx, that is, apply assignment:ai=ai-x, for alli.The player who cannot make a move loses.You're given the initial sequencea1,a2, ...,an. Determine who wins, if both players plays optimally well and if BitLGM and BitAryo start playing the described game in this sequence.InputThe first line contains an integern(1 ≤n≤ 3).The next line containsnintegersa1,a2, ...,an(0 ≤ai< 300).OutputWrite the name of the winner (provided that both players play optimally well). Either \"BitLGM\" or \"BitAryo\" (without the quotes).ExamplesInput21 1OutputBitLGMInput21 2OutputBitAryoInput31 2 1OutputBitLGM", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c7a7a4bf", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ non-negative integers $a_1, a_2, ..., a_n$. Two players take turns making moves.  On each turn, a player can choose one of the following actions:\n\n1. Choose an integer $i$ ($1 \\le i \\le n$) and an integer $x$ ($1 \\le x \\le a_i$).  Decrease $a_i$ by $x$.\n2. Choose an integer $x$. Decrease all $a_i$ by $x$.\n\nThe player who cannot make a move loses. Determine which player wins if both players play optimally."}, {"prompt_md5": "62ff91d1", "template_md5": "465699a0", "result": "Two players take turns modifying a list of numbers.  On each turn, a player can either:\n\n1. Choose a number in the list and decrease it by a positive integer.\n2. Decrease all numbers in the list by a positive integer.\n\nThe first player to be unable to make a move loses. Determine which player wins if both play optimally."}]}