{"uid": "282-C", "url": "https://codeforces.com/contest/282/problem/C", "tags": ["constructive algorithms", " implementation", " math"], "title": "282-C", "statement": "C. XOR and ORtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Bitlandians are quite weird people. They do everything differently. They have a different alphabet so they have a different definition for a string.A Bitlandish string is a string made only of characters \"0\" and \"1\".BitHaval (the mayor of Bitland) loves to play with Bitlandish strings. He takes some Bitlandish stringa, and applies several (possibly zero) operations to it. In one operation the mayor may take any two adjacent characters of a string, define one of them asxand the other one asy. Then he calculates two valuespandq:p=xxory,q=xory. Then he replaces one of the two taken characters bypand the other one byq.Thexoroperation means the bitwise excluding OR operation. Theoroperation is the bitwise OR operation.So for example one operation can transform string11to string10or to string01. String1cannot be transformed into any other string.You've got two Bitlandish stringsaandb. Your task is to check if it is possible for BitHaval to transform stringato stringbin several (possibly zero) described operations.InputThe first line contains Bitlandish stringa, the second line contains Bitlandish stringb. The strings can have different lengths.It is guaranteed that the given strings only consist of characters \"0\" and \"1\". The strings are not empty, their length doesn't exceed106.OutputPrint \"YES\" ifacan be transformed intob, otherwise print \"NO\". Please do not print the quotes.ExamplesInput1110OutputYESInput101OutputNOInput000101OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "852c313b", "template_md5": "35d339e4", "result": "You are given two strings, each consisting only of \"0\" and \"1\".  \n\nYou can perform the following operation on the strings:\n\n1. Select any two adjacent characters in the string.\n2. Let's call these characters $x$ and $y$.\n3. Calculate two new values:\n   *  $p = x \\oplus y$ (bitwise XOR)\n   *  $q = x \\lor y$ (bitwise OR)\n4. Replace one of the original characters with $p$ and the other with $q$.\n\nDetermine if it is possible to transform the first string into the second string using these operations. \n\nIf it is possible, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "95f610b7", "template_md5": "465699a0", "result": "Given two strings made up of only 0s and 1s, determine if you can transform the first string into the second string by repeatedly swapping adjacent characters and applying bitwise operations (XOR and OR) to them."}]}