{"uid": "283-E", "url": "https://codeforces.com/contest/283/problem/E", "tags": ["combinatorics", " data structures", " math"], "title": "283-E", "statement": "E. Cow Tennis Tournamenttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutFarmer John is hosting a tennis tournament with hisncows. Each cow has a skill levelsi, and no two cows having the same skill level. Every cow plays every other cow exactly once in the tournament, and each cow beats every cow with skill level lower than its own.However, Farmer John thinks the tournament will be demoralizing for the weakest cows who lose most or all of their matches, so he wants to flip some of the results. In particular, atkdifferent instances, he will take two integersai,bi(ai<bi)and flip all the results between cows with skill level betweenaiandbiinclusive. That is, for any pairx,yhe will change the result of the match on the final scoreboard (so ifxwon the match, the scoreboard will now display thatywon the match, and vice versa). It is possible that Farmer John will change the result of a match multiple times. It is not guaranteed thataiandbiare equal to some cow's skill level.Farmer John wants to determine how balanced he made the tournament results look. In particular, he wants to count the number of triples of cows(p,q,r)for which the final leaderboard shows that cowpbeats cowq, cowqbeats cowr, and cowrbeats cowp. Help him determine this number.Note that two triples are considered different if they do not contain the same set of cows (i.e. if there is a cow in one triple that is not in the other).InputOn the first line are two space-separated integers,nandk(3 ≤n≤ 105; 0 ≤k≤ 105). On the next line arenspace-separated distinct integers,s1,s2, ...,sn(1 ≤si≤ 109), denoting the skill levels of the cows. On the nextklines are two space separated integers,aiandbi(1 ≤ai<bi≤ 109)representing the changes Farmer John made to the scoreboard in the order he makes it.OutputA single integer, containing the number of triples of cows(p,q,r)for which the final leaderboard shows that cowpbeats cowq, cowqbeats cowr, and cowrbeats cowp.Please do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput3 21 2 31 22 3Output1Input5 35 9 4 1 71 72 83 9Output3NoteIn the first sample, cow 3 > cow 1, cow 3 > cow 2, and cow 2 > cow 1. However, the results between cows 1 and 2 and cows 2 and 3 are flipped, so now FJ's results show that cow 1 > cow 2, cow 2 > cow 3, and cow 3 > cow 1, so cows 1, 2, and 3 form a balanced triple.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "902094cb", "template_md5": "35d339e4", "result": "You are given $n$ distinct integers representing the skill levels of $n$ competitors.  Each competitor plays every other competitor exactly once. A competitor beats any competitor with a lower skill level.\n\nYou are also given $k$ pairs of integers $(a_i, b_i)$. For each pair, you must flip the results of all matches between competitors with skill levels between $a_i$ and $b_i$ (inclusive).\n\nYour task is to count the number of triples of competitors $(p, q, r)$ where:\n\n* Competitor $p$ beats competitor $q$\n* Competitor $q$ beats competitor $r$\n* Competitor $r$ beats competitor $p$\n\n\n\nLet me know if you'd like help with the solution!"}, {"prompt_md5": "fc06f6e9", "template_md5": "465699a0", "result": "You are given a list of numbers representing the skill levels of people.  You can swap the results of matches between any two ranges of these numbers.  Count how many sets of three people exist where person 1 beats person 2, person 2 beats person 3, and person 3 beats person 1."}]}