{"uid": "285-D", "url": "https://codeforces.com/contest/285/problem/D", "tags": ["bitmasks", " combinatorics", " dp", " implementation", " meet-in-the-middle"], "title": "285-D", "statement": "D. Permutation Sumtime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPermutationpis an ordered set of integersp1,p2,  ...,pn, consisting ofndistinct positive integers, each of them doesn't exceedn. We'll denote thei-th element of permutationpaspi. We'll call numbernthe size or the length of permutationp1,p2,  ...,pn.Petya decided to introduce the sum operation on the set of permutations of lengthn. Let's assume that we are given two permutations of lengthn:a1,a2, ...,anandb1,b2, ...,bn. Petya calls the sum of permutationsaandbsuch permutationcof lengthn, whereci= ((ai- 1 +bi- 1)modn) + 1(1 ≤i≤n).Operationmeans taking the remainder after dividing numberxby numbery.Obviously, not for all permutationsaandbexists permutationcthat is sum ofaandb. That's why Petya got sad and asked you to do the following: givenn, count the number of such pairs of permutationsaandbof lengthn, that exists permutationcthat is sum ofaandb. The pair of permutationsx,y(x≠y)and the pair of permutationsy,xare considered distinct pairs.As the answer can be rather large, print the remainder after dividing it by1000000007(109+ 7).InputThe single line contains integern(1 ≤n≤ 16).OutputIn the single line print a single non-negative integer — the number of such pairs of permutationsaandb, that exists permutationcthat is sum ofaandb, modulo1000000007(109+ 7).ExamplesInput3Output18Input5Output1800", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d51076b4", "template_md5": "35d339e4", "result": "Given a positive integer $n$, find the number of pairs of permutations of length $n$ whose sum exists.  \n\nThe sum of two permutations $a$ and $b$ of length $n$ is a new permutation $c$ of length $n$ where $c_i = ((a_{i-1} + b_{i-1}) \\mod n) + 1$ for $1 \\le i \\le n$.  \n\nThe modulo operation is defined as $x \\mod y = x - \\lfloor \\frac{x}{y} \\rfloor y$.\n\nSince the answer can be large, output the remainder after dividing by $10^9 + 7$."}, {"prompt_md5": "9200bb0b", "template_md5": "465699a0", "result": "Given a number *n*, count the number of pairs of unique arrangements of numbers from 1 to *n* where you can combine them to create a third arrangement by adding corresponding numbers (with a modulo operation)."}]}