{"uid": "286-E", "url": "https://codeforces.com/contest/286/problem/E", "tags": ["constructive algorithms", " fft", " math"], "title": "286-E", "statement": "E. Ladies' Shoptime limit per test8 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA ladies' shop has recently opened in the city of Ultima Thule. To get ready for the opening, the shop boughtnbags. Each bag is characterised by the total weightaiof the items you can put there. The weird thing is, youcannotuse these bags to put a set of items with the total weight strictly less thanai. However the weights of the items that will be sold in the shop haven't yet been defined. That's what you should determine right now.Your task is to find the set of the items' weightsp1,p2, ...,pk(1 ≤p1<p2< ... <pk), such that:Any bag will be used. That is, for anyi(1 ≤i≤n)there will be such set of items that their total weight will equalai. We assume that there is the infinite number of items of any weight. You can put multiple items of the same weight in one bag.For any set of items that have total weight less than or equal tom, there is a bag into which you can put this set. Similarly, a set of items can contain multiple items of the same weight.Of all sets of the items' weights that satisfy points 1 and 2, find the set with the minimum number of weights. In other words, valuekshould be as small as possible.Find and print the required set.InputThe first line contains space-separated integersnandm(1 ≤n,m≤ 106). The second line containsndistinct space-separated integersa1,a2, ...,an(1 ≤a1<a2< ... <an≤m) — the bags' weight limits.OutputIn the first line print \"NO\" (without the quotes) if there isn't setpi, that would meet the conditions.Otherwise, in the first line print \"YES\" (without the quotes), in the second line print an integerk(showing how many numbers are in the suitable set with the minimum number of weights), in the third line printkspace-separated integersp1,p2, ...,pk(1 ≤p1<p2< ... <pk). If there are multiple solutions, print any of them.ExamplesInput6 105 6 7 8 9 10OutputYES55 6 7 8 9Input1 101OutputNOInput1 106OutputYES16", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "533b7c60", "template_md5": "35d339e4", "result": "You are given $n$ bags, each with a weight limit $a_i$.  You need to determine the smallest set of distinct item weights $p_1, p_2, ..., p_k$ (where $1 \\le p_1 < p_2 < ... < p_k$) such that:\n\n1. Every bag can be filled with a set of items that weigh exactly $a_i$.\n2. For any total weight less than or equal to $m$, there is a bag that can hold those items.\n\nIf no such set of item weights exists, output \"NO\". Otherwise, output \"YES\", followed by the number of items $k$, and then the $k$ item weights $p_1, p_2, ..., p_k$."}, {"prompt_md5": "143ab1c9", "template_md5": "465699a0", "result": "You are given a list of numbers representing the maximum weight capacity of containers.  Find the smallest set of weights that can be used to fill all the containers.  If no such set exists, say so."}]}