{"uid": "287-B", "url": "https://codeforces.com/contest/287/problem/B", "tags": ["binary search", " math"], "title": "287-B", "statement": "B. Pipelinetime limit per test0.4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVova, the Ultimate Thule new shaman, wants to build a pipeline. As there are exactlynhouses in Ultimate Thule, Vova wants the city to have exactlynpipes, each such pipe should be connected to the water supply. A pipe can be connected to the water supply if there's water flowing out of it. Initially Vova has only one pipe with flowing water. Besides, Vova has several splitters.A splitter is a construction that consists of one input (it can be connected to a water pipe) andxoutput pipes. When a splitter is connected to a water pipe, water flows from each output pipe. You can assume that the output pipes are ordinary pipes. For example, you can connect water supply to such pipe if there's water flowing out from it. At most one splitter can be connected to any water pipe.The figure shows a4-output splitterVova has one splitter of each kind: with2,3,4, ...,koutputs. Help Vova use the minimum number of splitters to build the required pipeline or otherwise state that it's impossible.Vova needs the pipeline to have exactlynpipes with flowing out water. Note that some of those pipes can be the output pipes of the splitters.InputThe first line contains two space-separated integersnandk(1 ≤n≤ 1018,2 ≤k≤ 109).Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.OutputPrint a single integer — the minimum number of splitters needed to build the pipeline. If it is impossible to build a pipeline with the given splitters, print -1.ExamplesInput4 3Output2Input5 5Output1Input8 4Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "41371e7e", "template_md5": "35d339e4", "result": "You are given two numbers, $n$ and $k$.  You need to build a pipeline with exactly $n$ pipes that have water flowing out of them. You have one splitter of each kind, with 2, 3, 4, ..., $k$ output pipes. A splitter takes water from one pipe and sends it to its output pipes.  \n\nDetermine the minimum number of splitters needed to build the pipeline. If it's impossible to build the pipeline with the given splitters, output -1."}, {"prompt_md5": "cf408c29", "template_md5": "465699a0", "result": "You have to build a network of pipes with a given number of pipes. You can connect pipes to a water source and splitters. Splitters take water from one pipe and send it to multiple pipes. You have splitters that can send water to 2, 3, 4, ..., k pipes. Can you build the network with the given splitters? If yes, what is the minimum number of splitters needed? If no, say -1."}]}