{"uid": "288-B", "url": "https://codeforces.com/contest/288/problem/B", "tags": ["combinatorics"], "title": "288-B", "statement": "B. Polo the Penguin and Housestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle penguin Polo loves his home village. The village hasnhouses, indexed by integers from 1 ton. Each house has a plaque containing an integer, thei-th house has a plaque containing integerpi(1 ≤pi≤n).Little penguin Polo loves walking around this village. The walk looks like that. First he stands by a house numberx. Then he goes to the house whose number is written on the plaque of housex(that is, to housepx), then he goes to the house whose number is written on the plaque of housepx(that is, to houseppx), and so on.We know that:When the penguin starts walking from any house indexed from 1 tok, inclusive, he can walk to house number 1.When the penguin starts walking from any house indexed fromk+ 1ton, inclusive, he definitely cannot walk to house number 1.When the penguin starts walking from house number 1, he can get back to house number 1 after some non-zero number of walks from a house to a house.You need to find the number of ways you may write the numbers on the houses' plaques so as to fulfill the three above described conditions. Print the remainder after dividing this number by1000000007(109+ 7).InputThe single line contains two space-separated integersnandk(1 ≤n≤ 1000, 1 ≤k≤min(8,n)) — the number of the houses and the numberkfrom the statement.OutputIn a single line print a single integer — the answer to the problem modulo1000000007(109+ 7).ExamplesInput5 2Output54Input7 4Output1728", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8e59aff4", "template_md5": "35d339e4", "result": "You are given $n$ houses numbered from 1 to $n$. Each house has a plaque with a number on it, representing the number of the house the resident wants to go to next.  \n\nHere are the rules:\n\n*  You can start walking from any house numbered 1 to $k$ inclusive and eventually reach house number 1.\n*  You cannot start walking from any house numbered $k+1$ to $n$ inclusive and reach house number 1.\n*  If you start walking from house number 1, you can return to house number 1 after some number of steps.\n\nFind the number of ways to assign numbers to the plaques so that these rules are followed.  Print the remainder when this number is divided by $10^9 + 7$."}, {"prompt_md5": "2deb42eb", "template_md5": "465699a0", "result": "You have a line of houses numbered 1 to n. Each house has a number on its sign that indicates the number of the next house to visit.  \n\nYou need to figure out how many different ways you can number the houses so that:\n\n* Starting from any house 1 to k, you can eventually reach house 1.\n* Starting from any house k+1 to n, you can never reach house 1.\n* Starting from house 1, you can return to house 1 after walking to other houses. \n\n\n\nCount the number of possible arrangements and find the remainder when divided by 1000000007."}]}