{"uid": "288-D", "url": "https://codeforces.com/contest/288/problem/D", "tags": ["combinatorics", " dfs and similar", " trees"], "title": "288-D", "statement": "D. Polo the Penguin and Treestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle penguin Polo has got a tree — a non-directed connected acyclic graph, containingnnodes andn- 1edges. We will consider the tree nodes numbered by integers from 1 ton.Today Polo wonders, how to find the number of pairs of paths that don't have common nodes. More formally, he should find the number of groups of four integersa,b,canddsuch that:1 ≤a<b≤n;1 ≤c<d≤n;there's no such node that lies on both the shortest path from nodeato nodeband from nodecto noded.The shortest path betweem two nodes is the path that is shortest in the number of edges.Help Polo solve this problem.InputThe first line contains integern(1 ≤n≤ 80000)— the number of tree nodes. Each of the followingn- 1lines contains a pair of integersuiandvi(1 ≤ui,vi≤n;ui≠vi)— thei-th edge of the tree.It is guaranteed that the given graph is a tree.OutputIn a single line print a single integer — the answer to the problem.Please do not use the %lld specificator to read or write 64-bit numbers in С++. It is recommended to use the cin, cout streams or the %I64d specificator.ExamplesInput41 22 33 4Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "54ef3977", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes.  Each node is numbered from 1 to $n$.  The tree has $n-1$ edges.  \n\nFind the number of pairs of paths in the tree that do not share any nodes.  \n\nA path is a sequence of nodes connected by edges. The shortest path between two nodes is the path with the fewest edges.\n\n**Input:**\n\n* The first line contains the number of nodes, $n$.\n* The next $n-1$ lines each contain two integers, $u$ and $v$, representing an edge between nodes $u$ and $v$.\n\n**Output:**\n\n* Output a single integer representing the number of pairs of paths that do not share any nodes."}, {"prompt_md5": "90a6594d", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes.  Find the number of pairs of paths in the tree that do not share any nodes."}]}