{"uid": "289-A", "url": "https://codeforces.com/contest/289/problem/A", "tags": ["brute force", " implementation"], "title": "289-A", "statement": "A. Polo the Penguin and Segmentstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle penguin Polo adores integer segments, that is, pairs of integers[l;r](l≤r).He has a set that consists ofninteger segments:[l1;r1], [l2;r2], ..., [ln;rn]. We know that no two segments of this set intersect. In one move Polo can either widen any segment of the set 1 unit to the left or 1 unit to the right, that is transform[l;r]to either segment[l- 1;r], or to segment[l;r+ 1].Thevalueof a set of segments that consists ofnsegments[l1;r1], [l2;r2], ..., [ln;rn]is the number of integersx, such that there is integerj, for which the following inequality holds,lj≤x≤rj.Find the minimum number of moves needed to make the value of the set of Polo's segments divisible byk.InputThe first line contains two integersnandk(1 ≤n,k≤ 105). Each of the followingnlines contain a segment as a pair of integersliandri(- 105≤li≤ri≤ 105), separated by a space.It is guaranteed that no two segments intersect. In other words, for any two integersi,j(1 ≤i<j≤n)the following inequality holds,min(ri,rj) <max(li,lj).OutputIn a single line print a single integer — the answer to the problem.ExamplesInput2 31 23 4Output2Input3 71 23 34 7Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ceace22a", "template_md5": "35d339e4", "result": "You are given a set of non-overlapping integer segments, where each segment is defined by a pair of integers [l; r] (l ≤ r).  \n\nYou can perform the following operation on any segment:\n\n* Widen the segment by 1 unit to the left (change it to [l-1; r])\n* Widen the segment by 1 unit to the right (change it to [l; r+1])\n\nThe value of the set of segments is the number of integers x such that there exists a segment [l; r] in the set where l ≤ x ≤ r.\n\nFind the minimum number of operations needed to make the value of the set divisible by k.\n\nInput:\n\n* The first line contains two integers n and k (1 ≤ n, k ≤ 10^5).\n* The following n lines each contain a segment as a pair of integers l and r (-10^5 ≤ l ≤ r ≤ 10^5), separated by a space.\n\nOutput:\n\n* A single integer representing the minimum number of operations."}, {"prompt_md5": "5ea5802d", "template_md5": "465699a0", "result": "You are given a set of non-overlapping intervals. You can expand each interval by one unit to the left or right.  Find the minimum number of expansions needed to make the total count of integers covered by the intervals divisible by a given number."}]}