{"uid": "29-A", "url": "https://codeforces.com/contest/29/problem/A", "tags": ["brute force"], "title": "29-A", "statement": "A. Spit Problemtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn a Berland's zoo there is an enclosure with camels. It is known that camels like to spit. Bob watched these interesting animals for the whole day and registered in his notepad where each animal spitted. Now he wants to know if in the zoo there are two camels, which spitted at each other. Help him to solve this task.The trajectory of a camel's spit is an arc, i.e. if the camel in positionxspitsdmeters right, he can hit only the camel in positionx+d, if such a camel exists.InputThe first line contains integern(1 ≤n≤ 100) — the amount of camels in the zoo. Each of the followingnlines contains two integersxianddi(- 104≤xi≤ 104, 1 ≤ |di| ≤ 2·104) — records in Bob's notepad.xiis a position of thei-th camel, anddiis a distance at which thei-th camel spitted. Positive values ofdicorrespond to the spits right, negative values correspond to the spits left. No two camels may stand in the same position.OutputIf there are two camels, which spitted at each other, outputYES. Otherwise, outputNO.ExamplesInput20 11 -1OutputYESInput30 11 12 -2OutputNOInput52 -103 100 55 -510 1OutputYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "132baac8", "template_md5": "35d339e4", "result": "You are given a list of $n$ camels, each with a position ($x_i$) and a spitting distance ($d_i$).  A camel can spit either to the right ($d_i > 0$) or left ($d_i < 0$). \n\nDetermine if there are two camels that spit at each other. \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), the number of camels.\n* Each of the following $n$ lines contains two integers $x_i$ and $d_i$ (-10⁴ ≤ $x_i$ ≤ 10⁴, 1 ≤ |$d_i$| ≤ 2·10⁴). \n    * $x_i$ is the position of the $i$-th camel.\n    * $d_i$ is the distance the $i$-th camel spits.\n\n**Output:**\n\n* If there are two camels that spit at each other, output \"YES\".\n* Otherwise, output \"NO\"."}, {"prompt_md5": "ffb6aac4", "template_md5": "465699a0", "result": "You are given a list of animals and the direction and distance each animal spit. Determine if any two animals spit at each other."}]}