{"uid": "293-E", "url": "https://codeforces.com/contest/293/problem/E", "tags": ["data structures", " divide and conquer", " trees"], "title": "293-E", "statement": "E. Close Verticestime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou've got a weighted tree, consisting ofnvertices. Each edge has a non-negative weight. The length of the path between any two vertices of the tree is the number of edges in the path. The weight of the path is the total weight of all edges it contains.Two vertices are close if there exists a path of length at mostlbetween them and a path of weight at mostwbetween them. Count the number of pairs of verticesv,u(v<u), such that verticesvanduare close.InputThe first line contains three integersn,landw(1 ≤n≤ 105, 1 ≤l≤n, 0 ≤w≤ 109). The nextn- 1lines contain the descriptions of the tree edges. Thei-th line contains two integerspi,wi(1 ≤pi< (i+ 1), 0 ≤wi≤ 104), that mean that thei-th edge connects vertex(i+ 1)andpiand has weightwi.Consider the tree vertices indexed from 1 tonin some way.OutputPrint a single integer — the number of close pairs.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput4 4 61 31 41 3Output4Input6 2 171 32 52 131 65 9Output9", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5693adf5", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices. Each edge in the tree has a non-negative weight.  \n\nTwo vertices are considered \"close\" if:\n\n* There is a path between them with a length of at most $l$ (meaning at most $l$ edges).\n* There is a path between them with a total weight of at most $w$.\n\nYour task is to count the number of pairs of vertices $(v, u)$ where $v < u$ and the vertices are close.\n\n**Input:**\n\n* The first line contains three integers: $n$, $l$, and $w$ ($1 \\le n \\le 10^5$, $1 \\le l \\le n$, $0 \\le w \\le 10^9$).\n* The next $n-1$ lines describe the edges of the tree. Each line contains two integers: $p_i$ and $w_i$ ($1 \\le p_i < i+1$, $0 \\le w_i \\le 10^4$), representing an edge connecting vertex $i+1$ to vertex $p_i$ with weight $w_i$.\n\n**Output:**\n\nPrint a single integer representing the number of close vertex pairs."}, {"prompt_md5": "6edb7300", "template_md5": "465699a0", "result": "You have a tree-shaped network with nodes and connections between them. Each connection has a weight.  Find the number of pairs of nodes that are \"close\" to each other. Two nodes are close if there is a path between them with a length of at most a given number and a total weight of at most a given number."}]}