{"uid": "293-D", "url": "https://codeforces.com/contest/293/problem/D", "tags": ["geometry", " math", " probabilities", " two pointers"], "title": "293-D", "statement": "D. Ksusha and Squaretime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutKsusha is a vigorous mathematician. She is keen on absolutely incredible mathematical riddles.Today Ksusha came across a convex polygon of non-zero area. She is now wondering: if she chooses a pair of distinct points uniformly among all integer points (points with integer coordinates) inside or on the border of the polygon and then draws a square with two opposite vertices lying in the chosen points, what will the expectation of this square's area be?A pair of distinct points is chosen uniformly among all pairs of distinct points, located inside or on the border of the polygon. Pairs of pointsp,q(p≠q)andq,pare considered the same.Help Ksusha! Count the required expectation.InputThe first line contains integern(3 ≤n≤ 105)— the number of vertices of Ksusha's convex polygon. Nextnlines contain the coordinates of the polygon vertices in clockwise or counterclockwise order. Thei-th line contains integersxi,yi(|xi|, |yi| ≤ 106)— the coordinates of the vertex that goesi-th in that order.OutputPrint a single real number — the required expected area.The answer will be considered correct if its absolute and relative error doesn't exceed10- 6.ExamplesInput30 05 55 0Output4.6666666667Input4-1 34 56 23 -5Output8.1583333333Input317 136859 93716 641Output66811.3704155169", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "829094d4", "template_md5": "35d339e4", "result": "You are given a convex polygon with $n$ vertices.  Each vertex has integer coordinates $(x_i, y_i)$.  \n\nA square is formed by choosing two distinct points inside or on the boundary of the polygon.  What is the expected area of this square?\n\nThe points are chosen uniformly at random.  \n\nOutput the expected area of the square."}, {"prompt_md5": "bdd6be81", "template_md5": "465699a0", "result": "You are given a polygon.  Find the average area of all squares that can be formed using two points inside or on the edge of the polygon."}]}