{"uid": "293-A", "url": "https://codeforces.com/contest/293/problem/A", "tags": ["games", " greedy"], "title": "293-A", "statement": "A. Weird Gametime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYaroslav, Andrey and Roman can play cubes for hours and hours. But the game is for three, so when Roman doesn't show up, Yaroslav and Andrey play another game.Roman leaves a word for each of them. Each word consists of2·nbinary characters \"0\" or \"1\". After that the players start moving in turns. Yaroslav moves first. During a move, a player must choose an integer from 1 to2·n, which hasn't been chosen by anybody up to that moment. Then the player takes a piece of paper and writes out the corresponding character from his string.Let's represent Yaroslav's word ass=s1s2...s2n. Similarly, let's represent Andrey's word ast=t1t2...t2n. Then, if Yaroslav choose numberkduring his move, then he is going to write out characterskon the piece of paper. Similarly, if Andrey choose numberrduring his move, then he is going to write out charactertron the piece of paper.The game finishes when no player can make a move. After the game is over, Yaroslav makes some integer from the characters written on his piece of paper (Yaroslav can arrange these characters as he wants). Andrey does the same. The resulting numbers can contain leading zeroes. The person with the largest number wins. If the numbers are equal, the game ends with a draw.You are given two stringssandt. Determine the outcome of the game provided that Yaroslav and Andrey play optimally well.InputThe first line contains integern(1 ≤n≤ 106). The second line contains strings— Yaroslav's word. The third line contains stringt— Andrey's word.It is guaranteed that both words consist of2·ncharacters \"0\" and \"1\".OutputPrint \"First\", if both players play optimally well and Yaroslav wins. If Andrey wins, print \"Second\" and if the game ends with a draw, print \"Draw\". Print the words without the quotes.ExamplesInput201110001OutputFirstInput3110110001001OutputFirstInput3111000000111OutputDrawInput40101011000101101OutputFirstInput40110000010010011OutputSecond", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "71103f38", "template_md5": "35d339e4", "result": "Two players take turns choosing a number from 1 to $2n$. Each number corresponds to a section of a binary string. The player writes down the characters in that section.  \n\nThe game ends when no more numbers can be chosen.  \n\nThe players then form the largest possible integers from the characters they wrote down. The player with the larger integer wins. If the integers are equal, it's a draw.\n\nGiven two binary strings of length $2n$, determine the winner if both players play optimally."}, {"prompt_md5": "6b9ed1fc", "template_md5": "465699a0", "result": "Two players take turns choosing numbers from 1 to a given length. Each number corresponds to a character in their secret word. The first player to be unable to choose a number loses. The players then form the largest possible number from the characters they chose and the player with the larger number wins. Determine the winner assuming both players play optimally."}]}