{"uid": "294-B", "url": "https://codeforces.com/contest/294/problem/B", "tags": ["dp", " greedy"], "title": "294-B", "statement": "B. Shaass and Bookshelftime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutShaass hasnbooks. He wants to make a bookshelf for all his books. He wants the bookshelf's dimensions to be as small as possible. The thickness of thei-th book istiand its pages' width is equal towi. The thickness of each book is either1or2. All books have the same page heights.Shaass puts the books on the bookshelf in the following way. First he selects some of the books and put them vertically. Then he puts the rest of the books horizontally above the vertical books. The sum of the widths of the horizontal books must be no more than the total thickness of the vertical books. A sample arrangement of the books is depicted in the figure.Help Shaass to find the minimum total thickness of the vertical books that we can achieve.InputThe first line of the input contains an integern,(1 ≤n≤ 100). Each of the nextnlines contains two integerstiandwidenoting the thickness and width of thei-th book correspondingly, (1 ≤ti≤ 2, 1 ≤wi≤ 100).OutputOn the only line of the output print the minimum total thickness of the vertical books that we can achieve.ExamplesInput51 121 32 152 52 1Output5Input31 102 12 4Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ba0a6e38", "template_md5": "35d339e4", "result": "You are given $n$ books. Each book has a thickness ($t_i$) which is either 1 or 2, and a width ($w_i$).  \n\nYou want to arrange the books on a bookshelf in two ways:\n\n1. Some books are placed vertically.\n2. The remaining books are placed horizontally on top of the vertical books. The total width of the horizontal books must be less than or equal to the total thickness of the vertical books.\n\nFind the smallest possible total thickness of the vertical books. \n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), the number of books.\n* Each of the next $n$ lines contains two integers $t_i$ and $w_i$ representing the thickness and width of the $i$-th book (1 ≤ $t_i$ ≤ 2, 1 ≤ $w_i$ ≤ 100).\n\nOutput:\n\n* Print the minimum total thickness of the vertical books."}, {"prompt_md5": "208fd26f", "template_md5": "465699a0", "result": "You have a set of items, each with a thickness and a width. You need to divide the items into two groups: vertical and horizontal. The total width of the horizontal items must be less than or equal to the total thickness of the vertical items. Find the minimum total thickness of the vertical items."}]}