{"uid": "294-A", "url": "https://codeforces.com/contest/294/problem/A", "tags": ["implementation", " math"], "title": "294-A", "statement": "A. Shaass and Oskolstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutShaass has decided to hunt some birds. There arenhorizontal electricity wires aligned parallel to each other. Wires are numbered1tonfrom top to bottom. On each wire there are some oskols sitting next to each other. Oskol is the name of a delicious kind of birds in Shaass's territory. Supposed there areaioskols sitting on thei-th wire.Sometimes Shaass shots one of the birds and the bird dies (suppose that this bird sat at thei-th wire). Consequently all the birds on thei-th wire to the left of the dead bird get scared and jump up on the wire numberi- 1, if there exists no upper wire they fly away. Also all the birds to the right of the dead bird jump down on wire numberi+ 1, if there exists no such wire they fly away.Shaass has shotmbirds. You're given the initial number of birds on each wire, tell him how many birds are sitting on each wire after the shots.InputThe first line of the input contains an integern,(1 ≤n≤ 100). The next line contains a list of space-separated integersa1,a2, ...,an,(0 ≤ai≤ 100).The third line contains an integerm,(0 ≤m≤ 100). Each of the nextmlines contains two integersxiandyi. The integers mean that for thei-th time Shaass shoot theyi-th (from left) bird on thexi-th wire,(1 ≤xi≤n, 1 ≤yi). It's guaranteed there will be at leastyibirds on thexi-th wire at that moment.OutputOn thei-th line of the output print the number of birds on thei-th wire.ExamplesInput510 10 10 10 1052 53 132 121 134 6Output0125016Input32 4 112 2Output303", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d3234ba9", "template_md5": "35d339e4", "result": "There are $n$ wires arranged vertically. Initially, there are $a_i$ birds on the $i$-th wire. \n\nYou are given $m$ events, each event describes a bird being shot on a specific wire. The $j$-th event specifies that a bird on the $x_j$-th wire is shot.\n\nAfter each shot, all birds to the left of the shot bird on the same wire move to the wire above it (if it exists), and all birds to the right of the shot bird move to the wire below it (if it exists). Birds that have no wire to move to fly away.\n\nFor each wire, output the number of birds remaining on it after all the shots."}, {"prompt_md5": "c0e48858", "template_md5": "465699a0", "result": "You are given a number of horizontal lines. Each line has a number of birds on it.  You are also given a list of shots. Each shot specifies a line and a bird on that line to be removed. When a bird is removed, all birds to its left move to the line above it (if it exists), and all birds to its right move to the line below it (if it exists).  Output the number of birds on each line after all the shots have been made."}]}