{"uid": "295-E", "url": "https://codeforces.com/contest/295/problem/E", "tags": ["data structures"], "title": "295-E", "statement": "E. Yaroslav and Pointstime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYaroslav hasnpoints that lie on theOxaxis. The coordinate of the first point isx1, the coordinate of the second point isx2, ..., the coordinate of then-th point is —xn. Now Yaroslav wants to executemqueries, each of them is of one of the two following types:Move thepj-th point from positionxpjto positionxpj+dj. At that, it is guaranteed that after executing such query all coordinates of the points will be distinct.Count the sum of distances between all pairs of points that lie on the segment[lj,rj](lj≤rj). In other words, you should count the sum of:.Help Yaroslav.InputThe first line contains integern— the number of points(1 ≤n≤ 105). The second line contains distinct integersx1,x2, ...,xn— the coordinates of points(|xi| ≤ 109).The third line contains integerm— the number of queries(1 ≤m≤ 105). The nextmlines contain the queries. Thej-th line first contains integertj(1 ≤tj≤ 2)— the query type. Iftj= 1, then it is followed by two integerspjanddj(1 ≤pj≤n, |dj| ≤ 1000). Iftj= 2, then it is followed by two integersljandrj( - 109≤lj≤rj≤ 109).It is guaranteed that at any moment all the points have distinct coordinates.OutputFor each type 2 query print the answer on a single line. Print the answers in the order, in which the queries follow in the input.Please, do not use the%lldspecifier to read or write 64-bit integers inC++. It is preferred to use thecin,coutstreams of the%I64dspecifier.ExamplesInput836 50 28 -75 40 -60 -95 -48202 -61 291 5 -531 1 4291 5 1302 -101 -712 -69 531 1 4041 5 5182 -101 532 50 8721 1 -2072 -99 -401 7 -3891 6 -1711 2 4641 7 -7071 1 -7301 1 5602 635 6441 7 -677Output17620406104616381560", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cdba485a", "template_md5": "35d339e4", "result": "You are given $n$ points on the x-axis with coordinates $x_1, x_2, ..., x_n$. You will perform $m$ queries. \n\nThere are two types of queries:\n\n* **Type 1:** Move the $p_j$-th point from position $x_{p_j}$ to position $x_{p_j} + d_j$.  It is guaranteed that after each query, all coordinates of the points will be distinct.\n* **Type 2:**  For a given segment $[l_j, r_j]$, calculate the sum of distances between all pairs of points that lie within this segment.\n\nFor each Type 2 query, output the sum of distances."}, {"prompt_md5": "fe537a57", "template_md5": "465699a0", "result": "You are given a set of points on a number line. You can perform two types of operations:\n\n1. Move a point to a new position.\n2. Calculate the sum of distances between all pairs of points within a given range on the number line.\n\nFor each range query, output the sum of distances."}]}