{"uid": "296-B", "url": "https://codeforces.com/contest/296/problem/B", "tags": ["combinatorics", " dp"], "title": "296-B", "statement": "B. Yaroslav and Two Stringstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYaroslav thinks that two stringssandw, consisting of digits and having lengthnare non-comparable if there are two numbers,iandj(1 ≤i,j≤n), such thatsi>wiandsj<wj. Here signsirepresents thei-th digit of strings, similarly,wjrepresents thej-th digit of stringw.A string's template is a string that consists of digits and question marks (\"?\").Yaroslav has two string templates, each of them has lengthn. Yaroslav wants to count the number of ways to replace all question marks by some integers in both templates, so as to make the resulting strings incomparable. Note that the obtained strings can contain leading zeroes and that distinct question marks can be replaced by distinct or the same integers.Help Yaroslav, calculate the remainder after dividing the described number of ways by1000000007(109+ 7).InputThe first line contains integern(1 ≤n≤ 105)— the length of both templates. The second line contains the first template — a string that consists of digits and characters \"?\". The string's length equalsn. The third line contains the second template in the same format.OutputIn a single line print the remainder after dividing the answer to the problem by number1000000007(109+ 7).ExamplesInput29009Output1Input21155Output0Input5??????????Output993531194NoteThe first test contains no question marks and both strings are incomparable, so the answer is1.The second test has no question marks, but the given strings are comparable, so the answer is0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7d1ef19b", "template_md5": "35d339e4", "result": "You are given two strings, each of length $n$, consisting of digits and question marks (\"?\").  \n\nA string is considered \"incomparable\" to another string if there exist two indices $i$ and $j$ (where $1 \\le i, j \\le n$) such that the $i$-th digit of the first string is greater than the $i$-th digit of the second string, and the $j$-th digit of the first string is less than the $j$-th digit of the second string.\n\nYour task is to determine the number of ways to replace all the question marks in both strings with digits (0-9) such that the resulting strings are incomparable.  The order of digits in each string matters.  \n\nOutput the remainder when this number of ways is divided by $10^9 + 7$."}, {"prompt_md5": "40699819", "template_md5": "465699a0", "result": "You are given two strings of equal length, each containing digits and question marks.  \n\nYou need to figure out how many ways you can fill in the question marks with digits so that the resulting strings are not comparable. Two strings are not comparable if there are two pairs of positions where the digits in the first string are in different orders than the digits in the second string at those same positions. \n\nThe answer should be the remainder when the number of ways to fill in the question marks is divided by 1000000007."}]}