{"uid": "297-E", "url": "https://codeforces.com/contest/297/problem/E", "tags": ["data structures"], "title": "297-E", "statement": "E. Mystic Carvingstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe polar bears have discovered a gigantic circular piece of floating ice with some mystic carvings on it. There arenlines carved on the ice. Each line connects two points on the boundary of the ice (we call these pointsendpoints). The endpoints are numbered1, 2, ..., 2ncounter-clockwise along the circumference. No two lines share an endpoint.Now a group of 6 polar bears (Alice, Bob, Carol, Dave, Eve, Frank) are going to build caves on the endpoints. Each polar bear would build a cave and live in it. No two polar bears can build a cave on the same endpoints. Alice and Bob is a pair of superstitious lovers. They believe the lines are carved by aliens (or humans, which are pretty much the same thing to polar bears), and have certain spiritual power. Therefore they want to build their caves on two endpoints which are connected by a line. The same for Carol and Dave, Eve and Frank.Thedistancebetween two caves X and Y is defined as one plus minimum number of other caves one need to pass through in order to travel from X to Y along the boundary of the ice (endpoints without caves are not counted).To ensure fairness, the distances between the three pairs of lovers have to be the same (that is, the distance between Alice and Bob, the distance between Carol and Dave, and the distance between Eve and Frank are the same).The figures below show two different configurations, where the dots on the circle are the endpoints. The configuration on the left is not valid. Although each pair of lovers (A and B, C and D, E and F) is connected a line, the distance requirement is not satisfied. The distance between A and B is 2 (one can go from A to B in the clockwise direction passing through F). The distance between E and F is also 2. However, the distance between C and D is 1 (one can go from C to D in the counter-clockwise direction without passing through any other caves). The configuration on the right is valid. All three pairs have the same distance 1.Count the number of ways to build the caves under the requirements. Two configurations are considered the same if the same set of 6 endpoints are used.InputThe first line contains integern(3 ≤n≤ 105) — the number of lines.Each of the followingnlines contains two integersai,bi(1 ≤ai,bi≤ 2n), which means that there is a line carved on the ice connecting theai–th andbi–th endpoint.It's guaranteed that each endpoints touches exactly one line.OutputPrint the number of ways to build the caves.Please, do not write the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput45 41 26 78 3Output2Input81 72 43 95 116 810 1613 1514 12Output6NoteThe second sample corresponds to the figure in the problem statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5143efba", "template_md5": "35d339e4", "result": "You are given a circular shape with $n$ lines connecting its points. Each line connects two points on the boundary of the circle.  \n\nYou need to place 6 points on these boundary points, with the following rules:\n\n* No two points can be on the same line.\n* Points must be placed in pairs, and each pair must be connected by a line.\n\nThe distance between two points is defined as one plus the minimum number of other points you need to pass through to travel between them along the circle's boundary (points without points are not counted).\n\nThe distance between each pair of points must be the same.\n\nFind the number of ways to place the points according to these rules."}, {"prompt_md5": "c3798ffb", "template_md5": "465699a0", "result": "You are given a circular arrangement of points.  Some pairs of points are connected by lines.  You need to place 6 objects on the points so that:\n\n* Each pair of objects must be connected by a line.\n* The distance between each pair of objects is the same. \n\nThe distance between two objects is the minimum number of other objects you must pass through to travel between them along the circle.\n\nCount the number of ways to place the objects."}]}