{"uid": "297-A", "url": "https://codeforces.com/contest/297/problem/A", "tags": ["constructive algorithms"], "title": "297-A", "statement": "A. Parity Gametime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou are fishing with polar bears Alice and Bob. While waiting for the fish to bite, the polar bears get bored. They come up with a game. First Alice and Bob each writes a 01-string (strings that only contain character \"0\" and \"1\")aandb. Then you try to turnaintobusing two types of operations:Writeparity(a)to the end ofa. For example,.Remove the first character ofa. For example,. You cannot perform this operation ifais empty.You can use as many operations as you want. The problem is, is it possible to turnaintob?Theparityof a 01-string is1if there is an odd number of \"1\"s in the string, and0otherwise.InputThe first line contains the stringaand the second line contains the stringb(1 ≤ |a|, |b| ≤ 1000). Both strings contain only the characters \"0\" and \"1\". Here|x|denotes the length of the stringx.OutputPrint \"YES\" (without quotes) if it is possible to turnaintob, and \"NO\" (without quotes) otherwise.ExamplesInput010110110OutputYESInput00111110OutputNONoteIn the first sample, the steps are as follows:01011 → 1011 → 011 → 0110", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6c0c37b5", "template_md5": "35d339e4", "result": "You are given two strings,  $a$ and $b$, each consisting only of \"0\"s and \"1\"s.  You can transform string $a$ into string $b$ using these operations:\n\n1. **Parity Operation:** Append the parity of string $a$ to the end of $a$. The parity of a string is 1 if it has an odd number of \"1\"s, and 0 if it has an even number of \"1\"s.\n2. **Remove First Character:** Remove the first character of $a$, but only if $a$ is not empty.\n\nDetermine if it is possible to transform $a$ into $b$ using these operations.  If it is possible, output \"YES\"; otherwise, output \"NO\"."}, {"prompt_md5": "28f9c284", "template_md5": "465699a0", "result": "Given two strings of 0s and 1s, determine if you can transform the first string into the second string by repeatedly performing two operations:\n\n1. Append the parity (number of 1s) of the current string to the end.\n2. Remove the first character of the string."}]}