{"uid": "298-B", "url": "https://codeforces.com/contest/298/problem/B", "tags": ["brute force", " greedy", " implementation"], "title": "298-B", "statement": "B. Sailtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe polar bears are going fishing. They plan to sail from(sx,sy)to(ex,ey). However, the boat can only sail by wind. At each second, the wind blows in one of these directions: east, south, west or north. Assume the boat is currently at(x,y).If the wind blows to the east, the boat will move to(x+ 1,y).If the wind blows to the south, the boat will move to(x,y- 1).If the wind blows to the west, the boat will move to(x- 1,y).If the wind blows to the north, the boat will move to(x,y+ 1).Alternatively, they can hold the boat by the anchor. In this case, the boat stays at(x,y). Given the wind direction fortseconds, what is the earliest time they sail to(ex,ey)?InputThe first line contains five integerst,sx,sy,ex,ey(1 ≤t≤ 105,  - 109≤sx,sy,ex,ey≤ 109). The starting location and the ending location will be different.The second line containstcharacters, thei-th character is the wind blowing direction at thei-th second. It will be one of the four possibilities: \"E\" (east), \"S\" (south), \"W\" (west) and \"N\" (north).OutputIf they can reach(ex,ey)withintseconds, print the earliest time they can achieve it. Otherwise, print \"-1\" (without quotes).ExamplesInput5 0 0 1 1SESNWOutput4Input10 5 3 3 6NENSWESNEEOutput-1NoteIn the first sample, they can stay at seconds1,3, and move at seconds2,4.In the second sample, they cannot sail to the destination.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5daac5fb", "template_md5": "35d339e4", "result": "You are given a starting point $(s_x, s_y)$ and an ending point $(e_x, e_y)$.  A boat can move one unit in four directions: east ($+1$ in the x-coordinate), south ($-1$ in the y-coordinate), west ($-1$ in the x-coordinate), or north ($+1$ in the y-coordinate).  The boat can also stay in place.\n\nYou are given a sequence of $t$ wind directions, where each direction is represented by a letter: 'E', 'S', 'W', or 'N'.  The $i$-th letter represents the wind direction at the $i$-th second.\n\nDetermine the earliest time the boat can reach the ending point $(e_x, e_y)$  given the wind directions. If it is impossible to reach the destination within $t$ seconds, output -1."}, {"prompt_md5": "23b5230d", "template_md5": "465699a0", "result": "Given a starting point and an ending point on a grid, and a sequence of wind directions, determine the earliest time it takes to reach the ending point. The boat can move one unit in the direction of the wind each second, or stay still."}]}