{"uid": "298-A", "url": "https://codeforces.com/contest/298/problem/A", "tags": ["greedy", " implementation"], "title": "298-A", "statement": "A. Snow Footprintstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThere is a straight snowy road, divided intonblocks. The blocks are numbered from 1 tonfrom left to right. If one moves from thei-th block to the(i+ 1)-th block, he will leave a right footprint on thei-th block. Similarly, if one moves from thei-th block to the(i- 1)-th block, he will leave a left footprint on thei-th block. If there already is a footprint on thei-th block, the new footprint will cover the old one.At the beginning, there were no footprints. Then polar bear Alice starts from thes-th block, makes a sequence of moves and ends in thet-th block. It is known that Alice never moves outside of the road.You are given the description of Alice's footprints. Your task is to find a pair of possible values ofs,tby looking at the footprints.InputThe first line of the input contains integern(3 ≤n≤ 1000).The second line contains the description of the road — the string that consists ofncharacters. Each character will be either \".\" (a block without footprint), or \"L\" (a block with a left footprint), \"R\" (a block with a right footprint).It's guaranteed that the given string contains at least one character not equal to \".\". Also, the first and the last character will always be \".\". It's guaranteed that a solution exists.OutputPrint two space-separated integers — the values ofsandt. If there are several possible solutions you can print any of them.ExamplesInput9..RRLL...Output3 4Input11.RRRLLLLL..Output7 5NoteThe first test sample is the one in the picture.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b3f7efc1", "template_md5": "35d339e4", "result": "You are given a road represented by a string of characters. Each character can be:\n\n* \".\" : an empty block\n* \"L\" : a block with a left footprint\n* \"R\" : a block with a right footprint\n\nThe road has $n$ blocks ($3 \\le n \\le 1000$). The first and last blocks are always empty.\n\nYou know that someone started at a block and walked along the road, leaving footprints.  Your task is to find the starting block ($s$) and the ending block ($t$) of this walk based on the footprint pattern. \n\n**Input:**\n\n* The first line contains the number of blocks, $n$.\n* The second line contains the description of the road.\n\n**Output:**\n\n* Print two space-separated integers, $s$ and $t$, representing the starting and ending blocks."}, {"prompt_md5": "6643e377", "template_md5": "465699a0", "result": "You are given a sequence of footprints on a line. Some footprints are left-facing (\"L\") and some are right-facing (\"R\").  Find the starting and ending positions of a path that created these footprints."}]}