{"uid": "30-E", "url": "https://codeforces.com/contest/30/problem/E", "tags": ["binary search", " constructive algorithms", " data structures", " greedy", " hashing", " strings"], "title": "30-E", "statement": "E. Tricky and Clever Passwordtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn his very young years the hero of our story, king Copa, decided that his private data was hidden not enough securely, what is unacceptable for the king. That's why he invented tricky and clever password (later he learned that his password is a palindrome of odd length), and coded all his data using it.Copa is afraid to forget his password, so he decided to write it on a piece of paper. He is aware that it is insecure to keep password in such way, so he decided to cipher it the following way: he cutxcharacters from the start of his password and from the end of it (xcan be0, and2xis strictly less than the password length). He obtained 3parts of the password. Let's call itprefix,middleandsuffixcorrespondingly, bothprefixandsuffixhaving equal length andmiddlealways having odd length. From these parts he made a stringA+prefix+B+middle+C+suffix, whereA,BandCare some (possibly empty) strings invented by Copa, and «+» means concatenation.Many years have passed, and just yesterday the king Copa found the piece of paper where his ciphered password was written. The password, as well as the stringsA,BandC, was completely forgotten by Copa, so he asks you to find a password of maximum possible length, which could be invented, ciphered and written by Copa.InputThe input contains single string of small Latin letters with length from1to105characters.OutputThe first line should contain integerk— amount ofnonempty parts of the passwordin your answer (). In each of the followingklines output two integersxiandli— start and length of the corresponding part of the password. Output pairs in order of increasingxi. Separate the numbers in pairs by a single space.Starting positionxishould be an integer from1to the length of the input string. Alllimust be positive, because you should output only non-empty parts. The middle part must have odd length.If there are several solutions, output any. Note that your goal is to maximize the sum ofli, but not to maximizek.ExamplesInputabacabaOutput11 7InputaxbyaOutput31 12 15 1InputxabyczbaOutput32 24 17 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e78ab11c", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters. This string represents a ciphered password. The password was created by:\n\n1. Cutting $x$ characters from the beginning and end of the original password.\n2. Dividing the remaining password into three parts: a prefix, a middle part, and a suffix. The prefix and suffix have equal length, and the middle part has an odd length.\n3. Concatenating the string with three other strings (A, B, and C) in the following order: A + prefix + B + middle + C + suffix.\n\nYour task is to find the longest possible original password that could have been used to create this ciphered string. Output the length and starting position of each part of the original password. \n\n**Example:**\n\nInput: `abacaba`\n\nOutput:\n\n```\n1\n1 7\n```\n\nThis means the original password was 7 characters long, starting at position 1 in the input string."}, {"prompt_md5": "34e17cf9", "template_md5": "465699a0", "result": "You are given a string.  You need to divide it into three parts: a prefix, a middle part, and a suffix. The prefix and suffix must be of equal length, and the middle part must have an odd length.  Find the division that results in the longest total length of all three parts."}]}