{"uid": "300-D", "url": "https://codeforces.com/contest/300/problem/D", "tags": ["dp", " fft"], "title": "300-D", "statement": "D. Painting Squaretime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasily the bear has got a large square white table ofnrows andncolumns. The table has got a black border around this table.The example of the initial table atn= 5.Vasily the bear wants to paint his square table in exactlykmoves. Each move is sequence of actions:The bear chooses some square inside his table. At that the square must have a black border painted around it. Also, the square shouldn't contain a black cell. The number of cells in the square shouldn't be less than2.The bear chooses some row and some column inside the chosen square. Then he paints each cell of this row and this column inside the chosen square. After that the rectangles, formed by the square's border and the newly painted cells, must be squares of a non-zero area.An example of correct painting atn= 7 иk= 2.The bear already knows numbersnandk. Help him — find the number of ways to paint the square in exactlykmoves. Two ways to paint are called distinct if the resulting tables will differ in at least one cell. As the answer can be rather large, print the remainder after dividing it by7340033.InputThe first line contains integerq(1 ≤q≤ 105)— the number of test data.Each of the followingqlines contains two integersnandk(1 ≤n≤ 109, 0 ≤k≤ 1000)— the size of the initial table and the number of moves for the corresponding test.OutputFor each test from the input print the answer to the problem modulo7340033. Print the answers to the tests in the order in which the tests are given in the input.ExamplesInput81 01 13 03 12 02 13 27 2Output10111004NoteAll possible painting ways for the testn= 7andk= 2are:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5135a3e4", "template_md5": "35d339e4", "result": "You are given a square grid of size $n \\times n$ with a black border. You want to paint the grid in exactly $k$ moves. \n\nEach move consists of the following steps:\n\n1. Choose a square inside the grid that has a black border and contains no black cells. The square must have at least 2 cells.\n2. Choose a row and a column within the chosen square.\n3. Paint all the cells in that row and column within the chosen square.\n\nAfter each move, the resulting shapes formed by the border and the newly painted cells must be squares with a non-zero area.\n\nFind the number of distinct ways to paint the grid in exactly $k$ moves. Two ways are distinct if they result in different grids.  The answer can be large, so output the remainder after dividing by 7340033."}, {"prompt_md5": "e8341d81", "template_md5": "465699a0", "result": "You are given a square grid with a black border. You can paint a square inside the grid, then paint all cells in a chosen row and column within that square.  Find the number of ways to paint the entire grid in a specific number of moves."}]}