{"uid": "301-C", "url": "https://codeforces.com/contest/301/problem/C", "tags": ["constructive algorithms"], "title": "301-C", "statement": "C. Yaroslav and Algorithmtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYaroslav likes algorithms. We'll describe one of his favorite algorithms.The algorithm receives a string as the input. We denote this input string asa.The algorithm consists of some number of command. Сommand numberilooks either assi>>wi, or assi<>wi, wheresiandwiare some possibly empty strings of length at most7, consisting of digits and characters \"?\".At each iteration, the algorithm looks for a command with the minimum indexi, such thatsioccurs inaas a substring. If this command is not found the algorithm terminates.Let's denote the number of the found command ask. In stringathe first occurrence of the stringskis replaced by stringwk. If the found command at that had formsk>>wk, then the algorithm continues its execution and proceeds to the next iteration. Otherwise, the algorithm terminates.The value of stringaafter algorithm termination is considered to be the output of the algorithm.Yaroslav has a set ofnpositive integers, he needs to come up with his favorite algorithm that will increase each of the given numbers by one. More formally, if we consider each number as a string representing the decimal representation of the number, then being run on each of these strings separately, the algorithm should receive the output string that is a recording of the corresponding number increased by one.Help Yaroslav.InputThe first line contains integern(1 ≤n≤ 100)— the number of elements in the set. The nextnlines contains one positive integer each. All the given numbers are less than1025.OutputPrint the algorithm which can individually increase each number of the set. In thei-th line print the command numberiwithout spaces.Your algorithm will be launched for each of these numbers. The answer will be considered correct if:Each line will a correct algorithm command (see the description in the problem statement).The number of commands should not exceed50.The algorithm will increase each of the given numbers by one.To get a respond, the algorithm will perform no more than200iterations for each number.ExamplesInput21079Output10<>1179<>80", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2273ce7", "template_md5": "35d339e4", "result": "You are given a set of $n$ positive integers ($1 \\le n \\le 100$) less than $10^{25}$.  \n\nYou need to design an algorithm that takes each integer as input and outputs the integer increased by one.  \n\nThe algorithm works as follows:\n\n1. It takes a string as input.\n2. It has a list of commands, each command is in the form: \n   * `assi >> wi`  or \n   * `assi <> wi`\n   where `si` and `wi` are strings of length at most 7, consisting of digits and \"?\".\n3. The algorithm searches for the first command `si` that is a substring of the input string.\n4. If the command is found, it replaces the first occurrence of `si` in the input string with `wi`.\n   * If the command is of the form `assi >> wi`, the algorithm continues to the next iteration.\n   * If the command is of the form `assi <> wi`, the algorithm terminates.\n5. The algorithm terminates if no command is found.\n\nThe output of the algorithm is the modified string after termination.\n\n**Your task:**\n\nDesign an algorithm (a list of commands) that, when run on each of the given integers (treated as strings), will output the integer increased by one. \n\n**Constraints:**\n\n* The number of commands should not exceed 50.\n* The algorithm should not perform more than 200 iterations for each integer."}, {"prompt_md5": "f33f6c27", "template_md5": "465699a0", "result": "Given a list of numbers, design an algorithm that takes each number as input and outputs the number increased by one. The algorithm uses a set of commands that can replace parts of the input string based on specific patterns.  The commands have a limited number of iterations and must be designed to increment each number correctly."}]}