{"uid": "301-E", "url": "https://codeforces.com/contest/301/problem/E", "tags": ["dp"], "title": "301-E", "statement": "E. Yaroslav and Arrangementstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYaroslav calls an array ofrintegersa1,a2, ...,argood, if it meets the following conditions:|a1-a2| = 1, |a2-a3| = 1, ..., |ar- 1-ar| = 1, |ar-a1| = 1, at that.An array of integersb1,b2, ...,bris calledgreat, if it meets the following conditions:The elements in it do not decrease(bi≤bi+ 1).If the inequalities1 ≤r≤nand1 ≤bi≤mhold.If we can rearrange its elements and get at least one and at mostkdistinct good arrays.Yaroslav has three integersn,m,k. He needs to count the number of distinct great arrays. Help Yaroslav! As the answer may be rather large, print the remainder after dividing it by1000000007(109+ 7).Two arrays are considered distinct if there is a position in which they have distinct numbers.InputThe single line contains three integersn,m,k(1 ≤n,m,k≤ 100).OutputIn a single line print the remainder after dividing the answer to the problem by number1000000007(109+ 7).ExamplesInput1 1 1Output0Input3 3 3Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3403b125", "template_md5": "35d339e4", "result": "Given three integers $n$, $m$, and $k$, find the number of distinct arrays of length $n$ with elements from 1 to $m$ that meet the following conditions:\n\n1. The elements in the array do not decrease (each element is greater than or equal to the previous one).\n2. It is possible to rearrange the elements of the array to form at least one and at most $k$ \"good\" arrays.\n\nA \"good\" array is defined as an array where the absolute difference between consecutive elements is always 1. For example, [1, 2, 3] and [3, 2, 1] are both good arrays.\n\nThe answer should be the remainder when the number of distinct arrays is divided by $10^9 + 7$."}, {"prompt_md5": "8ad877ae", "template_md5": "465699a0", "result": "Given three numbers n, m, and k, count the number of sequences of length n containing numbers from 1 to m that meet certain conditions.  The sequences must be non-decreasing and can be rearranged to form a specific type of pattern. The number of distinct patterns that can be formed from the sequences must be between 1 and k.  The answer should be the remainder after dividing the count by 1000000007."}]}