{"uid": "303-D", "url": "https://codeforces.com/contest/303/problem/D", "tags": ["math", " number theory"], "title": "303-D", "statement": "D. Rotatable Numbertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBike is a smart boy who loves math very much. He invented a number called \"Rotatable Number\" inspired by142857.As you can see,142857is a magic number because any of its rotatings can be got by multiplying that number by1, 2, ..., 6(numbers from one to number's length). Rotating a number means putting its last several digit into first. For example, by rotating number12345you can obtain any numbers:12345, 51234, 45123, 34512, 23451. It's worth mentioning thatleading-zeroesare allowed. So both4500123and0123450can be obtained by rotating0012345. You can see why142857satisfies the condition. All of the6equations are under base10.142857·1 = 142857;142857·2 = 285714;142857·3 = 428571;142857·4 = 571428;142857·5 = 714285;142857·6 = 857142.Now, Bike has a problem. He extends \"Rotatable Number\" under any baseb. As is mentioned above,142857is a \"Rotatable Number\" under base10. Another example is0011under base 2. All of the4equations are under base2.0011·1 = 0011;0011·10 = 0110;0011·11 = 1001;0011·100 = 1100.So, he wants to find the largestb(1 <b<x)so that there is apositive\"Rotatable Number\" (leading-zeroes allowed) of lengthnunder baseb.Note that any time you multiply a rotatable number by numbers from 1 to its length you should get a rotating of that number.InputThe only line contains two space-separated integersn,x(1 ≤n≤ 5·106, 2 ≤x≤ 109).OutputPrint a single integer — the largestbyou found. If no suchbexists, print-1instead.ExamplesInput6 11Output10Input5 8Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bffc0715", "template_md5": "35d339e4", "result": "Given two integers $n$ and $x$ (where $1 \\le n \\le 5 \\times 10^6$ and $2 \\le x \\le 10^9$), find the largest base $b$ (where $1 < b < x$) such that there exists a positive integer of length $n$ in base $b$ that satisfies the following property:\n\nMultiplying the integer by each integer from 1 to its length (inclusive) results in all possible rotations of the original integer. \n\nIf no such base $b$ exists, print -1."}, {"prompt_md5": "f4bec996", "template_md5": "465699a0", "result": "Find the largest base (greater than 1 and less than a given number) where a positive number of a given length can be multiplied by numbers from 1 to its length to produce all its rotations. If no such base exists, print -1."}]}