{"uid": "303-E", "url": "https://codeforces.com/contest/303/problem/E", "tags": ["dp", " math", " probabilities"], "title": "303-E", "statement": "E. Random Rankingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutImagine a real contest or exam ofnparticipants. Every participant will get a particular score. We can predict the standings board more or less, if we do some statistics on their previous performance.Let's say the score of the participants will be uniformly distributed in interval[li,ri](the score can be a real number). Can you predict the standings board according to these data? In other words you should say for each participant the probability that he gets some fixed place in the scoreboard.The participants are sorted by increasing of their scores in the scoreboard. So, the participant with the largest score gets the last place.InputThe first line contains integern(1  ≤n≤ 80), showing how many participants we have. Each of the nextnlines contains our predictions, thei-th line contains a pair of integersli,ri(0 ≤li<ri≤ 109)as the distributed interval for participanti.Consider the participants numbered from1tonin some way.OutputOutput a distributed matrixaof ordern. The elementaijof the matrix is the probability that participantihas rankj.Your answer will considered correct if it has at most10- 6absolute or relative error.ExamplesInput21 64 9Output0.9200000000 0.0800.080 0.9200000000Input80 21 32 43 54 65 76 87 9Output0.875 0.125 0 0 0 0 0 00.125 0.750 0.125 0 0 0 0 00 0.125 0.750 0.125 0 0 0 00 0 0.125 0.750 0.125 0 0 00 0 0 0.125 0.750 0.125 0 00 0 0 0 0.125 0.750 0.125 00 0 0 0 0 0.125 0.750 0.1250 0 0 0 0 0 0.125 0.875NoteThe score probability distribution is continuous, which means, there is no possibility for a draw.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f468a77c", "template_md5": "465699a0", "result": "You are given the possible score ranges for each of *n* contestants in a competition.  Predict the probability of each contestant getting a specific rank in the competition.  The scores are distributed evenly within their given ranges."}, {"prompt_md5": "cd3a2616", "template_md5": "35d339e4", "result": "You are given a competition with $n$ participants. Each participant's score is predicted to be uniformly distributed within a given interval $[l_i, r_i]$.  \n\nYour task is to calculate the probability that each participant will achieve a specific rank on the leaderboard. The leaderboard is sorted in ascending order of scores, with the highest score getting the last rank.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 80), representing the number of participants.\n* Each of the next $n$ lines contains two integers, $l_i$ and $r_i$ (0 ≤ $l_i$ < $r_i$ ≤ 10⁹), representing the lower and upper bounds of the score distribution for the $i$-th participant.\n\n**Output:**\n\n* Output an $n \\times n$ matrix $a$. \n* Each element $a_{ij}$ represents the probability that the $i$-th participant will achieve the $j$-th rank. \n\nYour answer will be considered correct if it has at most 10⁻⁶ absolute or relative error."}]}