{"uid": "305-A", "url": "https://codeforces.com/contest/305/problem/A", "tags": ["brute force", " constructive algorithms", " implementation"], "title": "305-A", "statement": "A. Strange Additiontime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutUnfortunately, Vasya can only sum pairs of integers (a,b), such that for any decimal place at least one number has digit0in this place. For example, Vasya can sum numbers505and50, but he cannot sum1and4.Vasya has a set ofkdistinct non-negative integersd1,d2, ...,dk.Vasya wants to choose some integers from this set so that he could sum any two chosen numbers. What maximal number of integers can he choose in the required manner?InputThe first input line contains integerk(1 ≤k≤ 100)— the number of integers.The second line containskdistinct space-separated integersd1,d2, ...,dk(0 ≤di≤ 100).OutputIn the first line print a single integernthe maximum number of the chosen integers. In the second line printndistinct non-negative integers — the required integers.If there are multiple solutions, print any of them. You can print the numbers in any order.ExamplesInput4100 10 1 0Output40 1 10 100Input32 70 3Output22 70", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c677e295", "template_md5": "35d339e4", "result": "You are given a set of $k$ distinct non-negative integers $d_1, d_2, ..., d_k$.  \n\nA person can only sum pairs of integers if at least one number in the pair has a digit of 0 in every decimal place. For example, they can sum 505 and 50, but not 1 and 4.\n\nWhat is the maximum number of integers the person can choose from the set so that they can sum any two chosen numbers according to the given rule? \n\nIf there are multiple solutions, print any one."}, {"prompt_md5": "d792373e", "template_md5": "465699a0", "result": "You are given a set of numbers.  You can only add two numbers together if at least one of them has a zero in the same decimal place. What is the largest number of numbers you can choose from the set so that you can add any two of them together?"}]}