{"uid": "309-C", "url": "https://codeforces.com/contest/309/problem/C", "tags": ["binary search", " bitmasks", " greedy"], "title": "309-C", "statement": "C. Memory for Arraystime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou get to work and turn on the computer. You start coding and give little thought to the RAM role in the whole process. In this problem your task is to solve one of the problems you encounter in your computer routine.We'll consider the RAM as a sequence of cells that can contain data. Some cells already contain some data, some are empty. The empty cells form the so-calledmemory clusters. Thus, a memory cluster is a sequence of some consecutive empty memory cells.You have exactlynmemory clusters, thei-th cluster consists ofaicells. You need to find memory formarrays in your program. Thej-th array takes2bjconsecutive memory cells. There possibly isn't enough memory for allmarrays, so your task is to determine what maximum number of arrays can be located in the available memory clusters. Of course, the arrays cannot be divided between the memory clusters. Also, no cell can belong to two arrays.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 106). The next line containsnintegersa1,a2, ...,an(1 ≤ai≤ 109). The next line containsmintegersb1,b2, ...,bm(1 ≤ 2bi≤ 109).OutputPrint a single integer — the answer to the problem.ExamplesInput5 38 4 3 2 23 2 2Output2Input10 61 1 1 1 1 1 1 1 1 10 0 0 0 0 0Output6NoteIn the first example you are given memory clusters with sizes 8, 4, 3, 2, 2 and arrays with sizes 8, 4, 4. There are few ways to obtain an answer equals 2: you can locate array with size 8 to the cluster with size 8, and one of the arrays with size 4 to the cluster with size 4. Another way is to locate two arrays with size 4 to the one cluster with size 8.In the second example you are given 10 memory clusters with size 1 and 6 arrays with size 1. You can choose any 6 clusters and locate all given arrays to them.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7278e400", "template_md5": "35d339e4", "result": "You are given $n$ memory clusters, where the $i$-th cluster has $a_i$ empty cells. You also have $m$ arrays, where the $j$-th array requires $2b_j$ consecutive cells. \n\nFind the maximum number of arrays that can be placed in the memory clusters without overlapping.  Each array must be placed entirely within a single cluster. \n\n**Input:**\n\n* The first line contains two integers $n$ and $m$ ($1 \\le n, m \\le 10^6$).\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le 10^9$), representing the sizes of the memory clusters.\n* The third line contains $m$ integers $b_1, b_2, ..., b_m$ ($1 \\le 2b_j \\le 10^9$), representing the sizes of the arrays.\n\n**Output:**\n\n* Print a single integer, the maximum number of arrays that can be placed."}, {"prompt_md5": "298221c3", "template_md5": "465699a0", "result": "You have a number of memory blocks of different sizes. You also have a number of arrays that each require a certain number of consecutive memory blocks. Find the maximum number of arrays you can fit into the memory blocks."}]}