{"uid": "309-D", "url": "https://codeforces.com/contest/309/problem/D", "tags": ["brute force", " geometry"], "title": "309-D", "statement": "D. Tennis Racketstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutProfessional sport is more than hard work. It also is the equipment, designed by top engineers. As an example, let's take tennis. Not only should you be in great shape, you also need an excellent racket! In this problem your task is to contribute to the development of tennis and to help to design a revolutionary new concept of a racket!The concept is a triangular racket. Ant it should be not just any triangle, but a regular one. As soon as you've chosen the shape, you need to stretch the net. By the time you came the rocket hadnholes drilled on each of its sides. The holes divide each side into equaln+ 1parts. At that, themclosest to each apex holes on each side are made for better ventilation only and you cannot stretch the net through them. The next revolutionary idea as to stretch the net as obtuse triangles through the holes, so that for each triangle all apexes lay on different sides. Moreover, you need the net to be stretched along every possible obtuse triangle. That's where we need your help — help us to count the number of triangles the net is going to consist of.Two triangles are considered to be different if their pictures on the fixed at some position racket are different.InputThe first and the only input line contains two integersn,m.OutputPrint a single number — the answer to the problem.ExamplesInput3 0Output9Input4 0Output24Input10 1Output210Input8 4Output0NoteFor the following picturen= 8,m= 2. White circles are the holes for ventilation, red circles — holes for net stretching. One of the possible obtuse triangles is painted red.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e325f8ae", "template_md5": "35d339e4", "result": "You are given a regular triangle with $n$ sides.  Each side has $n+1$ holes, with the two holes closest to each apex being for ventilation and unusable.  \n\nYou need to stretch a net across the triangle using obtuse triangles formed by the remaining holes.  Each obtuse triangle must have its apexes on different sides of the main triangle.\n\nCount the total number of possible obtuse triangles that can be formed. \n\n**Input:**\n\nThe first and only line of input contains two integers, $n$ and $m$.\n\n**Output:**\n\nPrint a single integer representing the number of possible obtuse triangles."}, {"prompt_md5": "ace6aca6", "template_md5": "465699a0", "result": "You are given a triangle divided into equal sections by holes.  Some holes are unusable.  Count the number of obtuse triangles you can make using the remaining holes as vertices."}]}