{"uid": "313-D", "url": "https://codeforces.com/contest/313/problem/D", "tags": ["dp"], "title": "313-D", "statement": "D. Ilya and Roadstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutEverything is great about Ilya's city, except the roads. The thing is, the only ZooVille road is represented asnholes in a row. We will consider the holes numbered from 1 ton, from left to right.Ilya is really keep on helping his city. So, he wants to fix at leastkholes (perharps he can fix more) on a single ZooVille road.The city hasmbuilding companies, thei-th company needscimoney units to fix a road segment containing holes with numbers of at leastliand at mostri. The companies in ZooVille are very greedy, so, if they fix a segment containing some already fixed holes, they do not decrease the price for fixing the segment.Determine the minimum money Ilya will need to fix at leastkholes.InputThe first line contains three integersn,m,k(1 ≤n≤ 300, 1 ≤m≤ 105, 1 ≤k≤n). The nextmlines contain the companies' description. Thei-th line contains three integersli,ri,ci(1 ≤li≤ri≤n, 1 ≤ci≤ 109).OutputPrint a single integer — the minimum money Ilya needs to fix at leastkholes.If it is impossible to fix at leastkholes, print-1.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput10 4 67 9 116 9 137 7 73 5 6Output17Input10 7 13 4 158 9 85 6 89 10 61 4 21 4 108 10 13Output2Input10 1 95 10 14Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c9fbc671", "template_md5": "35d339e4", "result": "There is a road with $n$ holes numbered from 1 to $n$.  You need to fix at least $k$ holes. There are $m$ companies that can fix sections of the road. The $i$-th company charges $c_i$ money to fix holes numbered from $l_i$ to $r_i$.  A company will not reduce its price if it fixes holes that are already fixed.\n\nFind the minimum amount of money needed to fix at least $k$ holes. If it is impossible to fix at least $k$ holes, output -1."}, {"prompt_md5": "ff33a56b", "template_md5": "465699a0", "result": "You have a road with a certain number of segments.  Each segment can be fixed by a different company at a different cost. You need to fix at least a given number of segments. Find the minimum total cost to do this. If it's impossible to fix that many segments, output -1."}]}