{"uid": "313-C", "url": "https://codeforces.com/contest/313/problem/C", "tags": ["constructive algorithms", " greedy", " implementation", " sortings"], "title": "313-C", "statement": "C. Ilya and Matrixtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIlya is a very good-natured lion. He likes maths. Of all mathematical objects, his favourite one is matrices. Now he's faced a complicated matrix problem he needs to solve.He's got a square2n× 2n-sized matrix and4nintegers. You need to arrange all these numbers in the matrix (put each number in a single individual cell) so that thebeautyof the resulting matrix with numbers is maximum.Thebeautyof a2n× 2n-sized matrix is an integer, obtained by the following algorithm:Find the maximum element in the matrix. Let's denote it asm.Ifn= 0, then the beauty of the matrix equalsm. Otherwise, a matrix can be split into 4 non-intersecting2n- 1× 2n- 1-sized submatrices, then the beauty of the matrix equals the sum of numbermand other four beauties of the described submatrices.As you can see, the algorithm is recursive.Help Ilya, solve the problem and print the resulting maximum beauty of the matrix.InputThe first line contains integer4n(1 ≤ 4n≤ 2·106). The next line contains4nintegersai(1 ≤ai≤ 109)— the numbers you need to arrange in the2n× 2n-sized matrix.OutputOn a single line print the maximum value of the beauty of the described matrix.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput113Output13Input41 2 3 4Output14NoteConsider the second sample. You need to arrange the numbers in the matrix as follows:1 23 4Then the beauty of the matrix will equal: 4 + 1 + 2 + 3 + 4 = 14.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "20fb62e7", "template_md5": "35d339e4", "result": "You are given a square matrix of size $2n \\times 2n$ and $4n$ integers. You need to arrange these integers into the matrix in a way that maximizes the \"beauty\" of the matrix.\n\nThe beauty of a matrix is calculated as follows:\n\n* If the matrix size is $1 \\times 1$ (i.e., $n=0$), the beauty is the single element in the matrix.\n* Otherwise, the matrix can be divided into four smaller $2n-1 \\times 2n-1$ matrices. The beauty of the larger matrix is the sum of the maximum element in the larger matrix and the beauty of the four smaller matrices.\n\nFind the maximum possible beauty of the matrix."}, {"prompt_md5": "2cd5a5a6", "template_md5": "465699a0", "result": "You are given a square matrix of size 2n x 2n and 4n numbers.  Arrange the numbers in the matrix. The beauty of the matrix is calculated recursively:\n\n* If the matrix is 1x1, the beauty is the single number in the matrix.\n* Otherwise, divide the matrix into four smaller 2n-1 x 2n-1 matrices. The beauty of the larger matrix is the largest number in the larger matrix plus the beauty of the four smaller matrices.\n\nFind the maximum possible beauty of the matrix."}]}