{"uid": "314-E", "url": "https://codeforces.com/contest/314/problem/E", "tags": ["dp"], "title": "314-E", "statement": "E. Sereja and Squarestime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSereja paintednpoints on the plane, point numberi(1 ≤i≤n)has coordinates(i, 0). Then Sereja marked each point with a small or large English letter. Sereja don't like letter \"x\", so he didn't use it to mark points. Sereja thinks that the points are marked beautifully if the following conditions holds:all points can be divided into pairs so that each point will belong to exactly one pair;in each pair the point with the lesser abscissa will be marked with a small English letter and the point with the larger abscissa will be marked with the same large English letter;if we built a square on each pair, the pair's points will be the square's opposite points and the segment between them will be the square's diagonal, then among the resulting squares there won't be any intersecting or touching ones.Little Petya erased some small and all large letters marking the points. Now Sereja wonders how many ways are there to return the removed letters so that the points were marked beautifully.InputThe first line contains integernthe number of points(1 ≤n≤ 105). The second line contains a sequence consisting ofnsmall English letters and question marks — the sequence of letters, that mark points, in order of increasingx-coordinate of points. Question marks denote the points without letters (Petya erased them). It is guaranteed that the input string doesn't contain letter \"x\".OutputIn a single line print the answer to the problem modulo4294967296. If there is no way to return the removed letters, print number0.Please, do not write the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput4a???Output50Input4abc?Output0Input6abc???Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "63d2342a", "template_md5": "35d339e4", "result": "You are given $n$ points on the plane, each with coordinates $(i, 0)$ for $1 \\le i \\le n$.  Each point is marked with either a lowercase English letter or a question mark.  \n\nThe goal is to determine the number of ways to fill in the question marks with lowercase and uppercase English letters (excluding the letter \"x\") such that the following conditions are met:\n\n1.  Each point can be paired with exactly one other point.\n2.  In each pair, the point with the smaller x-coordinate is marked with a lowercase letter, and the point with the larger x-coordinate is marked with the same uppercase letter.\n3.  If you construct a square using each pair of points as opposite corners, no two squares intersect or touch.\n\nOutput the number of valid ways to fill in the letters, modulo $4294967296$. If no valid arrangement is possible, output $0$."}, {"prompt_md5": "55e2491e", "template_md5": "465699a0", "result": "You are given a sequence of points on a line.  Each point can have a small or capital letter.  You need to pair up the points so that:\n\n* Each point is in exactly one pair.\n* The point with the smaller position has a small letter, and the point with the larger position has the same capital letter.\n* The pairs form squares that don't overlap.\n\nSome letters have been erased.  Find how many ways you can fill in the erased letters to make the points beautiful."}]}