{"uid": "314-D", "url": "https://codeforces.com/contest/314/problem/D", "tags": ["binary search", " data structures", " geometry", " sortings", " two pointers"], "title": "314-D", "statement": "D. Sereja and Straight Linestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSereja placednpoints on a plane. Now Sereja wants to place on the plane two straight lines, intersecting at a right angle, so that one of the straight lines intersect theOxaxis at an angle of45degrees and the maximum distance from the points to the straight lines were minimum.In this problem we consider the distance between points(x1,y1)and(x2,y2)equal|x1-x2| + |y1-y2|. The distance between the point and the straight lines is the minimum distance from the point to some point belonging to one of the lines.Help Sereja, find the maximum distance from the points to the optimally located straight lines.InputThe first line contains integern(1 ≤n≤ 105). Nextnlines contain the coordinates of the lines. Thei-th line contains two integersxi,yi(|xi|, |yi| ≤ 109).OutputIn a single line print a real number — the answer to the problem. Your answer will be considered correct iff its absolute or relative error doesn't exceed10- 6.ExamplesInput40 02 00 22 2Output0.000000000000000Input41 00 12 11 2Output1.000000000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "67700529", "template_md5": "35d339e4", "result": "You are given $n$ points on a plane.  Find the two lines that intersect at a right angle, where one line intersects the x-axis at a 45-degree angle, such that the maximum distance from any of the points to either line is minimized.\n\nThe distance between two points $(x_1, y_1)$ and $(x_2, y_2)$ is calculated as $|x_1 - x_2| + |y_1 - y_2|$. The distance between a point and a line is the shortest distance from the point to any point on that line.\n\nOutput the maximum distance found."}, {"prompt_md5": "134b5f71", "template_md5": "465699a0", "result": "Place two lines that intersect at a right angle on a plane. One line must intersect the horizontal axis at a 45-degree angle. Find the smallest maximum distance between all given points and these lines.  The distance between a point and a line is the shortest distance to any point on that line."}]}