{"uid": "316-E3", "url": "https://codeforces.com/contest/316/problem/E3", "tags": ["data structures", " math"], "title": "316-E3", "statement": "E3. Summer Homeworktime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBy the age of three Smart Beaver mastered all arithmetic operations and got this summer homework from the amazed teacher:You are given a sequence of integersa1,a2, ...,an. Your task is to perform on itmconsecutive operations of the following type:For given numbersxiandviassign valuevito elementaxi.For given numbersliandriyou've got to calculate sum, wheref0=f1= 1and ati≥ 2:fi=fi- 1+fi- 2.For a group of three numbersliridiyou should increase valueaxbydifor allx(li≤x≤ri).Smart Beaver planned a tour around great Canadian lakes, so he asked you to help him solve the given problem.InputThe first line contains two integersnandm(1 ≤n,m≤ 2·105) — the number of integers in the sequence and the number of operations, correspondingly. The second line containsnintegersa1,a2, ...,an(0 ≤ai≤ 105). Then followmlines, each describes an operation. Each line starts with an integerti(1 ≤ti≤ 3) — the operation type:ifti= 1, then next follow two integersxivi(1 ≤xi≤n, 0 ≤vi≤ 105);ifti= 2, then next follow two integersliri(1 ≤li≤ri≤n);ifti= 3, then next follow three integersliridi(1 ≤li≤ri≤n, 0 ≤di≤ 105).The input limits for scoring30points are (subproblem E1):It is guaranteed thatndoes not exceed100,mdoes not exceed10000and there will be no queries of the3-rd type.The input limits for scoring70points are (subproblems E1+E2):It is guaranteed that there will be queries of the1-st and2-nd type only.The input limits for scoring100points are (subproblems E1+E2+E3):No extra limitations.OutputFor each query print the calculated sum modulo1000000000(109).ExamplesInput5 51 3 1 2 42 1 42 1 52 2 41 3 102 1 5Output1232850Input5 41 3 1 2 43 1 4 12 2 41 2 102 1 5Output1245", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8b707b65", "template_md5": "35d339e4", "result": "You are given a sequence of integers $a_1, a_2, ..., a_n$. You need to perform $m$ operations on this sequence. There are three types of operations:\n\n* **Type 1:**  Change the value of element $a_x$ to $v$.\n* **Type 2:** Calculate the sum of the sequence from index $l$ to $r$ (inclusive).\n* **Type 3:** Increase the value of each element from index $l$ to $r$ (inclusive) by $d$.\n\nAfter each operation of type 3, you need to output the calculated sum modulo $10^9$. \n\n**Input:**\n\n* The first line contains two integers $n$ and $m$ ($1 \\le n, m \\le 2 \\cdot 10^5$) - the number of integers in the sequence and the number of operations.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 \\le a_i \\le 10^5$).\n* The following $m$ lines describe the operations. Each line starts with an integer $t$ (1, 2, or 3) indicating the type of operation. \n    * If $t = 1$, the next two integers are $x$ and $v$ ($1 \\le x \\le n$, $0 \\le v \\le 10^5$).\n    * If $t = 2$, the next two integers are $l$ and $r$ ($1 \\le l \\le r \\le n$).\n    * If $t = 3$, the next three integers are $l$, $r$, and $d$ ($1 \\le l \\le r \\le n$, $0 \\le d \\le 10^5$).\n\n**Output:**\n\nFor each operation of type 2, print the calculated sum modulo $10^9$."}, {"prompt_md5": "5203cd6b", "template_md5": "465699a0", "result": "You are given a list of numbers. You need to perform a series of operations on the list:\n\n1. Change a specific number in the list to a new value.\n2. Calculate the sum of a range of numbers in the list.\n3. Increase a range of numbers in the list by a given value.\n\nAfter each operation, you need to output the result of a calculation modulo 1000000000."}]}