{"uid": "316-A2", "url": "https://codeforces.com/contest/316/problem/A2", "tags": ["math"], "title": "316-A2", "statement": "A2. Special Tasktime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutSpecial Agent Smart Beaver works in a secret research department of ABBYY. He's been working there for a long time and is satisfied with his job, as it allows him to eat out in the best restaurants and order the most expensive and exotic wood types there.The content special agent has got an important task: to get the latest research by British scientists on the English Language. These developments are encoded and stored in a large safe. The Beaver's teeth are strong enough, so the authorities assured that upon arriving at the place the beaver won't have any problems with opening the safe.And he finishes his aspen sprig and leaves for this important task. Of course, the Beaver arrived at the location without any problems, but alas. He can't open the safe with his strong and big teeth. At this point, the Smart Beaver get a call from the headquarters and learns that opening the safe with the teeth is not necessary, as a reliable source has sent the following information: the safe code consists of digits and has no leading zeroes. There also is a special hint, which can be used to open the safe. The hint is stringswith the following structure:ifsi= \"?\", then the digit that goesi-th in the safe code can be anything (between0to9, inclusively);ifsiis a digit (between0to9, inclusively), then it means that there is digitsion positioniin code;if the string contains letters from \"A\" to \"J\", then all positions with the same letters must contain the same digits and the positions with distinct letters must contain distinct digits.The length of the safe code coincides with the length of the hint.For example, hint \"?JGJ9\" has such matching safe code variants: \"51919\", \"55959\", \"12329\", \"93539\" and so on, and has wrong variants such as: \"56669\", \"00111\", \"03539\" and \"13666\".After receiving such information, the authorities change the plan and ask the special agents to work quietly and gently and not to try to open the safe by mechanical means, and try to find the password using the given hint.At a special agent school the Smart Beaver was the fastest in his platoon finding codes for such safes, but now he is not in that shape: the years take their toll ... Help him to determine the number of possible variants of the code to the safe, matching the given hint. After receiving this information, and knowing his own speed of entering codes, the Smart Beaver will be able to determine whether he will have time for tonight's show \"Beavers are on the trail\" on his favorite TV channel, or he should work for a sleepless night...InputThe first line contains strings— the hint to the safe code. Stringsconsists of the following characters:?, 0-9, A-J. It is guaranteed that the first character of stringsdoesn't equal to character0.The input limits for scoring 30 points are (subproblem A1):1 ≤ |s| ≤ 5.The input limits for scoring 100 points are (subproblems A1+A2):1 ≤ |s| ≤ 105.Here|s|means the length of strings.OutputPrint the number of codes that match the given hint.ExamplesInputAJOutput81Input1?AAOutput100", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6ab1fa51", "template_md5": "35d339e4", "result": "You are given a string $s$ representing a hint to a safe code. The string consists of the following characters:\n\n* `?`:  The digit at this position can be any number from 0 to 9.\n* Digits (0-9): The digit at this position must be the specific digit shown.\n* Letters (A-J): All positions with the same letter must have the same digit, and positions with different letters must have different digits.\n\nThe length of the safe code is the same as the length of the hint string.\n\nYour task is to determine the number of possible safe codes that match the given hint. \n\n\n**Example:**\n\nIf the hint is `?JGJ9`, then some possible safe codes are `51919`, `55959`, `12329`, and so on.  \n\n**Input:**\n\nThe first line contains the hint string $s$.\n\n**Output:**\n\nPrint the number of possible safe codes that match the hint."}, {"prompt_md5": "ae8e4181", "template_md5": "465699a0", "result": "Given a string of characters representing a code hint, find the number of possible codes that match the hint. The hint uses the following rules:\n\n* \"?\" means the digit can be anything from 0 to 9.\n* A digit means that digit is in that position.\n* Letters A-J mean that positions with the same letter must have the same digit, and positions with different letters must have different digits."}]}