{"uid": "316-D1", "url": "https://codeforces.com/contest/316/problem/D1", "tags": ["brute force", " dp"], "title": "316-D1", "statement": "D1. PE Lessontime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSmart Beaver decided to be not only smart, but also a healthy beaver! And so he began to attend physical education classes at school X. In this school, physical education has a very creative teacher. One of his favorite warm-up exercises is throwing balls. Students line up. Each one gets a single ball in the beginning. The balls are numbered from1ton(by the demand of the inventory commission).Figure 1. The initial position forn= 5.After receiving the balls the students perform the warm-up exercise. The exercise takes place in a few throws. For each throw the teacher chooses any two arbitrary different students who will participate in it. The selected students throw their balls to each other. Thus, after each throw the students remain in their positions, and the two balls are swapped.Figure 2. The example of a throw.In this case there was a throw between the students, who were holding the2-nd and the4-th balls. Since the warm-up has many exercises, each of them can only continue for little time. Therefore, for each student we know the maximum number of throws he can participate in. For this lessons maximum number of throws will be1or2.Note that after all phases of the considered exercise any ball can end up with any student. Smart Beaver decided to formalize it and introduced the concept of the \"ball order\". The ball order is a sequence ofnnumbers that correspond to the order of balls in the line. The first number will match the number of the ball of the first from the left student in the line, the second number will match the ball of the second student, and so on. For example, in figure2the order of the balls was (1,2,3,4,5), and after the throw it was (1,4,3,2,5). Smart beaver knows the number of students and for each student he knows the maximum number of throws in which he can participate. And now he is wondering: what is the number of distinct ways of ball orders by the end of the exercise.InputThe first line contains a single numbern— the number of students in the line and the number of balls. The next line contains exactlynspace-separated integers. Each number corresponds to a student in the line (thei-th number corresponds to thei-th from the left student in the line) and shows the number of throws he can participate in.The input limits for scoring 30 points are (subproblem D1):1 ≤n≤ 10.The input limits for scoring 70 points are (subproblems D1+D2):1 ≤n≤ 500.The input limits for scoring 100 points are (subproblems D1+D2+D3):1 ≤n≤ 1000000.OutputThe output should contain a single integer — the number of variants of ball orders after the warm up exercise is complete. As the number can be rather large, print it modulo1000000007(109+ 7).ExamplesInput51 2 2 1 2Output120Input81 2 2 1 2 1 1 2Output16800", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "05afa531", "template_md5": "35d339e4", "result": "There are $n$ students in a line, each holding a ball numbered from 1 to $n$.  In a warm-up exercise, the teacher pairs up any two different students and they swap balls.  Each student has a maximum number of times they can participate in this swap.  \n\nGiven the number of students ($n$) and the maximum number of swaps each student can make, find the number of unique possible arrangements of the balls at the end of the exercise.  The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "7167e362", "template_md5": "465699a0", "result": "You have a line of people, each with a maximum number of times they can swap objects with another person.  You need to find the number of unique arrangements of the objects after all the swaps are done."}]}