{"uid": "317-B", "url": "https://codeforces.com/contest/317/problem/B", "tags": ["brute force", " implementation"], "title": "317-B", "statement": "B. Antstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIt has been noted that if some ants are put in the junctions of the graphene integer lattice then they will act in the following fashion: every minute at each junction (x,y) containing at least four ants a group of four ants will be formed, and these four ants will scatter to the neighbouring junctions (x+ 1,y), (x- 1,y), (x,y+ 1), (x,y- 1) — one ant in each direction. No other ant movements will happen. Ants never interfere with each other.Scientists have put a colony ofnants into the junction (0, 0) and now they wish to know how many ants will there be at some given junctions, when the movement of the ants stops.InputFirst input line contains integersn(0 ≤n≤ 30000) andt(1 ≤t≤ 50000), wherenis the number of ants in the colony andtis the number of queries. Each of the nexttlines contains coordinates of a query junction: integersxi,yi(- 109≤xi,yi≤ 109). Queries may coincide.It is guaranteed that there will be a certain moment of time when no possible movements can happen (in other words, the process will eventually end).OutputPrinttintegers, one per line — the number of ants at the corresponding junctions when the movement of the ants stops.ExamplesInput1 30 10 00 -1Output010Input6 50 -20 -10 00 10 2Output01210NoteIn the first sample the colony consists of the one ant, so nothing happens at all.In the second sample the colony consists of 6 ants. At the first minute 4 ants scatter from (0, 0) to the neighbouring junctions. After that the process stops.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "76751ab5", "template_md5": "35d339e4", "result": "You are given a 2D grid. Initially, there are $n$ ants at the point $(0,0)$.  Every minute, any point with at least 4 ants will have 4 ants move to its four neighboring points (up, down, left, right).  \n\nYou are given $t$ queries, each asking for the number of ants at a specific point $(x,y)$ after the ant movement stops.\n\n**Input:**\n\n* Two integers $n$ and $t$ ($0 \\le n \\le 30000$, $1 \\le t \\le 50000$)\n* $t$ lines, each containing two integers $x_i$ and $y_i$ (-10^9 $\\le x_i, y_i \\le 10^9$) representing the query points.\n\n**Output:**\n\n* $t$ integers, one for each query, representing the number of ants at the corresponding point when the ant movement stops. \n\n\n\nLet me know if you'd like help with the algorithm to solve this!"}, {"prompt_md5": "f7330f05", "template_md5": "465699a0", "result": "You are given a number of ants starting at a specific point. Every minute, any point with at least four ants will send one ant to each of its four neighboring points.  You need to determine the number of ants at each given point after the movement stops."}]}