{"uid": "317-C", "url": "https://codeforces.com/contest/317/problem/C", "tags": ["constructive algorithms", " dfs and similar", " graphs", " trees"], "title": "317-C", "statement": "C. Balancetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA system ofnvessels with water is given. Several pairs of vessels are connected by tubes with transfusion mechanisms. One may transfer an integer amount of liters of water between two vessels connected by such tube (tube works in both directions). There might be multiple tubes between two vessels. Total number of tubes equalse. Volume of each vessel equalsvliters. Of course, the amount of the water in any vessel cannot exceedvliters in the process of transfusions.Given the initial amountsaiof water in the vessels and the desired amountsbifind a sequence of transfusions that deals with the task. Total number of transfusions must not exceed2·n2.InputFirst line of the input contains integersn,v,e(1 ≤n≤ 300,1 ≤v≤ 109,0 ≤e≤ 50000).Next two lines containnintegers each: initialaiand the desired amountsbiof water in corresponding vessels (0 ≤ai,bi≤v).Nextelines describe one tube each in the formatxy(1 ≤x,y≤n,x≠y) for a tube between vessels numberxandy. There might be multiple tubes between two vessels. You may assume that vessels are numbered from 1 tonin some way.OutputPrint \"NO\" (without quotes), if such sequence of transfusions does not exist.Otherwise print any suitable sequence in the following format. On the first line print the total number of transfusionsk(kshould not exceed2·n2). In the followingklines print transfusions in the formatxyd(transfusion ofdliters from the vessel numberxto the vessel numbery,xandymust be distinct). For all transfusionsdmust be a non-negative integer.ExamplesInput2 10 11 95 51 2Output12 1 4Input2 10 05 24 2OutputNOInput2 10 04 24 2Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e963019e", "template_md5": "35d339e4", "result": "You are given a system of $n$ vessels, each with a capacity of $v$ liters. Some vessels are connected by tubes that allow water to be transferred between them.  \n\nYou are given the initial amount of water in each vessel ($a_i$) and the desired amount of water in each vessel ($b_i$). \n\nYour task is to determine if it is possible to achieve the desired water amounts by transferring water between the vessels using the tubes.  The total number of water transfers you can make must not exceed $2n^2$.\n\nIf it is possible, output the minimum number of transfers required and a sequence of transfers describing how to achieve the desired amounts.  If it is not possible, output \"NO\".\n\n**Input:**\n\n* The first line contains three integers: $n$, $v$, and $e$ ($1 \\le n \\le 300$, $1 \\le v \\le 10^9$, $0 \\le e \\le 50000$).\n* The second line contains $n$ integers: $a_1$, $a_2$, ..., $a_n$ ($0 \\le a_i \\le v$).\n* The third line contains $n$ integers: $b_1$, $b_2$, ..., $b_n$ ($0 \\le b_i \\le v$).\n* The next $e$ lines each contain two integers: $x$ and $y$ ($1 \\le x, y \\le n$, $x \\neq y$), representing a tube connecting vessels $x$ and $y$.\n\n**Output:**\n\n* If it is possible to achieve the desired water amounts, output the minimum number of transfers $k$ followed by $k$ lines, each describing a transfer in the format $x y d$ (where $x$ and $y$ are the vessel numbers and $d$ is the amount of water transferred from vessel $x$ to vessel $y$).\n* If it is not possible, output \"NO\"."}, {"prompt_md5": "63333533", "template_md5": "465699a0", "result": "You have a system of containers with a fixed capacity. Each container starts with a certain amount of water. You can transfer water between connected containers.  Find a way to move the water so that each container ends up with a target amount. You can make a limited number of transfers. If it's impossible to achieve the target amounts, say so."}]}