{"uid": "319-B", "url": "https://codeforces.com/contest/319/problem/B", "tags": ["data structures", " implementation"], "title": "319-B", "statement": "B. Psychos in a Linetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThere arenpsychos standing in a line. Each psycho is assigned a unique integer from1ton. At each step every psycho who has an id greater than the psycho to his right (if exists) kills his right neighbor in the line. Note that a psycho might kill and get killed at the same step.You're given the initial arrangement of the psychos in the line. Calculate how many steps are needed to the moment of time such, that nobody kills his neighbor after that moment. Look notes to understand the statement more precise.InputThe first line of input contains integerndenoting the number of psychos,(1 ≤n≤ 105). In the second line there will be a list ofnspace separated distinct integers each in range1ton, inclusive — ids of the psychos in the line from left to right.OutputPrint the number of steps, so that the line remains the same afterward.ExamplesInput1010 9 7 8 6 5 3 4 2 1Output2Input61 2 3 4 5 6Output0NoteIn the first sample line of the psychos transforms as follows: [10 9 7 8 6 5 3 4 2 1]→[10 8 4]→[10]. So, there are two steps.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d0a86920", "template_md5": "35d339e4", "result": "You are given a line of $n$ people, each with a unique ID from 1 to $n$.  At each step, anyone with a higher ID than the person to their right will kill that person.  If a person is killed, they are removed from the line.\n\nYour task is to determine the minimum number of steps it takes for the line to stabilize, meaning no one kills anyone else in the next step."}, {"prompt_md5": "5c36f29a", "template_md5": "465699a0", "result": "You are given a line of numbered people. Each person with a higher number than the person to their right can eliminate that person.  This happens simultaneously.  Find the fewest steps it takes for no one to be able to eliminate anyone else."}]}