{"uid": "32-E", "url": "https://codeforces.com/contest/32/problem/E", "tags": ["geometry", " implementation"], "title": "32-E", "statement": "E. Hide-and-Seektime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVictor and Peter are playing hide-and-seek. Peter has hidden, and Victor is to find him. In the room where they are playing, there is only one non-transparent wall and one double-sided mirror. Victor and Peter are points with coordinates(xv,yv)and(xp,yp)respectively. The wall is a segment joining points with coordinates(xw, 1,yw, 1)and(xw, 2,yw, 2), the mirror — a segment joining points(xm, 1,ym, 1)and(xm, 2,ym, 2).If an obstacle has a common point with a line of vision, it's considered, that the boys can't see each other with this line of vision. If the mirror has a common point with the line of vision, it's considered, that the boys can see each other in the mirror, i.e. reflection takes place. The reflection process is governed by laws of physics — the angle of incidence is equal to the angle of reflection. The incident ray is in the same half-plane as the reflected ray, relative to the mirror. I.e. to see each other Victor and Peter should be to the same side of the line, containing the mirror (see example 1). If the line of vision is parallel to the mirror, reflection doesn't take place, and the mirror isn't regarded as an obstacle (see example 4).Victor got interested if he can see Peter, while standing at the same spot. Help him solve this problem.InputThe first line contains two numbersxvandyv— coordinates of Victor.The second line contains two numbersxpandyp— coordinates of Peter.The third line contains 4 numbersxw, 1,yw, 1,xw, 2,yw, 2— coordinates of the wall.The forth line contains 4 numbersxm, 1,ym, 1,xm, 2,ym, 2— coordinates of the mirror.All the coordinates are integer numbers, and don't exceed104in absolute value. It's guaranteed, that the segments don't have common points, Victor and Peter are not on any of the segments, coordinates of Victor and Peter aren't the same, the segments don't degenerate into points.OutputOutputYES, if Victor can see Peter without leaving the initial spot. Otherwise outputNO.ExamplesInput-1 31 30 2 0 40 0 0 1OutputNOInput0 01 10 1 1 0-100 -100 -101 -101OutputNOInput0 01 10 1 1 0-1 1 1 3OutputYESInput0 010 0100 100 101 1011 0 3 0OutputYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c4bd17ff", "template_md5": "35d339e4", "result": "Two points, A and B, are given in a 2D plane. There is a wall represented by a line segment and a mirror represented by another line segment.  \n\nDetermine if A can see B directly or through the mirror reflection, without moving from its position.\n\n**Rules:**\n\n*  A line of sight is blocked if it intersects with the wall.\n*  Reflection occurs at the mirror if the line of sight intersects the mirror. The angle of incidence equals the angle of reflection.\n*  For reflection to occur, A and B must be on the same side of the mirror's line.\n*  If the line of sight is parallel to the mirror, reflection does not occur.\n\n\n**Input:**\n\n* Coordinates of point A ($x_A$, $y_A$)\n* Coordinates of point B ($x_B$, $y_B$)\n* Coordinates of the wall's endpoints ($x_w1$, $y_w1$, $x_w2$, $y_w2$)\n* Coordinates of the mirror's endpoints ($x_m1$, $y_m1$, $x_m2$, $y_m2$)\n\n**Output:**\n\n* \"YES\" if A can see B, \"NO\" otherwise."}, {"prompt_md5": "efcbb8fb", "template_md5": "465699a0", "result": "Two points are given in a 2D plane. There is a wall and a mirror in the plane. Determine if the two points can see each other, considering reflections in the mirror."}]}