{"uid": "320-B", "url": "https://codeforces.com/contest/320/problem/B", "tags": ["dfs and similar", " graphs"], "title": "320-B", "statement": "B. Ping-Pong (Easy Version)time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn this problem at each moment you have a set of intervals. You can move from interval(a,b)from our set to interval(c,d)from our set if and only ifc<a<dorc<b<d. Also there is a path from intervalI1from our set to intervalI2from our set if there is a sequence of successive moves starting fromI1so that we can reachI2.Your program should handle the queries of the following two types:\"1 x y\"(x<y)— add the new interval(x,y)to the set of intervals. The length of the new interval is guaranteed to be strictly greater than all the previous intervals.\"2 a b\"(a≠b)— answer the question: is there a path froma-th (one-based) added interval tob-th (one-based) added interval?Answer all the queries. Note, that initially you have an empty set of intervals.InputThe first line of the input contains integerndenoting the number of queries,(1 ≤n≤ 100). Each of the following lines contains a query as described above. All numbers in the input are integers and don't exceed109by their absolute value.It's guaranteed that all queries are correct.OutputFor each query of the second type print \"YES\" or \"NO\" on a separate line depending on the answer.ExamplesInput51 1 51 5 112 1 21 2 92 1 2OutputNOYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1b729968", "template_md5": "35d339e4", "result": "You are given a set of intervals.  You can move from one interval to another if the start of the second interval is less than the end of the first interval, and the end of the second interval is greater than the start of the first interval.\n\nYou will be given queries of two types:\n\n1. **Add a new interval:** You will be given two numbers,  $x$ and $y$ ($x < y$), representing a new interval ($x$, $y$). This interval will be added to the set.\n2. **Check for a path:** You will be given two numbers, $a$ and $b$ ($a \\neq b$), representing two intervals in the set. You need to determine if there is a path from the $a$-th interval to the $b$-th interval.\n\nFor each query of the second type, output \"YES\" if there is a path, and \"NO\" otherwise. \n\n\nInitially, the set of intervals is empty."}, {"prompt_md5": "1e226f94", "template_md5": "465699a0", "result": "You are given a list of intervals. You can move from one interval to another if the second interval starts before the first interval ends.  \n\nYou need to determine if there is a path between two given intervals."}]}