{"uid": "322-A", "url": "https://codeforces.com/contest/322/problem/A", "tags": ["greedy"], "title": "322-A", "statement": "A. Ciel and Dancingtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutFox Ciel and her friends are in a dancing room. There arenboys andmgirls here, and they never danced before. There will be some songs, during each song, there must be exactly one boy and one girl are dancing. Besides, there is a special rule:either the boy in the dancing pair must dance for the first time (so, he didn't dance with anyone before);or the girl in the dancing pair must dance for the first time.Help Fox Ciel to make a schedule that they can dance as many songs as possible.InputThe first line contains two integersnandm(1 ≤n,m≤ 100) — the number of boys and girls in the dancing room.OutputIn the first line printk— the number of songs during which they can dance. Then in the followingklines, print the indexes of boys and girls dancing during songs chronologically. You can assume that the boys are indexed from 1 ton, and the girls are indexed from 1 tom.ExamplesInput2 1Output21 12 1Input2 2Output31 11 22 2NoteIn test case 1, there are 2 boys and 1 girl. We can have 2 dances: the 1st boy and 1st girl (during the first song), the 2nd boy and 1st girl (during the second song).And in test case 2, we have 2 boys with 2 girls, the answer is 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "64a67ca8", "template_md5": "35d339e4", "result": "You are given $n$ boys and $m$ girls.  They want to dance in pairs, with one boy and one girl in each pair.  Each song requires one pair to dance.  There is a rule: either the boy or the girl in each pair must be dancing for the first time.\n\nFind the maximum number of songs they can dance, and list the boy and girl indices for each song. \n\nThe boys are numbered from 1 to $n$, and the girls are numbered from 1 to $m$."}, {"prompt_md5": "80be7bcd", "template_md5": "465699a0", "result": "You have a group of boys and a group of girls.  Each song requires one boy and one girl to dance.  A boy and girl can only dance together if one of them is dancing for the first time. Find the maximum number of songs that can be danced."}]}