{"uid": "323-A", "url": "https://codeforces.com/contest/323/problem/A", "tags": ["combinatorics", " constructive algorithms"], "title": "323-A", "statement": "A. Black-and-White Cubetime limit per test0.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are given a cube of sizek×k×k, which consists of unit cubes. Two unit cubes are considered neighbouring, if they have common face.Your task is to paint each ofk3unit cubes one of two colours (black or white), so that the following conditions must be satisfied:each white cube has exactly 2 neighbouring cubes of white color;each black cube has exactly 2 neighbouring cubes of black color.InputThe first line contains integerk(1 ≤k≤ 100), which is size of the cube.OutputPrint -1 if there is no solution. Otherwise, print the required painting of the cube consequently by layers. Print ak×kmatrix in the firstklines, showing how the first layer of the cube should be painted. In the followingklines print ak×kmatrix — the way the second layer should be painted. And so on to the lastk-th layer. Note that orientation of the cube in the space does not matter.Mark a white unit cube with symbol \"w\" and a black one with \"b\". Use the format of output data, given in the test samples. You may print extra empty lines, they will be ignored.ExamplesInput1Output-1Input2Outputbbwwbbww", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0504c5d6", "template_md5": "35d339e4", "result": "You are given a cube of size $k \\times k \\times k$.  You need to paint each of the $k^3$ unit cubes either black or white. The rules are:\n\n* Each white cube must have exactly two other white cubes as neighbors.\n* Each black cube must have exactly two other black cubes as neighbors.\n\nIf it's possible to paint the cube following these rules, output the painting layer by layer.  If it's not possible, output -1.\n\n**Output Format:**\n\n* For each layer of the cube, output a $k \\times k$ matrix.\n* Use \"w\" to represent a white cube and \"b\" to represent a black cube."}, {"prompt_md5": "8df023cf", "template_md5": "465699a0", "result": "You are given a cube made of smaller cubes.  You need to color each smaller cube either black or white so that each black cube has exactly two black neighbors, and each white cube has exactly two white neighbors.  If this is possible, show the coloring of the cube layer by layer. If it's not possible, say so."}]}