{"uid": "323-B", "url": "https://codeforces.com/contest/323/problem/B", "tags": ["constructive algorithms", " graphs"], "title": "323-B", "statement": "B. Tournament-graphtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIn this problem you have to build tournament graph, consisting ofnvertices, such, that for any oriented pair of vertices(v,u)(v≠u)there exists a path from vertexvto vertexuconsisting of no more then two edges.A directed graph without self-loops is atournament, if there is exactly one edge between any two distinct vertices (in one out of two possible directions).InputThe first line contains an integern(3 ≤n≤ 1000), the number of the graph's vertices.OutputPrint-1if there is no graph, satisfying the described conditions.Otherwise, printnlines withnintegers in each. The numbers should be separated with spaces. That is adjacency matrixaof the found tournament. Consider the graph vertices to be numbered with integers from1ton. Thenav,u= 0, if there is no edge fromvtou, andav,u= 1if there is one.As the output graph has to be a tournament, following equalities must be satisfied:av,u+au,v= 1for eachv,u(1 ≤v,u≤n;v≠u);av,v= 0for eachv(1 ≤v≤n).ExamplesInput3Output0 1 00 0 11 0 0Input4Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b48b483d", "template_md5": "35d339e4", "result": "You are given an integer $n$ (3 ≤ $n$ ≤ 1000).  You need to create a directed graph with $n$ vertices that meets the following conditions:\n\n* For any two distinct vertices $v$ and $u$ (where $v \\neq u$), there must be a path from vertex $v$ to vertex $u$ with no more than two edges.\n* The graph cannot have any self-loops (an edge from a vertex to itself).\n\n**Output:**\n\n* If it's impossible to create such a graph, print \"-1\".\n* Otherwise, print an $n \\times n$ matrix representing the graph's adjacency matrix.  \n\n  *  The entry $a_{v,u}$ in the matrix should be:\n    * 0 if there is no edge from vertex $v$ to vertex $u$.\n    * 1 if there is an edge from vertex $v$ to vertex $u$.\n\n**Important:** The graph must be a tournament, meaning there is exactly one edge between any two distinct vertices (in one direction). This means the following must hold for all $v$ and $u$ (where $1 \\le v, u \\le n$ and $v \\neq u$):\n\n* $a_{v,u} + a_{u,v} = 1$\n* $a_{v,v} = 0$ for all $v$.\n\n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "e77553bc", "template_md5": "465699a0", "result": "You are given a number of points.  You need to connect these points with directed lines, where each pair of distinct points can be connected by at most two lines.  If it's impossible to do this, output -1. Otherwise, output a list of connections, where each line in the list represents a connection between two points."}]}