{"uid": "325-C", "url": "https://codeforces.com/contest/325/problem/C", "tags": ["dfs and similar", " graphs", " shortest paths"], "title": "325-C", "statement": "C. Monsters and Diamondstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPiegirl has found a monster and a book about monsters and pies. When she is reading the book, she found out that there arentypes of monsters, each with an ID between1andn. If you feed a pie to a monster, the monster will split into some number of monsters (possibly zero), and at least one colorful diamond. Monsters may be able to split in multiple ways.At the begining Piegirl has exactly one monster. She begins by feeding the monster a pie. She continues feeding pies to monsters until no more monsters are left. Then she collects all the diamonds that were created.You will be given a list of split rules describing the way in which the various monsters can split. Every monster can split in at least one way, and if a monster can split in multiple ways then each time when it splits Piegirl can choose the way it splits.For each monster, determine the smallest and the largest number of diamonds Piegirl can possibly collect, if initially she has a single instance of that monster. Piegirl has an unlimited supply of pies.InputThe first line contains two integers:mandn(1 ≤m,n≤ 105), the number of possible splits and the number of different monster types. Each of the followingmlines contains a split rule. Each split rule starts with an integer (a monster ID)mi(1 ≤mi≤n), and a positive integerliindicating the number of monsters and diamonds the current monster can split into. This is followed byliintegers, with positive integers representing a monster ID and-1representing a diamond.Each monster will have at least one split rule. Each split rule will have at least one diamond. The sum ofliacross all split rules will be at most105.OutputFor each monster, in order of their IDs, print a line with two integers: the smallest and the largest number of diamonds that can possibly be collected by starting with that monster. If Piegirl cannot possibly end up in a state without monsters, print-1for both smallest and the largest value. If she can collect an arbitrarily large number of diamonds, print-2as the largest number of diamonds.If any number in output exceeds314000000(but is finite), print314000000instead of that number.ExamplesInput6 41 3 -1 1 -11 2 -1 -12 3 -1 3 -12 3 -1 -1 -13 2 -1 -14 2 4 -1Output2 -23 42 2-1 -1Input3 21 2 1 -12 2 -1 -12 3 2 1 -1Output-1 -12 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3889a959", "template_md5": "35d339e4", "result": "There are $n$ types of monsters. Each monster type can split into a specific set of monsters and diamonds when fed a pie. You are given a list of rules describing how each monster type can split.\n\nFor each monster type, determine the minimum and maximum number of diamonds that can be collected starting with a single instance of that monster type.  \n\n* If a monster type can never be eliminated, output -1 for both minimum and maximum diamonds.\n* If a monster type can produce an unlimited number of diamonds, output -2 for the maximum diamonds.\n\n**Input:**\n\n* The first line contains two integers, $m$ and $n$ ($1 \\le m, n \\le 10^5$), representing the number of split rules and the number of monster types.\n* Each of the following $m$ lines describes a split rule:\n    * The first integer is the monster type ID ($1 \\le mi \\le n$).\n    * The second integer is the number of monsters and diamonds produced ($li$).\n    * The remaining integers represent the monster type IDs and -1 for diamonds.\n\n**Output:**\n\n* For each monster type, in order of their IDs, print a line with two integers: the minimum and maximum number of diamonds that can be collected."}, {"prompt_md5": "c14a3e2e", "template_md5": "465699a0", "result": "You are given a list of rules that describe how different types of creatures split when given a special item. Each creature can split into other creatures and a number of gems.  \n\nYour task is to determine the fewest and most gems that can be collected starting with a single instance of each creature type."}]}