{"uid": "327-D", "url": "https://codeforces.com/contest/327/problem/D", "tags": ["constructive algorithms", " dfs and similar", " graphs"], "title": "327-D", "statement": "D. Block Towertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAfter too much playing on paper, Iahub has switched to computer games. The game he plays is called \"Block Towers\". It is played in a rectangular grid withnrows andmcolumns (it containsn×mcells). The goal of the game is to build your own city. Some cells in the grid are big holes, where Iahub can't build any building. The rest of cells are empty. In some empty cell Iahub can build exactly one tower of two following types:Blue towers. Each has population limit equal to100.Red towers. Each has population limit equal to200. However, it can be built in some cell only if in that moment at least one of the neighbouring cells has a Blue Tower. Two cells are neighbours is they share a side.Iahub is also allowed to destroy a building from any cell. He can do this operation as much as he wants. After destroying a building, the other buildings are not influenced, and the destroyed cell becomes empty (so Iahub can build a tower in this cell if needed, see the second example for such a case).Iahub can convince as many population as he wants to come into his city. So he needs to configure his city to allow maximum population possible. Therefore he should find a sequence of operations that builds the city in an optimal way, so that total population limit is as large as possible.He says he's the best at this game, but he doesn't have the optimal solution. Write a program that calculates the optimal one, to show him that he's not as good as he thinks.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 500). Each of the nextnlines containsmcharacters, describing the grid. Thej-th character in thei-th line is '.' if you're allowed to build at the cell with coordinates(i,j)a tower (empty cell) or '#' if there is a big hole there.OutputPrint an integerkin the first line(0 ≤k≤ 106)— the number of operations Iahub should perform to obtain optimal result.Each of the followingklines must contain a single operation in the following format:«B x y»(1 ≤x≤n, 1 ≤y≤m)— building a blue tower at the cell(x,y);«R x y»(1 ≤x≤n, 1 ≤y≤m)— building a red tower at the cell(x,y);«D x y»(1 ≤x≤n, 1 ≤y≤m)— destroying a tower at the cell(x,y).If there are multiple solutions you can output any of them. Note, that you shouldn't minimize the number of operations.ExamplesInput2 3..#.#.Output4B 1 1R 1 2R 2 1B 2 3Input1 3...Output5B 1 1B 1 2R 1 3D 1 2R 1 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "790252d7", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$ cells. Some cells are blocked (represented by '#') and the rest are empty (represented by '.'). \n\nYou can build towers in empty cells. There are two types of towers:\n\n* **Blue towers:** Each has a population limit of 100.\n* **Red towers:** Each has a population limit of 200.\n\nA red tower can only be built if at least one of its neighboring cells (sharing a side) has a blue tower.\n\nYou can also destroy any existing tower.\n\nYour goal is to find the sequence of operations (building or destroying towers) that maximizes the total population limit of the city.\n\n**Input:**\n\n* The first line contains two integers $n$ and $m$ (the dimensions of the grid).\n* The next $n$ lines contain $m$ characters each, representing the grid.\n\n**Output:**\n\n* The first line contains an integer $k$ (the number of operations).\n* The next $k$ lines describe the operations, each in one of the following formats:\n    * `B x y`: Build a blue tower at cell $(x, y)$.\n    * `R x y`: Build a red tower at cell $(x, y)$.\n    * `D x y`: Destroy the tower at cell $(x, y)$."}, {"prompt_md5": "805e379e", "template_md5": "465699a0", "result": "You are given a grid of cells. Some cells are blocked, and the rest can be used to build towers. There are two types of towers: blue towers with a capacity of 100 and red towers with a capacity of 200. Red towers can only be built next to a blue tower.  \n\nYou can build and destroy towers as needed. Find the maximum number of towers you can build to maximize the total capacity."}]}