{"uid": "328-A", "url": "https://codeforces.com/contest/328/problem/A", "tags": ["implementation"], "title": "328-A", "statement": "A. IQ Testtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPetya is preparing for IQ test and he has noticed that there many problems like:you are given a sequence, find the next number.Now Petya can solve only problems with arithmetic or geometric progressions.Arithmetic progressionis a sequencea1,a1+d,a1+ 2d,...,a1+ (n- 1)d, wherea1anddare any numbers.Geometric progressionis a sequenceb1,b2=b1q,...,bn=bn- 1q, whereb1≠ 0,q≠ 0,q≠ 1.Help Petya and write a program to determine if the given sequence is arithmetic or geometric. Also it should found the next number. If the sequence is neither arithmetic nor geometric, print 42 (he thinks it is impossible to find better answer). You should also print 42 if the next element of progression is not integer. So answer is always integer.InputThe first line contains exactly four integer numbers between 1 and 1000, inclusively.OutputPrint the required number. If the given sequence is arithmetic progression, print the next progression element. Similarly, if the given sequence is geometric progression, print the next progression element.Print 42 if the given sequence is not an arithmetic or geometric progression.ExamplesInput836 624 412 200Output-12Input1 334 667 1000Output1333NoteThis problem contains very weak pretests!", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dfbebbdf", "template_md5": "35d339e4", "result": "Given a sequence of four integers, determine if it is an arithmetic or geometric progression. If it is, print the next number in the sequence. If it is neither, or if the next number is not an integer, print 42.\n\n**Arithmetic Progression:**  $a_1, a_1 + d, a_1 + 2d, ..., a_1 + (n-1)d$ where $a_1$ and $d$ are any numbers.\n\n**Geometric Progression:** $b_1, b_2 = b_1q, b_3 = b_2q, ..., b_n = b_{n-1}q$ where $b_1 \\neq 0$, $q \\neq 0$, and $q \\neq 1$."}, {"prompt_md5": "4bef5ad7", "template_md5": "465699a0", "result": "Given a sequence of four numbers, determine if it is an arithmetic or geometric progression. If it is, find the next number in the sequence. If it is neither, or if the next number is not an integer, print 42."}]}