{"uid": "328-B", "url": "https://codeforces.com/contest/328/problem/B", "tags": ["greedy"], "title": "328-B", "statement": "B. Sheldon and Ice Piecestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDo you remember how Kai constructed the word \"eternity\" using pieces of ice as components?Little Sheldon plays with pieces of ice, each piece has exactly one digit between 0 and 9. He wants to construct his favourite numbert. He realized that digits 6 and 9 are very similar, so he can rotate piece of ice with 6 to use as 9 (and vice versa). Similary, 2 and 5 work the same. There is no other pair of digits with similar effect. He called this effect \"Digital Mimicry\".Sheldon favourite number ist. He wants to have as many instances oftas possible. How many instances he can construct using the given sequence of ice pieces. He can use any piece at most once.InputThe first line contains integert(1 ≤t≤ 10000). The second line contains the sequence of digits on the pieces. The length of line is equal to the number of pieces and between 1 and 200, inclusive. It contains digits between 0 and 9.OutputPrint the required number of instances.ExamplesInput4223454Output2Input16912118999Output1NoteThis problem contains very weak pretests.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "de3f9fe4", "template_md5": "35d339e4", "result": "You are given a sequence of digits.  Some digits can be \"rotated\" to become another digit: 6 becomes 9, and 2 becomes 5.  All other digits remain the same.  \n\nYou want to find the maximum number of times you can form a target number $t$ using the digits in the sequence, where you can only use each digit once. \n\nInput:\n\n* The first line contains the target number $t$.\n* The second line contains the sequence of digits.\n\nOutput:\n\n* The maximum number of times you can form the target number $t$."}, {"prompt_md5": "e925482e", "template_md5": "465699a0", "result": "You are given a sequence of digits. Some digits can be swapped with each other (6 with 9, 2 with 5).  Find the maximum number of times a target digit can be formed using the digits in the sequence, where each digit can only be used once."}]}