{"uid": "329-C", "url": "https://codeforces.com/contest/329/problem/C", "tags": ["constructive algorithms"], "title": "329-C", "statement": "C. Graph Reconstructiontime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutI have an undirected graph consisting ofnnodes, numbered 1 throughn. Each node has at most two incident edges. For each pair of nodes, there is at most an edge connecting them. No edge connects a node to itself.I would like to create a new graph in such a way that:The new graph consists of the same number of nodes and edges as the old graph.The properties in the first paragraph still hold.For each two nodesuandv, if there is an edge connecting them in the old graph, there is no edge connecting them in the new graph.Help me construct the new graph, or tell me if it is impossible.InputThe first line consists of two space-separated integers:nandm(1 ≤m≤n≤ 105), denoting the number of nodes and edges, respectively. Thenmlines follow. Each of themlines consists of two space-separated integersuandv(1 ≤u,v≤n;u≠v), denoting an edge between nodesuandv.OutputIf it is not possible to construct a new graph with the mentioned properties, output a single line consisting of -1. Otherwise, output exactlymlines. Each line should contain a description of edge in the same way as used in the input format.ExamplesInput8 71 22 34 55 66 88 77 4Output1 44 61 62 77 58 52 8Input3 21 22 3Output-1Input5 41 22 33 44 1Output1 33 55 22 4NoteThe old graph of the first example:A possible new graph for the first example:In the second example, we cannot create any new graph.The old graph of the third example:A possible new graph for the third example:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a56ff584", "template_md5": "35d339e4", "result": "You are given a graph with $n$ nodes and $m$ edges. Each node has at most two edges connected to it, and no edge connects a node to itself.  \n\nYou need to create a new graph with the same number of nodes and edges that meets these conditions:\n\n*  If there is an edge between nodes $u$ and $v$ in the original graph, there is no edge between them in the new graph.\n\nDetermine if it is possible to create this new graph. If it is possible, list the edges of the new graph. If it is not possible, output -1."}, {"prompt_md5": "cfb89bfe", "template_md5": "465699a0", "result": "You are given a graph with a certain number of nodes and edges.  Each node has at most two connections.  You need to create a new graph with the same number of nodes and edges, but no two nodes connected in the original graph should be connected in the new graph.  If this is possible, describe the new graph; otherwise, say it's impossible."}]}