{"uid": "329-E", "url": "https://codeforces.com/contest/329/problem/E", "tags": ["math"], "title": "329-E", "statement": "E. Eviltime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arencities on a two dimensional Cartesian plane. The distance between two cities is equal to the Manhattan distance between them (see the Notes for definition). A Hamiltonian cycle of the cities is defined as a permutation of allncities. The length of this Hamiltonian cycle is defined as the sum of the distances between adjacent cities in the permutation plus the distance between the first and final city in the permutation. Please compute the longest possible length of a Hamiltonian cycle of the given cities.InputThe first line contains an integern(3 ≤n≤ 105). Thennlines follow, each consisting of two integersxiandyi(0 ≤xi,yi≤ 109), denoting the coordinates of a city. All given points will be distinct.OutputA single line denoting the longest possible length of a Hamiltonian cycle of the given cities. You should not output the cycle, only its length.Please, do not write the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput41 11 22 12 2Output6NoteIn the example, one of the possible Hamiltonian cycles with length 6 is (1, 1) (1, 2) (2, 1) (2, 2). There does not exist any other Hamiltonian cycle with a length greater than 6.The Manhattan distance between two cities(xi,yi)and(xj,yj)is|xi-xj| + |yi-yj|.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4b4de007", "template_md5": "35d339e4", "result": "You are given a set of cities located on a 2D plane. Each city is represented by its coordinates (x, y).  The distance between two cities is the sum of the absolute differences of their x-coordinates and y-coordinates (this is called the Manhattan distance).\n\nYour task is to find the longest possible total distance you can achieve by visiting each city exactly once and returning to the starting city. This is called a Hamiltonian cycle. \n\nOutput the length of the longest possible Hamiltonian cycle."}, {"prompt_md5": "56ea2be5", "template_md5": "465699a0", "result": "You are given a set of points on a grid. Find the longest possible path that visits each point exactly once and returns to the starting point. The length of the path is the sum of the distances between each pair of consecutive points."}]}