{"uid": "33-D", "url": "https://codeforces.com/contest/33/problem/D", "tags": ["geometry", " graphs", " shortest paths", " sortings"], "title": "33-D", "statement": "D. Knightstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutBerland is facing dark times again. The army of evil lord Van de Mart is going to conquer the whole kingdom. To the council of war called by the Berland's king Valery the Severe camenknights. After long discussions it became clear that the kingdom has exactlyncontrol points (if the enemy conquers at least one of these points, the war is lost) and each knight will occupy one of these points.Berland is divided intom+ 1regions withmfences, and the only way to get from one region to another is to climb over the fence. Each fence is a circle on a plane, no two fences have common points, and no control point is on the fence. You are givenkpairs of numbersai,bi. For each pair you have to find out: how many fences a knight from control point with indexaihas to climb over to reach control pointbi(in case when Van de Mart attacks control pointbifirst). As each knight rides a horse (it is very difficult to throw a horse over a fence), you are to find out for each pair the minimum amount of fences to climb over.InputThe first input line contains three integersn,m,k(1 ≤n,m≤ 1000,0 ≤k≤ 100000). Then follownlines, each containing two integersKxi,Kyi(- 109≤Kxi,Kyi≤ 109) — coordinates of control point with indexi. Control points can coincide.Each of the followingmlines describes fence with indexiwith three integersri,Cxi,Cyi(1 ≤ri≤ 109,- 109≤Cxi,Cyi≤ 109) — radius and center of the circle where the corresponding fence is situated.Then followkpairs of integersai,bi(1 ≤ai,bi≤n), each in a separate line — requests that you have to answer.aiandbican coincide.OutputOutput exactlyklines, each containing one integer — the answer to the corresponding request.ExamplesInput2 1 10 03 32 0 01 2Output1Input2 3 10 04 41 0 02 0 03 0 01 2Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c04756b1", "template_md5": "35d339e4", "result": "You are given a map with $n$ control points and $m$ fences. Each fence is a circle, and no two fences intersect.  Control points are not on the fences.\n\nYou are given $k$ pairs of control points $(a_i, b_i)$. For each pair, you need to find the minimum number of fences a knight must cross to travel from control point $a_i$ to control point $b_i$. \n\n**Input:**\n\n* The first line contains three integers: $n$, $m$, and $k$.\n* The next $n$ lines each contain two integers: the $x$ and $y$ coordinates of each control point.\n* The next $m$ lines each contain three integers: the radius $r_i$ and the $x$ and $y$ coordinates of the center of each fence.\n* The next $k$ lines each contain two integers: $a_i$ and $b_i$.\n\n**Output:**\n\n* Output $k$ lines, each containing an integer representing the minimum number of fences a knight must cross to travel from control point $a_i$ to control point $b_i$."}, {"prompt_md5": "b0f1d648", "template_md5": "465699a0", "result": "You are given a map with points and fences.  Each point can be occupied by a person.  You need to find the minimum number of fences a person at one point must cross to reach another point."}]}