{"uid": "335-F", "url": "https://codeforces.com/contest/335/problem/F", "tags": ["dp", " greedy"], "title": "335-F", "statement": "F. Buy One, Get One Freetime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA nearby pie shop is having a special sale. For each pie you pay full price for, you may select one pie of a strictly lesser value to get for free. Given the prices of all the pies you wish to acquire, determine the minimum total amount you must pay for all of the pies.InputInput will begin with an integern(1 ≤n≤ 500000), the number of pies you wish to acquire. Following this is a line withnintegers, each indicating the cost of a pie. All costs are positive integers not exceeding109.OutputPrint the minimum cost to acquire all the pies.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput63 4 5 3 4 5Output14Input55 5 5 5 5Output25Input4309999 6000 2080 2080Output314159NoteIn the first test case you can pay for a pie with cost 5 and get a pie with cost 4 for free, then pay for a pie with cost 5 and get a pie with cost 3 for free, then pay for a pie with cost 4 and get a pie with cost 3 for free.In the second test case you have to pay full price for every pie.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac61cda8", "template_md5": "35d339e4", "result": "You are buying pies. For every pie you buy at full price, you get a cheaper pie for free. The prices of all the pies are given. Find the minimum amount of money you need to spend to buy all the pies. \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 500000), the number of pies.\n* The second line contains $n$ integers, each representing the price of a pie. All prices are positive integers not exceeding $10^9$.\n\nOutput:\n\n* Print the minimum cost to buy all the pies."}, {"prompt_md5": "bb05df2e", "template_md5": "465699a0", "result": "You have a list of prices for items. You can buy one item at full price and get a cheaper item for free. Find the cheapest way to buy all the items."}]}