{"uid": "335-D", "url": "https://codeforces.com/contest/335/problem/D", "tags": ["brute force", " dp"], "title": "335-D", "statement": "D. Rectangles and Squaretime limit per test3 secondsmemory limit per test512 megabytesinputstdinoutputstdoutYou are givennrectangles, labeled 1 throughn. The corners of rectangles have integer coordinates and their edges are parallel to theOxandOyaxes. The rectangles may touch each other, but they do not overlap (that is, there are no points that belong to the interior of more than one rectangle).Your task is to determine if there's a non-empty subset of the rectangles that forms a square. That is, determine if there exists a subset of the rectangles and some square for which every point that belongs to the interior or the border of that square belongs to the interior or the border of at least one of the rectangles in the subset, and every point that belongs to the interior or the border of at least one rectangle in the subset belongs to the interior or the border of that square.InputFirst line contains a single integern(1 ≤n≤ 105) — the number of rectangles. Each of the nextnlines contains a description of a rectangle, with thei-th such line describing the rectangle labeledi. Each rectangle description consists of four integers:x1,y1,x2,y2— coordinates of the bottom left and the top right corners (0 ≤x1<x2≤ 3000,0 ≤y1<y2≤ 3000).No two rectangles overlap (that is, there are no points that belong to the interior of more than one rectangle).OutputIf such a subset exists, print \"YES\" (without quotes) on the first line of the output file, followed byk, the number of rectangles in the subset. On the second line printknumbers — the labels of rectangles in the subset in any order. If more than one such subset exists, print any one. If no such subset exists, print \"NO\" (without quotes).ExamplesInput90 0 1 91 0 9 11 8 9 98 1 9 82 2 3 63 2 7 32 6 7 75 3 7 63 3 5 6OutputYES 55 6 7 8 9Input40 0 1 91 0 9 11 8 9 98 1 9 8OutputNONoteThe first test case looks as follows:Note that rectangles 6, 8, and 9 form a square as well, and would be an acceptable answer.The second test case looks as follows:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ba59ca66", "template_md5": "35d339e4", "result": "You are given $n$ rectangles. Each rectangle is defined by the coordinates of its bottom-left and top-right corners.  The rectangles may touch but do not overlap.\n\nDetermine if there is a group of these rectangles that can form a square. A square is formed if:\n\n* Every point on the square's border or inside the square is also on the border or inside at least one of the rectangles in the group.\n* Every point on the border or inside at least one of the rectangles in the group is also on the border or inside the square.\n\nIf such a group of rectangles exists, output \"YES\" followed by the number of rectangles in the group and the labels of those rectangles. If no such group exists, output \"NO\"."}, {"prompt_md5": "d1185d4f", "template_md5": "465699a0", "result": "You are given a set of rectangles.  Determine if you can choose a group of these rectangles that together form a square.  If you can, output \"YES\" followed by the number of rectangles in the group and the labels of those rectangles. If you can't, output \"NO\"."}]}