{"uid": "336-E", "url": "https://codeforces.com/contest/336/problem/E", "tags": ["bitmasks", " combinatorics", " dp", " implementation"], "title": "336-E", "statement": "E. Vasily the Bear and Painting Squaretime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasily the bear has two favorite integersnandkand a pencil. Besides, he's gotkjars with different water color paints. All jars are numbered in some manner from1tok, inclusive. The jar numbericontains the paint of thei-th color.Initially the bear took a pencil and drew four segments on the coordinate plane. All of them end at point(0, 0). They begin at:(0, 2n),(0,  - 2n),(2n, 0),( - 2n, 0). Then for eachi= 1, 2, ...,n, the bear drew two squares. The first square has the following vertex coordinates:(2i, 0),( - 2i, 0),(0,  - 2i),(0, 2i). The second square has the following vertex coordinates:( - 2i- 1,  - 2i- 1),( - 2i- 1, 2i- 1),(2i- 1,  - 2i- 1),(2i- 1, 2i- 1). After that, the bear drew another square:(1, 0),( - 1, 0),(0,  - 1),(0, 1). All points mentioned above form the set of pointsA.The sample of the final picture atn= 0The sample of the final picture atn= 2The bear decided to paint the resulting picture inkmoves. Thei-th move consists of the following stages:The bear chooses 3 distinct points in setАso that any pair of the chosen points has a segment on the picture between them. The chosen points and segments mark the area that mustn't contain any previously painted points.The bear paints the area bounded by the chosen points and segments thei-th color.Note that after thek-th move some parts of the picture can stay unpainted.The bear asked you to calculate, how many distinct ways there are to paint his picture. A way to paint the picture is a sequence of three-element sets of points he chose on each step. Two sequences are considered distinct if there is such numberi(1 ≤i≤k), that thei-th members of these sequences do not coincide as sets. As the sought number can be rather large, you only need to calculate the remainder after dividing it by number1000000007(109+ 7).InputThe first line contains two integersnandk, separated by a space (0 ≤n,k≤ 200).OutputPrint exactly one integer — the answer to the problem modulo1000000007(109+ 7).ExamplesInput0 0Output1Input0 1Output8Input0 2Output32Input1 1Output32", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "499175fe", "template_md5": "35d339e4", "result": "You are given two integers $n$ and $k$.  \n\nYou need to calculate the number of ways to paint a picture with $k$ colors. \n\nThe picture is made up of squares drawn on a coordinate plane.  \n\n* There are four initial lines forming a cross.\n* Then, for each $i$ from 1 to $n$, two squares are drawn.\n* Finally, a small square is drawn in the center.\n\nEach color can only be used once.  \n\nTo paint the picture, you choose 3 points on the picture at a time, and color the area enclosed by those points.  \n\nNo two points can be used in the same color.\n\nThe answer should be the number of ways to paint the picture modulo $10^9 + 7$."}, {"prompt_md5": "efcf7a3d", "template_md5": "465699a0", "result": "You are given two numbers, n and k.  You need to find the number of ways to color a specific shape with k colors, where each color is applied to a distinct area of the shape.  The shape is made up of smaller squares and lines.  The number of ways to color the shape must be calculated modulo 1000000007."}]}