{"uid": "336-C", "url": "https://codeforces.com/contest/336/problem/C", "tags": ["brute force", " greedy", " implementation", " number theory"], "title": "336-C", "statement": "C. Vasily the Bear and Sequencetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutVasily the bear has got a sequence of positive integersa1,a2, ...,an. Vasily the Bear wants to write out several numbers on a piece of paper so that the beauty of the numbers he wrote out was maximum.Thebeautyof the written out numbersb1,b2, ...,bkis such maximum non-negative integerv, that numberb1andb2and...andbkis divisible by number2vwithout a remainder. If such numbervdoesn't exist (that is, for any non-negative integerv, numberb1andb2and...andbkis divisible by2vwithout a remainder), the beauty of the written out numbers equals -1.Tell the bear which numbers he should write out so that the beauty of the written out numbers is maximum. If there are multiple ways to write out the numbers, you need to choose the one where the bear writes out as many numbers as possible.Here expressionxandymeans applying the bitwise AND operation to numbersxandy. In programming languages C++ and Java this operation is represented by \"&\", in Pascal — by \"and\".InputThe first line contains integern(1 ≤n≤ 105). The second line containsnspace-separated integersa1,a2, ...,an(1 ≤a1<a2< ... <an≤ 109).OutputIn the first line print a single integerk(k> 0), showing how many numbers to write out. In the second line printkintegersb1,b2, ...,bk— the numbers to write out. You are allowed to print numbersb1,b2, ...,bkin any order, but all of them must be distinct. If there are multiple ways to write out the numbers, choose the one with the maximum number of numbers to write out. If there still are multiple ways, you are allowed to print any of them.ExamplesInput51 2 3 4 5Output24 5Input31 2 4Output14", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "668b23a8", "template_md5": "35d339e4", "result": "You are given a sequence of positive integers $a_1, a_2, ..., a_n$.  Find the largest possible number of distinct integers $b_1, b_2, ..., b_k$ from the sequence such that the bitwise AND of all the $b_i$ is divisible by $2^v$ for some non-negative integer $v$. If no such $v$ exists, the answer is -1. \n\nOutput the value of $k$ and the $b_i$. If there are multiple solutions, output the one with the largest $k$."}, {"prompt_md5": "ae6fb6d3", "template_md5": "465699a0", "result": "Given a list of distinct positive integers, find the largest subset of these integers whose bitwise AND is divisible by a positive integer. Output the size of the subset and the integers in the subset. If no such subset exists, output -1."}]}