{"uid": "336-D", "url": "https://codeforces.com/contest/336/problem/D", "tags": ["combinatorics", " math", " number theory"], "title": "336-D", "statement": "D. Vasily the Bear and Beautiful Stringstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasily the Bear lovesbeautifulstrings. Stringsisbeautifulif it meets the following criteria:Stringsonly consists of characters0and1, at that character0must occur in stringsexactlyntimes, and character1must occur exactlymtimes.We can obtain charactergfrom stringswith some (possibly, zero) number of modifications. The charactergequals either zero or one.Amodificationof string with length at least two is the following operation: we replace two last characters from the string by exactly one other character. This character equals one if it replaces two zeros, otherwise it equals zero. For example, one modification transforms string \"01010\" into string \"0100\", two modifications transform it to \"011\". It is forbidden to modify a string with length less than two.Help the Bear, count the number ofbeautifulstrings. As the number of beautiful strings can be rather large, print the remainder after dividing the number by1000000007(109+ 7).InputThe first line of the input contains three space-separated integersn,m,g(0 ≤n,m≤ 105,n+m≥ 1, 0 ≤g≤ 1).OutputPrint a single integer — the answer to the problem modulo1000000007(109+ 7).ExamplesInput1 1 0Output2Input2 2 0Output4Input1 1 1Output0NoteIn the first sample the beautiful strings are: \"01\", \"10\".In the second sample the beautiful strings are: \"0011\", \"1001\", \"1010\", \"1100\".In the third sample there are no beautiful strings.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fe82853c", "template_md5": "35d339e4", "result": "You are given three integers $n$, $m$, and $g$ ($0 \\le n, m \\le 10^5$, $n + m \\ge 1$, $0 \\le g \\le 1$).  \n\nA string is considered \"beautiful\" if it meets the following criteria:\n\n* It consists only of the characters '0' and '1'.\n* It contains exactly $n$ '0's.\n* It contains exactly $m$ '1's.\n\nYou can modify a string with length at least two as follows: replace the last two characters with a single character ('0' or '1'). The new character is '1' if the two replaced characters were both '0', otherwise it is '0'.  \n\nFind the number of beautiful strings that can be formed, and output the remainder when this number is divided by $10^9 + 7$."}, {"prompt_md5": "3d2f9b59", "template_md5": "465699a0", "result": "You are given three numbers: n, m, and g.  You need to find how many strings of length n+m can be made using only 0s and 1s, where '0' appears exactly n times and '1' appears exactly m times.  \n\nThe strings can be modified by replacing the last two characters with a single character (0 or 1) based on whether the last two characters were both 0s or not. \n\nCount the number of strings that meet these conditions and find the remainder when divided by 1000000007."}]}