{"uid": "337-E", "url": "https://codeforces.com/contest/337/problem/E", "tags": ["brute force", " number theory", " trees"], "title": "337-E", "statement": "E. Divisor Treetime limit per test0.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAdivisor treeis a rooted tree that meets the following conditions:Each vertex of the tree contains a positive integer number.The numbers written in the leaves of the tree are prime numbers.For any inner vertex, the number within it is equal to the product of the numbers written in its children.Manao hasndistinct integersa1,a2, ...,an. He tries to build a divisor tree which contains each of these numbers. That is, for eachai, there should be at least one vertex in the tree which containsai. Manao loves compact style, but his trees are too large. Help Manao determine the minimum possible number of vertices in the divisor tree sought.InputThe first line contains a single integern(1 ≤n≤ 8). The second line containsndistinct space-separated integersai(2 ≤ai≤ 1012).OutputPrint a single integer — the minimum number of vertices in the divisor tree that contains each of the numbersai.ExamplesInput26 10Output7Input46 72 8 4Output12Input17Output1NoteSample 1. The smallest divisor tree looks this way:Sample 2. In this case you can build the following divisor tree:Sample 3. Note that the tree can consist of a single vertex.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "df6a1402", "template_md5": "35d339e4", "result": "You are given $n$ distinct positive integers $a_1, a_2, ..., a_n$.  You need to build a tree with the following properties:\n\n* Each node in the tree contains a positive integer.\n* The leaves of the tree contain only prime numbers.\n* For every non-leaf node, the integer it contains is the product of the integers in its children.\n\nFind the minimum number of nodes required to build such a tree that includes all the given integers $a_i$."}, {"prompt_md5": "deb8c5ce", "template_md5": "465699a0", "result": "You are given a list of numbers.  Find the smallest number of nodes needed in a special tree where each number in the list appears somewhere in the tree.  The tree has a special property: each node's value is the product of its child nodes' values, and the leaves of the tree must contain prime numbers."}]}