{"uid": "337-C", "url": "https://codeforces.com/contest/337/problem/C", "tags": ["binary search", " greedy", " math", " matrices", " number theory"], "title": "337-C", "statement": "C. Quiztime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutManao is taking part in a quiz. The quiz consists ofnconsecutive questions. A correct answer gives one point to the player. The game also has a counter of consecutive correct answers. When the player answers a question correctly, the number on this counter increases by 1. If the player answers a question incorrectly, the counter is reset, that is, the number on it reduces to 0. If after an answer the counter reaches the numberk, then it is reset, and the player's score is doubled. Note that in this case, first 1 point is added to the player's score, and then the total score is doubled. At the beginning of the game, both the player's score and the counter of consecutive correct answers are set to zero.Manao remembers that he has answered exactlymquestions correctly. But he does not remember the order in which the questions came. He's trying to figure out what his minimum score may be. Help him and compute the remainder of the corresponding number after division by1000000009(109+ 9).InputThe single line contains three space-separated integersn,mandk(2 ≤k≤n≤ 109; 0 ≤m≤n).OutputPrint a single integer — the remainder from division of Manao's minimum possible score in the quiz by1000000009(109+ 9).ExamplesInput5 3 2Output3Input5 4 2Output6NoteSample 1. Manao answered 3 questions out of 5, and his score would double for each two consecutive correct answers. If Manao had answered the first, third and fifth questions, he would have scored as much as 3 points.Sample 2. Now Manao answered 4 questions. The minimum possible score is obtained when the only wrong answer is to the question 4.Also note that you are asked to minimize the score and not the remainder of the score modulo1000000009. For example, if Manao could obtain either2000000000or2000000020points, the answer is2000000000mod1000000009, even though2000000020mod1000000009is a smaller number.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3ebda421", "template_md5": "35d339e4", "result": "There are $n$ consecutive questions in a quiz. Answering a question correctly gives 1 point.  There is a counter that keeps track of consecutive correct answers. \n\n* If a question is answered correctly, the counter increases by 1.\n* If a question is answered incorrectly, the counter resets to 0.\n* If the counter reaches $k$, it resets, and the player's score is doubled (1 point is added first, then the total is doubled).\n\nThe player knows they answered $m$ questions correctly, but not the order. What is the minimum possible score the player could have?  \n\nOutput the remainder when the minimum possible score is divided by $10^9 + 9$."}, {"prompt_md5": "a8ad8d62", "template_md5": "465699a0", "result": "You are given a number of questions and a target number.  A player answers questions correctly and gets a point for each correct answer.  Every time the player answers a certain number of questions correctly in a row, their score doubles.  Find the smallest possible score the player can achieve given a specific number of correct answers."}]}