{"uid": "339-E", "url": "https://codeforces.com/contest/339/problem/E", "tags": ["constructive algorithms", " dfs and similar", " greedy"], "title": "339-E", "statement": "E. Three Swapstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutXenia the horse breeder hasn(n> 1)horses that stand in a row. Each horse has its own unique number. Initially, thei-th left horse has numberi. That is, the sequence of numbers of horses in a row looks as follows (from left to right): 1, 2, 3,...,n.Xenia trains horses before the performance. During the practice sessions, she consistently gives them commands. Each command is a pair of numbersl,r(1 ≤l<r≤n). The commandl,rmeans that the horses that are on thel-th,(l+ 1)-th,(l+ 2)-th,...,r-th places from the left must be rearranged. The horses that initially stand on thel-th andr-th places will swap. The horses on the(l+ 1)-th and(r- 1)-th places will swap. The horses on the(l+ 2)-th and(r- 2)-th places will swap and so on. In other words, the horses that were on the segment[l,r]change their order to the reverse one.For example, if Xenia commandedl= 2,r= 5, and the sequence of numbers of horses before the command looked as (2, 1, 3, 4, 5, 6), then after the command the sequence will be (2, 5, 4, 3, 1, 6).We know that during the practice Xenia gave at most three commands of the described form. You have got the final sequence of numbers of horses by the end of the practice. Find what commands Xenia gave during the practice. Note that you do not need to minimize the number of commands in the solution, find any valid sequence of at most three commands.InputThe first line contains an integern(2 ≤n≤ 1000)— the number of horses in the row. The second line containsndistinct integersa1,a2, ...,an(1 ≤ai≤n), whereaiis the number of thei-th left horse in the row after the practice.OutputThe first line should contain integerk(0 ≤k≤ 3)— the number of commads Xenia gave during the practice. In each of the nextklines print two integers. In thei-th line print numbersli,ri(1 ≤li<ri≤n)— Xenia'si-th command during the practice.It is guaranteed that a solution exists. If there are several solutions, you are allowed to print any of them.ExamplesInput51 4 3 2 5Output12 4Input62 1 4 3 6 5Output31 23 45 6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ecbf62d7", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ distinct integers ($n \\ge 2$) representing the order of horses after a series of training sessions.  Each session involves swapping horses within a specific segment of the sequence.  \n\nA session is defined by two numbers, $l$ and $r$ ($1 \\le l < r \\le n$), which indicate the starting and ending positions of the segment.  All horses within this segment swap positions with their corresponding counterparts from the other end of the segment.\n\nFor example, if $l=2$ and $r=5$ and the sequence is $(2, 1, 3, 4, 5, 6)$, the sequence after the session would be $(2, 5, 4, 3, 1, 6)$.\n\nYou know that at most three such sessions took place.  Your task is to determine a possible sequence of three or fewer sessions that could have resulted in the given final sequence. \n\n\nYou should output:\n\n* The number of sessions ($k$, where $0 \\le k \\le 3$).\n* For each session, output two integers, $l$ and $r$, representing the start and end positions of the segment. \n\n\n\nNote: There may be multiple valid solutions."}, {"prompt_md5": "425a1d1c", "template_md5": "465699a0", "result": "You are given a sequence of numbers.  You know that this sequence was created by swapping groups of numbers within the sequence at most three times.  Each swap involves reversing the order of a segment of numbers.  Find one possible sequence of swaps that could have produced the given sequence."}]}