{"uid": "34-D", "url": "https://codeforces.com/contest/34/problem/D", "tags": ["dfs and similar", " graphs"], "title": "34-D", "statement": "D. Road Maptime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arencities in Berland. Each city has its index — an integer number from1ton. The capital has indexr1. All the roads in Berland are two-way. The road system is such that there is exactly one path from the capital to each city, i.e. the road map looks like a tree. In Berland's chronicles the road map is kept in the following way: for each cityi, different from the capital, there is kept numberpi— index of the last city on the way from the capital toi.Once the king of Berland Berl XXXIV decided to move the capital from cityr1to cityr2. Naturally, after this the old representation of the road map in Berland's chronicles became incorrect. Please, help the king find out a new representation of the road map in the way described above.InputThe first line contains three space-separated integersn,r1,r2(2 ≤n≤ 5·104, 1 ≤r1≠r2≤n) — amount of cities in Berland, index of the old capital and index of the new one, correspondingly.The following line containsn- 1space-separated integers — the old representation of the road map. For each city, apart fromr1, there is given integerpi— index of the last city on the way from the capital to cityi. All the cities are described in order of increasing indexes.OutputOutputn- 1numbers — new representation of the road map in the same format.ExamplesInput3 2 32 2Output2 3Input6 2 46 1 2 4 2Output6 4 1 4 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e48ea08c", "template_md5": "35d339e4", "result": "There are $n$ cities.  The capital city is initially at index $r_1$.  The road system is a tree, meaning there is exactly one path from the capital to each city.  \n\nThe road system is represented by a list of $n-1$ integers. For each city $i$ (except the capital), the list contains the index $p_i$ of the last city on the path from the capital to city $i$.\n\nThe capital city is being moved to city $r_2$.  Find a new representation of the road system in the same format, given the new capital city. \n\n\nInput:\n\n* The first line contains three integers: $n$, $r_1$, and $r_2$ (the number of cities, the index of the old capital, and the index of the new capital).\n* The second line contains $n-1$ integers representing the old road system.\n\nOutput:\n\n* A line containing $n-1$ integers representing the new road system."}, {"prompt_md5": "1807c2f3", "template_md5": "465699a0", "result": "You are given a list of cities and their connections to a central city. The central city is moving to a new location.  You need to update the list of connections to reflect the new central city."}]}