{"uid": "340-B", "url": "https://codeforces.com/contest/340/problem/B", "tags": ["brute force", " geometry"], "title": "340-B", "statement": "B. Maximal Area Quadrilateraltime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIahub has drawn a set ofnpoints in the cartesian plane which he calls \"special points\". A quadrilateral is a simple polygon without self-intersections with four sides (also called edges) and four vertices (also called corners). Please note that a quadrilateral doesn't have to be convex. A special quadrilateral is one which has all four vertices in the set of special points. Given the set of special points, please calculate the maximal area of a special quadrilateral.InputThe first line contains integern(4 ≤n≤ 300). Each of the nextnlines contains two integers:xi,yi( - 1000 ≤xi,yi≤ 1000)— the cartesian coordinates ofith special point. It is guaranteed that no three points are on the same line. It is guaranteed that no two points coincide.OutputOutput a single real number — the maximal area of a special quadrilateral. The answer will be considered correct if its absolute or relative error does't exceed10- 9.ExamplesInput50 00 44 04 42 3Output16.000000NoteIn the test example we can choose first4points to be the vertices of the quadrilateral. They form a square by side4, so the area is4·4 = 16.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c1cc2f16", "template_md5": "35d339e4", "result": "You are given a set of $n$ points in the Cartesian plane, where $4 \\le n \\le 300$.  Each point has coordinates $(x_i, y_i)$, where $-1000 \\le x_i, y_i \\le 1000$.  No three points lie on the same line, and no two points are the same.\n\nA quadrilateral is a four-sided polygon.  A \"special quadrilateral\" is a quadrilateral whose four vertices are all from the given set of points.\n\nFind the largest possible area of a special quadrilateral.  The answer should be accurate to within $10^{-9}$."}, {"prompt_md5": "601f74b9", "template_md5": "465699a0", "result": "You are given a set of points in a 2D plane. Find the largest area that can be enclosed by a shape with four sides, using only points from the given set."}]}