{"uid": "340-A", "url": "https://codeforces.com/contest/340/problem/A", "tags": ["math"], "title": "340-A", "statement": "A. The Walltime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIahub and his friend Floyd have started painting a wall. Iahub is painting the wall red and Floyd is painting it pink. You can consider the wall being made of a very large number of bricks, numbered1,2,3and so on.Iahub has the following scheme of painting: he skipsx- 1consecutive bricks, then he paints thex-th one. That is, he'll paint bricksx,2·x,3·xand so on red. Similarly, Floyd skipsy- 1consecutive bricks, then he paints they-th one. Hence he'll paint bricksy,2·y,3·yand so on pink.After painting the wall all day, the boys observed that some bricks are painted both red and pink. Iahub has a lucky numberaand Floyd has a lucky numberb. Boys wonder how many bricks numbered no less thanaand no greater thanbare painted both red and pink. This is exactly your task: compute and print the answer to the question.InputThe input will have a single line containing four integers in this order:x,y,a,b. (1 ≤x,y≤ 1000,1 ≤a,b≤ 2·109,a≤b).OutputOutput a single integer — the number of bricks numbered no less thanaand no greater thanbthat are painted both red and pink.ExamplesInput2 3 6 18Output3NoteLet's look at the bricks fromatob(a= 6,b= 18). The bricks colored in red are numbered 6, 8, 10, 12, 14, 16, 18. The bricks colored in pink are numbered 6, 9, 12, 15, 18. The bricks colored in both red and pink are numbered with 6, 12 and 18.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac033938", "template_md5": "35d339e4", "result": "Two people are painting a wall with bricks. \n\n* Person 1 paints every $x$th brick, skipping $x-1$ bricks in between.\n* Person 2 paints every $y$th brick, skipping $y-1$ bricks in between.\n\nGiven:\n\n* $x$ (Person 1's painting interval)\n* $y$ (Person 2's painting interval)\n* $a$ (the smallest brick number to consider)\n* $b$ (the largest brick number to consider)\n\nFind the number of bricks between $a$ and $b$ (inclusive) that are painted by both people."}, {"prompt_md5": "ffd9c977", "template_md5": "465699a0", "result": "Two people paint bricks on a wall with alternating patterns.  The first person paints every xth brick, the second person paints every yth brick.  Find the number of bricks between a and b (inclusive) that are painted by both people."}]}