{"uid": "342-B", "url": "https://codeforces.com/contest/342/problem/B", "tags": ["brute force", " greedy", " implementation"], "title": "342-B", "statement": "B. Xenia and Spiestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutXenia the vigorous detective facedn(n≥ 2)foreign spies lined up in a row. We'll consider the spies numbered from 1 tonfrom left to right.Spyshas an important note. He has to pass the note to spyf. Xenia interrogates the spies in several steps. During one step the spy keeping the important note can pass the note to one of his neighbours in the row. In other words, if this spy's number isx, he can pass the note to another spy, eitherx- 1orx+ 1(ifx= 1orx=n, then the spy has only one neighbour). Also during a step the spy can keep a note and not pass it to anyone.But nothing is that easy. Duringmsteps Xenia watches some spies attentively. Specifically, during stepti(steps are numbered from 1) Xenia watches spies numbersli,li+ 1,li+ 2, ...,ri(1 ≤li≤ri≤n). Of course, if during some step a spy is watched, he can't do anything: neither give the note nor take it from some other spy. Otherwise, Xenia reveals the spies' cunning plot. Nevertheless, if the spy at the current step keeps the note, Xenia sees nothing suspicious even if she watches him.You've gotsandf. Also, you have the steps during which Xenia watches spies and which spies she is going to watch during each step. Find the best way the spies should act in order to pass the note from spysto spyfas quickly as possible (in the minimum number of steps).InputThe first line contains four integersn,m,sandf(1 ≤n,m≤ 105; 1 ≤s,f≤n;s≠f;n≥ 2). Each of the followingmlines contains three integersti,li,ri(1 ≤ti≤ 109, 1 ≤li≤ri≤n). It is guaranteed thatt1<t2<t3< ... <tm.OutputPrintkcharacters in a line: thei-th character in the line must represent the spies' actions on stepi. If on stepithe spy with the note must pass the note to the spy with a lesser number, thei-th character should equal \"L\". If on stepithe spy with the note must pass it to the spy with a larger number, thei-th character must equal \"R\". If the spy must keep the note at thei-th step, thei-th character must equal \"X\".As a result of applying the printed sequence of actions spysmust pass the note to spyf. The number of printed characterskmust be as small as possible. Xenia must not catch the spies passing the note.If there are miltiple optimal solutions, you can print any of them. It is guaranteed that the answer exists.ExamplesInput3 5 1 31 1 22 2 33 3 34 1 110 1 3OutputXXRR", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9ff72e64", "template_md5": "35d339e4", "result": "There are $n$ spies lined up in a row. Spy $s$ has a note and needs to pass it to spy $f$.  \n\nIn each step, the spy with the note can pass it to the spy on their left or right. They can also choose to keep the note.\n\nThere are $m$ steps where a group of spies are being watched. During these steps, the spies in the watched group cannot pass the note.\n\nFind the fastest way for the spies to pass the note from spy $s$ to spy $f$ without being caught.\n\n**Input:**\n\n* $n$: the number of spies\n* $m$: the number of watched steps\n* $s$: the starting spy\n* $f$: the ending spy\n* $m$ lines, each containing three integers:\n    * $t$: the step number\n    * $l$: the starting spy of the watched group\n    * $r$: the ending spy of the watched group\n\n**Output:**\n\nA sequence of characters, where each character represents the action of the spy with the note on each step:\n\n* \"L\": pass the note to the left\n* \"R\": pass the note to the right\n* \"X\": keep the note"}, {"prompt_md5": "87b9ce41", "template_md5": "465699a0", "result": "You have a line of people. One person starts with a message. They can pass the message to the person on either side, or keep it. At certain times, someone is watching the line. If someone is watched, they can't pass the message. Find the fastest way to get the message to a specific person."}]}