{"uid": "342-E", "url": "https://codeforces.com/contest/342/problem/E", "tags": ["data structures", " divide and conquer", " trees"], "title": "342-E", "statement": "E. Xenia and Treetime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutXenia the programmer has a tree consisting ofnnodes. We will consider the tree nodes indexed from 1 ton. We will also consider the first node to be initially painted red, and the other nodes — to be painted blue.Thedistancebetween two tree nodesvanduis the number of edges in the shortest path betweenvandu.Xenia needs to learn how to quickly execute queries of two types:paint a specified blue node in red;calculate which red node is the closest to the given one and print the shortest distance to the closest red node.Your task is to write a program which will execute the described queries.InputThe first line contains two integersnandm(2 ≤n≤ 105, 1 ≤m≤ 105)— the number of nodes in the tree and the number of queries. Nextn- 1lines contain the tree edges, thei-th line contains a pair of integersai,bi(1 ≤ai,bi≤n,ai≠bi)— an edge of the tree.Nextmlines contain queries. Each query is specified as a pair of integersti,vi(1 ≤ti≤ 2, 1 ≤vi≤n). Ifti= 1, then as a reply to the query we need to paint a blue nodeviin red. Ifti= 2, then we should reply to the query by printing the shortest distance from some red node to nodevi.It is guaranteed that the given graph is a tree and that all queries are correct.OutputFor each second type query print the reply in a single line.ExamplesInput5 41 22 32 44 52 12 51 22 5Output032", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c0e5e857", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes. Initially, node 1 is red, and all other nodes are blue.  \n\nThere are two types of queries:\n\n1. **Paint:** Change the color of node $v$ to red.\n2. **Distance:** Find the shortest distance from a red node to node $v$.\n\nProcess the given queries and output the shortest distance for each distance query. \n\n**Input:**\n\n* The first line contains two integers $n$ and $m$ ($2 \\le n \\le 10^5$, $1 \\le m \\le 10^5$): the number of nodes and the number of queries.\n* The next $n-1$ lines describe the tree edges, each line containing two integers $a_i$ and $b_i$ ($1 \\le a_i, b_i \\le n$, $a_i \\neq b_i$) representing an edge between nodes $a_i$ and $b_i$.\n* The next $m$ lines describe the queries. Each line contains two integers $t_i$ and $v_i$ ($1 \\le t_i \\le 2$, $1 \\le v_i \\le n$):\n    * If $t_i = 1$, paint node $v_i$ red.\n    * If $t_i = 2$, find the shortest distance from a red node to node $v_i$.\n\n**Output:**\n\nFor each distance query, print the shortest distance in a single line."}, {"prompt_md5": "42b30b7b", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes. Initially, the first node is red, and all other nodes are blue. You need to process queries of two types:\n\n1. Change the color of a blue node to red.\n2. Find the shortest distance from a red node to a given node."}]}