{"uid": "342-D", "url": "https://codeforces.com/contest/342/problem/D", "tags": ["bitmasks", " dfs and similar", " dp"], "title": "342-D", "statement": "D. Xenia and Dominoestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutXenia likes puzzles very much. She is especially fond of the puzzles that consist of domino pieces. Look at the picture that shows one of such puzzles.A puzzle is a3 ×ntable with forbidden cells (black squares) containing dominoes (colored rectangles on the picture). A puzzle is calledcorrectif it meets the following conditions:each domino occupies exactly two non-forbidden cells of the table;no two dominoes occupy the same table cell;exactly one non-forbidden cell of the table is unoccupied by any domino (it is marked by a circle in the picture).To solve the puzzle, you need multiple steps to transport an empty cell from the starting position to some specified position. A move is transporting a domino to the empty cell, provided that the puzzle stays correct.The horizontal dominoes can be moved only horizontally, and vertical dominoes can be moved only vertically. You can't rotate dominoes.The picture shows a probable move.Xenia has a3 ×ntable with forbidden cells and a cell marked with a circle. Also, Xenia has very many identical dominoes. Now Xenia is wondering, how many distinct correct puzzles she can make if she puts dominoes on the existing table. Also, Xenia wants the circle-marked cell to be empty in the resulting puzzle. The puzzle must contain at least one move.Help Xenia, count the described number of puzzles. As the described number can be rather large, print the remainder after dividing it by1000000007(109+ 7).InputThe first line contains integern(3 ≤n≤ 104)— the puzzle's size. Each of the following three lines containsncharacters — the description of the table. Thej-th character of thei-th line equals \"X\" if the corresponding cell is forbidden; it equals \".\", if the corresponding cell is non-forbidden and \"O\", if the corresponding cell is marked with a circle.It is guaranteed that exactly one cell in the table is marked with a circle. It is guaranteed that all cells of a given table having at least one common point with the marked cell is non-forbidden.OutputPrint a single number — the answer to the problem modulo1000000007(109+ 7).ExamplesInput5....X.O......X.Output1Input5......O........Output2Input3........OOutput4NoteTwo puzzles are considered distinct if there is a pair of cells that contain one domino in one puzzle and do not contain it in the other one.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "35f38c6d", "template_md5": "35d339e4", "result": "You are given a 3 x $n$ grid where some cells are forbidden (marked 'X'), and one cell is marked with a circle ('O').  The goal is to determine how many distinct ways you can place dominoes (which occupy two adjacent non-forbidden cells) on the grid such that:\n\n* Each domino occupies exactly two non-forbidden cells.\n* No two dominoes share a cell.\n* Exactly one non-forbidden cell remains empty (the circle-marked cell).\n\nA domino can only be moved horizontally or vertically, and cannot be rotated.  \n\nOutput the number of distinct valid configurations modulo 1000000007."}, {"prompt_md5": "caddbe09", "template_md5": "465699a0", "result": "You are given a grid of cells. Some cells are blocked, and one cell is marked.  You can place dominoes (which cover two adjacent cells) on the unblocked cells.  \n\nThe goal is to find how many ways you can arrange the dominoes so that:\n\n* Each domino covers exactly two unblocked cells.\n* No two dominoes overlap.\n* The marked cell remains empty. \n\nThe number of valid arrangements, modulo 1000000007, is the answer."}]}