{"uid": "342-A", "url": "https://codeforces.com/contest/342/problem/A", "tags": ["greedy", " implementation"], "title": "342-A", "statement": "A. Xenia and Divisorstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutXenia the mathematician has a sequence consisting ofn(nis divisible by 3) positive integers, each of them is at most 7. She wants to split the sequence into groups of three so that for each group of threea,b,cthe following conditions held:a<b<c;adividesb,bdividesc.Naturally, Xenia wants each element of the sequence to belong to exactly one group of three. Thus, if the required partition exists, then it hasgroups of three.Help Xenia, find the required partition or else say that it doesn't exist.InputThe first line contains integern(3 ≤n≤ 99999)— the number of elements in the sequence. The next line containsnpositive integers, each of them is at most 7.It is guaranteed thatnis divisible by 3.OutputIf the required partition exists, printgroups of three. Print each group as values of the elements it contains. You should print values in increasing order. Separate the groups and integers in groups by whitespaces. If there are multiple solutions, you can print any of them.If there is no solution, print -1.ExamplesInput61 1 1 2 2 2Output-1Input62 2 1 1 4 6Output1 2 41 2 6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d04a2fb5", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ positive integers ($n$ is divisible by 3) where each integer is at most 7.  The goal is to divide the sequence into groups of three, where each group satisfies the following conditions:\n\n* The numbers in each group are in increasing order ($a < b < c$).\n* The first number in the group divides the second number ($a$ divides $b$), and the second number divides the third number ($b$ divides $c$).\n\nIf such a division is possible, output the groups of three. If it's not possible, output -1."}, {"prompt_md5": "3e03e220", "template_md5": "465699a0", "result": "You are given a list of numbers. The list has a length divisible by 3.  You need to divide the list into groups of three, where each group must follow these rules:\n\n1. The numbers in each group must be in increasing order.\n2. The first number in the group must divide evenly into the second number, and the second number must divide evenly into the third number.\n\nIf you can divide the list into these groups, list the groups. If you can't, say \"not possible\"."}]}