{"uid": "343-B", "url": "https://codeforces.com/contest/343/problem/B", "tags": ["data structures", " greedy", " implementation"], "title": "343-B", "statement": "B. Alternating Currenttime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMad scientist Mike has just finished constructing a new device to search for extraterrestrial intelligence! He was in such a hurry to launch it for the first time that he plugged in the power wires without giving it a proper glance and started experimenting right away. After a while Mike observed that the wires ended up entangled and now have to be untangled again.The device is powered by two wires \"plus\" and \"minus\". The wires run along the floor from the wall (on the left) to the device (on the right). Both the wall and the device have two contacts in them on the same level, into which the wires are plugged in some order. The wires are considered entangled if there are one or more places where one wire runs above the other one. For example, the picture below has four such places (top view):Mike knows the sequence in which the wires run above each other. Mike also noticed that on the left side, the \"plus\" wire is always plugged into the top contact (as seen on the picture). He would like to untangle the wires without unplugging them andwithout movingthe device. Determine if it is possible to do that. A wire can be freely moved and stretched on the floor, but cannot be cut.To understand the problem better please read the notes to the test samples.InputThe single line of the input contains a sequence of characters \"+\" and \"-\" of lengthn(1 ≤n≤ 100000). Thei-th (1 ≤i≤n) position of the sequence contains the character \"+\", if on thei-th step from the wall the \"plus\" wire runs above the \"minus\" wire, and the character \"-\" otherwise.OutputPrint either \"Yes\" (without the quotes) if the wires can be untangled or \"No\" (without the quotes) if the wires cannot be untangled.ExamplesInput-++-OutputYesInput+-OutputNoInput++OutputYesInput-OutputNoNoteThe first testcase corresponds to the picture in the statement. To untangle the wires, one can first move the \"plus\" wire lower, thus eliminating the two crosses in the middle, and then draw it under the \"minus\" wire, eliminating also the remaining two crosses.In the second testcase the \"plus\" wire makes one full revolution around the \"minus\" wire. Thus the wires cannot be untangled:In the third testcase the \"plus\" wire simply runs above the \"minus\" wire twice in sequence. The wires can be untangled by lifting \"plus\" and moving it higher:In the fourth testcase the \"minus\" wire runs above the \"plus\" wire once. The wires cannot be untangled without moving the device itself:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9c9837c7", "template_md5": "35d339e4", "result": "You are given a sequence of characters, where \"+\" represents the \"plus\" wire being above the \"minus\" wire and \"-\" represents the \"minus\" wire being above the \"plus\" wire.  The sequence describes the order in which the wires cross each other as they run from a wall to a device.\n\nThe \"plus\" wire is always plugged into the top contact on the wall.\n\nDetermine if it is possible to untangle the wires without unplugging them or moving the device.  The wires can be freely moved and stretched on the floor, but cannot be cut. \n\n**Input:**\n\nA string of \"+\" and \"-\" characters representing the wire crossings. The length of the string is between 1 and 100,000.\n\n**Output:**\n\nPrint \"Yes\" if the wires can be untangled, and \"No\" if they cannot."}, {"prompt_md5": "1a41cceb", "template_md5": "465699a0", "result": "Given a sequence describing which wire is above the other at each point along its path, determine if it's possible to untangle the wires without moving the device or unplugging them."}]}