{"uid": "344-B", "url": "https://codeforces.com/contest/344/problem/B", "tags": ["brute force", " graphs", " math"], "title": "344-B", "statement": "B. Simple Moleculestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMad scientist Mike is busy carrying out experiments in chemistry. Today he will attempt to join three atoms into one molecule.A molecule consists of atoms, with some pairs of atoms connected by atomic bonds. Each atom has a valence number — the number of bonds the atom must form with other atoms. An atom can formone or multiplebonds with any other atom, but it cannot form a bond with itself. The number of bonds of an atom in the molecule must be equal to its valence number.Mike knows valence numbers of the three atoms. Find a molecule that can be built from these atoms according to the stated rules, or determine that it is impossible.InputThe single line of the input contains three space-separated integersa,bandc(1 ≤a,b,c≤ 106) — the valence numbers of the given atoms.OutputIf such a molecule can be built, print three space-separated integers — the number of bonds between the 1-st and the 2-nd, the 2-nd and the 3-rd, the 3-rd and the 1-st atoms, correspondingly. If there are multiple solutions, output any of them. If there is no solution, print \"Impossible\" (without the quotes).ExamplesInput1 1 2Output0 1 1Input3 4 5Output1 3 2Input4 1 1OutputImpossibleNoteThe first sample corresponds to the first figure. There are no bonds between atoms 1 and 2 in this case.The second sample corresponds to the second figure. There is one or more bonds between each pair of atoms.The third sample corresponds to the third figure. There is no solution, because an atom cannot form bonds with itself.The configuration in the fourth figure is impossible as each atom must have at least one atomic bond.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c7311f64", "template_md5": "35d339e4", "result": "Given three integers $a$, $b$, and $c$ representing the valence numbers of three atoms, determine if a molecule can be formed from these atoms. \n\nIf a molecule can be formed, output three integers representing the number of bonds between each pair of atoms. If no molecule can be formed, output \"Impossible\". \n\nThe molecule must satisfy the following rules:\n\n* Each atom must form bonds with other atoms until it has formed $a$, $b$, or $c$ bonds, respectively.\n* An atom cannot form a bond with itself. \n* The number of bonds formed by each atom must equal its valence number."}, {"prompt_md5": "1d38d248", "template_md5": "465699a0", "result": "Given three numbers representing the bonding needs of three objects, find a way to connect them with bonds so that each object has the required number of bonds. If no such connection is possible, say \"Impossible\"."}]}