{"uid": "345-B", "url": "https://codeforces.com/contest/345/problem/B", "tags": ["*special"], "title": "345-B", "statement": "B. Triskaidekaphobiatime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTriskaidekaphobia is a fear of number 13. Ordinary people who suffer from this phobia feel uncomfortable around numbers 13, 130, 513 etc, but you, being a programmer, take this fear one step further. For example, consider number 7. It's ok when written in decimal, but written in base 4 it becomes 13, the dreadful number!The more you think about it, the worse it looks. Number 100 has as many as 13 notations which contain 13! And there are numbers which have 13 in infinite number of their notations! Luckily, you can do any math in binary, which is completely safe from the nasty number. But still, you want to be able to estimate the level of nastiness of any number.Your task is: given an integern, find the number of different integer basesb(b≥ 2)for whichn, written in baseb, contains at least one 13. Assume that \"digits\" of the number in bases larger than 10 are written not as letters but as decimal numbers; thus, 30 in base 16 is not 1E but (1)(14) or simply 114. Please note, that 13 must be present as a substring of notation, not a subsequence (123 doesn't contain 13).InputThe only line of the input contains a single integern(1 ≤n≤ 105).OutputOutput a single integer — the number of different integer basesb(b≥ 2)for whichn, written in baseb, contains at least one 13. If there are infinitely many such bases, output -1.ExamplesInput7Output1Input100Output13Input13Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "662c32a3", "template_md5": "35d339e4", "result": "Given an integer $n$, find the number of different integer bases $b$ ($b \\ge 2$) for which $n$, written in base $b$, contains at least one \"13\" as a substring.  \n\nFor example, 7 in base 4 is 13, so the answer for $n=7$ is 1. \n\nIf there are infinitely many such bases, output -1."}, {"prompt_md5": "baebaf1d", "template_md5": "465699a0", "result": "Given a number, find how many number systems (bases) you can write it in where the number contains the sequence \"13\" within its representation.  If there are infinitely many such bases, output -1."}]}