{"uid": "345-D", "url": "https://codeforces.com/contest/345/problem/D", "tags": ["*special", " dfs and similar", " graphs"], "title": "345-D", "statement": "D. Chain Lettertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA chain letter is a kind of a message which urges the recipient to forward it to as many contacts as possible, usually with some kind of mystic explanation. Of course, this is only a superstition, and you don't believe in it, but all your friends do. You know that today there will be one of these letters going around, and you want to know how many times you'll receive it — of course, not that you'll be sending it yourself!You are given an array of stringsfwithnelements which describes the contacts between you andn- 1of your friends:j-th character ofi-th string (f[i][j]) is \"1\" if peopleiandjwill send messages to each other, and \"0\" otherwise. Person 1 starts sending the letter to all his contacts; every person who receives the letter for the first time sends it to all his contacts. You are personn, and you don't forward the letter when you receive it.Calculate the number of copies of this letter you'll receive.InputThe first line of the input contains an integern(2 ≤n≤ 50)— the number of people involved. Nextnfollowing lines contain elements off, strings of lengthn. Each character infis either \"0\" or \"1\". It's guaranteed that two following equations hold:f[i][j] =f[j][i],f[i][i] = 0, for alli,j(1 ≤i,j≤n).OutputOutput a single integer — the number of copies of the letter you will receive eventually.ExamplesInput40111101111011110Output3Input40110101011000000Output0Input40101100100011110Output2NoteIn the first case, everybody sends letters to everyone, so you get copies from all three of your friends.In the second case, you don't know any of these people, so they don't bother you with their superstitious stuff.In the third case, two of your friends send you copies of the letter but the third friend doesn't know them so he is unaffected.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "20702668", "template_md5": "35d339e4", "result": "You are given a graph with $n$ nodes, where each edge represents a friendship.  Two people are friends if and only if there is an edge between them.  \n\nPerson 1 starts a chain letter and sends it to all their friends. Each person who receives the letter for the first time sends it to all their friends. You are person $n$ and you do not forward the letter.\n\nDetermine the number of times you will receive the chain letter. \n\n\n\nInput:\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 50) representing the number of people.\n* The next $n$ lines each contain a string of length $n$ where each character is either \"0\" or \"1\".  The $j$-th character of the $i$-th string represents whether person $i$ and person $j$ are friends (1 for friends, 0 for not friends).\n\nOutput:\n\n* A single integer representing the number of times you will receive the chain letter."}, {"prompt_md5": "1a6cf5b8", "template_md5": "465699a0", "result": "You are part of a group of people. You know who in the group communicates with whom. One person starts sending a message to everyone they know. Each person who receives the message for the first time sends it to everyone they know. You do not send the message further.  Count how many times you will receive the message."}]}