{"uid": "345-E", "url": "https://codeforces.com/contest/345/problem/E", "tags": ["*special"], "title": "345-E", "statement": "E. Black Cat Rushtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutToday you go out of your house and immediately notice that something is weird. Around your door there is a swarm of black cats — all tense paws and twitching tails. As you do your first step, they all dart off and start running towards you. It looks like they want to thwart you!You are moving in a straight line from point(0, 0)to point(a, 0)with velocityv. There arenblack cats around you who want to cross your paths. A cat can move in any direction with velocity at mostu. A cat assumes it has crossed your path if it managed to get to at least one point of your path earlier or at the same time as you got there.You are given four integers:a,v,u,n, as well as cats' coordinates(xi,yi). What is the greatest number of cats who manage to cross your path?InputThe first line contains four integersa,v,u,n(1 ≤a≤ 10000; 1 ≤v,u≤ 100; 1 ≤n≤ 1000). Each of the nextnlines contains two integersxi,yi( - 100 ≤xi,yi≤ 100)— location of thei-th cat.It's guaranteed that all cats are located in distinct points.OutputOutput a single integer — what is the greatest number of cats who manage to cross your path?ExamplesInput1 1 5 40 34 -47 0-2 -2Output3Input10 5 3 47 55 210 -715 0Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "21b7f839", "template_md5": "35d339e4", "result": "You are moving in a straight line from point $(0,0)$ to point $(a,0)$ with velocity $v$. There are $n$ cats that want to cross your path. Each cat can move in any direction with a maximum velocity of $u$. A cat crosses your path if it reaches any point on your path at the same time as you or earlier. \n\nYou are given:\n\n* $a$: the x-coordinate of your destination\n* $v$: your velocity\n* $u$: the maximum velocity of each cat\n* $n$: the number of cats\n* $(x_i, y_i)$: the coordinates of each cat\n\nDetermine the maximum number of cats that can cross your path."}, {"prompt_md5": "7571d335", "template_md5": "465699a0", "result": "You are moving horizontally from point (0,0) to point (a,0).  Several cats are scattered around you and can move in any direction at a maximum speed.  Determine the maximum number of cats that can reach your path before you get to your destination."}]}