{"uid": "346-A", "url": "https://codeforces.com/contest/346/problem/A", "tags": ["games", " math", " number theory"], "title": "346-A", "statement": "A. Alice and Bobtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIt is so boring in the summer holiday, isn't it? So Alice and Bob have invented a new game to play. The rules are as follows. First, they get a set ofndistinct integers. And then they take turns to make the following moves. During each move, either Alice or Bob (the player whose turn is the current) can choose two distinct integersxandyfrom the set, such that the set doesn't contain their absolute difference|x-y|. Then this player adds integer|x-y|to the set (so, the size of the set increases by one).If the current player has no valid move, he (or she) loses the game. The question is who will finally win the game if both players play optimally. Remember that Alice always moves first.InputThe first line contains an integern(2 ≤n≤ 100) — the initial number of elements in the set. The second line containsndistinct space-separated integersa1,a2, ...,an(1 ≤ai≤ 109) — the elements of the set.OutputPrint a single line with the winner's name. If Alice wins print \"Alice\", otherwise print \"Bob\" (without quotes).ExamplesInput22 3OutputAliceInput25 3OutputAliceInput35 6 7OutputBobNoteConsider the first test sample. Alice moves first, and the only move she can do is to choose 2 and 3, then to add 1 to the set. Next Bob moves, there is no valid move anymore, so the winner is Alice.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "853a27aa", "template_md5": "35d339e4", "result": "You are given a set of $n$ distinct integers. Two players take turns making moves.  In each move, a player chooses two distinct integers $x$ and $y$ from the set, such that the set does not contain their absolute difference $|x-y|$. The player then adds $|x-y|$ to the set. If a player cannot make a valid move, they lose. Determine which player will win if both players play optimally. \n\nThe first player moves first."}, {"prompt_md5": "6c3c33a3", "template_md5": "465699a0", "result": "Two players take turns removing two distinct numbers from a set.  The difference between the two numbers is then added to the set. The player who cannot make a move loses. Determine the winner if both players play optimally."}]}