{"uid": "347-A", "url": "https://codeforces.com/contest/347/problem/A", "tags": ["constructive algorithms", " implementation", " sortings"], "title": "347-A", "statement": "A. Difference Rowtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou want to arrangenintegersa1,a2, ...,anin some order in a row. Let's define the value of an arrangement as the sum of differences between all pairs of adjacent integers.More formally, let's denote some arrangement as a sequence of integersx1,x2, ...,xn, where sequencexis a permutation of sequencea. The value of such an arrangement is(x1-x2) + (x2-x3) + ... + (xn- 1-xn).Find the largest possible value of an arrangement. Then, output the lexicographically smallest sequencexthat corresponds to an arrangement of the largest possible value.InputThe first line of the input contains integern(2 ≤n≤ 100). The second line containsnspace-separated integersa1,a2,...,an(|ai| ≤ 1000).OutputPrint the required sequencex1,x2, ...,xn. Sequencexshould be the lexicographically smallest permutation ofathat corresponds to an arrangement of the largest possible value.ExamplesInput5100 -100 50 0 -50Output100 -50 0 50 -100NoteIn the sample test case, the value of the output arrangement is(100 - ( - 50)) + (( - 50) - 0) + (0 - 50) + (50 - ( - 100)) = 200. No other arrangement has a larger value, and among all arrangements with the value of200, the output arrangement is the lexicographically smallest one.Sequencex1,x2, ... ,xpislexicographically smallerthan sequencey1,y2, ... ,ypif there exists an integerr(0 ≤r<p)such thatx1=y1,x2=y2, ... ,xr=yrandxr+ 1<yr+ 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "89b6f408", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers ($n$ is between 2 and 100, and each integer is between -1000 and 1000).  You need to arrange these integers in a row.  The \"value\" of an arrangement is the sum of the differences between each pair of adjacent integers.\n\nFor example, if your list is [1, 2, 3] and you arrange it as [3, 1, 2], the value would be (3-1) + (1-2) = 2.\n\nFind the arrangement that has the largest possible value. Then, output that arrangement in the order that comes first alphabetically."}, {"prompt_md5": "a032a632", "template_md5": "465699a0", "result": "You are given a list of numbers.  Rearrange the numbers in a line.  Find the arrangement that results in the largest sum of differences between each pair of adjacent numbers. Output that arrangement."}]}