{"uid": "348-E", "url": "https://codeforces.com/contest/348/problem/E", "tags": ["dfs and similar", " dp", " trees"], "title": "348-E", "statement": "E. Pilgrimstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA long time ago there was a land called Dudeland. Dudeland consisted ofntowns connected withn- 1bidirectonal roads. The towns are indexed from1tonand one can reach any city from any other city if he moves along the roads of the country. There aremmonasteries in Dudeland located inmdifferent towns. In each monastery lives a pilgrim.At the beginning of the year, each pilgrim writes down which monastery is the farthest from the monastery he is living in. If there is more than one farthest monastery, he lists all of them. On the Big Lebowski day each pilgrim picks one town from his paper at random and starts walking to that town.Walter hates pilgrims and wants to make as many of them unhappy as possible by preventing them from finishing their journey. He plans to destroy exactly one town that does not contain a monastery. A pilgrim becomes unhappy if all monasteries in his list become unreachable from the monastery he is living in.You need to find the maximum number of pilgrims Walter can make unhappy. Also find the number of ways he can make this maximal number of pilgrims unhappy: the number of possible towns he can destroy.InputThe first line contains two integersn(3 ≤n≤ 105) andm(2 ≤m<n). The next line containsmdistinct integers representing indices of towns that contain monasteries.Nextn- 1lines contain three integers each,ai,bi,ci, indicating that there is an edge between townsaiandbiof lengthci(1 ≤ai,bi≤n, 1 ≤ci≤ 1000,ai≠bi).OutputOutput two integers: the maximum number of pilgrims Walter can make unhappy and the number of ways in which he can make his plan come true.ExamplesInput8 57 2 5 4 81 2 12 3 21 4 14 5 21 6 16 7 86 8 10Output5 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "230ff7f7", "template_md5": "35d339e4", "result": "There are $n$ towns connected by $n-1$ bidirectional roads.  There are $m$ monasteries, each located in a different town.\n\nEach pilgrim living in a monastery writes down the indices of all the monasteries that are farthest from their own monastery.\n\nOn a specific day, each pilgrim randomly chooses one of the monasteries from their list and starts walking towards it.\n\nYou can destroy exactly one town that does not contain a monastery.  A pilgrim becomes unhappy if all the monasteries on their list become unreachable from their own monastery after you destroy a town.\n\nFind the maximum number of pilgrims you can make unhappy, and the number of different towns you could destroy to achieve this maximum unhappiness."}, {"prompt_md5": "fafd4eca", "template_md5": "465699a0", "result": "There are cities connected by roads. Some cities have special buildings. People live in these buildings and each person has a list of the farthest cities from their own.  You need to find the maximum number of people you can make unhappy by destroying one city (that doesn't have a building) so that the farthest cities on their lists become unreachable. Also, find how many different cities you could destroy to achieve this maximum unhappiness."}]}