{"uid": "350-D", "url": "https://codeforces.com/contest/350/problem/D", "tags": ["binary search", " data structures", " geometry", " hashing", " sortings"], "title": "350-D", "statement": "D. Looking for Owlstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutEmperor Palpatine loves owls very much. The emperor has some blueprints with the new Death Star, the blueprints containndistinct segments andmdistinct circles. We will consider the segments indexed from1tonin some way and the circles — indexed from1tomin some way.Palpatine defines an owl as a set of a pair of distinct circles(i,j)(i<j) and one segmentk, such that:circlesiandjare symmetrical relatively to the straight line containing segmentk;circlesiandjdon't have any common points;circlesiandjhave the same radius;segmentkintersects the segment that connects the centers of circlesiandj.Help Palpatine, count the number of distinct owls on the picture.InputThe first line contains two integers —nandm(1 ≤n≤ 3·105,2 ≤m≤ 1500).The nextnlines contain four integers each,x1,y1,x2,y2— the coordinates of the two endpoints of the segment. It's guaranteed that each segment has positive length.The nextmlines contain three integers each,xi,yi,ri— the coordinates of the center and the radius of thei-th circle. All coordinates are integers of at most104in their absolute value. The radius is a positive integer of at most104.It is guaranteed that all segments and all circles are dictinct.OutputPrint a single number — the answer to the problem.Please, do not use the%lldspecifier to output 64-bit integers is С++. It is preferred to use thecoutstream or the%I64dspecifier.ExamplesInput1 23 2 3 -20 0 26 0 2Output1Input3 20 0 0 10 -1 0 10 -1 0 02 0 1-2 0 1Output3Input1 2-1 0 1 0-100 0 1100 0 1Output0NoteHere's an owl from the first sample. The owl is sitting and waiting for you to count it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1ceb9d8a", "template_md5": "35d339e4", "result": "You are given $n$ line segments and $m$ circles.  \n\n* Each line segment is defined by two points $(x_1, y_1)$ and $(x_2, y_2)$.\n* Each circle is defined by its center $(x_i, y_i)$ and radius $r_i$.\n\nAn \"owl\" is defined as a pair of distinct circles $(i, j)$ ($i < j$) and a line segment $k$ such that:\n\n* Circles $i$ and $j$ are symmetrical with respect to the line containing segment $k$.\n* Circles $i$ and $j$ do not intersect.\n* Circles $i$ and $j$ have the same radius.\n* Segment $k$ intersects the line segment connecting the centers of circles $i$ and $j$.\n\nCount the number of distinct owls."}, {"prompt_md5": "550fc7fa", "template_md5": "465699a0", "result": "You are given a set of line segments and a set of circles.  Find the number of pairs of distinct circles and a line segment where:\n\n* The two circles are symmetrical across the line segment.\n* The circles do not intersect.\n* The circles have the same radius.\n* The line segment intersects the line connecting the centers of the two circles."}]}