{"uid": "353-E", "url": "https://codeforces.com/contest/353/problem/E", "tags": ["dp", " graph matchings", " greedy"], "title": "353-E", "statement": "E. Antichaintime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou have a directed acyclic graphG, consisting ofnvertexes, numbered from0ton- 1. The graph containsnedges numbered from0ton- 1. An edge with numbericonnects vertexesiand(i+ 1)modn, and it can be directed in either direction (fromito(i+ 1)modn, or vise versa).Operationxmodymeans taking the remainder after dividing numberxby numbery.Let's call two vertexesuandvin graphGcomparable if the graph contains a path either fromutovor fromvtou. We'll assume that an antichain is a set of vertexes of graphG, where any two distinct vertexes are not comparable. The size of an antichain is the number of vertexes in the corresponding set. An antichain is maximum if the graph doesn't have antichains of a larger size.Your task is to find the size of the maximum antichain in graphG.InputThe first line contains the sequence of characterss0s1...sn- 1(2 ≤n≤ 106), consisting of numbers zero and one. The length of the line (numbern) corresponds to the number of vertexes and edges in graphG. If charactersi(i≥ 0)equals0, then the edge between vertexesiand(i+ 1)modnis directed from thei-th vertex to the(i+ 1)modn-th one, otherwise — to the opposite point.It is guaranteed that the given graph is acyclic.OutputPrint a single integer — the size of the maximum antichain of graphG.ExamplesInput001Output1Input110010Output3NoteConsider the first test sample. The graph'sGedges are:0 → 1,1 → 2,0 → 2. We can choose the set of vertexes[0]as the maximum antichain. We cannot choose an antichain of larger size.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1a1c0601", "template_md5": "35d339e4", "result": "You are given a directed acyclic graph with $n$ vertices, numbered from 0 to $n-1$.  Each edge connects vertex $i$ to vertex $(i+1) \\mod n$. The direction of each edge can be either from $i$ to $(i+1) \\mod n$ or from $(i+1) \\mod n$ to $i$.\n\nTwo vertices $u$ and $v$ are comparable if there is a path from $u$ to $v$ or from $v$ to $u$ in the graph.\n\nAn antichain is a set of vertices where no two vertices are comparable. The size of an antichain is the number of vertices in the set. A maximum antichain is an antichain that is not a subset of any larger antichain.\n\nYour task is to find the size of the maximum antichain in the graph.\n\n**Input:**\n\nThe first line contains a string of 0s and 1s of length $n$, where each character represents the direction of an edge. A 0 indicates the edge goes from vertex $i$ to vertex $(i+1) \\mod n$, and a 1 indicates the edge goes from vertex $(i+1) \\mod n$ to vertex $i$.\n\n**Output:**\n\nPrint a single integer representing the size of the maximum antichain."}, {"prompt_md5": "8ce569bc", "template_md5": "465699a0", "result": "You are given a directed graph.  Find the largest group of nodes where no two nodes have a path between them."}]}