{"uid": "353-A", "url": "https://codeforces.com/contest/353/problem/A", "tags": ["implementation", " math"], "title": "353-A", "statement": "A. Dominotime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutValera has gotndomino pieces in a row. Each piece consists of two halves — the upper one and the lower one. Each of the halves contains a number from1to6. Valera loves even integers very much, so he wants the sum of the numbers on the upper halves and the sum of the numbers on the lower halves to be even.To do that, Valera can rotate the dominoes by180degrees. After the rotation the upper and the lower halves swap places. This action takes one second. Help Valera find out the minimum time he must spend rotating dominoes to make his wish come true.InputThe first line contains integern(1 ≤n≤ 100), denoting the number of dominoes Valera has. Nextnlines contain two space-separated integersxi,yi(1 ≤xi,yi≤ 6). Numberxiis initially written on the upper half of thei-th domino,yiis initially written on the lower half.OutputPrint a single number — the minimum required number of seconds. If Valera can't do the task in any time, print- 1.ExamplesInput24 26 4Output0Input12 3Output-1Input31 42 34 4Output1NoteIn the first test case the sum of the numbers on the upper halves equals10and the sum of the numbers on the lower halves equals6. Both numbers are even, so Valera doesn't required to do anything.In the second sample Valera has only one piece of domino. It is written3on the one of its halves, therefore one of the sums will always be odd.In the third case Valera can rotate the first piece, and after that the sum on the upper halves will be equal to10, and the sum on the lower halves will be equal to8.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2bbc1c9", "template_md5": "35d339e4", "result": "You are given $n$ dominoes, where each domino has two halves with numbers from 1 to 6.  You can rotate each domino 180 degrees.  \n\nDetermine the minimum number of rotations needed to make the sum of the numbers on the top halves of all dominoes even, and the sum of the numbers on the bottom halves even. If it's impossible to achieve this, output -1."}, {"prompt_md5": "e2c6477f", "template_md5": "465699a0", "result": "You have a set of objects, each with two sides. Each side has a number on it.  You want the sum of the numbers on one side to be even and the sum of the numbers on the other side to be even. You can flip each object over, which takes one unit of time. Find the minimum time needed to make this happen. If it's impossible, say so."}]}