{"uid": "354-B", "url": "https://codeforces.com/contest/354/problem/B", "tags": ["bitmasks", " dp", " games"], "title": "354-B", "statement": "B. Game with Stringstime limit per test1 secondmemory limit per test512 megabytesinputstdinoutputstdoutGiven ann×ntableTconsisting of lowercase English letters. We'll consider some stringsgoodif the table contains a correct path corresponding to the given string. In other words, good strings are all strings we can obtain by moving from the left upper cell of the table only to the right and down. Here's the formal definition of correct paths:Consider rows of the table are numbered from 1 tonfrom top to bottom, and columns of the table are numbered from 1 tonfrom left to the right. Cell(r,c)is a cell of tableTon ther-th row and in thec-th column. This cell corresponds to letterTr,c.A path of lengthkis a sequence of table cells[(r1,c1), (r2,c2), ..., (rk,ck)]. The following paths are correct:There is only one correct path of length1, that is, consisting of a single cell:[(1, 1)];Let's assume that[(r1,c1), ..., (rm,cm)]is a correct path of lengthm, then paths[(r1,c1), ..., (rm,cm), (rm+ 1,cm)]and[(r1,c1), ..., (rm,cm), (rm,cm+ 1)]are correct paths of lengthm+ 1.We should assume that a path[(r1,c1), (r2,c2), ..., (rk,ck)]corresponds to a string of lengthk:Tr1,c1+Tr2,c2+ ... +Trk,ck.Two players play the following game: initially they have an empty string. Then the players take turns to add a letter to the end of the string. After each move (adding a new letter) the resulting string must be good. The game ends after2n- 1turns. A player wins by the following scenario:If the resulting string has strictly more letters \"a\" than letters \"b\", then the first player wins;If the resulting string has strictly more letters \"b\" than letters \"a\", then the second player wins;If the resulting string has the same number of letters \"a\" and \"b\", then the players end the game with a draw.Your task is to determine the result of the game provided that both players played optimally well.InputThe first line contains a single numbern(1 ≤n≤ 20).Nextnlines containnlowercase English letters each — tableT.OutputIn a single line print string \"FIRST\", if the first player wins, \"SECOND\", if the second player wins and \"DRAW\", if the game ends with a draw.ExamplesInput2abcdOutputDRAWInput2xaayOutputFIRSTInput3aabbcbbacOutputDRAWNoteConsider the first sample:Good strings are strings:a,ab,ac,abd,acd.The first player moves first and adds letterato the string, as there is only one good string of length1. Then the second player can addborcand the game will end with stringsabdoracd, correspondingly. In the first case it will be a draw (the string has oneaand oneb), in the second case the first player wins. Naturally, in this case the second player prefers to choose letterband end the game with a draw.Consider the second sample:Good strings are:x,xa,xay.We can see that the game will end with stringxayand the first player wins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "917eb00f", "template_md5": "35d339e4", "result": "You are given an $n \\times n$ table filled with lowercase English letters.  \n\nA \"good string\" is formed by moving from the top-left cell of the table, only going right and down, and reading the letters in the path.\n\nTwo players take turns building a string, one letter at a time.  After each letter is added, the string must be good. The game ends after $2n-1$ turns.\n\nThe winner is determined as follows:\n\n* If the final string has more \"a\"s than \"b\"s, the first player wins.\n* If the final string has more \"b\"s than \"a\"s, the second player wins.\n* If the final string has an equal number of \"a\"s and \"b\"s, the game is a draw.\n\nDetermine the winner of the game if both players play optimally."}, {"prompt_md5": "57627893", "template_md5": "465699a0", "result": "Two players take turns building a string by adding one letter at a time. The letters come from a grid.  A valid string can only be built by moving right or down through the grid, starting from the top left corner. The game ends after a certain number of turns. The first player wins if the final string has more \"a\"s than \"b\"s, the second player wins if the final string has more \"b\"s than \"a\"s, and the game is a draw if there are an equal number of \"a\"s and \"b\"s. Determine the winner assuming both players play optimally."}]}