{"uid": "354-A", "url": "https://codeforces.com/contest/354/problem/A", "tags": ["brute force", " greedy", " math"], "title": "354-A", "statement": "A. Vasya and Robottime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutVasya hasnitems lying in a line. The items are consecutively numbered by numbers from1tonin such a way that the leftmost item has number1, the rightmost item has numbern. Each item has a weight, thei-th item weightswikilograms.Vasya needs to collect all these items, however he won't do it by himself. He uses his brand new robot. The robot has two different arms — the left one and the right one. The robot can consecutively perform the following actions:Take the leftmost item with the left hand and spendwi·lenergy units (wiis a weight of the leftmost item,lis some parameter). If the previous action was the same (left-hand), then the robot spends extraQlenergy units;Take the rightmost item with the right hand and spendwj·renergy units (wjis a weight of the rightmost item,ris some parameter). If the previous action was the same (right-hand), then the robot spends extraQrenergy units;Naturally, Vasya wants to program the robot in a way that the robot spends as little energy as possible. He asked you to solve this problem. Your task is to find the minimum number of energy units robot spends to collect all items.InputThe first line contains five integersn,l,r,Ql,Qr(1 ≤n≤ 105; 1 ≤l,r≤ 100; 1 ≤Ql,Qr≤ 104).The second line containsnintegersw1,w2, ...,wn(1 ≤wi≤ 100).OutputIn the single line print a single number — the answer to the problem.ExamplesInput3 4 4 19 142 3 99Output576Input4 7 2 3 91 2 3 4Output34NoteConsider the first sample. Asl=r, we can take an item in turns: first from the left side, then from the right one and last item from the left. In total the robot spends4·42 + 4·99 + 4·3 = 576energy units.The second sample. The optimal solution is to take one item from the right, then one item from the left and two items from the right. In total the robot spends(2·4) + (7·1) + (2·3) + (2·2 + 9) = 34energy units.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a7aeb8a1", "template_md5": "35d339e4", "result": "You are given $n$ items in a line, numbered from 1 to $n$. Each item has a weight $w_i$.  A robot can pick up items using its left or right hand.  \n\nHere are the rules:\n\n* **Left Hand:** The robot can pick up the leftmost item and spend $w_i \\cdot l$ energy units. If the previous action was also with the left hand, it spends an extra $Q_l$ energy units.\n* **Right Hand:** The robot can pick up the rightmost item and spend $w_i \\cdot r$ energy units. If the previous action was also with the right hand, it spends an extra $Q_r$ energy units.\n\nThe robot needs to collect all the items. Find the minimum total energy the robot needs to spend.\n\n**Input:**\n\n* The first line contains five integers: $n$, $l$, $r$, $Q_l$, and $Q_r$.\n* The second line contains $n$ integers: $w_1$, $w_2$, ..., $w_n$.\n\n**Output:**\n\n* Print a single integer: the minimum energy the robot needs to spend."}, {"prompt_md5": "79dbd6b9", "template_md5": "465699a0", "result": "You have a line of items, each with a weight. A robot can pick up items from either end. Picking up an item from the same side as the last action costs extra energy. Find the least amount of energy the robot needs to collect all the items."}]}