{"uid": "355-B", "url": "https://codeforces.com/contest/355/problem/B", "tags": ["greedy", " implementation"], "title": "355-B", "statement": "B. Vasya and Public Transporttime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutVasya often uses public transport. The transport in the city is of two types: trolleys and buses. The city hasnbuses andmtrolleys, the buses are numbered by integers from1ton, the trolleys are numbered by integers from1tom.Public transport is not free. There are 4 types of tickets:A ticket for one ride on some bus or trolley. It costsc1burles;A ticket for an unlimited number of rides on some bus or on some trolley. It costsc2burles;A ticket for an unlimited number of rides on all buses or all trolleys. It costsc3burles;A ticket for an unlimited number of rides on all buses and trolleys. It costsc4burles.Vasya knows for sure the number of rides he is going to make and the transport he is going to use. He asked you for help to find the minimum sum of burles he will have to spend on the tickets.InputThe first line contains four integersc1,c2,c3,c4(1 ≤c1,c2,c3,c4≤ 1000)— the costs of the tickets.The second line contains two integersnandm(1 ≤n,m≤ 1000)— the number of buses and trolleys Vasya is going to use.The third line containsnintegersai(0 ≤ai≤ 1000)— the number of times Vasya is going to use the bus numberi.The fourth line containsmintegersbi(0 ≤bi≤ 1000)— the number of times Vasya is going to use the trolley numberi.OutputPrint a single number — the minimum sum of burles Vasya will have to spend on the tickets.ExamplesInput1 3 7 192 32 54 4 4Output12Input4 3 2 11 37981 2 3Output1Input100 100 8 1003 57 94 12100 1 47 0 42Output16NoteIn the first sample the profitable strategy is to buy two tickets of the first type (for the first bus), one ticket of the second type (for the second bus) and one ticket of the third type (for all trolleys). It totals to(2·1) + 3 + 7 = 12burles.In the second sample the profitable strategy is to buy one ticket of the fourth type.In the third sample the profitable strategy is to buy two tickets of the third type: for all buses and for all trolleys.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7f54df82", "template_md5": "465699a0", "result": "You are given the cost of four types of transportation tickets. You are also given the number of times you will use each type of transportation. Find the cheapest way to buy tickets to cover all your transportation needs."}, {"prompt_md5": "782e6765", "template_md5": "35d339e4", "result": "There are four types of tickets:\n\n* **Type 1:** $c_1$ burles for one ride on a single bus or trolley.\n* **Type 2:** $c_2$ burles for unlimited rides on a single bus or trolley.\n* **Type 3:** $c_3$ burles for unlimited rides on all buses or all trolleys.\n* **Type 4:** $c_4$ burles for unlimited rides on all buses and trolleys.\n\nYou need to find the minimum cost to buy tickets for a given number of rides on buses and trolleys.\n\n**Input:**\n\n* Four integers: $c_1$, $c_2$, $c_3$, $c_4$ (the costs of each ticket type).\n* Two integers: $n$, $m$ (the number of buses and trolleys).\n* An integer array $a$ of length $n$ (the number of rides on each bus).\n* An integer array $b$ of length $m$ (the number of rides on each trolley).\n\n**Output:**\n\n* A single integer representing the minimum cost to buy tickets."}]}