{"uid": "356-C", "url": "https://codeforces.com/contest/356/problem/C", "tags": ["combinatorics", " constructive algorithms", " greedy", " implementation"], "title": "356-C", "statement": "C. Compartmentstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA team of students from the city S is sent to the All-Berland Olympiad in Informatics. Traditionally, they go on the train. All students have bought tickets in one carriage, consisting ofncompartments (each compartment has exactly four people). We know that if one compartment contain one or two students, then they get bored, and if one compartment contain three or four students, then the compartment has fun throughout the entire trip.The students want to swap with other people, so that no compartment with students had bored students. To swap places with another person, you need to convince him that it is really necessary. The students can not independently find the necessary arguments, so they asked a sympathetic conductor for help. The conductor can use her life experience to persuade any passenger to switch places with some student.However, the conductor does not want to waste time persuading the wrong people, so she wants to know what is the minimum number of people necessary to persuade her to change places with the students. Your task is to find the number.After all the swaps each compartment should either have no student left, or have a company of three or four students.InputThe first line contains integern(1 ≤n≤ 106) — the number of compartments in the carriage. The second line containsnintegersa1,a2, ...,anshowing how many students ride in each compartment (0 ≤ai≤ 4). It is guaranteed that at least one student is riding in the train.OutputIf no sequence of swapping seats with other people leads to the desired result, print number \"-1\" (without the quotes). In another case, print the smallest number of people you need to persuade to swap places.ExamplesInput51 2 2 4 3Output2Input34 1 1Output2Input40 3 0 4Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1fdb07fd", "template_md5": "35d339e4", "result": "You are given a train carriage with $n$ compartments, where each compartment can hold 4 people.  Each compartment currently has a certain number of students (between 0 and 4).  \n\nThe goal is to rearrange the students so that each compartment either has no students or exactly 3 or 4 students.  \n\nYou can swap a student with another person in the train, but you need to convince that person to swap.  \n\nFind the minimum number of people you need to convince to swap to achieve the desired arrangement. If it's impossible to achieve the desired arrangement, output -1."}, {"prompt_md5": "752eeb36", "template_md5": "465699a0", "result": "You are given a train with several compartments, each holding a certain number of people.  You need to rearrange the people so that each compartment has either no people or exactly three or four people. You can swap people with others in the train by convincing them to move. Find the minimum number of people you need to convince to swap. If it's impossible to achieve the desired arrangement, output -1."}]}