{"uid": "357-B", "url": "https://codeforces.com/contest/357/problem/B", "tags": ["constructive algorithms", " implementation"], "title": "357-B", "statement": "B. Flag Daytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIn Berland, there is the national holiday coming — the Flag Day. In the honor of this event the president of the country decided to make a big dance party and asked your agency to organize it. He has several conditions:overall, there must bemdances;exactly three people must take part in each dance;each dance must have one dancer in white clothes, one dancer in red clothes and one dancer in blue clothes (these are the colors of the national flag of Berland).The agency hasndancers, and their number can be less than3m. That is, some dancers will probably have to dance in more than one dance. All of your dancers must dance on the party. However, if some dance has two or more dancers from a previous dance, then the current dance stops being spectacular. Your agency cannot allow that to happen, so each dance has at most one dancer who has danced in some previous dance.You considered all the criteria and made the plan for themdances: each dance had three dancers participating in it. Your task is to determine the clothes color for each of thendancers so that the President's third condition fulfilled: each dance must have a dancer in white, a dancer in red and a dancer in blue. The dancers cannot change clothes between the dances.InputThe first line contains two space-separated integersn(3 ≤n≤ 105) andm(1 ≤m≤ 105) — the number of dancers and the number of dances, correspondingly. Thenmlines follow, describing the dances in the order of dancing them. Thei-th line contains three distinct integers — the numbers of the dancers that take part in thei-th dance. The dancers are numbered from1ton. Each dancer takes part in at least one dance.OutputPrintnspace-separated integers: thei-th number must represent the color of thei-th dancer's clothes (1for white,2for red,3for blue). If there are multiple valid solutions, print any of them. It is guaranteed that at least one solution exists.ExamplesInput7 31 2 31 4 54 6 7Output1 2 3 3 2 2 1Input9 33 6 92 5 81 4 7Output1 1 1 2 2 2 3 3 3Input5 24 1 53 1 2Output2 3 1 1 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97b6904a", "template_md5": "35d339e4", "result": "You are given $n$ dancers and $m$ dances. Each dance requires 3 dancers: one in white, one in red, and one in blue.  \n\n* Each dancer must participate in exactly one dance.\n* No dancer can participate in two dances that share a common dancer.\n\nDetermine a way to assign a color (white, red, or blue) to each dancer so that the requirements for each dance are met. \n\n**Input:**\n\n* The first line contains two integers: $n$ (the number of dancers) and $m$ (the number of dances).\n* The following $m$ lines each contain three distinct integers representing the dancers participating in each dance.\n\n**Output:**\n\n* Print $n$ integers, where each integer represents the color assigned to a dancer (1 for white, 2 for red, 3 for blue)."}, {"prompt_md5": "e01f9787", "template_md5": "465699a0", "result": "You are given a list of groups, each group containing 3 people.  Assign each person a color (white, red, or blue) so that each group has one person of each color.  You can reuse people in different groups, but no person can be in a group with someone they were already in."}]}