{"uid": "357-A", "url": "https://codeforces.com/contest/357/problem/A", "tags": ["brute force", " greedy", " implementation"], "title": "357-A", "statement": "A. Group of Studentstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAt the beginning of the school year Berland State University starts two city school programming groups, for beginners and for intermediate coders. The children were tested in order to sort them into groups. According to the results, each student got some score from 1 tompoints. We know thatc1schoolchildren got 1 point,c2children got 2 points, ...,cmchildren gotmpoints. Now you need to set the passing ratek(integer from 1 tom): all schoolchildren who got less thankpoints go to the beginner group and those who get at strictly leastkpoints go to the intermediate group. We know that if the size of a group is more thany, then the university won't find a room for them. We also know that if a group has less thanxschoolchildren, then it is too small and there's no point in having classes with it. So, you need to split all schoolchildren into two groups so that the size of each group was fromxtoy, inclusive.Help the university pick the passing rate in a way that meets these requirements.InputThe first line contains integerm(2 ≤m≤ 100). The second line containsmintegersc1,c2, ...,cm, separated by single spaces (0 ≤ci≤ 100). The third line contains two space-separated integersxandy(1 ≤x≤y≤ 10000). At least oneciis greater than 0.OutputIf it is impossible to pick a passing rate in a way that makes the size of each resulting groups at leastxand at mosty, print 0. Otherwise, print an integer from 1 tom— the passing rate you'd like to suggest. If there are multiple possible answers, print any of them.ExamplesInput53 4 3 2 16 8Output3Input50 3 3 4 23 10Output4Input22 53 6Output0NoteIn the first sample the beginner group has 7 students, the intermediate group has 6 of them.In the second sample another correct answer is 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "480fa615", "template_md5": "35d339e4", "result": "You are given the scores of $m$ students, where $c_i$ students scored $i$ points. You need to determine a passing score $k$ to divide the students into two groups:\n\n* **Beginner group:** Students who scored less than $k$ points.\n* **Intermediate group:** Students who scored at least $k$ points.\n\nThere are constraints on the group sizes:\n\n* Each group must have between $x$ and $y$ students, inclusive.\n\nIf it's impossible to find a passing score $k$ that satisfies these conditions, output 0. Otherwise, output any valid passing score $k$ from 1 to $m$."}, {"prompt_md5": "83c28f85", "template_md5": "465699a0", "result": "You are given a list of student scores.  You need to choose a passing score so that students scoring below it go into one group and students scoring at or above it go into another group.  \n\nThe groups must have between a minimum and maximum number of students.  If it's impossible to split the students this way, output 0. Otherwise, output the passing score."}]}