{"uid": "358-B", "url": "https://codeforces.com/contest/358/problem/B", "tags": ["brute force", " strings"], "title": "358-B", "statement": "B. Dima and Text Messagestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSeryozha has a very changeable character. This time he refused to leave the room to Dima and his girlfriend (her hame is Inna, by the way). However, the two lovebirds can always find a way to communicate. Today they are writing text messages to each other.Dima and Inna are using a secret code in their text messages. When Dima wants to send Inna some sentence, he writes out all words, inserting a heart before each word and after the last word. A heart is a sequence of two characters: the \"less\" characters (<) and the digit three (3). After applying the code, a test message looks like that: <3word1<3word2<3 ...wordn<3.Encoding doesn't end here. Then Dima inserts a random number of small English characters, digits, signs \"more\" and \"less\" into any places of the message.Inna knows Dima perfectly well, so she knows what phrase Dima is going to send her beforehand. Inna has just got a text message. Help her find out if Dima encoded the message correctly. In other words, find out if a text message could have been received by encoding in the manner that is described above.InputThe first line contains integern(1 ≤n≤ 105)— the number of words in Dima's message. Nextnlines contain non-empty words, one word per line. The words only consist of small English letters. The total length of all words doesn't exceed105.The last line contains non-empty text message that Inna has got. The number of characters in the text message doesn't exceed105. A text message can contain only small English letters, digits and signs more and less.OutputIn a single line, print \"yes\" (without the quotes), if Dima decoded the text message correctly, and \"no\" (without the quotes) otherwise.ExamplesInput3iloveyou<3i<3love<23you<3OutputyesInput7iamnotmaininthefamily<3i<>3am<3the<3<main<3in<3the<3><3family<3OutputnoNotePlease note that Dima got a good old kick in the pants for the second sample from the statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7596b479", "template_md5": "35d339e4", "result": "Given a list of words and a coded message, determine if the coded message was generated by a specific encoding scheme.\n\nThe encoding scheme works as follows:\n\n1.  Insert a sequence of \"<3\" before each word in the sentence.\n2.  Insert a sequence of \"<3\" after the last word in the sentence.\n3.  Randomly insert lowercase English letters, digits, \"<\", and \">\" into any position within the encoded message.\n\n**Input:**\n\n*   The first line contains an integer $n$ ($1 \\le n \\le 10^5$) representing the number of words in the original sentence.\n*   The next $n$ lines each contain a single word from the original sentence.\n*   The last line contains the coded message.\n\n**Output:**\n\nPrint \"yes\" if the coded message was generated according to the encoding scheme, and \"no\" otherwise."}, {"prompt_md5": "7bc0cf6e", "template_md5": "465699a0", "result": "Given a list of words and a coded message, determine if the message was created by inserting a specific code ( \"<3\" before and after each word) and then adding random characters."}]}