{"uid": "358-E", "url": "https://codeforces.com/contest/358/problem/E", "tags": ["brute force", " dsu", " graphs", " implementation"], "title": "358-E", "statement": "E. Dima and Kickstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDima is a good person. In fact, he's great. But all good things come to an end...Seryozha is going to kick Dima just few times.. For this reason he divides the room into unit squares. Now the room is a rectanglen×mconsisting of unit squares.For the beginning, Seryozha put Dima in a center of some square. Then he started to kick Dima (it is known, that he kicks Dima at least once). Each time when Dima is kicked he flyes up and moves into one of four directions (up, left, right, down). On each move Dima passesk(k> 1)unit of the length in the corresponding direction. Seryozha is really kind, so he kicks Dima in such way that Dima never meets the walls (in other words, Dima never leave the room's space). Seryozha is also dynamic character so Dima never flies above the same segment, connecting a pair of adjacent squares, twice.Seryozha kicks Dima for a long time, but Dima is not vindictive — Dima writes. Dima marked all squares in which he was staying or above which he was flying. Thanks to kicks, Dima does not remember thekvalue, so he asks you to find all possible values which matches to the Dima's records.InputThe first line containsnandm(1 ≤n,m≤ 103)— size of the room.Nextnlines goes, each containsmnumbersaij— Dima's notes:aij= 1, if Dima was staying in the square(i,j)or was flying above it. Otherwiseaij= 0.At least oneaijequals1.OutputIn a single line in accending order print allk(k> 1), which matches the Dima's notes. If there are no suchkand Dima invented this story with kicks, print -1.ExamplesInput5 51 1 1 1 11 0 0 0 11 0 0 0 11 0 0 0 11 1 1 1 1Output2 4Input7 70 0 1 1 1 0 00 0 1 0 1 0 01 1 1 1 1 1 11 0 1 0 1 0 11 1 1 1 1 1 10 0 1 0 1 0 00 0 1 1 1 0 0Output2Input3 31 1 11 1 11 1 1Output-1Input4 41 1 1 10 0 0 00 0 0 00 0 0 0Output3Input5 50 0 1 0 00 0 1 0 01 1 1 1 10 0 1 0 00 0 1 0 0Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6f38ea1c", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$.  Some squares in the grid have a value of 1, and the rest have a value of 0.  \n\nA person starts at the center of one of the squares. They then move repeatedly, always moving a distance of $k$ units in one of four directions (up, down, left, or right).  \n\nThe person never moves outside the grid, and they never move over the same line segment connecting two adjacent squares twice.\n\nYour task is to find all possible values of $k$ that could have resulted in the given grid pattern. If no such value of $k$ exists, output -1."}, {"prompt_md5": "b5ff6f9d", "template_md5": "465699a0", "result": "A room is represented as a grid.  You are given a pattern of marks on the grid.  The marks indicate where a person moved or flew over squares.  The person moved in a specific pattern, always moving a whole number of steps in one of four directions (up, down, left, right).  Find all possible distances the person could have moved in each step."}]}