{"uid": "358-C", "url": "https://codeforces.com/contest/358/problem/C", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "358-C", "statement": "C. Dima and Containerstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDima has a birthday soon! It's a big day! Saryozha's present to Dima is that Seryozha won't be in the room and won't disturb Dima and Inna as they celebrate the birthday. Inna's present to Dima is a stack, a queue and a deck.Inna wants her present to show Dima how great a programmer he is. For that, she is going to give Dima commands one by one. There are two types of commands:Add a given number into one of containers. For the queue and the stack, you can add elements only to the end. For the deck, you can add elements to the beginning and to the end.Extract a number from each of at most three distinct containers. Tell all extracted numbers to Inna and then empty all containers. In the queue container you can extract numbers only from the beginning. In the stack container you can extract numbers only from the end. In the deck number you can extract numbers from the beginning and from the end. You cannot extract numbers from empty containers.Every time Dima makes a command of the second type, Inna kisses Dima some (possibly zero) number of times. Dima knows Inna perfectly well, he is sure that this number equals the sum of numbers he extracts from containers during this operation.As we've said before, Dima knows Inna perfectly well and he knows which commands Inna will give to Dima and the order of the commands. Help Dima find the strategy that lets him give as more kisses as possible for his birthday!InputThe first line contains integern(1 ≤n≤ 105)— the number of Inna's commands. Thennlines follow, describing Inna's commands. Each line consists an integer:Integera(1 ≤a≤ 105)means that Inna gives Dima a command to add numberainto one of containers.Integer0shows that Inna asks Dima to make at most three extractions from different containers.OutputEach command of the input must correspond to one line of the output — Dima's action.For the command of the first type (adding) print one word that corresponds to Dima's choice:pushStack — add to the end of the stack;pushQueue — add to the end of the queue;pushFront — add to the beginning of the deck;pushBack — add to the end of the deck.For a command of the second type first print an integerk(0 ≤k≤ 3), that shows the number of extract operations, then printkwords separated by space. The words can be:popStack — extract from the end of the stack;popQueue — extract from the beginning of the line;popFront — extract from the beginning from the deck;popBack — extract from the end of the deck.The printed operations mustn't extract numbers from empty containers. Also, they must extract numbers from distinct containers.The printed sequence of actions must lead to the maximum number of kisses. If there are multiple sequences of actions leading to the maximum number of kisses, you are allowed to print any of them.ExamplesInput100101201230Output0pushStack1 popStackpushStackpushQueue2 popStack popQueuepushStackpushQueuepushFront3 popStack popQueue popFrontInput41230OutputpushStackpushQueuepushFront3 popStack popQueue popFront", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0a77ca0c", "template_md5": "35d339e4", "result": "You are given a sequence of commands. Each command is either:\n\n* An integer $a$ (1 ≤ $a$ ≤ 10⁵): Add the number $a$ to one of three containers: a stack, a queue, or a deck.\n* 0: Extract numbers from at most three different containers and output them.\n\nHere's how the containers work:\n\n* **Stack:**  Numbers are added and removed from the end.\n* **Queue:** Numbers are added and removed from the end.\n* **Deck:** Numbers can be added and removed from both ends.\n\nYou can only extract numbers from non-empty containers.  You must extract numbers from distinct containers in each operation.\n\nThe goal is to maximize the number of kisses you receive. You receive a kiss for every number you extract.\n\n**Input:**\n\nThe first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the number of commands. The following $n$ lines each contain a command (an integer or 0).\n\n**Output:**\n\nFor each command, output your action:\n\n* **Adding:**  Print one of the following words: `pushStack`, `pushQueue`, `pushFront`, `pushBack`.\n* **Extracting:** Print an integer $k$ (0 ≤ $k$ ≤ 3) followed by $k$ words representing the extraction operations (e.g., `popStack`, `popQueue`, `popFront`, `popBack`)."}, {"prompt_md5": "99fa40f4", "template_md5": "465699a0", "result": "You are given a sequence of commands. Some commands add a number to one of three containers (stack, queue, or deck). Other commands ask you to extract numbers from up to three of the containers and return the sum.  You want to maximize the number of times you extract numbers to get the most kisses.  \n\nYou know the order of the commands in advance.  \n\nOutput your actions for each command, choosing which container to add to or extract from."}]}