{"uid": "359-C", "url": "https://codeforces.com/contest/359/problem/C", "tags": ["math", " number theory"], "title": "359-C", "statement": "C. Prime Numbertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutSimon has a prime numberxand an array of non-negative integersa1,a2, ...,an.Simon loves fractions very much. Today he wrote out numberon a piece of paper. After Simon led all fractions to a common denominator and summed them up, he got a fraction:, where numbertequalsxa1+a2+ ... +an. Now Simon wants to reduce the resulting fraction.Help him, find the greatest common divisor of numberssandt. As GCD can be rather large, print it as a remainder after dividing it by number1000000007(109+ 7).InputThe first line contains two positive integersnandx(1 ≤n≤ 105,2 ≤x≤ 109) — the size of the array and the prime number.The second line containsnspace-separated integersa1,a2, ...,an(0 ≤a1≤a2≤ ... ≤an≤ 109).OutputPrint a single number — the answer to the problem modulo1000000007(109+ 7).ExamplesInput2 22 2Output8Input3 31 2 3Output27Input2 229 29Output73741817Input4 50 0 0 0Output1NoteIn the first sample. Thus, the answer to the problem is8.In the second sample,. The answer to the problem is27, as351 = 13·27,729 = 27·27.In the third sample the answer to the problem is1073741824mod1000000007 = 73741817.In the fourth sample. Thus, the answer to the problem is1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "db5c5c56", "template_md5": "35d339e4", "result": "You are given a prime number $x$ and an array of non-negative integers $a_1, a_2, ..., a_n$.  Calculate the greatest common divisor (GCD) of  $x(a_1 + a_2 + ... + a_n)$ and $(a_1 + a_2 + ... + a_n)$.  Print the GCD modulo $10^9 + 7$."}, {"prompt_md5": "304ca379", "template_md5": "465699a0", "result": "Given a prime number and an array of non-negative integers, find the greatest common divisor of the sum of the array elements and the product of the prime number and the sum of the array elements. The result should be modulo 1000000007."}]}