{"uid": "36-B", "url": "https://codeforces.com/contest/36/problem/B", "tags": ["implementation"], "title": "36-B", "statement": "B. Fractaltime limit per test2 secondsmemory limit per test64 megabytesinputinput.txtoutputoutput.txtEver since Kalevitch, a famous Berland abstractionist, heard of fractals, he made them the main topic of his canvases. Every morning the artist takes a piece of graph paper and starts with making a model of his future canvas. He takes a square as big asn×nsquares and paints some of them black. Then he takes a clean square piece of paper and paints the fractal using the following algorithm:Step 1. The paper is divided inton2identical squares and some of them are painted black according to the model.Step 2. Every square that remains white is divided inton2smaller squares and some of them are painted black according to the model.Every following step repeats step 2.Unfortunately, this tiresome work demands too much time from the painting genius. Kalevitch has been dreaming of making the process automatic to move to making 3D or even 4D fractals.InputThe first line contains integersnandk(2 ≤n≤ 3,1 ≤k≤ 5), wherekis the amount of steps of the algorithm. Each of the followingnlines containsnsymbols that determine the model. Symbol «.» stands for a white square, whereas «*» stands for a black one. It is guaranteed that the model has at least one white square.OutputOutput a matrixnk×nkwhich is what a picture should look like afterksteps of the algorithm.ExamplesInput2 3.*..Output.*******..******.*.*****....****.***.***..**..**.*.*.*.*........Input3 2.*.***.*.Output.*.***.*.*********.*.***.*.***************************.*.***.*.*********.*.***.*.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a499c5af", "template_md5": "35d339e4", "result": "You are given a square grid of size $n \\times n$ where each cell is either \".\" (white) or \"*\" (black).  This represents a starting pattern.\n\nYou will apply the following process $k$ times:\n\n1. Divide each white square into $2 \\times 2$ smaller squares.\n2.  Based on the original pattern, color some of these smaller squares black.\n\nOutput the final grid after $k$ iterations.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($2 \\le n \\le 3$, $1 \\le k \\le 5$).\n* The next $n$ lines each contain $n$ characters, representing the initial pattern.\n\n**Output:**\n\n* An $n \\times n$ grid of characters, representing the final pattern after $k$ iterations."}, {"prompt_md5": "0fef56c3", "template_md5": "465699a0", "result": "You are given a grid of squares, some of which are black and some are white.  You repeatedly divide each white square into smaller white squares and color them according to a given pattern. Output the final grid after a specified number of repetitions."}]}