{"uid": "36-C", "url": "https://codeforces.com/contest/36/problem/C", "tags": ["geometry", " implementation"], "title": "36-C", "statement": "C. Bowlstime limit per test2 secondsmemory limit per test64 megabytesinputinput.txtoutputoutput.txtOnce Petya was in such a good mood that he decided to help his mum with the washing-up. There werendirty bowls in the sink. From the geometrical point of view each bowl looks like a blunted cone. We can disregard the width of the walls and bottom. Petya puts the clean bowls one on another naturally, i. e. so that their vertical axes coincide (see the picture). You will be given the order in which Petya washes the bowls. Determine the height of the construction, i.e. the distance from the bottom of the lowest bowl to the top of the highest one.InputThe first input line contains integern(1 ≤n≤ 3000). Each of the followingnlines contains 3 integersh,randR(1 ≤h≤ 10000, 1 ≤r<R≤ 10000). They are the height of a bowl, the radius of its bottom and the radius of its top. The plates are given in the order Petya puts them on the table.OutputOutput the height of the plate pile accurate to at least10- 6.ExamplesInput240 10 5060 20 30Output70.00000000Input350 30 8035 25 7040 10 90Output55.00000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2185abdd", "template_md5": "35d339e4", "result": "You are given a list of bowls, each described by its height ($h$), the radius of its bottom ($r$), and the radius of its top ($R$).  The bowls are stacked one on top of the other, with their vertical axes aligned.  \n\nDetermine the total height of the stack of bowls. \n\nThe input will consist of:\n\n* The number of bowls ($n$)\n* For each bowl:\n    * Height ($h$)\n    * Bottom radius ($r$)\n    * Top radius ($R$)\n\nOutput the total height of the stack of bowls, accurate to at least 6 decimal places."}, {"prompt_md5": "6958c007", "template_md5": "465699a0", "result": "You are given a list of bowls, each with a height, bottom radius, and top radius. The bowls are stacked one on top of the other with their centers aligned.  Find the total height of the stack."}]}