{"uid": "36-E", "url": "https://codeforces.com/contest/36/problem/E", "tags": ["constructive algorithms", " dsu", " graphs", " implementation"], "title": "36-E", "statement": "E. Two Pathstime limit per test2 secondsmemory limit per test64 megabytesinputinput.txtoutputoutput.txtOnce archaeologists foundmmysterious papers, each of which had a pair of integers written on them. Ancient people were known to like writing down the indexes of the roads they walked along, as «ab» or «ba», wherea,bare the indexes of two different cities joint by the road . It is also known that the mysterious papers are pages of two travel journals (those days a new journal was written for every new journey).During one journey the traveler could walk along one and the same road several times in one or several directions but in that case he wrote a new entry for each time in his journal. Besides, the archaeologists think that the direction the traveler took on a road had no effect upon the entry: the entry that looks like «ab» could refer to the road fromatobas well as to the road frombtoa.The archaeologists want to put the pages in the right order and reconstruct the two travel paths but unfortunately, they are bad at programming. That’s where you come in. Go help them!InputThe first input line contains integerm(1 ≤m≤ 10000). Each of the followingmlines describes one paper. Each description consists of two integersa,b(1 ≤a,b≤ 10000,a≠b).OutputIn the first line output the numberL1. That is the length of the first path, i.e. the amount of papers in its description. In the following line outputL1space-separated numbers — the indexes of the papers that describe the first path. In the third and fourth lines output similarly the length of the second pathL2and the path itself. Both paths must contain at least one road, i.e. conditionL1> 0andL2> 0must be met. The papers are numbered from1tomaccording to the order of their appearance in the input file. The numbers should be output in the order in which the traveler passed the corresponding roads. If the answer is not unique, output any.If it’s impossible to find such two paths, output «-1».Don’t forget that each paper should be used exactly once, i.eL1+L2=m.ExamplesInput24 54 3Output1211Input11 2Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3957ac7d", "template_md5": "35d339e4", "result": "You are given a list of $m$ pairs of integers, where each pair represents a road between two cities.  \n\nThe goal is to divide these pairs into two groups, representing two different travel paths.  \n\n* Each pair can only be used once.\n* The order of the pairs in each group represents the order in which the traveler visited the cities on that path.\n\nIf it's possible to divide the pairs into two valid paths, output:\n\n1. The length of the first path ($L_1$).\n2. The list of pairs that make up the first path.\n3. The length of the second path ($L_2$).\n4. The list of pairs that make up the second path.\n\nIf it's impossible to divide the pairs into two valid paths, output \"-1\"."}, {"prompt_md5": "2373cc9c", "template_md5": "465699a0", "result": "You are given a list of pairs of numbers. Each pair represents a road traveled between two cities.  \n\nDetermine if you can split the list into two separate lists, where each list represents a unique travel path.  \n\nIf possible, output the length of each path and the order of the pairs in each path. If it's impossible to split the list, output \"-1\"."}]}