{"uid": "362-B", "url": "https://codeforces.com/contest/362/problem/B", "tags": ["implementation", " sortings"], "title": "362-B", "statement": "B. Petya and Staircasestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutLittle boy Petya loves stairs very much. But he is bored from simple going up and down them — he loves jumping over several stairs at a time. As he stands on some stair, he can either jump to the next one or jump over one or two stairs at a time. But some stairs are too dirty and Petya doesn't want to step on them.Now Petya is on the first stair of the staircase, consisting ofnstairs. He also knows the numbers of the dirty stairs of this staircase. Help Petya find out if he can jump through the entire staircase and reach the last stair numbernwithout touching a dirty stair once.One has to note that anyway Petya should step on the first and last stairs, so if the first or the last stair is dirty, then Petya cannot choose a path with clean steps only.InputThe first line contains two integersnandm(1 ≤n≤ 109,0 ≤m≤ 3000) — the number of stairs in the staircase and the number of dirty stairs, correspondingly. The second line containsmdifferentspace-separated integersd1,d2, ...,dm(1 ≤di≤n) — the numbers of the dirty stairs (in an arbitrary order).OutputPrint \"YES\" if Petya can reach stair numbern, stepping only on the clean stairs. Otherwise print \"NO\".ExamplesInput10 52 4 8 3 6OutputNOInput10 52 4 5 7 9OutputYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2d09ba44", "template_md5": "35d339e4", "result": "You are given a staircase with $n$ stairs. There are $m$ dirty stairs.  You need to determine if it is possible to reach the last stair ($n$) without stepping on any dirty stairs. You can jump one, two, or three stairs at a time. \n\nInput:\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n \\le 10^9$, $0 \\le m \\le 3000$), representing the number of stairs and the number of dirty stairs.\n* The second line contains $m$ integers, $d_1, d_2, ..., d_m$ ($1 \\le d_i \\le n$), representing the numbers of the dirty stairs.\n\nOutput:\n\n* Print \"YES\" if it is possible to reach the last stair without stepping on a dirty stair. Otherwise, print \"NO\"."}, {"prompt_md5": "2dcc00f0", "template_md5": "465699a0", "result": "You are given a staircase with a number of steps. Some steps are dirty and cannot be stepped on.  You start at the first step and can only jump to the next step, or skip one or two steps. Can you reach the last step without stepping on any dirty steps?"}]}