{"uid": "363-C", "url": "https://codeforces.com/contest/363/problem/C", "tags": ["greedy", " implementation"], "title": "363-C", "statement": "C. Fixing Typostime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMany modern text editors automatically check the spelling of the user's text. Some editors even suggest how to correct typos.In this problem your task to implement a small functionality to correct two types of typos in a word. We will assume that three identical letters together is a typo (for example, word \"helllo\" contains a typo). Besides, a couple of identical letters immediately followed by another couple of identical letters is a typo too (for example, words \"helloo\" and \"wwaatt\" contain typos).Write a code that deletes the minimum number of letters from a word, correcting described typos in the word. You are allowed to delete letters from both ends and from the middle of the word.InputThe single line of the input contains words, its length is from 1 to 200000 characters. The given wordsconsists of lowercase English letters.OutputPrint such wordtthat it doesn't contain any typos described in the problem statement and is obtained fromsby deleting the least number of letters.If there are multiple solutions, print any of them.ExamplesInputhellooOutputhelloInputwoooooowOutputwoowNoteThe second valid answer to the test from the statement is \"heloo\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "601433ac", "template_md5": "35d339e4", "result": "You are given a word.  The word may contain typos where:\n\n* Three identical letters are together (e.g., \"helllo\")\n* Two pairs of identical letters are together (e.g., \"helloo\" or \"wwaatt\")\n\nYour task is to find the shortest possible version of the word by deleting letters, so that it no longer contains these typos.  You can delete letters from the beginning, middle, or end of the word. \n\nPrint the shortest corrected word. If there are multiple solutions, any one is acceptable."}, {"prompt_md5": "3d873c4b", "template_md5": "465699a0", "result": "Fix typos in a word by deleting letters. A typo is three identical letters in a row, or two pairs of identical letters next to each other. Find the shortest word without typos."}]}