{"uid": "364-B", "url": "https://codeforces.com/contest/364/problem/B", "tags": ["dp", " greedy"], "title": "364-B", "statement": "B. Free Markettime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutJohn Doe has recently found a \"Free Market\" in his city — that is the place where you can exchange some of your possessions for other things for free.John knows that his city hasnitems in total (each item is unique). You can bring any number of items to the market and exchange them for any other one. Note that each item is one of a kind and that means that you cannot exchange set{a,b}for set{v,a}. However, you can always exchange setxfor any sety, unless there is itemp, such thatpoccurs inxandpoccurs iny.For each item, John knows its valueci. John's sense of justice doesn't let him exchange a set of itemsxfor a set of itemsy, ifs(x) +d<s(y)(s(x)is the total price of items in the setx).During one day John can exchange only one set of items for something else. Initially, he has no items. John wants to get a set of items with the maximum total price. Find the cost of such set and the minimum number of days John can get it in.InputThe first line contains two space-separated integersn,d(1 ≤n≤ 50,1 ≤d≤ 104) — the number of items on the market and John's sense of justice value, correspondingly. The second line containsnspace-separated integersci(1 ≤ci≤ 104).OutputPrint two space-separated integers: the maximum possible price in the set of items John can get and the minimum number of days needed to get such set.ExamplesInput3 21 3 10Output4 3Input3 51 2 3Output6 2Input10 1000010000 9999 1 10000 10000 10000 1 2 3 4Output50010 6NoteIn the first sample John can act like this:Take the first item (1 - 0 ≤ 2).Exchange the first item for the second one (3 - 1 ≤ 2).Take the first item (1 - 0 ≤ 2).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "96241f55", "template_md5": "35d339e4", "result": "There are $n$ unique items, each with a value $c_i$. You can exchange sets of items for other sets, but you cannot exchange a set $x$ for a set $y$ if there is an item that is in both $x$ and $y$.  You also cannot exchange a set $x$ for a set $y$ if the total value of $x$ plus $d$ is less than the total value of $y$.\n\nYou start with no items. Find the maximum total value of a set of items you can obtain and the minimum number of days it takes to get that set."}, {"prompt_md5": "90dc88f2", "template_md5": "465699a0", "result": "You have a set of items, each with a value. You can trade any number of items for any other set of items, as long as no item is duplicated in the trade. You also have a fairness rule: the total value of the items you trade away must be less than or equal to the total value of the items you receive.  Find the highest total value you can achieve and the fewest trades it takes."}]}