{"uid": "366-A", "url": "https://codeforces.com/contest/366/problem/A", "tags": ["implementation"], "title": "366-A", "statement": "A. Dima and Guardstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutNothing has changed since the last round. Dima and Inna still love each other and want to be together. They've made a deal with Seryozha and now they need to make a deal with the dorm guards...There are four guardposts in Dima's dorm. Each post contains two guards (in Russia they are usually elderly women). You can bribe a guard by a chocolate bar or a box of juice. For each guard you know the minimum price of the chocolate bar she can accept as a gift and the minimum price of the box of juice she can accept as a gift. If a chocolate bar for some guard costs less than the minimum chocolate bar price for this guard is, or if a box of juice for some guard costs less than the minimum box of juice price for this guard is, then the guard doesn't accept such a gift.In order to pass through a guardpost, one needs to bribe both guards.The shop has an unlimited amount of juice and chocolate of any price starting with1. Dima wants to choose some guardpost, buy one gift for each guard from the guardpost and spendexactlynrubles on it.Help him choose a post through which he can safely sneak Inna or otherwise say that this is impossible. Mind you, Inna would be very sorry to hear that!InputThe first line of the input contains integern(1 ≤n≤ 105)— the money Dima wants to spend. Then follow four lines describing the guardposts. Each line contains four integersa,b,c,d(1 ≤a,b,c,d≤ 105)— the minimum price of the chocolate and the minimum price of the juice for the first guard and the minimum price of the chocolate and the minimum price of the juice for the second guard, correspondingly.OutputIn a single line of the output print three space-separated integers: the number of the guardpost, the cost of the first present and the cost of the second present. If there is no guardpost Dima can sneak Inna through at such conditions, print -1 in a single line.The guardposts are numbered from1to4according to the order given in the input.If there are multiple solutions, you can print any of them.ExamplesInput105 6 5 66 6 7 75 8 6 69 9 9 9Output1 5 5Input106 6 6 67 7 7 74 4 4 48 8 8 8Output3 4 6Input53 3 3 33 3 3 33 3 3 33 3 3 3Output-1NoteExplanation of the first example.The only way to spend 10 rubles to buy the gifts that won't be less than the minimum prices is to buy two 5 ruble chocolates to both guards from the first guardpost.Explanation of the second example.Dima needs 12 rubles for the first guardpost, 14 for the second one, 16 for the fourth one. So the only guardpost we can sneak through is the third one. So, Dima can buy 4 ruble chocolate for the first guard and 6 ruble juice of the second guard.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "040f4029", "template_md5": "35d339e4", "result": "There are four guard posts. Each guard post has two guards.  To pass through a guard post, you must bribe both guards. Each guard has a minimum price for a chocolate bar and a minimum price for a box of juice. You have $n$ rubles to spend.  \n\nFind a guard post where you can buy one gift for each guard, spending exactly $n$ rubles, where the gifts meet or exceed the minimum prices for each guard. If this is not possible, output -1.\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the amount of money you have.\n* The next four lines each contain four integers representing the minimum prices for chocolate and juice for each guard at a guard post.\n\nOutput:\n\n* Output three space-separated integers: the number of the guard post, the cost of the first gift, and the cost of the second gift.\n* If no guard post can be passed through, output -1."}, {"prompt_md5": "506581b1", "template_md5": "465699a0", "result": "You have a certain amount of money. There are several locations, each with two items for sale. Each item has a minimum price. You need to choose a location and buy one item from each of the two sellers there, spending exactly the given amount of money.  Can you do this while ensuring the price of each item is at least as high as the minimum price for that seller? If yes, output the location number and the price of each item. If not, output -1."}]}