{"uid": "366-C", "url": "https://codeforces.com/contest/366/problem/C", "tags": ["dp"], "title": "366-C", "statement": "C. Dima and Saladtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDima, Inna and Seryozha have gathered in a room. That's right, someone's got to go. To cheer Seryozha up and inspire him to have a walk, Inna decided to cook something.Dima and Seryozha havenfruits in the fridge. Each fruit has two parameters: the taste and the number of calories. Inna decided to make a fruit salad, so she wants to take some fruits from the fridge for it. Inna follows a certain principle as she chooses the fruits: the total taste to the total calories ratio of the chosen fruits must equalk. In other words,, whereajis the taste of thej-th chosen fruit andbjis its calories.Inna hasn't chosen the fruits yet, she is thinking: what is the maximum taste of the chosen fruits if she strictly follows her principle? Help Inna solve this culinary problem — now the happiness of a young couple is in your hands!Inna loves Dima very much so she wants to make the salad from at least one fruit.InputThe first line of the input contains two integersn,k(1 ≤n≤ 100, 1 ≤k≤ 10). The second line of the input containsnintegersa1,a2, ...,an(1 ≤ai≤ 100)— the fruits' tastes. The third line of the input containsnintegersb1,b2, ...,bn(1 ≤bi≤ 100)— the fruits' calories. Fruit numberihas tasteaiand caloriesbi.OutputIf there is no way Inna can choose the fruits for the salad, print in the single line number -1. Otherwise, print a single integer — the maximum possible sum of the taste values of the chosen fruits.ExamplesInput3 210 8 12 7 1Output18Input5 34 4 4 4 42 2 2 2 2Output-1NoteIn the first test sample we can get the total taste of the fruits equal to 18 if we choose fruit number 1 and fruit number 2, then the total calories will equal 9. The conditionfulfills, that's exactly what Inna wants.In the second test sample we cannot choose the fruits so as to follow Inna's principle.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a3e0fa07", "template_md5": "35d339e4", "result": "You are given $n$ fruits, each with a taste value ($a_i$) and a calorie value ($b_i$).  You need to select some fruits to make a salad. The ratio of the total taste to the total calories of the selected fruits must equal a given constant $k$.\n\nFind the maximum possible sum of the taste values of the selected fruits. If it's impossible to make a salad that satisfies the condition, output -1."}, {"prompt_md5": "4b91df2e", "template_md5": "465699a0", "result": "You are given a list of items, each with a taste value and a calorie value.  Find the maximum total taste value of a subset of items such that the ratio of total taste to total calories is a constant. If no such subset exists, output -1."}]}