{"uid": "366-E", "url": "https://codeforces.com/contest/366/problem/E", "tags": ["brute force", " implementation", " math"], "title": "366-E", "statement": "E. Dima and Magic Guitartime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDima loves Inna very much. He decided to write a song for her. Dima has a magic guitar withnstrings andmfrets. Dima makes the guitar produce sounds like that: to play a note, he needs to hold one of the strings on one of the frets and then pull the string. When Dima pulls thei-th string holding it on thej-th fret the guitar produces a note, let's denote it asaij. We know that Dima's guitar can producekdistinct notes. It is possible that some notes can be produced in multiple ways. In other words, it is possible thataij=apqat(i,j) ≠ (p,q).Dima has already written a song — a sequence ofsnotes. In order to play the song, you need to consecutively produce the notes from the song on the guitar. You can produce each note in any available way. Dima understood that there are many ways to play a song and he wants to play it so as to make the song look as complicated as possible (try to act like Cobein).We'll represent a way to play a song as a sequence of pairs(xi,yi)(1 ≤i≤s), such that thexi-th string on theyi-th fret produces thei-th note from the song. The complexity of moving between pairs(x1,y1)and(x2,y2)equals+. The complexity of a way to play a song is the maximum of complexities of moving between adjacent pairs.Help Dima determine the maximum complexity of the way to play his song! The guy's gotta look cool!InputThe first line of the input contains four integersn,m,kands(1 ≤n,m≤ 2000, 1 ≤k≤ 9, 2 ≤s≤ 105).Then follownlines, each containingmintegersaij(1 ≤aij≤k). The number in thei-th row and thej-th column (aij) means a note that the guitar produces on thei-th string and thej-th fret.The last line of the input containssintegersqi(1 ≤qi≤k)— the sequence of notes of the song.OutputIn a single line print a single number — the maximum possible complexity of the song.ExamplesInput4 6 5 73 1 2 2 3 13 2 2 2 5 54 2 2 2 5 33 2 2 1 4 32 3 1 4 1 5 1Output8Input4 4 9 54 7 9 51 2 1 78 3 4 95 7 7 27 1 9 2 5Output4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b93014d2", "template_md5": "35d339e4", "result": "You are given a guitar with $n$ strings and $m$ frets.  Each combination of a string and a fret produces a unique note, and there are $k$ distinct notes in total.  You are also given a sequence of $s$ notes that represent a song.\n\nYour task is to find the maximum possible \"complexity\" of playing this song on the guitar.  Complexity is defined as the maximum distance between any two consecutive notes played.  The distance between two notes is calculated as the sum of the absolute differences between their corresponding string and fret positions.\n\nFor example, if note 1 is played on string 2, fret 3, and note 2 is played on string 5, fret 1, the distance between them is  $|2-5| + |3-1| = 3$.\n\n\n\nInput:\n\n* The first line contains four integers: $n$, $m$, $k$, and $s$.\n* The next $n$ lines each contain $m$ integers, representing the note produced by each string and fret combination.\n* The last line contains $s$ integers, representing the sequence of notes in the song.\n\nOutput:\n\n* A single integer representing the maximum possible complexity of playing the song."}, {"prompt_md5": "e0fc3338", "template_md5": "465699a0", "result": "You have a musical instrument with a grid of strings and frets. Each combination of string and fret produces a unique sound. You are given a sequence of sounds to play.  Find the most complex way to play the sequence, where complexity is measured by the largest distance between consecutive sounds on the instrument."}]}