{"uid": "366-B", "url": "https://codeforces.com/contest/366/problem/B", "tags": ["brute force", " implementation"], "title": "366-B", "statement": "B. Dima and To-do Listtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou helped Dima to have a great weekend, but it's time to work. Naturally, Dima, as all other men who have girlfriends, does everything wrong.Inna and Dima are now in one room. Inna tells Dima off for everything he does in her presence. After Inna tells him off for something, she goes to another room, walks there in circles muttering about how useless her sweetheart is. During that time Dima has time to peacefully completek- 1tasks. Then Inna returns and tells Dima off for the next task he does in her presence and goes to another room again. It continues until Dima is through with his tasks.Overall, Dima hasntasks to do, each task has a unique number from1ton. Dima loves order, so he does tasks consecutively, starting from some task. For example, if Dima has6tasks to do in total, then, if he starts from the5-th task, the order is like that: first Dima does the5-th task, then the6-th one, then the1-st one, then the2-nd one, then the3-rd one, then the4-th one.Inna tells Dima off (only lovingly and appropriately!) so often and systematically that he's very well learned the power with which she tells him off for each task. Help Dima choose the first task so that in total he gets told off with as little power as possible.InputThe first line of the input contains two integersn,k(1 ≤k≤n≤ 105). The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 103), whereaiis the power Inna tells Dima off with if she is present in the room while he is doing thei-th task.It is guaranteed thatnis divisible byk.OutputIn a single line print the number of the task Dima should start with to get told off with as little power as possible. If there are multiple solutions, print the one with the minimum number of the first task to do.ExamplesInput6 23 2 1 6 5 4Output1Input10 51 3 5 7 9 9 4 1 8 5Output3NoteExplanation of the first example.If Dima starts from the first task, Inna tells him off with power 3, then Dima can do one more task (ask= 2), then Inna tells him off for the third task with power 1, then she tells him off for the fifth task with power 5. Thus, Dima gets told off with total power 3 + 1 + 5 = 9. If Dima started from the second task, for example, then Inna would tell him off for tasks 2, 4 and 6 with power 2 + 6 + 4 = 12.Explanation of the second example.In the second examplek= 5, thus, Dima manages to complete 4 tasks in-between the telling off sessions. Thus, Inna tells Dima off for tasks number 1 and 6 (if he starts from 1 or 6), 2 and 7 (if he starts from 2 or 7) and so on. The optimal answer is to start from task 3 or 8, 3 has a smaller number, so the answer is 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bf0aa9a9", "template_md5": "35d339e4", "result": "You are given a list of $n$ tasks, each with an associated power value $a_i$.  You must complete the tasks in consecutive order, starting with a specific task.  \n\nAfter completing $k-1$ tasks, you are \"told off\" with a certain power.  \n\nFind the starting task that minimizes the total power you are \"told off\" with. \n\n**Input:**\n\n* The first line contains two integers $n$ and $k$ ($1 \\le k \\le n \\le 10^5$).\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le 10^3$), where $a_i$ is the power associated with the $i$-th task.\n\n**Output:**\n\n* Print the number of the task to start with to minimize the total power. If there are multiple solutions, print the one with the smallest starting task number."}, {"prompt_md5": "8e0d9093", "template_md5": "465699a0", "result": "You have a list of tasks, each with a certain \"cost\". You can do $k-1$ tasks between each time a \"cost\" is incurred. Find the starting task that minimizes the total \"cost\"."}]}