{"uid": "367-C", "url": "https://codeforces.com/contest/367/problem/C", "tags": ["graphs", " greedy", " sortings"], "title": "367-C", "statement": "C. Sereja and the Arrangement of Numberstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutLet's call an array consisting ofninteger numbersa1,a2,...,an,beautifulif it has the following property:consider all pairs of numbersx,y(x≠y), such that numberxoccurs in the arrayaand numberyoccurs in the arraya;for each pairx,ymust exist some positionj(1 ≤j<n), such that at least one of the two conditions are met, eitheraj=x,aj+ 1=y, oraj=y,aj+ 1=x.Sereja wants to build a beautiful arraya, consisting ofnintegers. But not everything is so easy, Sereja's friend Dima hasmcoupons, each contains two integersqi,wi. Couponicostswiand allows you to use as many numbersqias you want when constructing the arraya. Valuesqiare distinct. Sereja has no coupons, so Dima and Sereja have made the following deal. Dima builds some beautiful arrayaofnelements. After that he takeswirubles from Sereja for eachqi, which occurs in the arraya. Sereja believed his friend and agreed to the contract, and now he is wondering, what is the maximum amount of money he can pay.Help Sereja, find the maximum amount of money he can pay to Dima.InputThe first line contains two integersnandm(1 ≤n≤ 2·106, 1 ≤m≤ 105). Nextmlines contain pairs of integers. Thei-th line contains numbersqi,wi(1 ≤qi,wi≤ 105).It is guaranteed that allqiare distinct.OutputIn a single line print maximum amount of money (in rubles) Sereja can pay.Please, do not use the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput5 21 22 3Output5Input100 31 22 13 1Output4Input1 21 12 100Output100NoteIn the first sample Sereja can pay5rubles, for example, if Dima constructs the following array:[1, 2, 1, 2, 2]. There are another optimal arrays for this test.In the third sample Sereja can pay100rubles, if Dima constructs the following array:[2].", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac9e8790", "template_md5": "35d339e4", "result": "You are given two integers $n$ and $m$.  \n\nAn array of $n$ integers is considered \"beautiful\" if for every pair of distinct integers $x$ and $y$ in the array, there exists an index $j$ (where $1 \\le j < n$) such that either $a_j = x$ and $a_{j+1} = y$ or $a_j = y$ and $a_{j+1} = x$.\n\nYou are also given $m$ pairs of integers $(q_i, w_i)$.  \n\nThe goal is to find the maximum amount of money you can pay, given the following rules:\n\n* You can use any number of times the integers in the $q_i$ values.\n* For each $q_i$ that appears in the beautiful array, you pay $w_i$ rubles.\n\n\n\nInput:\n\nThe first line contains two integers $n$ and $m$.\nThe next $m$ lines each contain two integers $q_i$ and $w_i$.\n\nOutput:\n\nPrint the maximum amount of money you can pay in rubles."}, {"prompt_md5": "c0fe3f82", "template_md5": "465699a0", "result": "You are given a target number of items and a set of coupons. Each coupon allows you to use a specific number of items.  You need to find the maximum number of items you can use from the coupons to build a specific arrangement, where each pair of used items must be adjacent or have one item directly before the other.  The cost of using a coupon is its associated value. What is the maximum amount you are willing to pay?"}]}