{"uid": "369-E", "url": "https://codeforces.com/contest/369/problem/E", "tags": ["binary search", " data structures"], "title": "369-E", "statement": "E. Valera and Queriestime limit per test2 secondsmemory limit per test512 megabytesinputstdinoutputstdoutValera loves segments. He has recently come up with one interesting problem.TheOxaxis of coordinates hasnsegments, thei-th segment starts in positionliand ends in positionri(we will mark it as[li,ri]). Your task is to processmqueries, each consists of numbercntiand a set ofcnticoordinates of points located on theOxaxis. The answer to the query is the number of segments, such that each of them contains at least one point from the query. Segment[l,r]containspointq, ifl≤q≤r.Valera found the solution of this problem too difficult. So he asked you to help him. Help Valera.InputThe first line contains two integersn,m(1 ≤n,m≤ 3·105) — the number of segments on the axis of coordinates and the number of queries.Nextnlines contain the descriptions of the segments. Thei-th line contains two positive integersli,ri(1 ≤li≤ri≤ 106) — the borders of thei-th segment.Nextmlines contain the description of the queries, one per line. Each line starts from integercnti(1 ≤cnti≤ 3·105) — the number of points in thei-th query. Then the line containscntidistinct positive integersp1,p2, ...,pcnti(1 ≤p1<p2< ... <pcnti≤ 106) — the coordinates of points in thei-th query.It is guaranteed that the total number of points in all queries doesn't exceed3·105.OutputPrintmnon-negative integers, where thei-th number is the response to thei-th query.ExamplesInput3 31 34 56 73 1 4 72 4 51 8Output310", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "da24c543", "template_md5": "35d339e4", "result": "You are given $n$ segments on the x-axis, where the $i$-th segment is defined by its start point $l_i$ and end point $r_i$. You are also given $m$ queries. Each query consists of an integer $c_i$ and a set of $c_i$ distinct points $p_1, p_2, ..., p_{c_i}$ on the x-axis.\n\nFor each query, determine the number of segments that contain at least one of the points in the query. A segment $[l, r]$ contains a point $q$ if $l \\le q \\le r$.\n\nOutput the answer to each query."}, {"prompt_md5": "8b99e55f", "template_md5": "465699a0", "result": "You are given a list of intervals on a number line. You need to process a series of queries, each containing a set of points. For each query, count the number of intervals that contain at least one of the given points."}]}