{"uid": "369-D", "url": "https://codeforces.com/contest/369/problem/D", "tags": ["dfs and similar", " dp", " graphs", " shortest paths"], "title": "369-D", "statement": "D. Valera and Foolstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOne fine morning,nfools lined up in a row. After that, they numbered each other with numbers from1ton, inclusive. Each fool got a unique number. The fools decided not to change their numbers before the end of the fun.Every fool has exactlykbullets and a pistol. In addition, the fool numberihas probability ofpi(in percent) that he kills the fool he shoots at.The fools decided to have several rounds of the fun. Each round of the fun looks like this: each currently living fool shoots at another living fool with the smallest number (a fool is not stupid enough to shoot at himself). All shots of the round are perfomed at one time (simultaneously). If there is exactly one living fool, he does not shoot.Let's define asituationas the set of numbers of all the living fools at the some time. We say that a situation ispossibleif for some integer numberj(0 ≤j≤k) there is a nonzero probability that afterjrounds of the fun this situation will occur.Valera knows numbersp1,p2, ...,pnandk. Help Valera determine the number of distinctpossible situations.InputThe first line contains two integersn,k(1 ≤n,k≤ 3000) — the initial number of fools and the number of bullets for each fool.The second line containsnintegersp1,p2, ...,pn(0 ≤pi≤ 100) — the given probabilities (in percent).OutputPrint a single number — the answer to the problem.ExamplesInput3 350 50 50Output7Input1 1100Output1Input2 1100 100Output2Input3 30 0 0Output1NoteIn the first sample, any situation is possible, except for situation{1, 2}.In the second sample there is exactly one fool, so he does not make shots.In the third sample the possible situations are{1, 2}(after zero rounds) and the \"empty\" situation{}(after one round).In the fourth sample, the only possible situation is{1, 2, 3}.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ae682d4f", "template_md5": "35d339e4", "result": "There are $n$ people numbered from 1 to $n$. Each person has $k$ bullets and a gun. Each person $i$ has a probability of $p_i$ (in percent) of killing the person they shoot at.\n\nIn each round, each living person shoots the person with the lowest number. If there is only one person left, they don't shoot.\n\nA \"situation\" is a set of the people who are still alive at a given time.  \n\nDetermine the number of distinct possible situations that could occur after some number of rounds."}, {"prompt_md5": "33ef8371", "template_md5": "465699a0", "result": "You are given a number of people and a number of bullets each person has. Each person has a chance of successfully hitting another person they shoot at.  People take turns shooting at the person with the lowest number.  Determine the number of possible groups of people that could remain alive after some number of rounds."}]}