{"uid": "370-A", "url": "https://codeforces.com/contest/370/problem/A", "tags": ["graphs", " math", " shortest paths"], "title": "370-A", "statement": "A. Rook, Bishop and Kingtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutLittle Petya is learning to play chess. He has already learned how to move a king, a rook and a bishop. Let us remind you the rules of moving chess pieces. A chessboard is 64 square fields organized into an8 × 8table. A field is represented by a pair of integers(r,c)— the number of the row and the number of the column (in a classical game the columns are traditionally indexed by letters). Each chess piece takes up exactly one field. To make a move is to move a chess piece, the pieces move by the following rules:A rook moves any number of fields horizontally or vertically.A bishop moves any number of fields diagonally.A king moves one field in any direction — horizontally, vertically or diagonally.The pieces move like thatPetya is thinking about the following problem: what minimum number of moves is needed for each of these pieces to move from field(r1,c1)to field(r2,c2)? At that, we assume that there are no more pieces besides this one on the board. Help him solve this problem.InputThe input contains four integersr1,c1,r2,c2(1 ≤r1,c1,r2,c2≤ 8) — the coordinates of the starting and the final field. The starting field doesn't coincide with the final one.You can assume that the chessboard rows are numbered from top to bottom 1 through 8, and the columns are numbered from left to right 1 through 8.OutputPrint three space-separated integers: the minimum number of moves the rook, the bishop and the king (in this order) is needed to move from field(r1,c1)to field(r2,c2). If a piece cannot make such a move, print a 0 instead of the corresponding number.ExamplesInput4 3 1 6Output2 1 3Input5 5 5 6Output1 0 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a7f58475", "template_md5": "35d339e4", "result": "Given the starting coordinates $(r_1, c_1)$ and ending coordinates $(r_2, c_2)$ of a square on an 8x8 chessboard, determine the minimum number of moves required for a rook, a bishop, and a king to move from the starting square to the ending square. \n\n* **Rook:** Can move any number of squares horizontally or vertically.\n* **Bishop:** Can move any number of squares diagonally.\n* **King:** Can move one square in any direction (horizontally, vertically, or diagonally).\n\nIf a piece cannot make the move, output 0. \n\nOutput the minimum number of moves for each piece separated by spaces."}, {"prompt_md5": "8ab64574", "template_md5": "465699a0", "result": "Given two squares on an 8x8 grid, find the minimum number of moves required for a rook, a bishop, and a king to move from the first square to the second.  A rook moves horizontally or vertically, a bishop moves diagonally, and a king moves one square in any direction. If a piece cannot make the move, output 0."}]}