{"uid": "370-B", "url": "https://codeforces.com/contest/370/problem/B", "tags": ["implementation"], "title": "370-B", "statement": "B. Berland Bingotime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutLately, a national version of a bingo game has become very popular in Berland. There arenplayers playing the game, each player has a card with numbers. The numbers on each card are distinct, but distinct cards can have equal numbers. The card of thei-th player containsminumbers.During the game the host takes numbered balls one by one from a bag. He reads the number aloud in a high and clear voice and then puts the ball away. All participants cross out the number if it occurs on their cards. The person who crosses out all numbers from his card first, wins. If multiple people cross out all numbers from their cards at the same time, there are no winners in the game. At the beginning of the game the bag contains 100 balls numbered 1 through 100, the numbers of all balls are distinct.You are given the cards for each player. Write a program that determines whether a player can win the game at the most favorable for him scenario or not.InputThe first line of the input contains integern(1 ≤n≤ 100) — the number of the players. Then follownlines, each line describes a player's card. The line that describes a card starts from integermi(1 ≤mi≤ 100) that shows how many numbers thei-th player's card has. Then follows a sequence of integersai, 1,ai, 2, ...,ai,mi(1 ≤ai,k≤ 100) — the numbers on thei-th player's card. The numbers in the lines are separated by single spaces.It is guaranteed that all the numbers on each card are distinct.OutputPrintnlines, thei-th line must contain word \"YES\" (without the quotes), if thei-th player can win, and \"NO\" (without the quotes) otherwise.ExamplesInput31 13 2 4 12 10 11OutputYESNOYESInput21 11 1OutputNONO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5c483a23", "template_md5": "35d339e4", "result": "There are $n$ players playing a game. Each player has a unique card with $m_i$ numbers on it. The numbers on each card are distinct.  \n\nThe game involves drawing numbered balls from a bag containing numbers 1 through 100.  A player marks off a number on their card if the drawn ball matches a number on their card. The first player to mark off all the numbers on their card wins.\n\nGiven the numbers on each player's card, determine if a player can win the game if they are lucky enough to draw the balls in the most favorable order for them.\n\nOutput \"YES\" if a player can win, and \"NO\" otherwise."}, {"prompt_md5": "f4c368b3", "template_md5": "465699a0", "result": "You are given a list of cards, each with a unique set of numbers.  Balls numbered 1 to 100 are drawn one by one.  Determine if each player can win by crossing off all the numbers on their card, given they can only cross off a number if it is drawn."}]}