{"uid": "370-E", "url": "https://codeforces.com/contest/370/problem/E", "tags": ["dp", " greedy"], "title": "370-E", "statement": "E. Summer Readingtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAt school Vasya got an impressive list of summer reading books. Unlike other modern schoolchildren, Vasya loves reading, so he read some book each day of the summer.As Vasya was reading books, he was making notes in the Reader's Diary. Each day he wrote the orderal number of the book he was reading. The books in the list are numbered starting from 1 and Vasya was reading them in the order they go in the list. Vasya never reads a new book until he finishes reading the previous one. Unfortunately, Vasya wasn't accurate and some days he forgot to note the number of the book and the notes for those days remained empty.As Vasya knows that the literature teacher will want to check the Reader's Diary, so he needs to restore the lost records. Help him do it and fill all the blanks. Vasya is sure that he spends at least two and at most five days for each book. Vasya finished reading all the books he had started. Assume that the reading list contained many books. So many, in fact, that it is impossible to read all of them in a summer. If there are multiple valid ways to restore the diary records, Vasya prefers the one that shows the maximum number of read books.InputThe first line contains integern— the number of summer days (2 ≤n≤ 2·105). The second line containsnintegersa1,a2, ...an— the records in the diary in the order they were written (0 ≤ai≤ 105). If Vasya forgot to write the number of the book on thei-th day, thenaiequals 0.OutputIf it is impossible to correctly fill the blanks in the diary (the diary may contain mistakes initially), print \"-1\".Otherwise, print in the first line the maximum number of books Vasya could have read in the summer if we stick to the diary. In the second line printnintegers — the diary with correctly inserted records. If there are multiple optimal solutions, you can print any of them.ExamplesInput70 1 0 0 0 3 0Output31 1 2 2 3 3 3Input80 0 0 0 0 0 0 0Output41 1 2 2 3 3 4 4Input40 0 1 0Output11 1 1 1Input40 0 0 3Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dfecb312", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers representing the number of a book read each day of summer. Some days are marked with 0, indicating the book number was not recorded.  \n\nYou know that the person read at least 2 and at most 5 days per book.  \n\nYour task is to:\n\n1. Determine the maximum number of books that could have been read.\n2. If possible, fill in the missing book numbers to create a valid reading list. \n\nIf it's impossible to create a valid reading list, output \"-1\"."}, {"prompt_md5": "9c4e50c3", "template_md5": "465699a0", "result": "You are given a list of numbers representing days of reading. Some days are missing (represented by 0).  You need to fill in the missing days with numbers from 1 upwards, assuming each number represents a book and a person reads at least 2 and at most 5 days per book.  \n\nThe goal is to find the maximum number of books that could have been read and fill in the missing days accordingly. If it's impossible to fill in the missing days logically, output -1."}]}