{"uid": "372-E", "url": "https://codeforces.com/contest/372/problem/E", "tags": ["combinatorics", " geometry"], "title": "372-E", "statement": "E. Drawing Circles is Funtime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere are a set of pointsSon the plane. This set doesn't contain the originO(0, 0), and for each two distinct points in the setAandB, the triangleOABhas strictly positive area.Consider a set of pairs of points(P1,P2), (P3,P4), ..., (P2k- 1,P2k). We'll call the setgoodif and only if:k≥ 2.AllPiare distinct, and eachPiis an element ofS.For any two pairs(P2i- 1,P2i)and(P2j- 1,P2j), the circumcircles of trianglesOP2i- 1P2j- 1andOP2iP2jhave a single common point, and the circumcircle of trianglesOP2i- 1P2jandOP2iP2j- 1have a single common point.Calculate the number of good sets of pairs modulo1000000007(109+ 7).InputThe first line contains a single integern(1 ≤n≤ 1000)— the number of points inS. Each of the nextnlines contains four integersai,bi,ci,di(0 ≤ |ai|, |ci| ≤ 50; 1 ≤bi,di≤ 50; (ai,ci) ≠ (0, 0)). These integers represent a point.No two points coincide.OutputPrint a single integer — the answer to the problem modulo1000000007(109+ 7).ExamplesInput10-46 46 0 360 20 -24 48-50 50 -49 49-20 50 8 40-15 30 14 284 10 -4 56 15 8 10-20 50 -3 154 34 -16 3416 34 2 17Output2Input1030 30 -26 260 15 -36 36-28 28 -34 3410 10 0 4-8 20 40 509 45 12 306 15 7 3536 45 -8 20-16 34 -4 344 34 8 17Output4Input100 20 38 38-30 30 -13 13-11 11 16 1630 30 0 376 30 -4 106 15 12 15-4 5 -10 25-16 20 4 108 17 -2 1716 34 2 17Output10", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5600aa45", "template_md5": "35d339e4", "result": "You are given a set of points on a plane.  No two points are the same, and for any two distinct points, the triangle formed by those points and the origin (0,0) has a positive area.\n\nYou need to find the number of ways to group these points into pairs, where each pair forms a set of two points.  \n\nHere are the rules for a valid grouping:\n\n* There must be at least two pairs.\n* All points must be used, and no point can be in more than one pair.\n* For any two pairs of points (P1, P2) and (P3, P4), the circumcircles of the triangles formed by:\n    *  O, P1, P3\n    *  O, P2, P4\n    *  O, P1, P4\n    *  O, P2, P3 \nmust all intersect at exactly one point.\n\nCalculate the number of valid groupings modulo 1000000007 (10^9 + 7)."}, {"prompt_md5": "6f456c42", "template_md5": "465699a0", "result": "You are given a set of points.  Find the number of ways to group these points into pairs, where each pair forms a triangle with the origin (0,0) and the circumcircles of certain triangles formed by these pairs intersect in a specific way.  The answer should be given modulo 1000000007."}]}