{"uid": "372-D", "url": "https://codeforces.com/contest/372/problem/D", "tags": ["binary search", " data structures", " dfs and similar", " trees", " two pointers"], "title": "372-D", "statement": "D. Choosing Subtree is Funtime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere is a tree consisting ofnvertices. The vertices are numbered from1ton.Let's define the length of an interval[l,r]as the valuer-l+ 1. The score of a subtree of this tree is the maximum length of such an interval[l,r]that, the vertices with numbersl,l+ 1, ...,rbelong to the subtree.Considering all subtrees of the tree whose size is at mostk, return the maximum score of the subtree. Note, that in this problem tree is not rooted, so a subtree — is an arbitrary connected subgraph of the tree.InputThere are two integers in the first line,nandk(1 ≤k≤n≤ 105). Each of the nextn- 1lines contains integersaiandbi(1 ≤ai,bi≤n,ai≠bi). That meansaiandbiare connected by a tree edge.It is guaranteed that the input represents a tree.OutputOutput should contain a single integer — the maximum possible score.ExamplesInput10 64 1010 62 99 68 57 14 77 31 8Output3Input16 713 1112 112 148 69 1516 115 146 154 311 1515 1410 13 1414 71 7Output6NoteFor the first case, there is some subtree whose size is at most6, including3consecutive numbers of vertices. For example, the subtree that consists of{1, 3, 4, 5, 7, 8}or of{1, 4, 6, 7, 8, 10}includes3consecutive numbers of vertices. But there is no subtree whose size is at most6, which includes4or more consecutive numbers of vertices.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "df3a7547", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices numbered from 1 to $n$.  \n\nThe score of a subtree is the length of the longest consecutive sequence of vertices within that subtree.\n\nFind the maximum score of any subtree with at most $k$ vertices. \n\n\n**Input:**\n\n* Two integers $n$ and $k$ ($1 \\le k \\le n \\le 10^5$)\n* $n-1$ lines, each containing two integers $a_i$ and $b_i$ (1 $\\le a_i, b_i \\le n$, $a_i \\neq b_i$), representing an edge between vertices $a_i$ and $b_i$.\n\n**Output:**\n\n* A single integer representing the maximum possible score."}, {"prompt_md5": "8f5f464f", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes.  Find the largest possible sequence of consecutive nodes within a subtree of the tree that has at most a given number of nodes.  The length of the sequence is the number of nodes in the sequence minus 1."}]}