{"uid": "375-D", "url": "https://codeforces.com/contest/375/problem/D", "tags": ["data structures", " dfs and similar", " trees"], "title": "375-D", "statement": "D. Tree and Queriestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou have a rooted tree consisting ofnvertices. Each vertex of the tree has some color. We will assume that the tree vertices are numbered by integers from 1 ton. Then we represent the color of vertexvascv. The tree root is a vertex with number 1.In this problem you need to answer tomqueries. Each query is described by two integersvj,kj. The answer to queryvj,kjis the number of such colors of verticesx, that the subtree of vertexvjcontains at leastkjvertices of colorx.You can find the definition of a rooted tree by the following link:http://en.wikipedia.org/wiki/Tree_(graph_theory).InputThe first line contains two integersnandm(2 ≤n≤ 105; 1 ≤m≤ 105). The next line contains a sequence of integersc1,c2, ...,cn(1 ≤ci≤ 105). The nextn- 1lines contain the edges of the tree. Thei-th line contains the numbersai,bi(1 ≤ai,bi≤n;ai≠bi)— the vertices connected by an edge of the tree.Nextmlines contain the queries. Thej-th line contains two integersvj,kj(1 ≤vj≤n; 1 ≤kj≤ 105).OutputPrintmintegers — the answers to the queries in the order the queries appear in the input.ExamplesInput8 51 2 2 3 3 2 3 31 21 52 32 45 65 75 81 21 31 42 35 3Output22101Input4 11 2 3 41 22 33 41 1Output4NoteA subtree of vertexvin a rooted tree with rootris a set of vertices{u:dist(r,v) +dist(v,u) =dist(r,u)}. Wheredist(x,y)is the length (in edges) of the shortest path between verticesxandy.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ce60bd8f", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices, numbered from 1 to $n$. Each vertex has a color, represented by an integer $c_i$ where $1 \\le c_i \\le 10^5$. \n\nYou need to answer $m$ queries. Each query is represented by two integers $v_j$ and $k_j$ (where $1 \\le v_j \\le n$ and $1 \\le k_j \\le 10^5$). \n\nFor each query, you need to find the number of colors $x$ such that there are at least $k_j$ vertices with color $x$ in the subtree rooted at vertex $v_j$.\n\n**Input:**\n\n* The first line contains two integers $n$ and $m$.\n* The second line contains $n$ integers, $c_1, c_2, ..., c_n$, representing the colors of the vertices.\n* The next $n-1$ lines each contain two integers $a_i$ and $b_i$, representing an edge between vertices $a_i$ and $b_i$.\n* The next $m$ lines each contain two integers $v_j$ and $k_j$, representing a query.\n\n**Output:**\n\nPrint $m$ integers, representing the answers to the queries in the order they appear in the input."}, {"prompt_md5": "4f7b5438", "template_md5": "465699a0", "result": "You are given a tree with numbered nodes, each having a color. You need to answer queries about the number of nodes with a specific color within a given subtree. Each query specifies a node and a minimum number of nodes of that color required in the subtree."}]}