{"uid": "375-C", "url": "https://codeforces.com/contest/375/problem/C", "tags": ["bitmasks", " shortest paths"], "title": "375-C", "statement": "C. Circling Round Treasurestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou have a map as a rectangle table. Each cell of the table is either an obstacle, or a treasure with a certain price, or a bomb, or an empty cell. Your initial position is also given to you.You can go from one cell of the map to a side-adjacent one. At that, you are not allowed to go beyond the borders of the map, enter the cells with treasures, obstacles and bombs. To pick the treasures, you need to build a closed path (starting and ending in the starting cell). The closed path mustn't contain any cells with bombs inside. Let's assume that the sum of the treasures' values that are located inside the closed path equalsv, and besides, you've madeksingle moves (from one cell to another) while you were going through the path, then such path brings you the profit ofv-krubles.Your task is to build a closed path that doesn't contain any bombs and brings maximum profit.Note that the path can have self-intersections. In order to determine if a cell lies inside a path or not, use the following algorithm:Assume that the table cells are points on the plane (the table cell on the intersection of thei-th column and thej-th row is point(i,j)). And the given path is a closed polyline that goes through these points.You need to find out if the pointpof the table that is not crossed by the polyline lies inside the polyline.Let's draw a ray that starts from pointpand does not intersect other points of the table (such ray must exist).Let's count the number of segments of the polyline that intersect the painted ray. If this number is odd, we assume that pointp(and consequently, the table cell) lie inside the polyline (path). Otherwise, we assume that it lies outside.InputThe first line contains two integersnandm(1 ≤n,m≤ 20)— the sizes of the table. Nextnlines each containsmcharacters — the description of the table. The description means the following:character \"B\" is a cell with a bomb;character \"S\" is the starting cell, you can assume that it's empty;digitc(1-8) is treasure with indexc;character \".\" is an empty cell;character \"#\" is an obstacle.Assume that the map hasttreasures. Nexttlines contain the prices of the treasures. Thei-th line contains the price of the treasure with indexi,vi( - 200 ≤vi≤ 200). It is guaranteed that the treasures are numbered from 1 tot. It is guaranteed that the map has not more than 8 objects in total. Objects are bombs and treasures. It is guaranteed that the map has exactly one character \"S\".OutputPrint a single integer — the maximum possible profit you can get.ExamplesInput4 4.....S1.........10Output2Input7 7........1###2..#...#..#.B.#..3...4...##.........S100100100100Output364Input7 8....................1B...S..........2...3...............100-100100Output0Input1 1SOutput0NoteIn the first example the answer will look as follows.In the second example the answer will look as follows.In the third example you cannot get profit.In the fourth example you cannot get profit as you cannot construct a closed path with more than one cell.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f6e52cdb", "template_md5": "35d339e4", "result": "You are given a rectangular map with cells that can be empty, contain a treasure, a bomb, or be an obstacle. You start at a designated cell.  \n\nYou can move to adjacent cells (up, down, left, right) but cannot move beyond the map boundaries, into cells with treasures, obstacles, or bombs.\n\nTo collect treasures, you must create a closed loop path that starts and ends at your initial position. The path cannot contain any bombs.\n\nEach treasure has a value. The profit you earn from a path is the sum of the treasure values minus the number of moves you made.\n\nYour goal is to find the closed loop path that maximizes your profit. \n\n**Input:**\n\n*  The dimensions of the map (n x m).\n*  A description of the map (characters representing empty cells, treasures, bombs, obstacles, and your starting position).\n*  The value of each treasure.\n\n**Output:**\n\n* The maximum profit you can achieve."}, {"prompt_md5": "fa81e49e", "template_md5": "465699a0", "result": "You have a grid with empty spaces, treasures, bombs, and obstacles. You start at a specific point. You can move to adjacent empty spaces to collect treasures.  \n\nYou need to find a closed loop path that:\n\n* Doesn't go through bombs.\n* Collects as many treasures as possible.\n\nThe profit is the total value of the treasures minus the number of moves you make.  Find the path that gives the highest profit."}]}