{"uid": "377-A", "url": "https://codeforces.com/contest/377/problem/A", "tags": ["dfs and similar"], "title": "377-A", "statement": "A. Mazetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPavel loves grid mazes. A grid maze is ann×mrectangle maze where each cell is either empty, or is a wall. You can go from one cell to another only if both cells are empty and have a common side.Pavel drew a grid maze with all empty cells forming a connected area. That is, you can go from any empty cell to any other one. Pavel doesn't like it when his maze has too little walls. He wants to turn exactlykempty cells into walls so that all the remaining cells still formed a connected area. Help him.InputThe first line contains three integersn,m,k(1 ≤n,m≤ 500,0 ≤k<s), wherenandmare the maze's height and width, correspondingly,kis the number of walls Pavel wants to add and lettersrepresents the number of empty cells in the original maze.Each of the nextnlines containsmcharacters. They describe the original maze. If a character on a line equals \".\", then the corresponding cell is empty and if the character equals \"#\", then the cell is a wall.OutputPrintnlines containingmcharacters each: the new maze that fits Pavel's requirements. Mark the empty cells that you transformed into walls as \"X\", the other cells must be left without changes (that is, \".\" and \"#\").It is guaranteed that a solution exists. If there are multiple solutions you can output any of them.ExamplesInput3 4 2#..#..#.#...Output#.X#X.#.#...Input5 4 5#...#.#..#.....#.#.#Output#XXX#X#.X#.....#.#.#", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5282292f", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times m$ representing a maze. The grid contains '.' representing empty cells and '#' representing walls.  \n\nYou need to change exactly $k$ empty cells to walls ('X') such that the remaining empty cells are still connected.  \n\nPrint the modified grid. \n\n**Input:**\n\n* The first line contains three integers: $n$, $m$, and $k$ ($1 \\le n, m \\le 500$, $0 \\le k < n \\times m$).\n* The next $n$ lines contain $m$ characters each, representing the original maze.\n\n**Output:**\n\n* Print $n$ lines containing $m$ characters each, representing the modified maze."}, {"prompt_md5": "8ad40d13", "template_md5": "465699a0", "result": "You are given a grid of empty and blocked cells.  You need to change some empty cells to blocked cells to make a specific number of changes. The goal is to find a way to change the cells so that the remaining empty cells are still connected."}]}