{"uid": "377-C", "url": "https://codeforces.com/contest/377/problem/C", "tags": ["bitmasks", " dp", " games"], "title": "377-C", "statement": "C. Captains Modetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutKostya is a progamer specializing in the discipline of Dota 2. Valve Corporation, the developer of this game, has recently released a new patch which turned the balance of the game upside down. Kostya, as the captain of the team, realizes that the greatest responsibility lies on him, so he wants to resort to the analysis of innovations patch from the mathematical point of view to choose the best heroes for his team in every game.A Dota 2 match involves two teams, each of them must choose some heroes that the players of the team are going to play for, and it is forbidden to choose the same hero several times, even in different teams. In large electronic sports competitions where Kostya's team is going to participate, the matches are held in the Captains Mode. In this mode the captains select the heroes by making one of two possible actions in a certain, predetermined order: pick or ban.To pick a hero for the team. After the captain picks, the picked hero goes to his team (later one of a team members will play it) and can no longer be selected by any of the teams.To ban a hero. After the ban the hero is not sent to any of the teams, but it still can no longer be selected by any of the teams.The team captain may miss a pick or a ban. If he misses a pick, a random hero is added to his team from those that were available at that moment, and if he misses a ban, no hero is banned, as if there was no ban.Kostya has already identified the strength of all the heroes based on the new patch fixes. Of course, Kostya knows the order of picks and bans. The strength of a team is the sum of the strengths of the team's heroes and both teams that participate in the match seek to maximize the difference in strengths in their favor. Help Kostya determine what team, the first one or the second one, has advantage in the match, and how large the advantage is.InputThe first line contains a single integern(2 ≤n≤ 100) — the number of heroes in Dota 2.The second line containsnintegerss1,s2, ...,sn(1 ≤si≤ 106) — the strengths of all the heroes.The third line contains a single integerm(2 ≤m≤min(n, 20)) — the number of actions the captains of the team must perform.Nextmlines look like \"actionteam\", whereactionis the needed action: a pick (represented as a \"p\") or a ban (represented as a \"b\"), andteamis the number of the team that needs to perform the action (number1or2).It is guaranteed that each team makes at least one pick. Besides, each team has the same number of picks and the same number of bans.OutputPrint a single integer — the difference between the strength of the first team and the strength of the second team if the captains of both teams will act optimally well.ExamplesInput22 12p 1p 2Output1Input66 4 5 4 5 54b 2p 1b 1p 2Output0Input41 2 3 44p 2b 2p 1b 1Output-2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d946c29b", "template_md5": "35d339e4", "result": "There are $n$ heroes, each with a strength $s_i$ (where $1 \\le i \\le n$). Two teams will play a game, each choosing a subset of heroes.\n\nThe teams take turns performing actions:\n\n* **Pick:** Choose a hero and add it to their team. The chosen hero is no longer available.\n* **Ban:** Prevent a hero from being chosen by either team.\n\nEach team has the same number of picks and bans. If a team misses a pick, a random available hero is added to their team. If a team misses a ban, no hero is banned.\n\nGiven the order of actions for each team, determine the difference in the total strength of the two teams if both teams play optimally."}, {"prompt_md5": "0bc6b08e", "template_md5": "465699a0", "result": "Two teams take turns picking or banning heroes. Each hero has a strength value.  The team with the highest total strength of their chosen heroes wins.  Determine which team has the advantage and by how much if both teams play optimally."}]}