{"uid": "378-B", "url": "https://codeforces.com/contest/378/problem/B", "tags": ["implementation", " sortings"], "title": "378-B", "statement": "B. Semifinalstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutTwo semifinals have just been in the running tournament. Each semifinal hadnparticipants. There arenparticipants advancing to the finals, they are chosen as follows: from each semifinal, we choosekpeople (0 ≤ 2k≤n) who showed the best result in their semifinals and all other places in the finals go to the people who haven't ranked in the topkin their semifinal but got to then- 2kof the best among the others.The tournament organizers hasn't yet determined thekvalue, so the participants want to know who else has any chance to get to the finals and who can go home.InputThe first line contains a single integern(1 ≤n≤ 105) — the number of participants in each semifinal.Each of the nextnlines contains two integersaiandbi(1 ≤ai,bi≤ 109) — the results of thei-th participant (the number of milliseconds he needs to cover the semifinals distance) of the first and second semifinals, correspondingly. All results are distinct. Sequencesa1,a2, ...,anandb1,b2, ...,bnare sorted in ascending order, i.e. in the order the participants finished in the corresponding semifinal.OutputPrint two strings consisting ofncharacters, each equals either \"0\" or \"1\". The first line should correspond to the participants of the first semifinal, the second line should correspond to the participants of the second semifinal. Thei-th character in thej-th line should equal \"1\" if thei-th participant of thej-th semifinal has any chances to advance to the finals, otherwise it should equal a \"0\".ExamplesInput49840 99209860 99809930 1002010040 10090Output11101100Input49900 98509940 993010000 1002010060 10110Output11001100NoteConsider the first sample. Each semifinal has 4 participants. The results of the first semifinal are 9840, 9860, 9930, 10040. The results of the second semifinal are 9920, 9980, 10020, 10090.Ifk= 0, the finalists are determined by the time only, so players 9840, 9860, 9920 and 9930 advance to the finals.Ifk= 1, the winners from both semifinals move to the finals (with results 9840 and 9920), and the other places are determined by the time (these places go to the sportsmen who run the distance in 9860 and 9930 milliseconds).Ifk= 2, then first and second places advance from each seminfial, these are participants with results 9840, 9860, 9920 and 9980 milliseconds.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8bf51900", "template_md5": "35d339e4", "result": "There are two semifinals in a tournament with $n$ participants each.  The top $k$ participants from each semifinal advance to the finals, where $0 \\le 2k \\le n$. The remaining spots in the finals are filled by the next $n-2k$ fastest participants who did not place in the top $k$ of their semifinal.\n\nGiven the results of each participant in both semifinals, determine which participants from each semifinal have a chance to advance to the finals.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the number of participants in each semifinal.\n* Each of the next $n$ lines contains two integers $a_i$ and $b_i$ (1 ≤ $a_i$, $b_i$ ≤ 10⁹) representing the results of the $i$-th participant in the first and second semifinals, respectively. The results are distinct and sorted in ascending order within each semifinal.\n\n**Output:**\n\n* Print two strings of length $n$, each consisting of \"0\"s and \"1\"s. \n* The $i$-th character in the $j$-th string should be \"1\" if the $i$-th participant in the $j$-th semifinal has a chance to advance to the finals, and \"0\" otherwise."}, {"prompt_md5": "1fed6f6d", "template_md5": "465699a0", "result": "You are given the results of two tournaments with the same number of participants.  The top 'k' participants from each tournament advance to the finals. The remaining spots in the finals are filled by the next 'n-2k' fastest participants from each tournament.  \n\nDetermine for each participant in each tournament if they have a chance to make it to the finals."}]}