{"uid": "378-A", "url": "https://codeforces.com/contest/378/problem/A", "tags": ["brute force"], "title": "378-A", "statement": "A. Playing with Dicetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutTwo players are playing a game. First each of them writes an integer from 1 to 6, and then a dice is thrown. The player whose written number got closer to the number on the dice wins. If both payers have the same difference, it's a draw.The first player wrote numbera, the second player wrote numberb. How many ways to throw a dice are there, at which the first player wins, or there is a draw, or the second player wins?InputThe single line contains two integersaandb(1 ≤a,b≤ 6) — the numbers written on the paper by the first and second player, correspondingly.OutputPrint three integers: the number of ways to throw the dice at which the first player wins, the game ends with a draw or the second player wins, correspondingly.ExamplesInput2 5Output3 0 3Input2 4Output2 1 3NoteThe dice is a standard cube-shaped six-sided object with each side containing a number from 1 to 6, and where all numbers on all sides are distinct.You can assume that numberais closer to numberxthan numberb, if|a-x| < |b-x|.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "375be5bb", "template_md5": "35d339e4", "result": "Two players each choose a number between 1 and 6. Then, a standard six-sided die is rolled. The player whose chosen number is closer to the number rolled on the die wins. If both players have the same distance from the rolled number, it's a draw.\n\nGiven two numbers,  $a$ and $b$,  representing the choices of the two players, determine:\n\n* The number of ways the die can be rolled so that the first player wins.\n* The number of ways the die can be rolled so that the game is a draw.\n* The number of ways the die can be rolled so that the second player wins."}, {"prompt_md5": "9a37e179", "template_md5": "465699a0", "result": "Two players each choose a number between 1 and 6. A die is rolled. The player whose chosen number is closer to the die roll wins.  Count the number of ways the die can be rolled so that:\n\n1. The first player wins.\n2. The game is a draw.\n3. The second player wins."}]}