{"uid": "379-F", "url": "https://codeforces.com/contest/379/problem/F", "tags": ["data structures", " divide and conquer", " trees"], "title": "379-F", "statement": "F. New Year Treetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are a programmer and you have a New Year Tree (not the traditional fur tree, though) — a tree of four vertices: one vertex of degree three (has number 1), connected with three leaves (their numbers are from 2 to 4).On the New Year, programmers usually have fun. You decided to have fun as well by adding vertices to the tree. One adding operation looks as follows:First we choose some leaf of the tree with numberv.Let's mark the number of vertices on the tree at this moment by variablen, then two vertexes are added to the tree, their numbers aren+ 1andn+ 2, also you get new edges, one between verticesvandn+ 1and one between verticesvandn+ 2.Your task is not just to model the process of adding vertices to the tree, but after each adding operation print the diameter of the current tree. Come on, let's solve the New Year problem!InputThe first line contains integerq(1 ≤q≤ 5·105)— the number of operations. Each of the nextqlines contains integervi(1 ≤vi≤n)— the operation of adding leaves to vertexvi. Variablenrepresents the number of vertices in the current tree.It is guaranteed that all given operations are correct.OutputPrintqintegers — the diameter of the current tree after each operation.ExamplesInput523485Output34456", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d72f3adf", "template_md5": "35d339e4", "result": "You are given a tree with 4 vertices: one vertex with degree 3 (numbered 1) and three leaf vertices (numbered 2, 3, and 4).\n\nYou will perform a series of operations. Each operation involves:\n\n1. Choosing a leaf vertex (numbered 2, 3, or 4).\n2. Adding two new vertices to the tree, numbered $n+1$ and $n+2$, where $n$ is the current number of vertices in the tree.\n3. Connecting the chosen leaf vertex to the new vertices with edges.\n\nAfter each operation, you need to calculate and print the diameter of the tree. The diameter of a tree is the length of the longest path between any two vertices in the tree. \n\n**Input:**\n\n* The first line contains an integer $q$ (1 ≤ $q$ ≤ 5 * 10⁵) representing the number of operations.\n* Each of the next $q$ lines contains an integer $v$ (1 ≤ $v$ ≤ $n$) representing the leaf vertex chosen for the operation.\n\n**Output:**\n\nPrint $q$ integers, where each integer represents the diameter of the tree after each operation."}, {"prompt_md5": "5540dd11", "template_md5": "465699a0", "result": "You start with a tree with 4 vertices.  One vertex has 3 connections to the other vertices. You repeatedly add two new vertices to the tree, connecting each new vertex to one of the original leaves. After each addition, determine the longest path between any two vertices in the tree."}]}