{"uid": "379-B", "url": "https://codeforces.com/contest/379/problem/B", "tags": ["constructive algorithms", " implementation"], "title": "379-B", "statement": "B. New Year Presenttime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe New Year is coming! That's why many people today are busy preparing New Year presents. Vasily the Programmer is no exception.Vasily knows that the best present is (no, it's not a contest) money. He's putnempty wallets from left to right in a row and decided how much money to put in what wallet. Vasily decided to putaicoins to thei-th wallet from the left.Vasily is a very busy man, so the money are sorted into the bags by his robot. Initially, the robot stands by the leftmost wallet in the row. The robot can follow instructions of three types: go to the wallet that is to the left of the current one (if such wallet exists), go to the wallet that is to the right of the current one (if such wallet exists), put a coin to the current wallet. Due to some technical malfunctions the robot cannot follow two \"put a coin\" instructions in a row.Vasily doesn't want to wait for long, so he wants to write a program for the robot that contains at most106operations (not necessarily minimum in length) the robot can use to put coins into the wallets. Help him.InputThe first line contains integern(2 ≤n≤ 300)— the number of wallets. The next line containsnintegersa1,a2, ...,an(0 ≤ai≤ 300).It is guaranteed that at least oneaiis positive.OutputPrint the sequence that consists ofk(1 ≤k≤ 106)characters, each of them equals: \"L\", \"R\" or \"P\". Each character of the sequence is an instruction to the robot. Character \"L\" orders to move to the left, character \"R\" orders to move to the right, character \"P\" orders the robot to put a coin in the wallet. The robot is not allowed to go beyond the wallet line. In other words, you cannot give instructions \"L\" if the robot is at wallet 1, or \"R\" at walletn.As a result of the performed operations, thei-th wallet from the left must contain exactlyaicoins. If there are multiple answers, you can print any of them.ExamplesInput21 2OutputPRPLRPInput40 2 0 2OutputRPRRPLLPLRRRP", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "df5a5132", "template_md5": "35d339e4", "result": "You are given a row of $n$ wallets, where each wallet has a target number of coins to be placed in it. The target number of coins for the $i$-th wallet is $a_i$.\n\nA robot starts at the leftmost wallet and can perform the following actions:\n\n* **L:** Move one position to the left.\n* **R:** Move one position to the right.\n* **P:** Place a coin in the current wallet.\n\nThe robot cannot place two coins in a row.\n\nYour task is to find a sequence of at most $10^6$ actions (L, R, or P) that will result in each wallet having the correct number of coins. \n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 300), the number of wallets.\n* The second line contains $n$ integers $a_1$, $a_2$, ..., $a_n$ (0 ≤ $a_i$ ≤ 300), representing the target number of coins for each wallet.\n\n**Output:**\n\nPrint a sequence of characters (L, R, or P) representing the actions for the robot."}, {"prompt_md5": "970d1231", "template_md5": "465699a0", "result": "You are given a sequence of numbers representing the desired number of coins in each of a row of wallets. A robot can move left or right between wallets and place a coin in the current wallet. The robot cannot place two coins in a row.  Find the shortest sequence of instructions (left, right, place) to achieve the desired coin count in each wallet.  The sequence cannot be longer than 10^6 instructions."}]}