{"uid": "38-D", "url": "https://codeforces.com/contest/38/problem/D", "tags": ["implementation"], "title": "38-D", "statement": "D. Vasya the Architecttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOnce Vasya played bricks. All the bricks in the set had regular cubical shape. Vasya vas a talented architect, however the tower he built kept falling apart.Let us consider the building process. Vasya takes a brick and puts it on top of the already built tower so that the sides of the brick are parallel to the sides of the bricks he has already used. Let's introduce a Cartesian coordinate system on the horizontal plane, where Vasya puts the first brick. Then the projection of brick numberion the plane is a square with sides parallel to the axes of coordinates with opposite corners in points(xi, 1,yi, 1)and(xi, 2,yi, 2). The bricks are cast from homogeneous plastic and the weight of a bricka×a×aisa3grams.It is guaranteed that Vasya puts any brick except the first one on the previous one, that is the area of intersection of the upper side of the previous brick and the lower side of the next brick is always positive.We (Vasya included) live in a normal world where the laws of physical statics work. And that is why, perhaps, if we put yet another brick, the tower will collapse under its own weight. Vasya puts the cubes consecutively one on top of the other until at least one cube loses the balance and falls down. If it happens, Vasya gets upset and stops the construction. Print the number of bricks in the maximal stable tower, that is the maximal numbermsatisfying the condition that all the towers consisting of bricks 1, 2, ...,kfor every integerkfrom 1 tomremain stable.InputThe first input file contains an integern(1 ≤n≤ 100) which is the number of bricks. Each of the nextnlines contains four numbersxi, 1,yi, 1,xi, 2,yi, 2(xi, 1≠xi, 2, |xi, 1-xi, 2| = |yi, 1-yi, 2|) which are the coordinates of the opposite angles of the base of the brick numberi. The coordinates are integers and their absolute value does not exceed50.The cubes are given in the order Vasya puts them. It is guaranteed that the area of intersection of the upper side of the brick numberi- 1and the lower side of the brick numberiis strictly strictly greater than zero for alli≥ 2.OutputPrint the number of bricks in the maximal stable tower.ExamplesInput20 0 3 31 0 4 3Output2Input20 0 3 32 0 5 3Output1Input30 0 3 31 0 4 32 0 5 3Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3f45f5b9", "template_md5": "35d339e4", "result": "You are given a set of $n$ bricks, where each brick is a cube. Each brick is defined by the coordinates of its bottom-left and bottom-right corners in a 2D plane.  \n\nThe bricks are placed one on top of the other, with each brick's base parallel to the plane. A tower is considered stable if no brick is overhanging or unsupported.\n\nYour task is to determine the maximum number of bricks that can be stacked to form a stable tower. \n\n\nInput:\n\nThe first line contains an integer $n$ (1 ≤ $n$ ≤ 100), representing the number of bricks.\n\nEach of the next $n$ lines contains four integers: $x_1$, $y_1$, $x_2$, $y_2$, representing the coordinates of the bottom-left and bottom-right corners of the $i$-th brick.\n\nOutput:\n\nPrint a single integer, representing the maximum number of bricks in a stable tower."}, {"prompt_md5": "7571834e", "template_md5": "465699a0", "result": "You are given a list of building blocks. Each block has a specific shape and size.  Determine the maximum number of blocks that can be stacked on top of each other without toppling over."}]}