{"uid": "38-E", "url": "https://codeforces.com/contest/38/problem/E", "tags": ["dp", " sortings"], "title": "38-E", "statement": "E. Let's Go Rolling!time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOn a number axis directed from the left rightwards,nmarbles with coordinatesx1,x2, ...,xnare situated. Let's assume that the sizes of the marbles are infinitely small, that is in this task each of them is assumed to be a material point. You can stick pins in some of them and the cost of sticking in the marble numberiis equal toci, numbercimay be negative. After you choose and stick the pins you need, the marbles will start to roll left according to the rule: if a marble has a pin stuck in it, then the marble doesn't move, otherwise the marble rolls all the way up to the next marble which has a pin stuck in it and stops moving there. If there is no pinned marble on the left to the given unpinned one, it is concluded that the marble rolls to the left to infinity and you will pay an infinitely large fine for it. If no marble rolled infinitely to the left, then the fine will consist of two summands:the sum of the costs of stuck pins;the sum of the lengths of the paths of each of the marbles, that is the sum of absolute values of differences between their initial and final positions.Your task is to choose and pin some marbles in the way that will make the fine for you to pay as little as possible.InputThe first input line contains an integern(1 ≤n≤ 3000) which is the number of marbles. The nextnlines contain the descriptions of the marbles in pairs of integersxi,ci(- 109≤xi,ci≤ 109). The numbers are space-separated. Each description is given on a separate line. No two marbles have identical initial positions.OutputOutput the single number — the least fine you will have to pay.ExamplesInput32 33 41 2Output5Input41 73 15 106 1Output11", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "70ab4f68", "template_md5": "35d339e4", "result": "You have $n$ marbles positioned on a number line. Each marble has a coordinate $x_i$ and a cost $c_i$ associated with it. You can choose to \"pin\" some of the marbles, which means they will stay in place. Unpinned marbles will roll to the left until they hit a pinned marble or reach the left edge of the number line (in which case you pay a large penalty).\n\nYour goal is to choose which marbles to pin to minimize the total cost. The cost is calculated as follows:\n\n* The sum of the costs of all pinned marbles.\n* The sum of the distances each unpinned marble travels.\n\n\nInput:\n\n* The first line contains the number of marbles, $n$.\n* The next $n$ lines each contain a pair of integers, $x_i$ and $c_i$, representing the coordinate and cost of the $i$-th marble.\n\nOutput:\n\n* The minimum total cost you can achieve."}, {"prompt_md5": "cecd3ddd", "template_md5": "465699a0", "result": "You have a line of objects. Each object has a position and a cost associated with it. You can choose to \"pin\" some of the objects.  Pinned objects stay in place, while unpinned objects will move to the left until they hit a pinned object. If an unpinned object reaches the left end of the line, it costs a very large amount. Your goal is to choose which objects to pin to minimize the total cost, which includes the cost of pinning objects and the total distance moved by the unpinned objects."}]}