{"uid": "38-G", "url": "https://codeforces.com/contest/38/problem/G", "tags": ["data structures"], "title": "38-G", "statement": "G. Queuetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOn a cold winter evening our hero Vasya stood in a railway queue to buy a ticket for Codeforces championship final. As it usually happens, the cashier said he was going to be away for 5 minutes and left for an hour. Then Vasya, not to get bored, started to analyze such a mechanism as a queue. The findings astonished Vasya.Every man is characterized by two numbers:ai, which is the importance of his current task (the greater the number is, the more important the task is) and numberci, which is a picture of his conscience. Numbersaiform the permutation of numbers from1ton.Let the queue consist ofn- 1people at the moment. Let's look at the way the person who came numbernbehaves. First, he stands at the end of the queue and the does the following: if importance of the taskaiof the man in front of him is less thanan, they swap their places (it looks like this: the man numbernasks the one before him: \"Erm... Excuse me please but it's very important for me... could you please let me move up the queue?\"), then he again poses the question to the man in front of him and so on. But in case whenaiis greater thanan, moving up the queue stops. However, the man numberncan perform the operation no more thancntimes.In our task let us suppose that by the moment when the man numbernjoins the queue, the process of swaps betweenn- 1will have stopped. If the swap is possible it necessarily takes place.Your task is to help Vasya model the described process and find the order in which the people will stand in queue when all the swaps stops.InputThe first input line contains an integernwhich is the number of people who has joined the queue (1 ≤n≤ 105). In the nextnlines descriptions of the people are given in order of their coming — space-separated integersaiandci(1 ≤ai≤n,0 ≤ci≤n). Every description is located on s single line. All theai's are different.OutputOutput the permutation of numbers from1ton, which signifies the queue formed according to the above described rules, starting from the beginning to the end. In this succession thei-th number stands for the number of a person who will stand in line on the place numberiafter the swaps ends. People are numbered starting with1in the order in which they were given in the input. Separate numbers by a space.ExamplesInput21 02 1Output2 1Input31 32 33 3Output3 2 1Input52 31 44 33 15 2Output3 1 5 4 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e866336a", "template_md5": "35d339e4", "result": "You are given a queue of $n$ people, where each person is identified by a number from 1 to $n$. Each person also has two attributes:\n\n* $a_i$: the importance of their task (a number from 1 to $n$).\n* $c_i$: the number of times they are allowed to swap positions with someone in front of them.\n\nA new person enters the queue.  This person will try to move up the queue as follows:\n\n1. They compare their task importance ($a_n$) with the task importance of the person in front of them ($a_{n-1}$).\n2. If $a_n > a_{n-1}$, they stop trying to move up.\n3. If $a_n < a_{n-1}$, they swap positions with the person in front of them. They can repeat this step up to $c_n$ times.\n\nThe process continues until no more swaps are possible.\n\n**Input:**\n\n* The first line contains an integer $n$ (the number of people in the queue).\n* The next $n$ lines each contain two integers: $a_i$ and $c_i$ (the task importance and the maximum number of swaps for person $i$).\n\n**Output:**\n\nPrint the final order of the people in the queue, starting from the front."}, {"prompt_md5": "0108857c", "template_md5": "465699a0", "result": "You are given a list of people, each with an importance level and a number of allowed swaps.  People join the queue one by one.  Each new person can swap places with the person in front of them if their importance level is higher, but they can only do this a limited number of times.  Determine the final order of the people in the queue after all swaps are complete."}]}