{"uid": "380-B", "url": "https://codeforces.com/contest/380/problem/B", "tags": ["graphs", " implementation"], "title": "380-B", "statement": "B. Sereja and Treetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSereja adores trees. Today he came up with a revolutionary new type of binary root trees.His new tree consists ofnlevels, each vertex is indexed by two integers: the number of the level and the number of the vertex on the current level. The tree root is at level1, its index is(1, 1). Here is a pseudo code of tree construction.//the global data are integer arrays cnt[], left[][], right[][]cnt[1] = 1;fill arrays left[][], right[][] with values -1;for(level = 1; level < n; level = level + 1){cnt[level + 1] = 0;for(position = 1; position <= cnt[level]; position = position + 1){if(the value of position is a power of two){ // that is, 1, 2, 4, 8...left[level][position] = cnt[level + 1] + 1;right[level][position] = cnt[level + 1] + 2;cnt[level + 1] = cnt[level + 1] + 2;}else{right[level][position] = cnt[level + 1] + 1;cnt[level + 1] = cnt[level + 1] + 1;}}}After the pseudo code is run, cellcnt[level]contains the number of vertices on levellevel. Cellleft[level][position]contains the number of the vertex on the levellevel+ 1, which is the left child of the vertex with index(level,position), or it contains -1, if the vertex doesn't have a left child. Similarly, cellright[level][position]is responsible for the right child. You can see how the tree withn= 4looks like in the notes.Serja loves to make things complicated, so he first made a tree and then added an empty setA(level,position)for each vertex. Then Sereja executesmoperations. Each operation is of one of the two following types:The format of the operation is \"1tlrx\". For all verticeslevel,position(level=t;l≤position≤r)add valuexto setA(level,position).The format of the operation is \"2tv\". For vertexlevel,position(level=t,position=v), find the union of all sets of vertices that are in the subtree of vertex(level,position). Print the size of the union of these sets.Help Sereja execute the operations. In this problem a set contains only distinct values like std::set in C++.InputThe first line contains integersnandm(1 ≤n,m≤ 7000).Nextmlines contain the descriptions of the operations. The operation of the first type is given by five integers:1tlrx(1 ≤t≤n; 1 ≤l≤r≤cnt[t]; 1 ≤x≤ 106). The operation of the second type is given by three integers:2tv(1 ≤t≤n; 1 ≤v≤cnt[t]).OutputFor each operation of the second type, print the answer on a single line.ExamplesInput4 51 4 4 7 11 3 1 2 22 1 12 4 12 3 3Output201NoteYou can find the definitions that are used while working with root trees by this link: http://en.wikipedia.org/wiki/Tree_(graph_theory)You can see an example of a constructed tree atn= 4below.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "386240f2", "template_md5": "35d339e4", "result": "You are given a tree with $n$ levels. Each level has a number of vertices, and each vertex is indexed by a pair $(level, position)$. The root of the tree is at level 1, index $(1,1)$.\n\nThe tree is constructed as follows:\n\n* Level 1 has 1 vertex.\n* For each subsequent level, the number of vertices is determined by a specific rule (see the original problem statement for details).\n* Each vertex has a left and right child, which are also vertices in the tree.\n\nFor each vertex $(level, position)$, there is an associated set $A(level, position)$.\n\nYou are given $m$ operations to perform:\n\n* **Operation 1:**  Add a value $x$ to the set $A(level, position)$ for all vertices $(level, position)$ where $l \\le position \\le r$.\n* **Operation 2:** Find the size of the union of all sets $A(level, position)$ for all vertices in the subtree rooted at $(level, v)$.\n\nOutput the size of the union for each operation of type 2."}, {"prompt_md5": "17480b15", "template_md5": "465699a0", "result": "You are given a tree with multiple levels. Each level has a number of nodes.  \n\nYou are given operations of two types:\n\n1. Add a value to a set associated with a range of nodes on a specific level.\n2. Find the size of the union of all sets associated with nodes in a subtree rooted at a specific node. \n\nOutput the size of the union for each operation of type 2."}]}