{"uid": "380-D", "url": "https://codeforces.com/contest/380/problem/D", "tags": ["combinatorics", " math"], "title": "380-D", "statement": "D. Sereja and Cinematime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe cinema theater hall in Sereja's city isnseats lined up in front of one large screen. There are slots for personal possessions to the left and to the right of each seat. Any two adjacent seats have exactly one shared slot. The figure below shows the arrangement of seats and slots forn= 4.Today it's the premiere of a movie called \"Dry Hard\". The tickets for all the seats have been sold. There is a very strict controller at the entrance to the theater, so allnpeople will come into the hall one by one. As soon as a person enters a cinema hall, he immediately (momentarily) takes his seat and occupies all empty slots to the left and to the right from him. If there are no empty slots, the man gets really upset and leaves.People are not very constant, so it's hard to predict the order in which the viewers will enter the hall. For some seats, Sereja knows the number of the viewer (his number in the entering queue of the viewers) that will come and take this seat. For others, it can be any order.Being a programmer and a mathematician, Sereja wonders: how many ways are there for the people to enter the hall, such that nobody gets upset? As the number can be quite large, print it modulo1000000007(109+ 7).InputThe first line contains integern(1 ≤n≤ 105). The second line containsnintegers, thei-th integer shows either the index of the person (index in the entering queue) with the ticket for thei-th seat or a0, if his index is not known. It is guaranteed that all positive numbers in the second line are distinct.You can assume that the index of the person who enters the cinema hall is a unique integer from 1 ton. The person who has index 1 comes first to the hall, the person who has index 2 comes second and so on.OutputIn a single line print the remainder after dividing the answer by number1000000007(109+ 7).ExamplesInput110 0 0 0 0 0 0 0 0 0 0Output1024Input60 3 1 0 0 0Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4ee45a70", "template_md5": "35d339e4", "result": "There are $n$ seats in a cinema hall arranged in a row. Each seat has two slots next to it, one on each side.  \n\nYou are given a list of $n$ numbers. The $i$-th number represents the index of the person who will sit in the $i$-th seat, or 0 if the seat is unassigned.\n\nPeople enter the cinema one by one. When a person enters, they take the empty slots on both sides of their assigned seat. If there are no empty slots, the person leaves.\n\nFind the number of ways the people can enter the cinema so that no one leaves.  The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "44793b3e", "template_md5": "465699a0", "result": "You are given a row of seats with slots on either side. Each seat can be occupied by a person.  You know the order some people will arrive, but not all.  \n\nDetermine how many different ways the people can arrive so that everyone can sit down without being blocked by someone already seated."}]}