{"uid": "380-E", "url": "https://codeforces.com/contest/380/problem/E", "tags": ["data structures"], "title": "380-E", "statement": "E. Sereja and Dividingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLet's assume that we have a sequence of doublesa1,a2, ...,a|a|and a double variablex. You are allowed to perform the following two-staged operation:choose an index of the sequence elementi(1 ≤i≤ |a|);consecutively perform assignments:.Let's use functiong(a,x)to represent the largest value that can be obtained from variablex, using the described operation any number of times and sequencea.Sereja has sequenceb1,b2, ...,b|b|. Help Sereja calculate sum:. Record[bi,bi+ 1, ...,bj]represents a sequence containing the elements in brackets in the given order. To avoid problems with precision, please, print the required sum divided by|b|2.InputThe first line contains integer|b|(1 ≤ |b| ≤ 3·105)— the length of sequenceb. The second line contains|b|integersb1,b2,...,b|b|(1 ≤bi≤ 105).OutputIn a single line print a real number — the required sum divided by|b|2. Your answer will be considered correct if its absolute or relative error won't exceed10- 6.ExamplesInput51 2 3 4 1Output1.238750000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3eec490d", "template_md5": "35d339e4", "result": "You are given a sequence of integers $b_1, b_2, ..., b_{|b|}$.  \n\nYou are also given a function $g(a, x)$ that works as follows:\n\n1. Choose an index $i$ from the sequence $a$ (where $1 \\le i \\le |a|$).\n2. Perform the following assignments consecutively:\n   * $x = a_i$\n\nThe function $g(a, x)$ returns the largest value that can be obtained for $x$ using the described operation any number of times and the sequence $a$.\n\nCalculate the sum:\n\n$$\\frac{1}{|b|^2} \\sum_{i=1}^{|b|} g([b_i, b_{i+1}, ..., b_j], x)$$\n\nwhere the sum is taken over all possible values of $j$ such that $i \\le j \\le |b|$.\n\nPrint the result."}, {"prompt_md5": "b7efad80", "template_md5": "465699a0", "result": "You are given two lists of numbers.  The goal is to find the average of the maximum values you can get from a specific operation applied to the first list. The operation involves choosing a number from the first list and repeatedly adding it to a target value."}]}