{"uid": "382-E", "url": "https://codeforces.com/contest/382/problem/E", "tags": ["combinatorics", " dp"], "title": "382-E", "statement": "E. Ksenia and Combinatoricstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutKsenia has her winter exams. Today she is learning combinatorics. Here's one of the problems she needs to learn to solve.How many distinct trees are there consisting ofnvertices, each with the following properties:the tree is marked, that is, the vertices of the tree are numbered from 1 ton;each vertex of the tree is connected with at most three other vertices, and at the same moment the vertex with number 1 is connected with at most two other vertices;the size of the tree's maximum matching equalsk.Two trees are considered distinct if there are such two verticesuandv, that in one tree they are connected by an edge and in the other tree they are not.Help Ksenia solve the problem for the givennandk. As the answer to the problem can be very huge you should output it modulo1000000007 (109+ 7).InputThe first line contains two integersn,k(1 ≤n,k≤ 50).OutputPrint a single integer — the answer to the problem modulo1000000007 (109+ 7).ExamplesInput1 1Output0Input2 1Output1Input3 1Output3Input4 2Output12NoteIf you aren't familiar with matchings, please, read the following link: http://en.wikipedia.org/wiki/Matching_(graph_theory).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f75a181f", "template_md5": "35d339e4", "result": "Given two integers $n$ and $k$ (where $1 \\le n, k \\le 50$), find the number of distinct trees with $n$ vertices that satisfy the following conditions:\n\n* The vertices of the tree are numbered from 1 to $n$.\n* Each vertex is connected to at most three other vertices.\n* Vertex 1 is connected to at most two other vertices.\n* The size of the tree's maximum matching is $k$.\n\nTwo trees are considered distinct if there are two vertices $u$ and $v$ where they are connected by an edge in one tree but not in the other.\n\nThe answer should be output modulo 1000000007 ($10^9 + 7$)."}, {"prompt_md5": "6cd457a9", "template_md5": "465699a0", "result": "Count the number of unique trees with *n* numbered nodes where each node connects to at most three other nodes, the first node connects to at most two other nodes, and the largest possible set of connected pairs of nodes is of size *k*.  The answer should be given modulo 1000000007."}]}