{"uid": "382-B", "url": "https://codeforces.com/contest/382/problem/B", "tags": ["binary search", " math"], "title": "382-B", "statement": "B. Number Busterstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutArthur and Alexander are number busters. Today they've got a competition.Arthur took a group of four integersa,b,w,x(0 ≤b<w, 0 <x<w)and Alexander took integerс. Arthur and Alexander use distinct approaches to number bustings. Alexander is just a regular guy. Each second, he subtracts one from his number. In other words, he performs the assignment:c=c- 1. Arthur is a sophisticated guy. Each second Arthur performs a complex operation, described as follows: ifb≥x, perform the assignmentb=b-x, ifb<x, then perform two consecutive assignmentsa=a- 1;b=w- (x-b).You've got numbersa,b,w,x,c. Determine when Alexander gets ahead of Arthur if both guys start performing the operations at the same time. Assume that Alexander got ahead of Arthur ifc≤a.InputThe first line contains integersa,b,w,x,c(1 ≤a≤ 2·109, 1 ≤w≤ 1000, 0 ≤b<w, 0 <x<w, 1 ≤c≤ 2·109).OutputPrint a single integer — the minimum time in seconds Alexander needs to get ahead of Arthur. You can prove that the described situation always occurs within the problem's limits.ExamplesInput4 2 3 1 6Output2Input4 2 3 1 7Output4Input1 2 3 2 6Output13Input1 1 2 1 1Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7de08517", "template_md5": "35d339e4", "result": "You are given five integers: $a$, $b$, $w$, $x$, and $c$.  \n\nThere are two players. Player 1 starts with $a$ and $b$. Player 2 starts with $c$.\n\n* **Player 1's turn:**\n    * If $b \\ge x$, then set $b = b - x$.\n    * If $b < x$, then set $a = a - 1$ and $b = w - (x - b)$.\n\n* **Player 2's turn:**\n    * Set $c = c - 1$.\n\nBoth players take turns simultaneously. Determine the minimum number of turns it takes for Player 2 to have a value less than or equal to Player 1's value ($c \\le a$)."}, {"prompt_md5": "032a5f79", "template_md5": "465699a0", "result": "Two players decrease their numbers over time. One player subtracts 1 each second. The other player subtracts a larger number if their current number is greater than or equal to a certain value, otherwise, they subtract smaller numbers in a specific sequence. Determine the minimum time it takes for the first player to have a smaller number than the second player."}]}