{"uid": "383-D", "url": "https://codeforces.com/contest/383/problem/D", "tags": ["dp"], "title": "383-D", "statement": "D. Antimattertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIahub accidentally discovered a secret lab. He found therendevices ordered in a line, numbered from1tonfrom left to right. Each devicei(1 ≤i≤n)can create eitheraiunits of matter oraiunits of antimatter.Iahub wants to choose some contiguous subarray of devices in the lab, specify the production mode for each of them (produce matter or antimatter) and finally take a photo of it. However he will be successful only if the amounts of matter and antimatter produced in the selected subarray will be the same (otherwise there would be overflowing matter or antimatter in the photo).You are requested to compute the number of different ways Iahub can successful take a photo. A photo is different than another if it represents another subarray, or if at least one device of the subarray is set to produce matter in one of the photos and antimatter in the other one.InputThe first line contains an integern(1 ≤n≤ 1000). The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 1000).The suma1+a2+ ... +anwill be less than or equal to10000.OutputOutput a single integer, the number of ways Iahub can take a photo, modulo1000000007(109+ 7).ExamplesInput41 1 1 1Output12NoteThe possible photos are [1+, 2-], [1-, 2+], [2+, 3-], [2-, 3+], [3+, 4-], [3-, 4+], [1+, 2+, 3-, 4-], [1+, 2-, 3+, 4-], [1+, 2-, 3-, 4+], [1-, 2+, 3+, 4-], [1-, 2+, 3-, 4+] and [1-, 2-, 3+, 4+], where \"i+\" means that thei-th element produces matter, and \"i-\" means that thei-th element produces antimatter.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "98c36bdd", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, where each integer represents the amount of matter or antimatter a device can produce.  \n\nYou need to find the number of ways to choose a contiguous subarray of these devices and set each device to either produce matter or antimatter such that the total amount of matter produced equals the total amount of antimatter produced.\n\nThe output should be the number of valid subarrays modulo $10^9 + 7$."}, {"prompt_md5": "9733c864", "template_md5": "465699a0", "result": "You are given a sequence of numbers.  Each number represents a device that can produce either a positive or negative amount.  You need to find the number of ways to choose a sub-sequence of these numbers so that the sum of the positive values equals the sum of the negative values."}]}