{"uid": "385-E", "url": "https://codeforces.com/contest/385/problem/E", "tags": ["math", " matrices"], "title": "385-E", "statement": "E. Bear in the Fieldtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOur bear's forest has a checkered field. The checkered field is ann×ntable, the rows are numbered from 1 tonfrom top to bottom, the columns are numbered from 1 tonfrom left to right. Let's denote a cell of the field on the intersection of rowxand columnyby record(x,y). Each cell of the field contains growing raspberry, at that, the cell(x,y)of the field containsx+yraspberry bushes.The bear came out to walk across the field. At the beginning of the walk his speed is(dx,dy). Then the bear spends exactlytseconds on the field. Each second the following takes place:Let's suppose that at the current moment the bear is in cell(x,y).First the bear eats the raspberry from all the bushes he has in the current cell. After the bear eats the raspberry fromkbushes, he increases each component of his speed byk. In other words, if before eating thekbushes of raspberry his speed was(dx,dy), then after eating the berry his speed equals(dx+k,dy+k).Let's denote the current speed of the bear(dx,dy)(it was increased after the previous step). Then the bear moves from cell(x,y)to cell(((x+dx- 1)modn) + 1, ((y+dy- 1)modn) + 1).Then one additional raspberry bush grows in each cell of the field.You task is to predict the bear's actions. Find the cell he ends up in if he starts from cell(sx,sy). Assume that each bush has infinitely much raspberry and the bear will never eat all of it.InputThe first line of the input contains six space-separated integers:n,sx,sy,dx,dy,t(1 ≤n≤ 109; 1 ≤sx,sy≤n;  - 100 ≤dx,dy≤ 100; 0 ≤t≤ 1018).OutputPrint two integers — the coordinates of the cell the bear will end up in aftertseconds.ExamplesInput5 1 2 0 1 2Output3 1Input1 1 1 -1 -1 2Output1 1NoteOperationamodbmeans taking the remainder after dividingabyb. Note that the result of the operation is always non-negative. For example,( - 1)mod3 = 2.In the first sample before the first move the speed vector will equal (3,4) and the bear will get to cell (4,1). Before the second move the speed vector will equal (9,10) and he bear will get to cell (3,1). Don't forget that at the second move, the number of berry bushes increased by 1.In the second sample before the first move the speed vector will equal (1,1) and the bear will get to cell (1,1). Before the second move, the speed vector will equal (4,4) and the bear will get to cell (1,1). Don't forget that at the second move, the number of berry bushes increased by 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dbe04aab", "template_md5": "35d339e4", "result": "You are given a square grid of size $n \\times n$. Each cell $(x, y)$ contains $x + y$ raspberry bushes. \n\nA bear starts at cell $(s_x, s_y)$ with an initial speed of $(d_x, d_y)$. \n\nEvery second, the bear performs the following actions:\n\n1. **Eat:** The bear eats all the raspberry bushes in its current cell, increasing each component of its speed by the number of bushes eaten.\n2. **Move:** The bear moves to a new cell based on its current speed. The new cell is calculated as:\n   *  $((x + d_x - 1) \\mod n) + 1$ for the row.\n   *  $((y + d_y - 1) \\mod n) + 1$ for the column.\n   *  The $\\mod n$ operation ensures the bear stays within the grid boundaries.\n\n3. **Grow:** One new raspberry bush grows in each cell of the grid.\n\nThe process repeats for $t$ seconds.\n\n**Your task:** Determine the cell coordinates $(x, y)$ where the bear will end up after $t$ seconds.\n\n\n\nLet me know if you'd like me to clarify any part of the problem!"}, {"prompt_md5": "69c0b57f", "template_md5": "465699a0", "result": "A creature starts at a given position on a square grid. Each second, it eats berries in its current cell, which increases its speed. After eating, it moves to a new cell based on its speed and the grid's size.  New berries grow in each cell each second.  Determine the creature's final position after a given number of seconds."}]}