{"uid": "385-D", "url": "https://codeforces.com/contest/385/problem/D", "tags": ["bitmasks", " dp", " geometry"], "title": "385-D", "statement": "D. Bear and Floodlighttime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day a bear lived on theOxyaxis. He was afraid of the dark, so he couldn't move at night along the plane points that aren't lit. One day the bear wanted to have a night walk from his house at point(l, 0)to his friend's house at point(r, 0), along the segment of length(r-l). Of course, if he wants to make this walk, he needs each point of the segment to be lit. That's why the bear called his friend (and yes, in the middle of the night) asking for a very delicate favor.TheOxyaxis containsnfloodlights. Floodlightiis at point(xi,yi)and can light any angle of the plane as large asaidegree with vertex at point(xi,yi). The bear asked his friend to turn the floodlights so that he (the bear) could go as far away from his house as possible during the walking along the segment. His kind friend agreed to fulfill his request. And while he is at it, the bear wonders: what is the furthest he can go away from his house? Hep him and find this distance.Consider that the plane has no obstacles and no other light sources besides the floodlights. The bear's friend cannot turn the floodlights during the bear's walk. Assume that after all the floodlights are turned in the correct direction, the bear goes for a walk and his friend goes to bed.InputThe first line contains three space-separated integersn,l,r(1 ≤n≤ 20;  - 105≤l≤r≤ 105). Thei-th of the nextnlines contain three space-separated integersxi,yi,ai( - 1000 ≤xi≤ 1000; 1 ≤yi≤ 1000; 1 ≤ai≤ 90)— the floodlights' description.Note that two floodlights can be at the same point of the plane.OutputPrint a single real number — the answer to the problem. The answer will be considered correct if its relative or absolute error doesn't exceed10- 6.ExamplesInput2 3 53 1 455 1 45Output2.000000000Input1 0 11 1 30Output0.732050808Input1 0 11 1 45Output1.000000000Input1 0 20 2 90Output2.000000000NoteIn the first sample, one of the possible solutions is:In the second sample, a single solution is:In the third sample, a single solution is:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "772f26f0", "template_md5": "35d339e4", "result": "You are given a line segment of length $r-l$ on the x-axis, with one end at point $(l,0)$ and the other at point $(r,0)$. There are $n$ floodlights, each located at point $(x_i, y_i)$ and able to illuminate a cone of angle $a_i$ degrees. \n\nThe goal is to find the maximum distance the bear can walk along the line segment while staying within the illuminated area of the floodlights. \n\n**Input:**\n\n* $n$: the number of floodlights\n* $l$: the x-coordinate of the starting point\n* $r$: the x-coordinate of the ending point\n* For each floodlight $i$:\n    * $x_i$: the x-coordinate of the floodlight\n    * $y_i$: the y-coordinate of the floodlight\n    * $a_i$: the angle of illumination of the floodlight\n\n**Output:**\n\n* The maximum distance the bear can walk along the line segment."}, {"prompt_md5": "2afa8166", "template_md5": "465699a0", "result": "You are given a line segment and a set of lights that can illuminate a certain angle.  Find the furthest point on the line segment that can be lit by at least one of the lights."}]}