{"uid": "388-C", "url": "https://codeforces.com/contest/388/problem/C", "tags": ["games", " greedy", " sortings"], "title": "388-C", "statement": "C. Fox and Card Gametime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutFox Ciel is playing a card game with her friend Fox Jiro. There arenpiles of cards on the table. And there is a positive integer on each card.The players take turns and Ciel takes the first turn. In Ciel's turn she takes a card from the top of any non-empty pile, and in Jiro's turn he takes a card from the bottom of any non-empty pile. Each player wants to maximize the total sum of the cards he took. The game ends when all piles become empty.Suppose Ciel and Jiro play optimally, what is the score of the game?InputThe first line contain an integern(1 ≤n≤ 100). Each of the nextnlines contains a description of the pile: the first integer in the line issi(1 ≤si≤ 100) — the number of cards in thei-th pile; then followsipositive integersc1,c2, ...,ck, ...,csi(1 ≤ck≤ 1000) — the sequence of the numbers on the cards listed from top of the current pile to bottom of the pile.OutputPrint two integers: the sum of Ciel's cards and the sum of Jiro's cards if they play optimally.ExamplesInput21 1002 1 10Output101 10Input19 2 8 6 5 9 4 7 1 3Output30 15Input33 1 3 23 5 4 62 8 7Output18 18Input33 1000 1000 10006 1000 1000 1000 1000 1000 10005 1000 1000 1000 1000 1000Output7000 7000NoteIn the first example, Ciel will take the cards with number 100 and 1, Jiro will take the card with number 10.In the second example, Ciel will take cards with numbers 2, 8, 6, 5, 9 and Jiro will take cards with numbers 4, 7, 1, 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5f527b7b", "template_md5": "35d339e4", "result": "There are $n$ piles of cards. Each pile has a number of cards ($s_i$) and each card has a positive integer value ($c_1, c_2, ..., c_i$). \n\nTwo players take turns.  The first player can take the top card from any non-empty pile. The second player can take the bottom card from any non-empty pile.  \n\nThe game ends when all piles are empty.\n\nWhat is the maximum total sum of cards each player can get if they both play optimally? \n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100).\n* Each of the next $n$ lines describes a pile:\n    * The first integer is $s_i$ (1 ≤ $s_i$ ≤ 100), the number of cards in the pile.\n    * The next $s_i$ integers are the values of the cards in the pile, listed from top to bottom.\n\nOutput:\n\n* Print two integers: the sum of the first player's cards and the sum of the second player's cards."}, {"prompt_md5": "753558db", "template_md5": "465699a0", "result": "Two players take turns removing cards from piles. One player removes from the top of a pile, the other from the bottom.  Each card has a value. Players want to maximize their total card value. What is the final score for each player if they play optimally?"}]}