{"uid": "39-F", "url": "https://codeforces.com/contest/39/problem/F", "tags": ["implementation"], "title": "39-F", "statement": "F. Pacifist frogstime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutThumbelina has had an accident. She has found herself on a little island in the middle of a swamp and wants to get to the shore very much.One can get to the shore only by hills that are situated along a straight line that connects the little island with the shore. Let us assume that the hills are numbered from1tonand the number of a hill is equal to the distance in meters between it and the island. The distance between then-th hill and the shore is also1meter.Thumbelina is too small to make such jumps. Fortunately, a family of frogs living in the swamp suggests to help her. Each frog agrees to give Thumbelina a ride but Thumbelina should choose only one frog. Each frog has a certain jump length. If Thumbelina agrees to accept help from a frog whose jump length isd, the frog will jump from the island on the hilld, then — on the hill2d, then3dand so on until they get to the shore (i.e. find itself beyond the hilln).However, there is one more problem: mosquitoes also live in the swamp. At the moment they have a siesta, and they are having a nap on some hills. If the frog jumps on a hill with a mosquito the frog will smash it. The frogs Thumbelina has met are pacifists, so they will find the death of each mosquito very much sad. Help Thumbelina choose a frog that will bring her to the shore and smash as small number of mosquitoes as possible.InputThe first line contains three integersn,mandk(1 ≤n≤ 109,1 ≤m,k≤ 100) — the number of hills, frogs and mosquitoes respectively. The second line containsmintegersdi(1 ≤di≤ 109) — the lengths of the frogs’ jumps. The third line containskintegers — the numbers of the hills on which each mosquito is sleeping. No more than one mosquito can sleep on each hill. The numbers in the lines are separated by single spaces.OutputIn the first line output the number of frogs that smash the minimal number of mosquitoes, in the second line — their numbers in increasing order separated by spaces. The frogs are numbered from1tomin the order of the jump length given in the input data.ExamplesInput5 3 52 3 41 2 3 4 5Output22 3Input1000000000 2 32 5999999995 999999998 999999996Output12", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "033f548c", "template_md5": "35d339e4", "result": "There are $n$ hills numbered from 1 to $n$.  Hill 1 is an island and hill $n$ is the shore.  You need to get from hill 1 to hill $n$.\n\nThere are $m$ frogs, each with a different jump length. Frog $i$ can jump $d_i$ hills at a time.\n\nThere are $k$ mosquitoes on some of the hills.\n\nYou can choose one frog to help you.  You want to choose the frog that will step on the fewest mosquitoes while getting you to hill $n$.\n\nInput:\n\n* Line 1: $n$, $m$, $k$\n* Line 2: $d_1$, $d_2$, ..., $d_m$\n* Line 3: The hills where the mosquitoes are.\n\nOutput:\n\n* Line 1: The number of frogs that minimize the number of mosquitoes stepped on.\n* Line 2: The numbers of those frogs."}, {"prompt_md5": "85fd7235", "template_md5": "465699a0", "result": "You are given a number of hills and a number of frogs, each with a different jump length. Some hills have mosquitoes on them.  You need to choose a frog to help reach the last hill while minimizing the number of mosquitoes killed. Output the number of frogs that minimize mosquito deaths and their corresponding IDs."}]}