{"uid": "39-G", "url": "https://codeforces.com/contest/39/problem/G", "tags": ["implementation"], "title": "39-G", "statement": "G. Inverse Functiontime limit per test5 secondsmemory limit per test64 megabytesinputstdinoutputstdoutPetya wrote a programme on C++ that calculated a very interesting functionf(n). Petya ran the program with a certain value ofnand went to the kitchen to have some tea. The history has no records concerning how long the program had been working. By the time Petya returned, it had completed the calculations and had the result. However while Petya was drinking tea, a sly virus managed to destroy the input file so that Petya can't figure out for which value ofnthe program was run. Help Petya, carry out the inverse function!Mostly, the program consists of a function in C++ with the following simplified syntax:function::= int f(int n) {operatorSequence}operatorSequence::=operator|operatoroperatorSequenceoperator::= returnarithmExpr;|if (logicalExpr) returnarithmExpr;logicalExpr::=arithmExpr>arithmExpr|arithmExpr<arithmExpr|arithmExpr==arithmExprarithmExpr::=sumsum::=product|sum+product|sum-productproduct::=multiplier|product*multiplier|product/multipliermultiplier::= n|number|f(arithmExpr)number::=0|1|2|... |32767The whitespaces in aoperatorSequenceare optional.Thus, we have a function, in which body there are two kinds of operators. There is the operator \"returnarithmExpr;\" that returns the value of the expression as the value of the function, and there is the conditional operator \"if (logicalExpr) returnarithmExpr;\" that returns the value of the arithmetical expression when and only when the logical expression is true. Guaranteed that no other constructions of C++ language — cycles, assignment operators, nested conditional operators etc, and other variables except thenparameter are used in the function. All the constants are integers in the interval[0..32767].The operators are performed sequentially. After the function has returned a value other operators in the sequence are not performed. Arithmetical expressions are performed taking into consideration the standard priority of the operations. It means that first all the products that are part of the sum are calculated. During the calculation of the products the operations of multiplying and division are performed from the left to the right. Then the summands are summed, and the addition and the subtraction are also performed from the left to the right. Operations \">\" (more), \"<\" (less) and \"==\" (equals) also have standard meanings.Now you've got to pay close attention! The program is compiled with the help of15-bit Berland C++ compiler invented by a Berland company BerSoft, that's why arithmetical operations are performed in a non-standard way. Addition, subtraction and multiplication are performed modulo32768(if the result of subtraction is negative, then32768is added to it until the number belongs to the interval[0..32767]). Division \"/\" is a usual integer division where the remainder is omitted.Examples of arithmetical operations:Guaranteed that for all values ofnfrom0to32767the given function is performed correctly. That means that:1. Division by0never occures.2. When performing a function for the valuen=Nrecursive calls of the functionfmay occur only for the parameter value of0, 1, ...,N- 1. Consequently, the program never has an infinite recursion.3. As the result of the sequence of the operators, the function always returns a value.We have to mention that due to all the limitations the value returned by the functionfis independent from either global variables or the order of performing the calculations of arithmetical expressions as part of the logical one, or from anything else except the value ofnparameter. That's why theffunction can be regarded as a function in its mathematical sense, i.e. as a unique correspondence between any value ofnfrom the interval[0..32767]and a value off(n)from the same interval.Given the value off(n), and you should findn. If the suitablenvalue is not unique, you should find the maximal one (from the interval[0..32767]).InputThe first line has an integerf(n)from the interval[0..32767]. The next lines have the description of the functionf. In the description can be found extra spaces and line breaks (see the examples) which, of course, can’t break key words int, if, return and numbers. The size of input data can’t exceed100bytes.OutputOutput a single number — the answer to the problem. If there’s no answer, output \"-1\" (without quotes).ExamplesInput17int f(int n){if (n < 100) return 17;if (n > 99) return 27;}Output99Input13int f(int n){if (n == 0) return 0;return f(n - 1) + 1;}Output13Input144int f(int n){if (n == 0) return 0;if (n == 1) return n;return f(n - 1) + f(n - 2);}Output24588", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9528ce4e", "template_md5": "35d339e4", "result": "You are given a function $f(n)$ defined by a program. The program's code is provided as input. The program calculates a value based on the input $n$ using arithmetic operations, comparisons, and conditional statements. \n\nYou are also given the output of the function, $f(n)$. Your task is to find the input value $n$ that produced this output. \n\n**Important Notes:**\n\n* The program uses a non-standard arithmetic system where addition, subtraction, and multiplication are performed modulo 32768.\n* Division is standard integer division (remainder is discarded).\n* The program only uses the input $n$ and does not use any global variables or other external factors.\n* If there are multiple possible values of $n$ that produce the given output, you should find the largest one.\n* If no such value exists, output -1.\n\n\n\nLet me know if you'd like me to elaborate on any specific aspect of the problem."}, {"prompt_md5": "8069919a", "template_md5": "465699a0", "result": "You are given the result of a function calculated for an unknown input. The function uses basic arithmetic operations (addition, subtraction, multiplication, division) and conditional statements (if-then).  You need to find the largest possible input value that would produce the given result."}]}