{"uid": "39-H", "url": "https://codeforces.com/contest/39/problem/H", "tags": ["implementation"], "title": "39-H", "statement": "H. Multiplication Tabletime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutPetya studies positional notations. He has already learned to add and subtract numbers in the systems of notations with different radices and has moved on to a more complicated action — multiplication. To multiply large numbers one has to learn the multiplication table. Unfortunately, in the second grade students learn only the multiplication table of decimals (and some students even learn it in the first grade). Help Petya make a multiplication table for numbers in the system of notations with the radixk.InputThe first line contains a single integerk(2 ≤k≤ 10) — the radix of the system.OutputOutput the multiplication table for the system of notations with the radixk. The table must containk- 1rows andk- 1columns. The element on the crossing of thei-th row and thej-th column is equal to the product ofiandjin the system of notations with the radixk. Each line may have any number of spaces between the numbers (the extra spaces in the samples are put for clarity).ExamplesInput10Output1  2  3  4  5  6  7  8  92  4  6  8 10 12 14 16 183  6  9 12 15 18 21 24 274  8 12 16 20 24 28 32 365 10 15 20 25 30 35 40 456 12 18 24 30 36 42 48 547 14 21 28 35 42 49 56 638 16 24 32 40 48 56 64 729 18 27 36 45 54 63 72 81Input3Output1  22 11", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "312d8918", "template_md5": "35d339e4", "result": "Given an integer $k$ (where $2 \\le k \\le 10$), output the multiplication table for the number system with radix $k$. The table should have $k-1$ rows and $k-1$ columns. The element in the $i$-th row and $j$-th column is the product of $i$ and $j$ in the number system with radix $k$."}, {"prompt_md5": "6c25da01", "template_md5": "465699a0", "result": "Create a multiplication table for numbers in a system with a base specified by the user.  The table should have dimensions (base-1) x (base-1). Each cell in the table should contain the product of the corresponding row and column number, calculated in the specified base."}]}