{"uid": "39-I", "url": "https://codeforces.com/contest/39/problem/I", "tags": [], "title": "39-I", "statement": "I. Tramtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutIn a Berland city S*** there is a tram engine house and only one tram. Three people work in the house — the tram driver, the conductor and the head of the engine house. The tram used to leave the engine house every morning and drove along his loop route. The tram needed exactlycminutes to complete the route. The head of the engine house controlled the tram’s movement, going outside everycminutes when the tram drove by the engine house, and the head left the driver without a bonus if he was even one second late.It used to be so. Afterwards the Berland Federal Budget gave money to make more tramlines in S***, and, as it sometimes happens, the means were used as it was planned. The tramlines were rebuilt and as a result they turned into a huge network. The previous loop route may have been destroyed. S*** hasncrossroads and nowmtramlines that links the pairs of crossroads. The traffic in Berland is one way so the tram can move along each tramline only in one direction. There may be several tramlines between two crossroads, which go same way or opposite ways. Every tramline links two different crossroads and for each crossroad there is at least one outgoing tramline.So, the tramlines were built but for some reason nobody gave a thought to increasing the number of trams in S***! The tram continued to ride alone but now the driver had an excellent opportunity to get rid of the unending control of the engine house head. For now due to the tramline network he could choose the route freely! Now at every crossroad the driver can arbitrarily choose the way he can go. The tram may even go to the parts of S*** from where it cannot return due to one way traffic. The driver is not afraid of the challenge: at night, when the city is asleep, he can return to the engine house safely, driving along the tramlines in the opposite direction.The city people were rejoicing for some of the had been waiting for the tram to appear on their streets for several years. However, the driver’s behavior enraged the engine house head. Now he tries to carry out an insidious plan of installing cameras to look after the rebellious tram.The plan goes as follows. The head of the engine house wants to install cameras at some crossroads, to choose a period of timetand everytminutes turn away from the favourite TV show to check where the tram is. Also the head of the engine house wants at all moments of time, divisible byt, and only at such moments the tram to appear on a crossroad under a camera. There must be a camera on the crossroad by the engine house to prevent possible terrorist attacks on the engine house head. Among all the possible plans the engine house head chooses the plan with the largest possible value oft(as he hates being distracted from his favourite TV show but he has to). If such a plan is not unique, pick the plan that requires the minimal possible number of cameras. Find such a plan.InputThe first line contains integersnandm(2 ≤n,m≤ 105) — the number of crossroads and tramlines in S*** respectively. The nextmlines contain the descriptions of the tramlines in \"uv\" format, whereuis the initial tramline crossroad andvis its final crossroad. The crossroads are numbered with integers from1ton, and the engine house is at the crossroad number1.OutputIn the first line output the value oft. In the next line output the value ofk— the required number of the cameras. In the next line output space-separated numbers of the crossroads, where the cameras should be installed. Output the numbers in increasing order.ExamplesInput4 51 22 33 44 11 4Output221 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a7a3436e", "template_md5": "35d339e4", "result": "There are $n$ crossroads and $m$ one-way tramlines connecting them. The tramlines are represented by pairs of integers $(u,v)$ where $u$ is the starting crossroad and $v$ is the ending crossroad.  \n\nA tram travels along these tramlines. The goal is to find the largest possible time interval $t$ (in minutes) such that the tram can be observed at a specific crossroad at every time point divisible by $t$.  \n\nThere must be a camera at the starting crossroad (crossroad 1).  \n\nFind the largest possible $t$ and the minimum number of cameras required to achieve this. If there are multiple solutions with the same $t$, choose the one requiring the fewest cameras. \n\n\n\nLet me know if you'd like me to elaborate on any part of the simplified statement."}, {"prompt_md5": "f1a29fd5", "template_md5": "465699a0", "result": "There are cities connected by one-way roads.  You need to find the longest interval of time between checks, where at each interval, a tram must be at a specific city.  You need to minimize the number of cities where you need to place cameras to make this work."}]}