{"uid": "39-K", "url": "https://codeforces.com/contest/39/problem/K", "tags": [], "title": "39-K", "statement": "K. Testingtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutYou take part in the testing of new weapon. For the testing a polygon was created. The polygon is a rectangular fieldn×min size, divided into unit squares1 × 1in size. The polygon containskobjects, each of which is a rectangle with sides, parallel to the polygon sides and entirely occupying several unit squares. The objects don't intersect and don't touch each other.The principle according to which the weapon works is highly secret. You only know that one can use it to strike any rectangular area whose area is not equal to zero with sides, parallel to the sides of the polygon. The area must completely cover some of the unit squares into which the polygon is divided and it must not touch the other squares. Of course the area mustn't cross the polygon border. Your task is as follows: you should hit no less than one and no more than three rectangular objects. Each object must either lay completely inside the area (in that case it is considered to be hit), or lay completely outside the area.Find the number of ways of hitting.InputThe first line has three integersn,mиk(1 ≤n,m≤ 1000,1 ≤k≤ 90) — the sizes of the polygon and the number of objects on it respectively. Nextnlines containmsymbols each and describe the polygon. The symbol \"*\" stands for a square occupied an object, whereas the symbol \".\" stands for an empty space. The symbols \"*\" form exactlykrectangular connected areas that meet the requirements of the task.OutputOutput a single number — the number of different ways to hit a target.ExamplesInput3 3 3*.*...*..Output21Input4 5 4.*.**...****......**Output38Input2 2 1.*..Output4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "67fbfbfb", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$ containing $k$ non-overlapping rectangles.  Each rectangle is made up of unit squares and does not touch each other.\n\nYou can strike any rectangular area within the grid, as long as:\n\n* The area has a non-zero area.\n* The area's sides are parallel to the grid's sides.\n* The area does not overlap with any other areas.\n* The area stays within the grid's boundaries.\n\nYour task is to find the number of ways to strike the grid such that:\n\n* You hit at least one rectangle and at most three rectangles.\n* Each rectangle is either entirely inside the struck area or entirely outside the struck area. \n\n\n\nInput:\n\n* The first line contains three integers: $n$, $m$, and $k$ (where $1 \\le n, m \\le 1000$ and $1 \\le k \\le 90$).\n* The next $n$ lines contain $m$ characters each, representing the grid. \n    * \"*\" represents a square occupied by a rectangle.\n    * \".\" represents an empty square.\n\nOutput:\n\n* A single integer representing the number of valid ways to strike the grid."}, {"prompt_md5": "4ac1a43d", "template_md5": "465699a0", "result": "You have a rectangular grid. Some squares are filled, and you need to find the number of ways to draw a rectangle around some of the filled squares without overlapping any filled squares.  The rectangle must be completely inside the grid and can't touch any empty squares.  You need to hit at least one and at most three filled squares."}]}