{"uid": "390-B", "url": "https://codeforces.com/contest/390/problem/B", "tags": ["implementation"], "title": "390-B", "statement": "B. Inna, Dima and Songtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutInna is a great piano player and Dima is a modest guitar player. Dima has recently written a song and they want to play it together. Of course, Sereja wants to listen to the song very much.A song is a sequence of notes. Dima and Inna want to play each note at the same time. At that, they can play thei-th note at volumev(1 ≤v≤ai;vis an integer) both on the piano and the guitar. They should retain harmony, so the total volume with which thei-th note was played on the guitar and the piano must equalbi. If Dima and Inna cannot play a note by the described rules, they skip it and Sereja's joy drops by 1. But if Inna and Dima play thei-th note at volumesxiandyi(xi+yi=bi)correspondingly, Sereja's joy rises byxi·yi.Sereja has just returned home from the university and his current joy is 0. Help Dima and Inna play the song so as to maximize Sereja's total joy after listening to the whole song!InputThe first line of the input contains integern(1 ≤n≤ 105)— the number of notes in the song. The second line containsnintegersai(1 ≤ai≤ 106). The third line containsnintegersbi(1 ≤bi≤ 106).OutputIn a single line print an integer — the maximum possible joy Sereja feels after he listens to a song.ExamplesInput31 1 22 2 3Output4Input125Output-1NoteIn the first sample, Dima and Inna play the first two notes at volume1(1 + 1 = 2, the condition holds), they should play the last note at volumes1and2. Sereja's total joy equals:1·1 + 1·1 + 1·2 = 4.In the second sample, there is no such pair(x,y), that1 ≤x,y≤ 2,x+y= 5, so Dima and Inna skip a note. Sereja's total joy equals -1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "599d2811", "template_md5": "35d339e4", "result": "There are $n$ notes in a song. For each note $i$, there is a maximum volume $a_i$ that can be played on each instrument.  The total volume for each note must be $b_i$.  \n\nIf the instruments play a note at volumes $x$ and $y$ ($x+y = b_i$), then Sereja's joy increases by $x \\cdot y$. If the instruments cannot play a note according to these rules, Sereja's joy decreases by 1.\n\nWhat is the maximum joy Sereja can have after listening to the whole song? \n\n\nInput:\n\n* The first line contains $n$.\n* The second line contains $a_1, a_2, ..., a_n$.\n* The third line contains $b_1, b_2, ..., b_n$.\n\nOutput:\n\n* The maximum possible joy Sereja can have."}, {"prompt_md5": "efcf675d", "template_md5": "465699a0", "result": "You are given two lists of numbers, one representing the maximum volume each note can be played at and another representing the target volume for each note.  Find the maximum total joy you can achieve by playing each note at a volume that adds up to the target volume for that note. If a note cannot be played at the required volume, you lose joy."}]}