{"uid": "390-A", "url": "https://codeforces.com/contest/390/problem/A", "tags": ["implementation"], "title": "390-A", "statement": "A. Inna and Alarm Clocktime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutInna loves sleeping very much, so she needsnalarm clocks in total to wake up. Let's suppose that Inna's room is a100 × 100square with the lower left corner at point(0, 0)and with the upper right corner at point(100, 100). Then the alarm clocks are points with integer coordinates in this square.The morning has come. Allnalarm clocks in Inna's room are ringing, so Inna wants to turn them off. For that Inna has come up with an amusing game:First Inna chooses a type of segments that she will use throughout the game. The segments can be either vertical or horizontal.Then Inna makes multiple moves. In a single move, Inna can paint a segment of any length on the plane, she chooses its type at the beginning of the game (either vertical or horizontal), then all alarm clocks that are on this segment switch off. The game ends when all the alarm clocks are switched off.Inna is very sleepy, so she wants to get through the alarm clocks as soon as possible. Help her, find the minimum number of moves in the game that she needs to turn off all the alarm clocks!InputThe first line of the input contains integern(1 ≤n≤ 105)— the number of the alarm clocks. The nextnlines describe the clocks: thei-th line contains two integersxi,yi— the coordinates of thei-th alarm clock(0 ≤xi,yi≤ 100).Note that a single point in the room can contain any number of alarm clocks and the alarm clocks can lie on the sides of the square that represents the room.OutputIn a single line print a single integer — the minimum number of segments Inna will have to draw if she acts optimally.ExamplesInput40 00 10 21 0Output2Input40 00 11 01 1Output2Input41 11 22 33 3Output3NoteIn the first sample, Inna first chooses type \"vertical segments\", and then she makes segments with ends at :(0, 0),(0, 2); and, for example,(1, 0),(1, 1). If she paints horizontal segments, she will need at least 3 segments.In the third sample it is important to note that Inna doesn't have the right to change the type of the segments during the game. That's why she will need 3 horizontal or 3 vertical segments to end the game.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "78f25b51", "template_md5": "35d339e4", "result": "You are given a 100x100 grid. There are $n$ points on the grid, each representing an alarm clock.  You can turn off alarm clocks by drawing segments on the grid.  \n\n* You can choose to draw either horizontal or vertical segments.\n* Once you choose a segment type, you must stick with it for the entire game.\n* Each segment you draw turns off all alarm clocks that lie on that segment.\n\nFind the minimum number of segments you need to draw to turn off all the alarm clocks."}, {"prompt_md5": "887575cc", "template_md5": "465699a0", "result": "You are given a grid of points.  You must turn off all the points by drawing lines (either horizontal or vertical). You can only choose one type of line at the beginning and must stick with it. Find the fewest lines needed to turn off all the points."}]}