{"uid": "390-E", "url": "https://codeforces.com/contest/390/problem/E", "tags": [], "title": "390-E", "statement": "E. Inna and Large Sweet Matrixtime limit per test1 secondmemory limit per test512 megabytesinputstdinoutputstdoutInna loves sweets very much. That's why she wants to play the \"Sweet Matrix\" game with Dima and Sereja. But Sereja is a large person, so the game proved small for him. Sereja suggested playing the \"Large Sweet Matrix\" game.The \"Large Sweet Matrix\" playing field is ann×mmatrix. Let's number the rows of the matrix from1ton, and the columns — from1tom. Let's denote the cell in thei-th row andj-th column as(i,j). Each cell of the matrix can contain multiple candies, initially all cells are empty. The game goes inwmoves, during each move one of the two following events occurs:Sereja chooses five integersx1,y1,x2,y2,v(x1≤x2,y1≤y2)and addsvcandies to each matrix cell(i,j)(x1≤i≤x2;y1≤j≤y2).Sereja chooses four integersx1,y1,x2,y2(x1≤x2,y1≤y2). Then he asks Dima to calculate the total number of candies in cells(i,j)(x1≤i≤x2;y1≤j≤y2)and he asks Inna to calculate the total number of candies in the cells of matrix(p,q), which meet the following logical criteria: (p<x1ORp>x2) AND (q<y1ORq>y2). Finally, Sereja asks to write down the difference between the number Dima has calculated and the number Inna has calculated (D - I).Unfortunately, Sereja's matrix is really huge. That's why Inna and Dima aren't coping with the calculating. Help them!InputThe first line of the input contains three integersn,mandw(3 ≤n,m≤ 4·106; 1 ≤w≤ 105).The nextwlines describe the moves that were made in the game.A line that describes an event of the first type contains 6 integers:0,x1,y1,x2,y2andv(1 ≤x1≤x2≤n; 1 ≤y1≤y2≤m; 1 ≤v≤ 109).A line that describes an event of the second type contains 5 integers:1,x1,y1,x2,y2(2 ≤x1≤x2≤n- 1; 2 ≤y1≤y2≤m- 1).It is guaranteed that the second type move occurs at least once. It is guaranteed that a single operation will not add more than109candies.Be careful, the constraints are very large, so please use optimal data structures. Max-tests will be in pretests.OutputFor each second type move print a single integer on a single line — the difference between Dima and Inna's numbers.ExamplesInput4 5 50 1 1 2 3 20 2 2 3 3 30 1 5 4 5 11 2 3 3 41 3 4 3 4Output2-21NoteNote to the sample. After the first query the matrix looks as:22200222000000000000After the second one it is:22200255000330000000After the third one it is:22201255010330100001For the fourth query, Dima's sum equals 5 + 0 + 3 + 0 = 8 and Inna's sum equals 4 + 1 + 0 + 1 = 6. The answer to the query equals 8 - 6 = 2. For the fifth query, Dima's sum equals 0 and Inna's sum equals 18 + 2 + 0 + 1 = 21. The answer to the query is 0 - 21 = -21.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6bcc9c31", "template_md5": "35d339e4", "result": "You are given an $n \\times m$ matrix.  There are $w$ operations performed on the matrix. Each operation is one of two types:\n\n* **Type 1:** Add $v$ candies to all cells in a rectangular submatrix defined by the coordinates $(x_1, y_1)$ and $(x_2, y_2)$.\n* **Type 2:**  Calculate the difference between the total number of candies in a rectangular submatrix defined by $(x_1, y_1)$ and $(x_2, y_2)$ and the total number of candies in all cells outside of this submatrix.\n\nFor each Type 2 operation, output the calculated difference.\n\n**Input:**\n\n* The first line contains three integers: $n$, $m$, and $w$.\n* The next $w$ lines describe the operations.\n    * A Type 1 operation is described by 6 integers: 0, $x_1$, $y_1$, $x_2$, $y_2$, and $v$.\n    * A Type 2 operation is described by 5 integers: 1, $x_1$, $y_1$, $x_2$, and $y_2$.\n\n**Output:**\n\n* For each Type 2 operation, output a single integer representing the difference."}, {"prompt_md5": "fed78294", "template_md5": "465699a0", "result": "You are given a grid of cells.  Some cells have candies in them.  \n\nThere are two types of operations:\n\n1. Add candies to a rectangular region of cells.\n2.  Calculate the total number of candies in two regions: one rectangular region and the remaining cells outside that region.  \n\nFor each operation of type 2, output the difference between the two calculated sums."}]}