{"uid": "390-D", "url": "https://codeforces.com/contest/390/problem/D", "tags": ["constructive algorithms"], "title": "390-D", "statement": "D. Inna and Sweet Matrixtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutInna loves sweets very much. That's why she decided to play a game called \"Sweet Matrix\".Inna sees ann×mmatrix andkcandies. We'll index the matrix rows from1tonand the matrix columns from1tom. We'll represent the cell in thei-th row andj-th column as(i,j). Two cells(i,j)and(p,q)of the matrix areadjacentif|i-p| + |j-q| = 1. Apathis a sequence of the matrix cells where each pair of neighbouring cells in the sequence is adjacent. We'll call the number of cells in the sequence the path's length.Each cell of the matrix can have at most one candy. Initiallly, all the cells are empty. Inna is trying to place each of thekcandies in the matrix one by one. For each candy Inna chooses cell(i,j)that will contains the candy, and also chooses the path that starts in cell(1, 1)and ends in cell(i,j)and doesn't contain any candies. After that Inna moves the candy along the path from cell(1, 1)to cell(i,j), where the candy stays forever. If at some moment Inna can't choose a path for the candy, she loses. If Inna can place all the candies in the matrix in the described manner, then her penalty equals the sum of lengths of all the paths she has used.Help Inna to minimize the penalty in the game.InputThe first line of the input contains three integersn,mandk(1 ≤n,m≤ 50, 1 ≤k≤n·m).OutputIn the first line print an integer — Inna's minimum penalty in the game.In the nextklines print the description of the path for each candy. The description of the path of the candy that is placedi-th should follow on thei-th line. The description of a path is a sequence of cells. Each cell must be written in the format(i,j), whereiis the number of the row andjis the number of the column. You are allowed to print extra whitespaces in the line. If there are multiple optimal solutions, print any of them.Please follow the output format strictly! If your program passes the first pretest, then the output format is correct.ExamplesInput4 4 4Output8(1,1) (2,1) (2,2)(1,1) (1,2)(1,1) (2,1)(1,1)NoteNote to the sample. Initially the matrix is empty. Then Inna follows her first path, the path penalty equals the number of cells in it — 3. Note that now no path can go through cell (2, 2), as it now contains a candy. The next two candies go to cells (1, 2) and (2, 1). Inna simply leaves the last candy at cell (1, 1), the path contains only this cell. The total penalty is: 3 + 2 + 2 + 1 = 8.Note that Inna couldn't use cell (1, 1) to place, for instance, the third candy as in this case she couldn't have made the path for the fourth candy.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8ff10664", "template_md5": "35d339e4", "result": "You are given an $n \\times m$ matrix and $k$ candies.  \n\n* Each cell in the matrix can hold at most one candy.\n*  Two cells $(i,j)$ and $(p,q)$ are adjacent if $|i-p| + |j-q| = 1$.\n* A path is a sequence of adjacent cells.\n\nThe goal is to place all $k$ candies in the matrix.  For each candy, you must:\n\n1. Choose a cell $(i,j)$ to place the candy.\n2. Choose a path from cell $(1,1)$ to $(i,j)$ that does not contain any candies.\n3. Move the candy along the chosen path.\n\nThe penalty is the sum of the lengths of all the paths used.\n\nFind the minimum possible penalty.\n\n**Output:**\n\n* The minimum penalty.\n* For each candy, output the path it takes (a sequence of cells)."}, {"prompt_md5": "19d317e5", "template_md5": "465699a0", "result": "You are given a grid of cells and a number of items.  You must place each item in a cell on the grid, following these rules:\n\n1. Each cell can only hold one item.\n2. You must start at a designated cell (1,1) and move to the target cell containing the item, following a path where each step is to an adjacent cell.\n3. You cannot move through a cell that already has an item.\n\nThe goal is to minimize the total length of all the paths used to place the items."}]}