{"uid": "391-A", "url": "https://codeforces.com/contest/391/problem/A", "tags": ["implementation", " two pointers"], "title": "391-A", "statement": "A. Genetic Engineeringtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou will receive 3 points for solving this problem.Manao is designing the genetic code for a new type of algae to efficiently produce fuel. Specifically, Manao is focusing on a stretch of DNA that encodes one protein. The stretch of DNA is represented by a string containing only the characters 'A', 'T', 'G' and 'C'.Manao has determined that if the stretch of DNA contains a maximal sequence of consecutive identical nucleotides that is of even length, then the protein will be nonfunctional. For example, consider a protein described by DNA string \"GTTAAAG\". It contains four maximal sequences of consecutive identical nucleotides: \"G\", \"TT\", \"AAA\", and \"G\". The protein is nonfunctional because sequence \"TT\" has even length.Manao is trying to obtain a functional protein from the protein he currently has. Manao can insert additional nucleotides into the DNA stretch. Each additional nucleotide is a character from the set {'A', 'T', 'G', 'C'}. Manao wants to determine the minimum number of insertions necessary to make the DNA encode a functional protein.InputThe input consists of a single line, containing a stringsof lengthn(1 ≤n≤ 100). Each character ofswill be from the set {'A', 'T', 'G', 'C'}.This problem doesn't have subproblems. You will get 3 points for the correct submission.OutputThe program should print on one line a single integer representing the minimum number of 'A', 'T', 'G', 'C' characters that are required to be inserted into the input string in order to make all runs of identical characters have odd length.ExamplesInputGTTAAAGOutput1InputAACCAACCAAAACOutput5NoteIn the first example, it is sufficient to insert a single nucleotide of any type between the two 'T's in the sequence to restore the functionality of the protein.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7af05ee6", "template_md5": "35d339e4", "result": "You are given a string of DNA represented by characters 'A', 'T', 'G', and 'C'.  A protein is functional if and only if all consecutive identical nucleotides in the DNA string have odd length. Determine the minimum number of nucleotides that need to be inserted into the string to make the protein functional."}, {"prompt_md5": "e1c2c666", "template_md5": "465699a0", "result": "Given a string of DNA characters (A, T, G, C), determine the minimum number of characters to insert to ensure all consecutive identical characters are of odd length."}]}