{"uid": "392-E", "url": "https://codeforces.com/contest/392/problem/E", "tags": [], "title": "392-E", "statement": "E. Deleting Substringstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutSmallR likes a game called \"Deleting Substrings\". In the game you are given a sequence of integersw, you can modify the sequence and get points. The only type of modification you can perform is (unexpected, right?) deleting substrings. More formally, you can choose several contiguous elements ofwand delete them from the sequence. Let's denote the sequence of chosen elements aswl,wl+ 1, ...,wr. They must meet the conditions:the equality|wi-wi+ 1| = 1must hold for alli(l≤i<r);the inequality2·wi-wi+ 1-wi- 1≥ 0must hold for alli(l<i<r).After deleting the chosen substring ofw, you gainvr-l+ 1points. You can perform the described operation again and again while proper substrings exist. Also you can end the game at any time. Your task is to calculate the maximum total score you can get in the game.InputThe first line contains a single integern(1 ≤n≤ 400)— the initial length ofw. The second line containsnintegersv1,v2, ...,vn(0 ≤ |vi| ≤ 2000)— the costs of operations. The next line containsnintegersw1,w2, ...,wn(1 ≤wi≤ 109)— the initialw.OutputPrint a single integer — the maximum total score you can get.ExamplesInput30 0 31 2 1Output3Input61 4 5 6 7 10002 1 1 2 2 3Output12", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a55bc0fc", "template_md5": "35d339e4", "result": "You are given a sequence of integers $w$ of length $n$. You can delete contiguous sub-sequences from $w$ as long as the following conditions are met:\n\n1. The difference between consecutive elements in the sub-sequence is 1 ($|w_i - w_{i+1}| = 1$ for all $i$).\n2. The following inequality holds for all $i$ within the sub-sequence ($i < r$): $2w_i - w_{i+1} - w_{i-1} \\ge 0$.\n\nAfter deleting a sub-sequence, you earn points equal to the length of the deleted sub-sequence. You can repeat this process until no valid sub-sequences remain.\n\nYour goal is to find the maximum total points you can earn by deleting sub-sequences. \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 400), the length of the sequence.\n* The second line contains $n$ integers $v_1, v_2, ..., v_n$ (0 ≤ $|v_i|$ ≤ 2000), representing the points earned for deleting each element.\n* The third line contains $n$ integers $w_1, w_2, ..., w_n$ (1 ≤ $w_i$ ≤ 10⁹), the elements of the sequence.\n\nOutput:\n\n* Print a single integer, the maximum total points you can earn."}, {"prompt_md5": "8d83a1f7", "template_md5": "465699a0", "result": "You are given a sequence of numbers. You can delete consecutive groups of numbers from the sequence, where the difference between each pair of consecutive numbers in the group is 1, and the sum of twice the middle number minus the two numbers on either side is greater than or equal to 0.  You get points for each group you delete. Find the maximum number of points you can get."}]}