{"uid": "396-D", "url": "https://codeforces.com/contest/396/problem/D", "tags": ["combinatorics", " math"], "title": "396-D", "statement": "D. On Sum of Number of Inversions in Permutationstime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are given a permutationp. Calculate the total number of inversions in all permutations that lexicographically do not exceed the given one.As this number can be very large, print it modulo1000000007(109+ 7).InputThe first line contains a single integern(1 ≤n≤ 106) — the length of the permutation. The second line containsndistinct integersp1,p2, ...,pn(1 ≤pi≤n).OutputPrint a single number — the answer to the problem modulo1000000007(109+ 7).ExamplesInput22 1Output1Input32 1 3Output2NotePermutationpof lengthnis the sequence that consists ofndistinct integers, each of them is from1ton.An inversion of permutationp1,p2, ...,pnis a pair of indexes(i,j), such thati<jandpi>pj.Permutationado not exceed permutationblexicographically, if eithera=bor there exists such numberi, for which the following logical condition fulfills:AND(ai<bi).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1df8ae1f", "template_md5": "35d339e4", "result": "You are given a permutation of $n$ distinct integers.  Find the total number of inversions in all permutations that are lexicographically less than or equal to the given permutation.\n\n**Inversions:** An inversion in a permutation is a pair of indices $(i, j)$ where $i < j$ and the element at index $i$ is greater than the element at index $j$.\n\n**Lexicographically:** A permutation $a$ is lexicographically less than or equal to a permutation $b$ if either:\n\n* $a$ is a prefix of $b$ (i.e., all elements of $a$ appear in the same order at the beginning of $b$)\n* there exists an index $i$ where $a_i < b_i$\n\n**Output:** Print the total number of inversions modulo $10^9 + 7$."}, {"prompt_md5": "65a6f248", "template_md5": "465699a0", "result": "You are given a list of numbers.  Find the total number of ways to rearrange the numbers so that the rearranged list is smaller than or equal to the given list (in dictionary order), and count the number of \"inversions\" in each of those rearrangements. An inversion is when two numbers are in the wrong order (like 3 comes before 1).  The answer should be the total number of inversions from all the valid rearrangements, all divided by a large number (1000000007)."}]}