{"uid": "399-B", "url": "https://codeforces.com/contest/399/problem/B", "tags": [], "title": "399-B", "statement": "B. Red and Blue Ballstime limit per test0.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutUser ainta has a stack ofnred and blue balls. He can apply a certain operation which changes the colors of the balls inside the stack.While the top ball inside the stack is red, pop the ball from the top of the stack.Then replace the blue ball on the top with a red ball.And finally push some blue balls to the stack until the stack has total ofnballs inside.If there are no blue balls inside the stack, ainta can't apply this operation. Given the initial state of the stack, ainta wants to know the maximum number of operations he can repeatedly apply.InputThe first line contains an integern(1 ≤n≤ 50) — the number of balls inside the stack.The second line contains a strings(|s| =n) describing the initial state of the stack. Thei-th character of the stringsdenotes the color of thei-th ball (we'll number the balls from top to bottom of the stack). If the character is \"R\", the color is red. If the character is \"B\", the color is blue.OutputPrint the maximum number of operations ainta can repeatedly apply.Please, do not write the%lldspecifier to read or write 64-bit integers in С++. It is preferred to use thecin,coutstreams or the%I64dspecifier.ExamplesInput3RBROutput2Input4RBBROutput6Input5RBBRROutput6NoteThe first example is depicted below.The explanation how user ainta applies the first operation. He pops out one red ball, changes the color of the ball in the middle from blue to red, and pushes one blue ball.The explanation how user ainta applies the second operation. He will not pop out red balls, he simply changes the color of the ball on the top from blue to red.From now on, ainta can't apply any operation because there are no blue balls inside the stack. ainta applied two operations, so the answer is 2.The second example is depicted below. The blue arrow denotes a single operation.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "351d2fc5", "template_md5": "35d339e4", "result": "You are given a stack of $n$ balls, where each ball is either red (\"R\") or blue (\"B\").  You can perform the following operation repeatedly:\n\n1. If the top ball is red, remove it from the stack.\n2. Change the color of the ball at the top of the stack to red.\n3. Add blue balls to the stack until there are $n$ balls in total.\n\nYou cannot perform the operation if there are no blue balls in the stack.\n\nFind the maximum number of times you can perform this operation."}, {"prompt_md5": "dc9b6279", "template_md5": "465699a0", "result": "You have a stack of balls that are either red or blue. You can perform an operation that removes the top red ball, changes the top blue ball to red, and adds blue balls back to the stack until the stack has the original number of balls.  What is the maximum number of times you can perform this operation?"}]}