{"uid": "399-A", "url": "https://codeforces.com/contest/399/problem/A", "tags": ["implementation"], "title": "399-A", "statement": "A. Pagestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutUser ainta is making a web site. This time he is going to make a navigation of the pages. In his site, there arenpages numbered by integers from1ton. Assume that somebody is on thep-th page now. The navigation will look like this:<<p-kp-k+ 1...p- 1(p)p+ 1...p+k- 1p+k>>When someone clicks the button \"<<\" he is redirected to page1, and when someone clicks the button \">>\" he is redirected to pagen. Of course if someone clicks on a number, he is redirected to the corresponding page.There are some conditions in the navigation:If page1is in the navigation, the button \"<<\" must not be printed.If pagenis in the navigation, the button \">>\" must not be printed.If the page number is smaller than1or greater thann, it must not be printed.You can see some examples of the navigations. Make a program that prints the navigation.InputThe first and the only line contains three integersn,p,k(3 ≤n≤ 100;1 ≤p≤n;1 ≤k≤n)OutputPrint the proper navigation. Follow the format of the output from the test samples.ExamplesInput17 5 2Output<< 3 4 (5) 6 7 >>Input6 5 2Output<< 3 4 (5) 6Input6 1 2Output(1) 2 3 >>Input6 2 2Output1 (2) 3 4 >>Input9 6 3Output<< 3 4 5 (6) 7 8 9Input10 6 3Output<< 3 4 5 (6) 7 8 9 >>Input8 5 4Output1 2 3 4 (5) 6 7 8", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "72476f0f", "template_md5": "35d339e4", "result": "Given a website with $n$ pages numbered from 1 to $n$, a user is currently on page $p$.  The website navigation displays a sequence of page numbers with buttons \"<<\", \">>\", and the page numbers themselves.\n\nThe navigation follows these rules:\n\n* If page 1 is displayed, the \"<< button is not shown.\n* If page $n$ is displayed, the \">>\" button is not shown.\n* Page numbers less than 1 or greater than $n$ are not displayed.\n* The navigation shows $k$ pages to the left and right of the current page $p$.\n\nWrite a program that prints the navigation for a given $n$, $p$, and $k$."}, {"prompt_md5": "326be8a9", "template_md5": "465699a0", "result": "Given a number of pages (n), the current page (p), and the number of pages to display on each side of the current page (k), generate a navigation string showing the page numbers.  The navigation should include buttons for moving to the first and last pages, but these buttons should be omitted if the current page is the first or last page, respectively.  Page numbers outside the range of 1 to n should not be included."}]}