{"uid": "400-D", "url": "https://codeforces.com/contest/400/problem/D", "tags": ["dsu", " graphs", " shortest paths"], "title": "400-D", "statement": "D. Dima and Bacteriatime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDima took up the biology of bacteria, as a result of his experiments, he inventedktypes of bacteria. Overall, there arenbacteria at his laboratory right now, and the number of bacteria of typeiequalsci. For convenience, we will assume that all the bacteria are numbered from1ton. The bacteria of typeciare numbered fromto.With the help of special equipment Dima can move energy from some bacteria into some other one. Of course, the use of such equipment is not free. Dima knowsmways to move energy from some bacteria to another one. The way with numberican be described with integersui,viandximean that this way allows moving energy from bacteria with numberuito bacteria with numbervior vice versa forxidollars.Dima's Chef (Inna) calls the type-distributioncorrectif there is a way (may be non-direct) to move energy from any bacteria of the particular type to any other bacteria of the same type (between any two bacteria of the same type) for zero cost.As for correct type-distribution the cost of moving the energy depends only on the types of bacteria help Inna to determine is the type-distribution correct? If it is, print the matrixdwith sizek×k. Celld[i][j]of this matrix must be equal to the minimal possible cost of energy-moving from bacteria with typeito bacteria with typej.InputThe first line contains three integersn,m,k(1 ≤n≤ 105; 0 ≤m≤ 105; 1 ≤k≤ 500). The next line containskintegersc1,c2, ...,ck(1 ≤ci≤n). Each of the nextmlines contains three integersui,vi,xi(1 ≤ui,vi≤ 105; 0 ≤xi≤ 104). It is guaranteed that.OutputIf Dima's type-distribution is correct, print string «Yes», and thenklines: in thei-th line print integersd[i][1],d[i][2], ...,d[i][k](d[i][i] = 0). If there is no way to move energy from bacteriaito bacteriajappropriated[i][j]must equal to -1. If the type-distribution isn't correct print «No».ExamplesInput4 4 21 32 3 03 4 02 4 12 1 2OutputYes0 22 0Input3 1 22 11 2 0OutputYes0 -1-1 0Input3 2 22 11 2 02 3 1OutputYes0 11 0Input3 0 21 2OutputNo", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "55ae088e", "template_md5": "35d339e4", "result": "There are $n$ bacteria divided into $k$ types. The number of bacteria of type $i$ is $c_i$. There are $m$ ways to move energy between bacteria. Each way is described by three integers $u$, $v$, and $x$, meaning energy can be moved from bacteria $u$ to $v$ (or vice versa) for a cost of $x$ dollars.\n\nDetermine if it's possible to move energy from any bacteria of a given type to any other bacteria of the same type for zero cost. If it is possible, output a matrix $d$ of size $k \\times k$.  $d[i][j]$ should represent the minimum cost to move energy from bacteria of type $i$ to bacteria of type $j$. If it's not possible, output \"No\"."}, {"prompt_md5": "e36c143e", "template_md5": "465699a0", "result": "You are given a set of items and a set of operations that can move items between each other.  Determine if it is possible to move any item of a given type to any other item of the same type for free. If so, find the minimum cost to move items between each type."}]}