{"uid": "401-A", "url": "https://codeforces.com/contest/401/problem/A", "tags": ["implementation", " math"], "title": "401-A", "statement": "A. Vanya and Cardstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutVanya loves playing. He even has a special set of cards to play with. Each card has a single integer. The number on the card can be positive, negative and can even be equal to zero. The only limit is, the number on each card doesn't exceedxin the absolute value.Natasha doesn't like when Vanya spends a long time playing, so she hid all of his cards. Vanya became sad and started looking for the cards but he only foundnof them. Vanya loves the balance, so he wants the sum of all numbers on found cards equal to zero. On the other hand, he got very tired of looking for cards. Help the boy and say what is the minimum number of cards does he need to find to make the sum equal to zero?You can assume that initially Vanya had infinitely many cards with each integer number from-xtox.InputThe first line contains two integers:n(1 ≤n≤ 1000)— the number of found cards andx(1 ≤x≤ 1000)— the maximum absolute value of the number on a card. The second line containsnspace-separated integers — the numbers on found cards. It is guaranteed that the numbers do not exceedxin their absolute value.OutputPrint a single number — the answer to the problem.ExamplesInput3 2-1 1 2Output1Input2 3-2 -2Output2NoteIn the first sample, Vanya needs to find a single card with number -2.In the second sample, Vanya needs to find two cards with number 2. He can't find a single card with the required number as the numbers on the lost cards do not exceed 3 in their absolute value.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b3be3afa", "template_md5": "35d339e4", "result": "You are given a set of $n$ integers.  Each integer is between $-x$ and $x$ inclusive.  Find the minimum number of additional integers you need to add to this set so that the sum of all the integers is zero."}, {"prompt_md5": "e327f551", "template_md5": "465699a0", "result": "You are given a set of numbers. Find the minimum number of additional numbers you need to add to this set so that the sum of all the numbers is zero.  The numbers you can add are within a certain range."}]}