{"uid": "401-B", "url": "https://codeforces.com/contest/401/problem/B", "tags": ["greedy", " implementation", " math"], "title": "401-B", "statement": "B. Sereja and Conteststime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutSereja is a coder and he likes to take part in Codesorfes rounds. However, Uzhland doesn't have good internet connection, so Sereja sometimes skips rounds.Codesorfes has rounds of two types:Div1(for advanced coders) andDiv2(for beginner coders). Two rounds,Div1andDiv2, can go simultaneously, (Div1round cannot be held withoutDiv2) in all other cases the rounds don't overlap in time. Each round has a unique identifier — a positive integer. The rounds are sequentially (without gaps) numbered with identifiers by the starting time of the round. The identifiers of rounds that are run simultaneously are different by one, also the identifier of theDiv1round is always greater.Sereja is a beginner coder, so he can take part only in rounds ofDiv2type. At the moment he is taking part in aDiv2round, its identifier equals tox. Sereja remembers very well that he has taken part in exactlykrounds before this round. Also, he remembers all identifiers of the rounds he has taken part in and all identifiers of the rounds that went simultaneously with them. Sereja doesn't remember anything about the rounds he missed.Sereja is wondering: what minimum and what maximum number ofDiv2rounds could he have missed? Help him find these two numbers.InputThe first line contains two integers:x(1 ≤x≤ 4000)— the round Sereja is taking part in today, andk(0 ≤k< 4000)— the number of rounds he took part in.Nextklines contain the descriptions of the rounds that Sereja took part in before. If Sereja took part in one of two simultaneous rounds, the corresponding line looks like: \"1num2num1\" (wherenum2is the identifier of thisDiv2round,num1is the identifier of theDiv1round). It is guaranteed thatnum1-num2= 1. If Sereja took part in a usualDiv2round, then the corresponding line looks like: \"2num\" (wherenumis the identifier of thisDiv2round). It is guaranteed that the identifiers of all given rounds are less thanx.OutputPrint in a single line two integers — the minimum and the maximum number of rounds that Sereja could have missed.ExamplesInput3 22 12 2Output0 0Input9 31 2 32 81 4 5Output2 3Input10 0Output5 9NoteIn the second sample we have unused identifiers of rounds 1, 6, 7. The minimum number of rounds Sereja could have missed equals to 2. In this case, the round with the identifier 1 will be a usualDiv2round and the round with identifier6will be synchronous with theDiv1round.The maximum number of rounds equals3. In this case all unused identifiers belong to usualDiv2rounds.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0e01254f", "template_md5": "465699a0", "result": "You are given a number representing the current round and another number representing the number of rounds participated in before. You are also given a list of previous round identifiers. Some rounds were simultaneous (one Div2 and one Div1), while others were standalone Div2 rounds. Determine the minimum and maximum number of rounds that could have been missed."}, {"prompt_md5": "a391c0ce", "template_md5": "35d339e4", "result": "You are given two integers, $x$ and $k$.  $x$ is the identifier of the current round. $k$ is the number of rounds participated in before the current round.\n\nYou are also given $k$ lines, each describing a round participated in before the current round. Each line can be in one of two formats:\n\n* \"1 num2 num1\": This means the participant took part in a Div2 round with identifier $num2$ which was simultaneous with a Div1 round with identifier $num1$.\n* \"2 num\": This means the participant took part in a Div2 round with identifier $num$.\n\nThe identifiers of all given rounds are less than $x$.\n\nFind the minimum and maximum number of Div2 rounds that could have been missed."}]}