{"uid": "401-C", "url": "https://codeforces.com/contest/401/problem/C", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "401-C", "statement": "C. Teamtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutNow it's time of Olympiads. Vanya and Egor decided to make his own team to take part in a programming Olympiad. They've been best friends ever since primary school and hopefully, that can somehow help them in teamwork.For each team Olympiad, Vanya takes his play cards with numbers. He takes only the cards containing numbers 1 and 0. The boys are very superstitious. They think that they can do well at the Olympiad if they begin with layingallthe cards in a row so that:there wouldn't be a pair of any side-adjacent cards with zeroes in a row;there wouldn't be a group of three consecutive cards containing numbers one.Today Vanya broughtncards with zeroes andmcards with numbers one. The number of cards was so much that the friends do not know how to put all those cards in the described way. Help them find the required arrangement of the cards or else tell the guys that it is impossible to arrange cards in such a way.InputThe first line contains two integers:n(1 ≤n≤ 106) — the number of cards containing number 0;m(1 ≤m≤ 106) — the number of cards containing number 1.OutputIn a single line print the required sequence of zeroes and ones without any spaces. If such sequence is impossible to obtain, print -1.ExamplesInput1 2Output101Input4 8Output110110110101Input4 10Output11011011011011Input1 5Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5d0eadd9", "template_md5": "35d339e4", "result": "You are given two numbers, $n$ and $m$, representing the number of cards with the value 0 and 1 respectively.  \n\nDetermine if it is possible to arrange these cards in a sequence such that:\n\n* There are no two consecutive cards with the value 0.\n* There are no three consecutive cards with the value 1.\n\nIf such an arrangement is possible, output the sequence of 0s and 1s. Otherwise, output -1."}, {"prompt_md5": "3180857d", "template_md5": "465699a0", "result": "Given a number of cards with 0 and a number of cards with 1, determine if it's possible to arrange them in a sequence so that:\n\n* No two adjacent cards are both 0.\n* No three consecutive cards are all 1.\n\nIf possible, output the sequence. Otherwise, output -1."}]}