{"uid": "402-C", "url": "https://codeforces.com/contest/402/problem/C", "tags": ["brute force", " constructive algorithms", " graphs"], "title": "402-C", "statement": "C. Searching for Graphtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutLet's call an undirected graph ofnverticesp-interesting, if the following conditions fulfill:the graph contains exactly2n+pedges;the graph doesn't contain self-loops and multiple edges;for any integerk(1 ≤k≤n), any subgraph consisting ofkvertices contains at most2k+pedges.Asubgraphof a graph is some set of the graph vertices and some set of the graph edges. At that, the set of edges must meet the condition: both ends of each edge from the set must belong to the chosen set of vertices.Your task is to find ap-interestinggraph consisting ofnvertices.InputThe first line contains a single integert(1 ≤t≤ 5) — the number of tests in the input. Nexttlines each contains two space-separated integers:n,p(5 ≤n≤ 24;p≥ 0;) — the number of vertices in the graph and the interest value for the appropriate test.It is guaranteed that the required graph exists.OutputFor each of thettests print2n+plines containing the description of the edges of ap-interestinggraph: thei-th line must contain two space-separated integersai,bi(1 ≤ai,bi≤n;ai≠bi) — two vertices, connected by an edge in the resulting graph. Consider the graph vertices numbered with integers from1ton.Print the answers to the tests in the order the tests occur in the input. If there are multiple solutions, you can print any of them.ExamplesInput16 0Output1 21 31 41 51 62 32 42 52 63 43 53 6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c633d110", "template_md5": "35d339e4", "result": "You are given a number of tests. For each test, you are given two integers, $n$ and $p$.  \n\nYou need to construct an undirected graph with $n$ vertices that meets the following conditions:\n\n* The graph has exactly $2n + p$ edges.\n* The graph does not contain any self-loops (an edge connecting a vertex to itself) or multiple edges (two edges connecting the same pair of vertices).\n* For any integer $k$ (where $1 \\le k \\le n$), any subgraph consisting of $k$ vertices contains at most $2k + p$ edges.\n\nOutput the description of the graph for each test case. The description should list each edge as a pair of integers representing the two vertices connected by the edge. \n\n**Example:**\n\nFor $n = 6$ and $p = 0$, a possible output could be:\n\n```\n1 2\n1 3\n1 4\n1 5\n1 6\n2 3\n2 4\n2 5\n2 6\n3 4\n3 5\n3 6\n4 5\n4 6\n5 6\n```"}, {"prompt_md5": "7d9c2417", "template_md5": "465699a0", "result": "You are given a number of vertices (n) and an interest value (p).  You need to create a graph with these vertices and edges that meets the following rules:\n\n* The graph has exactly 2n + p edges.\n* There are no loops (an edge connecting a vertex to itself) or multiple edges between the same two vertices.\n* For any group of k vertices (where 1 ≤ k ≤ n), the subgraph formed by those vertices has at most 2k + p edges.\n\nOutput the edges of the graph that satisfy these rules."}]}