{"uid": "402-A", "url": "https://codeforces.com/contest/402/problem/A", "tags": ["greedy", " math"], "title": "402-A", "statement": "A. Nutstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou haveanuts and lots of boxes. The boxes have a wonderful feature: if you putx(x≥ 0)divisors (the spacial bars that can divide a box) to it, you get a box, divided intox+ 1sections.You are minimalist. Therefore, on the one hand, you are against dividing some box into more thanksections. On the other hand, you are against putting more thanvnuts into some section of the box. What is the minimum number of boxes you have to use if you want to put all the nuts in boxes, and you havebdivisors?Please note that you need to minimize the number of used boxes, not sections. You do not have to minimize the number of used divisors.InputThe first line contains four space-separated integersk,a,b,v(2 ≤k≤ 1000;1 ≤a,b,v≤ 1000) — the maximum number of sections in the box, the number of nuts, the number of divisors and the capacity of each section of the box.OutputPrint a single integer — the answer to the problem.ExamplesInput3 10 3 3Output2Input3 10 1 3Output3Input100 100 1 1000Output1NoteIn the first sample you can act like this:Put two divisors to the first box. Now the first box has three sections and we can put three nuts into each section. Overall, the first box will have nine nuts.Do not put any divisors into the second box. Thus, the second box has one section for the last nut.In the end we've put all the ten nuts into boxes.The second sample is different as we have exactly one divisor and we put it to the first box. The next two boxes will have one section each.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e64bf530", "template_md5": "35d339e4", "result": "You have $k$ nuts and want to put them into boxes. Each box can have $0$ to $k$ divisors placed inside.  Each divisor divides the box into one more section. You can put at most $v$ nuts in each section.  You have $b$ divisors available.\n\nFind the minimum number of boxes needed to hold all the nuts."}, {"prompt_md5": "c0bf0309", "template_md5": "465699a0", "result": "You have a limited number of boxes and dividers. Each divider splits a box into more sections. You need to put a given number of items into the boxes, with a limit on how many items can go in each section. Find the fewest boxes needed to hold all the items."}]}