{"uid": "402-D", "url": "https://codeforces.com/contest/402/problem/D", "tags": ["dp", " greedy", " math", " number theory"], "title": "402-D", "statement": "D. Upgrading Arraytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou have an array of positive integersa[1],a[2], ...,a[n]and a set ofbadprime numbersb1,b2, ...,bm. The prime numbers that do not occur in the setbare consideredgood. Thebeautyof arrayais the sum, where functionf(s)is determined as follows:f(1) = 0;Let's assume thatpis the minimum prime divisor ofs. Ifpis a good prime, then, otherwise.You are allowed to perform an arbitrary (probably zero) number of operations to improve arraya. Theoperation of improvementis the following sequence of actions:Choose some numberr(1 ≤r≤n) and calculate the valueg= GCD(a[1],a[2], ...,a[r]).Apply the assignments:,,...,.What is the maximum beauty of the array you can get?InputThe first line contains two integersnandm(1 ≤n,m≤ 5000) showing how many numbers are in the array and how many bad prime numbers there are.The second line containsnspace-separated integersa[1],a[2], ...,a[n](1 ≤a[i] ≤ 109) — arraya. The third line containsmspace-separated integersb1,b2, ...,bm(2 ≤b1<b2< ... <bm≤ 109) — the set of bad prime numbers.OutputPrint a single integer — the answer to the problem.ExamplesInput5 24 20 34 10 102 5Output-2Input4 52 4 8 163 5 7 11 17Output10NoteNote that the answer to the problem can be negative.The GCD(x1,x2, ...,xk) is the maximum positive integer that divides eachxi.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac14867a", "template_md5": "35d339e4", "result": "You are given an array of positive integers $a_1, a_2, ..., a_n$ and a set of bad prime numbers $b_1, b_2, ..., b_m$.  \n\nThe beauty of the array is calculated as follows:\n\n*  Define a function $f(s)$:\n    * If $s = 1$, then $f(1) = 0$.\n    * Otherwise, let $p$ be the smallest prime divisor of $s$.\n    * If $p$ is a good prime (not in the set of bad primes), then $f(s) = p - 1$.\n    * Otherwise, $f(s) = 0$.\n\nYou can perform any number of operations to improve the array. Each operation consists of:\n\n1. Choosing a number $r$ (where $1 \\le r \\le n$).\n2. Calculating $g = \\text{GCD}(a_1, a_2, ..., a_r)$.\n3. Updating the array: $a_1 = g$, $a_2 = g$, ..., $a_r = g$.\n\nWhat is the maximum possible beauty of the array after performing any number of operations?"}, {"prompt_md5": "0a3655f8", "template_md5": "465699a0", "result": "You have a list of numbers and a list of \"bad\" prime numbers.  You can repeatedly choose a section of the list and find the greatest common divisor (GCD) of those numbers.  Then, replace each number in that section with the GCD.  What is the largest possible sum you can get by doing this, where the sum is calculated based on the prime factors of each number in the list?"}]}