{"uid": "402-B", "url": "https://codeforces.com/contest/402/problem/B", "tags": ["brute force", " implementation"], "title": "402-B", "statement": "B. Trees in a Rowtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe Queen of England hasntrees growing in a row in her garden. At that, thei-th(1 ≤i≤n)tree from the left has heightaimeters. Today the Queen decided to update the scenery of her garden. She wants the trees' heights to meet the condition: for alli(1 ≤i<n),ai+ 1-ai=k, wherekis the number the Queen chose.Unfortunately, the royal gardener is not a machine and he cannot fulfill the desire of the Queen instantly! In one minute, the gardener can either decrease the height of a tree to any positive integer height or increase the height of a tree to any positive integer height. How should the royal gardener act to fulfill a whim of Her Majesty in the minimum number of minutes?InputThe first line contains two space-separated integers:n,k(1 ≤n,k≤ 1000). The second line containsnspace-separated integersa1,a2, ...,an(1 ≤ai≤ 1000) — the heights of the trees in the row.OutputIn the first line print a single integerp— the minimum number of minutes the gardener needs. In the nextplines print the description of his actions.If the gardener needs to increase the height of thej-th (1 ≤j≤n) tree from the left byx(x≥ 1)meters, then print in the corresponding line \"+ j x\". If the gardener needs to decrease the height of thej-th (1 ≤j≤n) tree from the left byx(x≥ 1)meters, print on the corresponding line \"- j x\".If there are multiple ways to make a row of trees beautiful in the minimum number of actions, you are allowed to print any of them.ExamplesInput4 11 2 1 5Output2+ 3 2- 4 1Input4 11 2 3 4Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a88d1283", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, representing the heights of trees in a row. You need to make the difference between the heights of adjacent trees equal to a given integer $k$.  You can increase or decrease the height of any tree by any positive integer amount. Find the minimum number of operations required to achieve this and describe a sequence of operations."}, {"prompt_md5": "36b3cf4a", "template_md5": "465699a0", "result": "You are given a list of numbers representing the heights of trees. You need to make the difference between each consecutive pair of trees equal to a given value.  You can increase or decrease the height of any tree by any amount. Find the minimum number of operations needed to achieve this."}]}