{"uid": "404-E", "url": "https://codeforces.com/contest/404/problem/E", "tags": ["binary search", " greedy", " implementation"], "title": "404-E", "statement": "E. Maze 1Dtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutValera has a strip infinite in both directions and consisting of cells. The cells are numbered by integers. The cell number0has a robot.The robot has instructions — the sequence of moves that he must perform. In one move, the robot moves one cell to the left or one cell to the right, according to instructions. Before the robot starts moving, Valera puts obstacles in some cells of the strip, excluding cell number0. If the robot should go into the cell with an obstacle according the instructions, it will skip this move.Also Valera indicates the finish cell in which the robot has to be after completing the entire instructions. The finishing cell should be different from the starting one. It is believed that the robotcompleted the instructions successfully, if during the process of moving he visited the finish cell exactly once — at its last move. Moreover, the latter move cannot be skipped.Let's assume thatkis the minimum number of obstacles that Valera must put to make the robot able to complete the entire sequence of instructions successfully and end up in some finishing cell. You need to calculate in how many ways Valera can choosekobstacles and the finishing cell so that the robot is able to complete the instructions successfully.InputThe first line contains a sequence of characters without spacess1s2...sn(1 ≤n≤ 106), consisting only of letters \"L\" and \"R\". If charactersiequals \"L\", then the robot on thei-th move must try to move one cell to the left. If thesi-th character equals \"R\", then the robot on thei-th move must try to move one cell to the right.OutputPrint a single integer — the required number of ways. It's guaranteed that this number fits into 64-bit signed integer type.ExamplesInputRROutput1InputRRLOutput1NoteIn the first sample Valera mustn't add any obstacles and his finishing cell must be cell2.In the second sample, Valera must add an obstacle in cell number1, and his finishing cell must be cell number- 1. In this case robot skips the first two moves and on the third move he goes straight from the starting cell to the finishing one. But if Valera doesn't add any obstacles, or adds an obstacle to another cell, then the robot visits the finishing cell more than once.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2abc98bd", "template_md5": "35d339e4", "result": "You are given a sequence of instructions, where each instruction is either \"L\" (move left) or \"R\" (move right).  \n\nA robot starts at cell 0 and follows these instructions.  \n\nYou can place obstacles in any cell *except* cell 0. If the robot encounters an obstacle, it skips that move.\n\nYour goal is to determine the minimum number of obstacles needed so that the robot:\n\n1. Successfully completes all instructions.\n2. Reaches a specific *finish* cell exactly once at the end.\n\nThe robot cannot skip the final move to reach the finish cell.\n\nFind the number of ways to choose the obstacles and the finish cell that satisfy these conditions."}, {"prompt_md5": "8974f212", "template_md5": "465699a0", "result": "You are given a sequence of moves (left or right).  You need to determine how many ways you can place obstacles and choose a destination cell so that a robot, following the moves, will:\n\n1. Visit the destination cell exactly once.\n2. The final move must be to the destination cell. \n3. The robot can skip moves that land on an obstacle."}]}