{"uid": "404-B", "url": "https://codeforces.com/contest/404/problem/B", "tags": ["implementation", " math"], "title": "404-B", "statement": "B. Marathontime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutValera takes part in the Berland Marathon. The marathon race starts at the stadium that can be represented on the plane as a square whose lower left corner is located at point with coordinates(0, 0)and the length of the side equalsameters. The sides of the square are parallel to coordinate axes.As the length of the marathon race is very long, Valera needs to have extra drink during the race. The coach gives Valera a bottle of drink eachdmeters of the path. We know that Valera starts at the point with coordinates(0, 0)and runs counter-clockwise. That is, when Valera coversameters, he reaches the point with coordinates(a, 0). We also know that the length of the marathon race equalsnd+ 0.5meters.Help Valera's coach determine where he should be located to help Valera. Specifically, determine the coordinates of Valera's positions when he coversd, 2·d, ...,n·dmeters.InputThe first line contains two space-separated real numbersaandd(1 ≤a,d≤ 105), given with precision till4decimal digits after the decimal point. Numberadenotes the length of the square's side that describes the stadium. Numberdshows that after eachdmeters Valera gets an extra drink.The second line contains integern(1 ≤n≤ 105)showing that Valera needs an extra drinkntimes.OutputPrintnlines, each line should contain two real numbersxiandyi, separated by a space. Numbersxiandyiin thei-th line mean that Valera is at point with coordinates(xi,yi)after he coversi·dmeters. Your solution will be considered correct if the absolute or relative error doesn't exceed10- 4.Note, that this problem have huge amount of output data. Please, do not use cout stream for output in this problem.ExamplesInput2 52Output1.0000000000 2.00000000002.0000000000 0.0000000000Input4.147 2.88196Output2.8819000000 0.00000000004.1470000000 1.61680000003.7953000000 4.14700000000.9134000000 4.14700000000.0000000000 2.17850000000.7034000000 0.0000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f54ce814", "template_md5": "35d339e4", "result": "A square stadium has sides of length $a$ meters. A runner starts at the bottom left corner of the stadium and runs counter-clockwise around the perimeter.  Every $d$ meters, the runner needs a drink. The total length of the race is $n \\cdot d + 0.5$ meters.\n\nGiven $a$ and $d$, and the number of drinks needed $n$, determine the coordinates of the runner's position after they have run $d$, $2d$, $3d$, ..., $n \\cdot d$ meters."}, {"prompt_md5": "6c697419", "template_md5": "465699a0", "result": "A square track has a side length of 'a'.  Someone runs counter-clockwise around the track, getting a drink every 'd' meters.  Find the coordinates of the runner's position after they have run 'd', '2d', '3d', ..., 'nd' meters."}]}