{"uid": "407-B", "url": "https://codeforces.com/contest/407/problem/B", "tags": ["dp", " implementation"], "title": "407-B", "statement": "B. Long Pathtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOne day, little Vasya found himself in a maze consisting of(n+ 1)rooms, numbered from1to(n+ 1). Initially, Vasya is at the first room and to get out of the maze, he needs to get to the(n+ 1)-th one.The maze is organized as follows. Each room of the maze has two one-way portals. Let's consider room numberi(1 ≤i≤n), someone can use the first portal to move from it to room number(i+ 1), also someone can use the second portal to move from it to room numberpi, where1 ≤pi≤i.In order not to get lost, Vasya decided to act as follows.Each time Vasya enters some room, he paints a cross on its ceiling. Initially, Vasya paints a cross at the ceiling of room1.Let's assume that Vasya is in roomiand has already painted a cross on its ceiling. Then, if the ceiling now contains an odd number of crosses, Vasya uses the second portal (it leads to roompi), otherwise Vasya uses the first portal.Help Vasya determine the number of times he needs to use portals to get to room(n+ 1)in the end.InputThe first line contains integern(1 ≤n≤ 103) — the number of rooms. The second line containsnintegerspi(1 ≤pi≤i). Eachpidenotes the number of the room, that someone can reach, if he will use the second portal in thei-th room.OutputPrint a single number — the number of portal moves the boy needs to go out of the maze. As the number can be rather large, print it modulo1000000007(109+ 7).ExamplesInput21 2Output4Input41 1 2 3Output20Input51 1 1 1 1Output62", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1877e85c", "template_md5": "35d339e4", "result": "You are given a maze with $n+1$ rooms numbered from 1 to $n+1$.  You start in room 1 and need to reach room $n+1$. Each room has two one-way portals:\n\n* The first portal leads to the next room ($i+1$).\n* The second portal leads to a room numbered $p_i$ where $1 \\le p_i \\le i$.\n\nYou paint a cross on the ceiling of each room you enter.  If a room has an odd number of crosses on its ceiling, you must use the second portal. Otherwise, you use the first portal.\n\nDetermine the minimum number of times you need to use portals to reach room $n+1$.  \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100000) representing the number of rooms.\n* The second line contains $n$ integers $p_1$, $p_2$, ..., $p_n$ (1 ≤ $p_i$ ≤ $i$) representing the destination rooms for the second portal in each room.\n\n**Output:**\n\n* Print a single integer representing the minimum number of portal uses modulo 1000000007 (10⁹ + 7)."}, {"prompt_md5": "fccddab8", "template_md5": "465699a0", "result": "You are in a maze with numbered rooms. Each room has two exits. One exit leads to the next room, the other leads to a randomly chosen previous room. You must reach the last room.  You can only use the second exit if the current room has an odd number of marks. You place a mark on the ceiling of each room you enter. How many times do you need to use the second exit to reach the last room?"}]}