{"uid": "409-I", "url": "https://codeforces.com/contest/409/problem/I", "tags": ["*special"], "title": "409-I", "statement": "I. Feed the Golorptime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutGolorps are mysterious creatures who feed on variables. Golorp's name is a program in some programming language. Some scientists believe that this language is Befunge; golorps are tantalizingly silent.Variables consumed by golorps can take values from 0 to 9, inclusive. For each golorp its daily diet is defined by its name. Some golorps are so picky that they can't be fed at all. Besides, all golorps are very health-conscious and try to eat as little as possible. Given a choice of several valid sequences of variable values, each golorp will choose lexicographically smallest one.For the purposes of this problem you can assume that a golorp consists of jaws and a stomach. The number of variables necessary to feed a golorp is defined by the shape of its jaws. Variables can get to the stomach only via the jaws.A hungry golorp is visiting you. You know its name; feed it or figure out that it's impossible.InputThe input is a single string (between 13 and 1024 characters long) — the name of the visiting golorp. All names are similar and will resemble the ones given in the samples. The name is guaranteed to be valid.OutputOutput lexicographically smallest sequence of variable values fit for feeding this golorp. Values should be listed in the order in which they get into the jaws. If the golorp is impossible to feed, output \"false\".ExamplesInput?(_-_/___*__):-___>__.Output0010Input?(__-_+_/_____):-__>__,_____<__.OutputfalseInput?(______________________/____+_______*__-_____*______-___):-__<___,___<____,____<_____,_____<______,______<_______.Output0250341Input?(__+___+__-___):-___>__.Output0101", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b6d0434e", "template_md5": "35d339e4", "result": "You are given a string representing a golorp's name.  The golorp eats sequences of numbers from 0 to 9.  \n\nDetermine the lexicographically smallest sequence of numbers that the golorp can eat. If no such sequence exists, output \"false\". \n\nThe golorp's name describes how it eats:\n\n*  `_` represents a variable that can be any number from 0 to 9.\n*  `+` means the golorp can eat the variable.\n*  `-` means the golorp cannot eat the variable.\n*  `>` and `<` indicate the direction the golorp moves through the variables.\n\nFor example, if the golorp's name is `?_`, it can eat the number 0 or 1.  The lexicographically smallest sequence is `0`."}, {"prompt_md5": "25414376", "template_md5": "465699a0", "result": "Given a string representing a creature's dietary needs, determine the smallest sequence of numbers (0-9) that satisfies those needs. If no such sequence exists, output \"false\"."}]}