{"uid": "41-C", "url": "https://codeforces.com/contest/41/problem/C", "tags": ["expression parsing", " implementation"], "title": "41-C", "statement": "C. Email addresstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSometimes one has to spell email addresses over the phone. Then one usually pronounces a dot asdot, an at sign asat. As a result, we get something likevasyaatgmaildotcom. Your task is to transform it into a proper email address ([email protected]).It is known that a proper email address contains only such symbols as.@and lower-case Latin letters, doesn't start with and doesn't end with a dot. Also, a proper email address doesn't start with and doesn't end with an at sign. Moreover, an email address contains exactly one such symbol as@, yet may contain any number (possible, zero) of dots.You have to carry out a series of replacements so that the length of the result was as short as possible and it was a proper email address. If the lengths are equal, you should print the lexicographically minimal result.Overall, two variants of replacement are possible:dotcan be replaced by a dot,atcan be replaced by an at.InputThe first line contains the email address description. It is guaranteed that that is a proper email address with all the dots replaced bydotan the at signs replaced byat. The line is not empty and its length does not exceed 100 symbols.OutputPrint the shortest email address, from which the given line could be made by the described above replacements. If there are several solutions to that problem, print the lexicographically minimal one (the lexicographical comparison of the lines are implemented with an operator < in modern programming languages).In the ASCII table the symbols go in this order:. @ ab...zExamplesInputvasyaatgmaildotcomOutput[email protected]InputdotdotdotatdotdotatOutput[email protected]InputaattOutputa@t", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e14181e5", "template_md5": "35d339e4", "result": "You are given a string representing an email address where dots are replaced with \"dot\" and \"@\" symbols are replaced with \"at\".  \n\nYour task is to convert this string into a valid email address. \n\nA valid email address:\n\n* Contains only lowercase letters, \".\", and \"@\".\n* Does not start or end with \".\" or \"@\".\n* Has exactly one \"@\" symbol.\n* May contain any number of \".\" symbols.\n\nFind the shortest valid email address that can be formed from the given string. If there are multiple shortest valid email addresses, output the one that comes first alphabetically."}, {"prompt_md5": "e0a4fe8a", "template_md5": "465699a0", "result": "You are given a string representing an email address with dots replaced by \"dot\" and \"@\" replaced by \"at\".  Your task is to transform this string into a valid email address (e.g., [email protected]) by replacing \"dot\" with \".\" and \"at\" with \"@\".  The shortest valid email address should be returned, and if there are multiple shortest options, the one that comes first alphabetically should be chosen."}]}