{"uid": "413-D", "url": "https://codeforces.com/contest/413/problem/D", "tags": ["bitmasks", " dp"], "title": "413-D", "statement": "D. 2048time limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe programmers from the R2 company love playing 2048. One day, they decided to invent their own simplified version of this game —2kon a stripe.Imagine an infinite in one direction stripe, consisting of unit squares (the side of each square is equal to the height of the stripe). Each square can either be empty or contain some number.Initially, all squares are empty. Then at infinity one of the unit squares number 2 or 4 appears. Then the player presses a button once, and the appeared number begins to move towards the beginning of the stripe. Let's assume that some numberxmoves to the beginning of the stripe, then it will stop if:it either gets in the first square of the stripe;or it is in the square that is preceded by a square with numbery(y≠x). But if numberxat some point of time gets to the square with the same number then both numbers add to each other and result in2x. The new number2xcontinues moving to the beginning of the stripe by the same rules.After the final stop of the number moving process, the infinity gets a new number 2 or 4 and the process repeats. Read the notes to the test samples to better understand the moving strategy.I guess you've understood that the game progress fully depends on the order in which numbers 2 and 4 appear. Let's look at some sequence of numbers 2 and 4 in the game. We assume that the sequence iswinningif it results in at least one square getting the number greater or equal than2k.The goal of the game is to make up a winning sequence ofnnumbers. But not everything is so simple, some numbers in the sequence are identified beforehand. You are given a sequence consisting of numbers 0, 2, 4. Count how many ways there are to replace each 0 of the sequence with 2 or 4 to get a winning sequence.InputThe first line contains two integersnandk(1 ≤n≤ 2000; 3 ≤k≤ 11). The next line contains sequence ofnintegers, each of them is either 0, or 2, or 4.OutputPrint a single integer — the number of ways to replace zeroes by numbers 2 or 4 to get a winning sequence. As this number can be rather large, print it modulo1000000007(109+ 7).ExamplesInput7 42 2 4 2 2 2 2Output1Input1 30Output0Input2 30 4Output1Input5 42 0 0 4 4Output2NoteConsider the first example. The beginning of the strip will look as follows:2→4→8→8 2→8 4→8 4 2→16.To better understand the game, you can see the original game onhttp://gabrielecirulli.github.io/2048/. Please note that the game that is described on the strip is slightly different from the original game (when the two numbers add up in the original game, they do not keep moving). Be careful, the game is addictive, there isn't much time for the contest!", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "25a59897", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers, where each integer is either 0, 2, or 4.  \n\nThe game works as follows:\n\n* Imagine an infinite line of squares.\n* Initially, all squares are empty.\n* A number (2 or 4) appears at the end of the line.\n* This number moves towards the beginning of the line, stopping when it:\n    * Reaches the first square.\n    * Encounters a square with a different number.\n* If a number encounters a square with the same number, they merge to form a new number twice their value. This new number continues moving.\n\nA sequence is considered \"winning\" if, after the numbers have stopped moving, at least one square contains a number greater than or equal to $k$.\n\nYour task is to determine the number of ways to replace the 0s in the given sequence with 2s or 4s to create a winning sequence.  The answer should be taken modulo $10^9 + 7$."}, {"prompt_md5": "33e73e7a", "template_md5": "465699a0", "result": "You are given a sequence of numbers (0, 2, or 4).  You need to replace the 0s with either 2 or 4 to create a sequence where at least one number in the final result is greater than or equal to a given target number.  Count how many different ways you can do this."}]}