{"uid": "413-B", "url": "https://codeforces.com/contest/413/problem/B", "tags": ["implementation"], "title": "413-B", "statement": "B. Spyke Chattingtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe R2 company hasnemployees working for it. The work involves constant exchange of ideas, sharing the stories of success and upcoming challenging. For that, R2 uses a famous instant messaging program Spyke.R2 hasmSpyke chats just to discuss all sorts of issues. In each chat, some group of employees exchanges messages daily. An employee can simultaneously talk in multiple chats. If some employee is in thek-th chat, he can write messages to this chat and receive notifications about messages from this chat. If an employee writes a message in the chat, all other participants of the chat receive a message notification.The R2 company is conducting an audit. Now the specialists study effective communication between the employees. For this purpose, they have a chat log and the description of chat structure. You, as one of audit specialists, are commissioned to write a program that will use this data to determine the total number of message notifications received by each employee.InputThe first line contains three space-separated integersn,mandk(2 ≤n≤ 2·104; 1 ≤m≤ 10; 1 ≤k≤ 2·105)— the number of the employees, the number of chats and the number of events in the log, correspondingly.Nextnlines contain matrixaof sizen×m, consisting of numbers zero and one. The element of this matrix, recorded in thej-th column of thei-th line, (let's denote it asaij) equals1, if thei-th employee is the participant of thej-th chat, otherwise the element equals0. Assume that the employees are numbered from1tonand the chats are numbered from1tom.Nextklines contain the description of the log events. Thei-th line contains two space-separated integersxiandyi(1 ≤xi≤n; 1 ≤yi≤m)which mean that the employee numberxisent one message to chat numberyi. It is guaranteed that employee numberxiis a participant of chatyi. It is guaranteed that each chat contains at least two employees.OutputPrint in the single linenspace-separated integers, where thei-th integer shows the number of message notifications thei-th employee receives.ExamplesInput3 4 51 1 1 11 0 1 11 1 0 01 13 11 32 43 2Output3 3 1Input4 3 40 1 11 0 11 1 10 0 01 22 13 11 3Output0 2 3 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d45f5782", "template_md5": "35d339e4", "result": "There are $n$ employees and $m$ chats. Each employee can be in multiple chats.  \n\nA matrix $a$ of size $n \\times m$ describes which employees are in which chats. $a_{ij} = 1$ if employee $i$ is in chat $j$, otherwise $a_{ij} = 0$.\n\nThere are $k$ events in the log, each event describes an employee sending a message to a chat. Each event is represented by two integers $x$ and $y$, where $x$ is the employee number and $y$ is the chat number.\n\nYour task is to determine the number of message notifications each employee receives."}, {"prompt_md5": "837dfab7", "template_md5": "465699a0", "result": "You are given a list of employees and chats they participate in. You are also given a log of messages sent by employees to chats. Determine the number of message notifications each employee receives."}]}