{"uid": "414-A", "url": "https://codeforces.com/contest/414/problem/A", "tags": ["constructive algorithms", " number theory"], "title": "414-A", "statement": "A. Mashmokh and Numberstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIt's holiday. Mashmokh and his boss, Bimokh, are playing a game invented by Mashmokh.In this game Mashmokh writes sequence ofndistinct integers on the board. Then Bimokh makes several (possibly zero) moves. On the first move he removes the first and the second integer from from the board, on the second move he removes the first and the second integer of the remaining sequence from the board, and so on. Bimokh stops when the board contains less than two numbers. When Bimokh removes numbersxandyfrom the board, he getsgcd(x,y)points. At the beginning of the game Bimokh has zero points.Mashmokh wants to win in the game. For this reason he wants his boss to get exactlykpoints in total. But the guy doesn't know how choose the initial sequence in the right way.Please, help him. Findndistinct integersa1,a2, ...,ansuch that his boss will score exactlykpoints. Also Mashmokh can't memorize too huge numbers. Therefore each of these integers must be at most109.InputThe first line of input contains two space-separated integersn,k(1 ≤n≤ 105; 0 ≤k≤ 108).OutputIf such sequence doesn't exist output -1 otherwise outputndistinct space-separated integersa1,a2, ...,an(1 ≤ai≤ 109).ExamplesInput5 2Output1 2 3 4 5Input5 3Output2 4 3 7 1Input7 2Output-1Notegcd(x,y)is greatest common divisor ofxandy.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b35fce2b", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $k$.  Find $n$ distinct integers $a_1, a_2, ..., a_n$ such that the greatest common divisor (GCD) of pairs of these integers, when removed sequentially as described below, sums to exactly $k$.\n\n**Removal Rule:**\n\n1. Remove the first two integers from the sequence.\n2. Calculate the GCD of the removed integers.\n3. Repeat step 1 and 2 with the remaining sequence until there are less than two integers left.\n\nIf no such sequence exists, output -1. \n\n**Constraints:**\n\n* $1 \\le n \\le 10^5$\n* $0 \\le k \\le 10^8$\n* $1 \\le a_i \\le 10^9$"}, {"prompt_md5": "f46ed0a4", "template_md5": "465699a0", "result": "Given two numbers, *n* and *k*, find *n* distinct numbers whose greatest common divisors, when taken two at a time, add up to *k*. If no such sequence exists, output -1."}]}