{"uid": "415-B", "url": "https://codeforces.com/contest/415/problem/B", "tags": ["binary search", " greedy", " implementation", " math"], "title": "415-B", "statement": "B. Mashmokh and Tokenstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutBimokh is Mashmokh's boss. For the followingndays he decided to pay to his workers in a new way. At the beginning of each day he will give each worker a certain amount of tokens. Then at the end of each day each worker can give some of his tokens back to get a certain amount of money. The worker can save the rest of tokens but he can't use it in any other day to get more money. If a worker gives backwtokens then he'll getdollars.Mashmokh likes the tokens however he likes money more. That's why he wants to save as many tokens as possible so that the amount of money he gets is maximal possible each day. He hasnnumbersx1,x2, ...,xn. Numberxiis the number of tokens given to each worker on thei-th day. Help him calculate for each ofndays the number of tokens he can save.InputThe first line of input contains three space-separated integersn,a,b(1 ≤n≤ 105; 1 ≤a,b≤ 109). The second line of input containsnspace-separated integersx1,x2, ...,xn(1 ≤xi≤ 109).OutputOutputnspace-separated integers. Thei-th of them is the number of tokens Mashmokh can save on thei-th day.ExamplesInput5 1 412 6 11 9 1Output0 2 3 1 1Input3 1 21 2 3Output1 0 1Input1 1 11Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3b838db6", "template_md5": "35d339e4", "result": "You are given $n$ numbers, $x_1, x_2, ..., x_n$. Each number represents the number of tokens given to workers on a specific day.  \n\nFor each day, workers can return some tokens to receive a certain amount of money. The amount of money received is determined by the number of tokens returned ($w$ tokens = $d$ dollars).\n\nYou need to determine the maximum number of tokens that can be saved on each day. \n\n**Input:**\n\n* The first line contains three integers: $n$, $a$, and $b$ ($1 \\le n \\le 10^5; 1 \\le a, b \\le 10^9$).\n* The second line contains $n$ space-separated integers: $x_1, x_2, ..., x_n$ ($1 \\le x_i \\le 10^9$).\n\n**Output:**\n\nOutput $n$ space-separated integers. The $i$-th integer represents the maximum number of tokens that can be saved on the $i$-th day."}, {"prompt_md5": "90172b6a", "template_md5": "465699a0", "result": "You are given a list of numbers representing the number of items given out each day.  Each day, you can choose to keep some of the items or return some for a set amount of money.  Find the maximum number of items you can keep each day."}]}