{"uid": "416-E", "url": "https://codeforces.com/contest/416/problem/E", "tags": ["dp", " graphs", " shortest paths"], "title": "416-E", "statement": "E. President's Pathtime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutGood old Berland hasncities andmroads. Each road connects a pair of distinct cities and is bidirectional. Between any pair of cities, there is at most one road. For each road, we know its length.We also know that the President will soon ride along the Berland roads from citysto cityt. Naturally, he will choose one of the shortest paths fromstot, but nobody can say for sure which path he will choose.The Minister for Transport is really afraid that the President might get upset by the state of the roads in the country. That is the reason he is planning to repair the roads in the possible President's path.Making the budget for such an event is not an easy task. For all possible distinct pairss,t(s<t) find the number of roads that lie on at least one shortest path fromstot.InputThe first line of the input contains integersn,m(2 ≤n≤ 500,0 ≤m≤n·(n- 1) / 2) — the number of cities and roads, correspondingly. Thenmlines follow, containing the road descriptions, one description per line. Each description contains three integersxi,yi,li(1 ≤xi,yi≤n,xi≠yi, 1 ≤li≤ 106), wherexi,yiare the numbers of the cities connected by thei-th road andliis its length.OutputPrint the sequence ofintegersc12,c13, ...,c1n,c23,c24, ...,c2n, ...,cn- 1,n, wherecstis the number of roads that can lie on the shortest path fromstot. Print the elements of sequencecin the described order. If the pair of citiessandtdon't have a path between them, thencst= 0.ExamplesInput5 61 2 12 3 13 4 14 1 12 4 24 5 4Output1 4 1 2 1 5 6 1 2 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b82480e2", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ roads. Each road connects two different cities and is bidirectional. There is at most one road between any two cities. The length of each road is known.\n\nYou need to find, for all pairs of cities $s$ and $t$ ($s < t$), the number of roads that are on at least one shortest path from city $s$ to city $t$.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($2 \\le n \\le 500$, $0 \\le m \\le n(n-1)/2$), representing the number of cities and roads, respectively.\n* The next $m$ lines each contain three integers, $x_i$, $y_i$, and $l_i$ ($1 \\le x_i, y_i \\le n$, $x_i \\neq y_i$, $1 \\le l_i \\le 10^6$), representing the cities connected by the $i$-th road and its length.\n\n**Output:**\n\nPrint a sequence of integers $c_{12}, c_{13}, ..., c_{1n}, c_{23}, c_{24}, ..., c_{2n}, ..., c_{n-1,n}$, where $c_{st}$ is the number of roads that can lie on the shortest path from city $s$ to city $t$. If there is no path between cities $s$ and $t$, then $c_{st} = 0$."}, {"prompt_md5": "83e586ea", "template_md5": "465699a0", "result": "You are given a network of cities connected by roads. Each road has a length.  Find for every pair of cities, the number of roads that are on at least one shortest path between them."}]}