{"uid": "416-A", "url": "https://codeforces.com/contest/416/problem/A", "tags": ["greedy", " implementation", " two pointers"], "title": "416-A", "statement": "A. Guess a number!time limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA TV show called \"Guess a number!\" is gathering popularity. The whole Berland, the old and the young, are watching the show.The rules are simple. The host thinks of an integeryand the participants guess it by asking questions to the host. There are four types of acceptable questions:Is it true thatyis strictly larger than numberx?Is it true thatyis strictly smaller than numberx?Is it true thatyis larger than or equal to numberx?Is it true thatyis smaller than or equal to numberx?On each question the host answers truthfully, \"yes\" or \"no\".Given the sequence of questions and answers, find any integer value ofythat meets the criteria of all answers. If there isn't such value, print \"Impossible\".InputThe first line of the input contains a single integern(1 ≤n≤ 10000) — the number of questions (and answers). Nextnlines each contain one question and one answer to it. The format of each line is like that: \"sign x answer\", where thesignis:\">\" (for the first type queries),\"<\" (for the second type queries),\">=\" (for the third type queries),\"<=\" (for the fourth type queries).All values ofxare integer and meet the inequation- 109≤x≤ 109. Theansweris an English letter \"Y\" (for \"yes\") or \"N\" (for \"no\").Consequtive elements in lines are separated by a single space.OutputPrint any of such integersy, that the answers to all the queries are correct. The printed numberymust meet the inequation- 2·109≤y≤ 2·109. If there are many answers, print any of them. If such value doesn't exist, print word \"Impossible\" (without the quotes).ExamplesInput4>= 1 Y< 3 N<= -3 N> 55 NOutput17Input2> 100 Y< -100 YOutputImpossible", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b0ad4588", "template_md5": "35d339e4", "result": "You are given a series of questions about a secret number. Each question is of the form:\n\n* Is it true that  $y$ is strictly larger than $x$?\n* Is it true that $y$ is strictly smaller than $x$?\n* Is it true that $y$ is larger than or equal to $x$?\n* Is it true that $y$ is smaller than or equal to $x$?\n\nYou are also given the answer to each question (Yes or No).  \n\nFind any integer value for $y$ that satisfies all the given questions and answers. If no such integer exists, print \"Impossible\". \n\nThe possible values for $y$ are between $-2 \\times 10^9$ and $2 \\times 10^9$."}, {"prompt_md5": "e4dc4f7b", "template_md5": "465699a0", "result": "You are given a series of questions about a secret number. Each question asks if a given value is greater than, less than, greater than or equal to, or less than or equal to the secret number. You know the answers to all the questions. Find a number that satisfies all the questions. If no such number exists, say \"Impossible\"."}]}