{"uid": "417-A", "url": "https://codeforces.com/contest/417/problem/A", "tags": ["dp", " implementation", " math"], "title": "417-A", "statement": "A. Eliminationtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe finalists of the \"Russian Code Cup\" competition in 2214 will be the participants who win in one of the elimination rounds.The elimination rounds are divided into main and additional. Each of the main elimination rounds consists ofcproblems, the winners of the round are the firstnpeople in the rating list. Each of the additional elimination rounds consists ofdproblems. The winner of the additional round is one person. Besides,kwinners of the past finals are invited to the finals without elimination.As a result of all elimination rounds at leastn·mpeople should go to the finals. You need to organize elimination rounds in such a way, that at leastn·mpeople go to the finals, and the total amount of used problems in all rounds is as small as possible.InputThe first line contains two integerscandd(1 ≤c,d≤ 100) — the number of problems in the main and additional rounds, correspondingly. The second line contains two integersnandm(1 ≤n,m≤ 100). Finally, the third line contains an integerk(1 ≤k≤ 100) — the number of the pre-chosen winners.OutputIn the first line, print a single integer — the minimum number of problems the jury needs to prepare.ExamplesInput1 107 21Output2Input2 22 12Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ceb9e8e3", "template_md5": "35d339e4", "result": "You are given two numbers, $c$ and $d$, representing the number of problems in main and additional elimination rounds respectively. You are also given two numbers, $n$ and $m$, representing the number of winners needed from each type of round. Finally, you are given a number $k$ representing the number of pre-selected winners.\n\nYour task is to determine the minimum number of problems needed to be prepared for all elimination rounds, ensuring that at least $n \\cdot m$ people qualify for the finals."}, {"prompt_md5": "f7ffd824", "template_md5": "465699a0", "result": "You need to determine the minimum number of problems to use in elimination rounds for a competition. There are two types of rounds: main rounds with a set number of problems and additional rounds with a different set number of problems.  A certain number of winners from the main rounds and one winner from each additional round advance to the finals.  A fixed number of past winners also automatically qualify for the finals.  You need to ensure at least a target number of people qualify for the finals."}]}