{"uid": "417-D", "url": "https://codeforces.com/contest/417/problem/D", "tags": ["bitmasks", " dp", " greedy", " sortings"], "title": "417-D", "statement": "D. Cunning Genatime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA boy named Gena really wants to get to the \"Russian Code Cup\" finals, or at least get a t-shirt. But the offered problems are too complex, so he made an arrangement with hisnfriends that they will solve the problems for him.The participants are offeredmproblems on the contest. For each friend, Gena knows what problems he can solve. But Gena's friends won't agree to help Gena for nothing: thei-th friend asks Genaxirubles for his helpin solving all the problemshe can. Also, the friend agreed to write a code for Gena only if Gena's computer is connected to at leastkimonitors, each monitor costsbrubles.Gena is careful with money, so he wants to spend as little money as possible to solve all the problems. Help Gena, tell him how to spend the smallest possible amount of money. Initially, there's no monitors connected to Gena's computer.InputThe first line contains three integersn,mandb(1 ≤n≤ 100;1 ≤m≤ 20;1 ≤b≤ 109) — the number of Gena's friends, the number of problems and the cost of a single monitor.The following2nlines describe the friends. Lines number2iand(2i+ 1)contain the information about thei-th friend. The2i-th line contains three integersxi,kiandmi(1 ≤xi≤ 109;1 ≤ki≤ 109;1 ≤mi≤m) — the desired amount of money, monitors and the number of problems the friend can solve. The(2i+ 1)-th line containsmidistinct positive integers — the numbers of problems that thei-th friend can solve. The problems are numbered from1tom.OutputPrint the minimum amount of money Gena needs to spend to solve all the problems. Or print -1, if this cannot be achieved.ExamplesInput2 2 1100 1 12100 2 11Output202Input3 2 5100 1 11100 1 12200 1 21 2Output205Input1 2 11 1 11Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a9a6d695", "template_md5": "35d339e4", "result": "There are $n$ friends who can help solve $m$ problems. Each friend has a price ($x_i$), a minimum number of monitors required ($k_i$), and a list of problems they can solve ($p_{i1}, p_{i2}, ..., p_{ik_i}$).  A monitor costs $b$ dollars.\n\nFind the minimum amount of money needed to hire all the friends and solve all the problems, given that you need to buy enough monitors to satisfy each friend's requirement. If it's impossible to solve all the problems, output -1."}, {"prompt_md5": "fe4a7283", "template_md5": "465699a0", "result": "You have a set of tasks and a group of people who can do some of the tasks for a price. Each person has a different price and requires a certain number of resources to complete their tasks. You have a limited amount of resources. Find the cheapest way to get all the tasks done."}]}