{"uid": "417-C", "url": "https://codeforces.com/contest/417/problem/C", "tags": ["constructive algorithms", " graphs", " implementation"], "title": "417-C", "statement": "C. Footballtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOne day, at the \"Russian Code Cup\" event it was decided to play football as an out of competition event. All participants was divided intonteams and played several matches, two teams could not play against each other more than once.The appointed Judge was the most experienced member — Pavel. But since he was the wisest of all, he soon got bored of the game and fell asleep. Waking up, he discovered that the tournament is over and the teams want to know the results of all the matches.Pavel didn't want anyone to discover about him sleeping and not keeping an eye on the results, so he decided to recover the results of all games. To do this, he asked all the teams and learned that the real winner was friendship, that is, each team beat the other teams exactlyktimes. Help Pavel come up with chronology of the tournir that meets all the conditions, or otherwise report that there is no such table.InputThe first line contains two integers —nandk(1 ≤n,k≤ 1000).OutputIn the first line print an integerm— number of the played games. The followingmlines should contain the information about all the matches, one match per line. Thei-th line should contain two integersaiandbi(1 ≤ai,bi≤n;ai≠bi). The numbersaiandbimean, that in thei-th match the team with numberaiwon against the team with numberbi. You can assume, that the teams are numbered from1ton.If a tournir that meets the conditions of the problem does not exist, then print -1.ExamplesInput3 1Output31 22 33 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cf875d8f", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $k$, where $n$ is the number of teams and $k$ is the number of matches each team won.  \n\nYour task is to determine if it's possible to create a tournament schedule where:\n\n* Each team plays every other team exactly once.\n* Each team wins exactly $k$ matches.\n\nIf such a schedule is possible, output the number of matches ($m$) and a list of the winning team and losing team for each match. \n\nIf no such schedule is possible, output -1."}, {"prompt_md5": "d171d242", "template_md5": "465699a0", "result": "You are given the number of teams (n) and the number of wins each team had (k).  Determine if it's possible to create a tournament schedule where each team won k games and lost the rest. If possible, output the schedule listing each game (team A beat team B). If not possible, output -1."}]}