{"uid": "417-B", "url": "https://codeforces.com/contest/417/problem/B", "tags": ["implementation"], "title": "417-B", "statement": "B. Crashtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDuring the \"Russian Code Cup\" programming competition, the testing system stores all sent solutions for each participant. We know that many participants use random numbers in their programs and are often sent several solutions with the same source code to check.Each participant is identified by some unique positive integerk, and each sent solutionAis characterized by two numbers:x— the number of different solutions that are sent before the first solution identical toA, andk— the number of the participant, who is the author of the solution. Consequently, all identical solutions have the samex.It is known that the data in the testing system are stored in the chronological order, that is, if the testing system has a solution with numberx(x> 0)of the participant with numberk, then the testing system has a solution with numberx- 1of the same participant stored somewhere before.During the competition the checking system crashed, but then the data of the submissions of all participants have been restored. Now the jury wants to verify that the recovered data is in chronological order. Help the jury to do so.InputThe first line of the input contains an integern(1 ≤n≤ 105) — the number of solutions. Each of the followingnlines contains two integers separated by spacexandk(0 ≤x≤ 105;1 ≤k≤ 105) — the number of previous unique solutions and the identifier of the participant.OutputA single line of the output should contain «YES» if the data is in chronological order, and «NO» otherwise.ExamplesInput20 11 1OutputYESInput40 11 21 10 2OutputNOInput40 11 10 10 2OutputYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c914ff3d", "template_md5": "35d339e4", "result": "You are given a list of $n$ solutions, where each solution is represented by a pair of numbers $(x, k)$.  \n\n* $x$ represents the number of unique solutions submitted before this one by the same participant.\n* $k$ represents the unique identifier of the participant who submitted this solution.\n\nThe solutions are given in a potentially unsorted order.  \n\nDetermine if the list of solutions is chronologically ordered, meaning that if a solution has $x > 0$, then there is a previous solution with $x-1$ submitted by the same participant.\n\nIf the list is chronologically ordered, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "34775c1d", "template_md5": "465699a0", "result": "You are given a list of numbers representing submissions. Each number has two parts: the number of previous unique submissions and the participant ID.  Determine if the list is in chronological order based on the submission count."}]}