{"uid": "418-D", "url": "https://codeforces.com/contest/418/problem/D", "tags": ["data structures", " graphs", " trees"], "title": "418-D", "statement": "D. Big Problems for Organizerstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Finals of the \"Russian Code Cup\" 2214 will be held innhotels. Two hotels (let's assume that they are the main hotels), will host all sorts of events, and the remaining hotels will accommodate the participants. The hotels are connected byn- 1roads, you can get from any hotel to any other one.The organizers wonder what is the minimum time all the participants need to get to the main hotels, if each participant goes to the main hotel that is nearest to him and moving between two hotels connected by a road takes one unit of time.The hosts consider various options for the location of the main hotels. For each option help the organizers to find minimal time.InputThe first line contains an integern(2 ≤n≤ 100000) — the number of hotels. The nextn- 1lines contain two integers each  — the numbers of the hotels that have a road between them. Consider hotels are numbered from1ton.The next line contains an integerm(1 ≤m≤ 100000) — the number of queries. The followingmlines contains two distinct integers each — the numbers of the hotels we assume to be the main.OutputFor each request of the organizers print a single integer — the time that all participants need to reach the main hotels.ExamplesInput32 33 132 12 33 1Output111Input41 41 22 331 41 32 3Output212", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d2ae4bb4", "template_md5": "35d339e4", "result": "There are $n$ hotels ($2 \\le n \\le 100000$) connected by $n-1$ roads.  You can travel between any two hotels by following these roads, and it takes 1 unit of time to travel between hotels connected by a road.\n\nThe organizers want to choose 2 hotels to be the \"main hotels\".  They want to know the minimum amount of time it takes for all participants to travel to one of the main hotels, where each participant goes to the nearest main hotel.\n\nInput:\n\n* The first line contains the number of hotels, $n$.\n* The next $n-1$ lines each contain two numbers, representing a road between those two hotels.\n* The next line contains the number of queries, $m$.\n* The following $m$ lines each contain two numbers, representing the two hotels that will be the main hotels for that query.\n\nOutput:\n\nFor each query, print the minimum time it takes for all participants to reach a main hotel."}, {"prompt_md5": "894baf24", "template_md5": "465699a0", "result": "You are given a network of connected cities.  Find the minimum time it takes for all people to reach two designated cities, given that each person travels to the closest designated city and travel between cities takes one unit of time."}]}