{"uid": "420-C", "url": "https://codeforces.com/contest/420/problem/C", "tags": ["data structures", " graphs", " implementation", " two pointers"], "title": "420-C", "statement": "C. Bug in Codetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutRecently a serious bug has been found in the FOS code. The head of the F company wants to find the culprit and punish him. For that, he set up an organizational meeting, the issue is: who's bugged the code? Each of thencoders on the meeting said: 'I know for sure that eitherxorydid it!'The head of the company decided to choose two suspects and invite them to his office. Naturally, he should consider the coders' opinions. That's why the head wants to make such a choice that at leastpofncoders agreed with it. A coder agrees with the choice of two suspects if at least one of the two people that he named at the meeting was chosen as a suspect. In how many ways can the head of F choose two suspects?Note that even if some coder was chosen as a suspect, he can agree with the head's choice if he named the other chosen coder at the meeting.InputThe first line contains integersnandp(3 ≤n≤ 3·105; 0 ≤p≤n)— the number of coders in the F company and the minimum number of agreed people.Each of the nextnlines contains two integersxi,yi(1 ≤xi,yi≤n)— the numbers of coders named by thei-th coder. It is guaranteed thatxi≠i,yi≠i,xi≠yi.OutputPrint a single integer –– the number of possible two-suspect sets. Note that the order of the suspects doesn't matter, that is, sets(1, 2)и(2, 1)are considered identical.ExamplesInput4 22 31 41 42 1Output6Input8 65 65 75 86 22 17 31 31 4Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4d960e9f", "template_md5": "35d339e4", "result": "There are $n$ people. Each person names two other people. You need to choose 2 people out of the $n$ people.  A person agrees with your choice if at least one of the two people they named is among the two people you chose.  \n\nWhat is the number of ways to choose 2 people so that at least $p$ people agree with your choice? \n\nThe order you choose the two people does not matter."}, {"prompt_md5": "c9bd6288", "template_md5": "465699a0", "result": "You have a group of people. Each person points to two other people in the group and says \"one of these two people did something wrong\". You need to choose two people to investigate.  At least a certain number of people must agree that one of the chosen people was pointed to. How many different groups of two people can you choose?"}]}