{"uid": "421-A", "url": "https://codeforces.com/contest/421/problem/A", "tags": ["constructive algorithms", " implementation"], "title": "421-A", "statement": "A. Pasha and Hamsterstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPasha has two hamsters: Arthur and Alexander. Pasha putnapples in front of them. Pasha knows which apples Arthur likes. Similarly, Pasha knows which apples Alexander likes. Pasha doesn't want any conflict between the hamsters (as they may like the same apple), so he decided to distribute the apples between the hamsters on his own. He is going to give some apples to Arthur and some apples to Alexander. It doesn't matter how many apples each hamster gets but it is important that each hamster gets only the apples he likes. It is possible that somebody doesn't get any apples.Help Pasha distribute all the apples between the hamsters. Note that Pasha wants to distribute all the apples, not just some of them.InputThe first line contains integersn,a,b(1 ≤n≤ 100; 1 ≤a,b≤n)— the number of apples Pasha has, the number of apples Arthur likes and the number of apples Alexander likes, correspondingly.The next line containsadistinct integers — the numbers of the apples Arthur likes. The next line containsbdistinct integers — the numbers of the apples Alexander likes.Assume that the apples are numbered from1ton. The input is such that the answer exists.OutputPrintncharacters, each of them equals either 1 or 2. If thei-h character equals 1, then thei-th apple should be given to Arthur, otherwise it should be given to Alexander. If there are multiple correct answers, you are allowed to print any of them.ExamplesInput4 2 31 22 3 4Output1 1 2 2Input5 5 23 4 1 2 52 3Output1 1 1 1 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d4275830", "template_md5": "35d339e4", "result": "You are given $n$ apples. There are two people, each who likes a specific set of apples. The first person likes $a$ apples, and the second person likes $b$ apples.  You need to assign each apple to one of the two people, ensuring that each person only receives the apples they like. \n\n**Input:**\n\n* The first line contains three integers: $n$, $a$, and $b$ ($1 \\le n \\le 100$; $1 \\le a, b \\le n$).\n* The second line contains $a$ distinct integers representing the numbers of the apples the first person likes.\n* The third line contains $b$ distinct integers representing the numbers of the apples the second person likes.\n\n**Output:**\n\nPrint a string of $n$ characters, where each character is either '1' or '2'. \n\n* '1' means the corresponding apple should be given to the first person.\n* '2' means the corresponding apple should be given to the second person."}, {"prompt_md5": "e56e50c3", "template_md5": "465699a0", "result": "You are given a set of items and two lists of items each person likes.  You need to assign each item to one person, ensuring that each person only receives items they like.  Output a sequence of 1s and 2s, where 1 represents an item for the first person and 2 represents an item for the second person."}]}