{"uid": "427-D", "url": "https://codeforces.com/contest/427/problem/D", "tags": ["dp", " string suffix structures", " strings"], "title": "427-D", "statement": "D. Match & Catchtime limit per test1 secondmemory limit per test512 megabytesinputstdinoutputstdoutPolice headquarter is monitoring signal on different frequency levels. They have got two suspiciously encoded stringss1ands2from two different frequencies as signals. They are suspecting that these two strings are from two different criminals and they are planning to do some evil task.Now they are trying to find a common substring of minimum length between these two strings. The substring must occur only once in the first string, and also it must occur only once in the second string.Given two stringss1ands2consist of lowercase Latin letters, find the smallest (by length) common substringpof boths1ands2, wherepis a unique substring ins1and also ins2. See notes for formal definition of substring and uniqueness.InputThe first line of input containss1and the second line containss2(1 ≤ |s1|, |s2| ≤ 5000). Both strings consist of lowercase Latin letters.OutputPrint the length of the smallest common unique substring ofs1ands2. If there are no common unique substrings ofs1ands2print -1.ExamplesInputapplepepperoniOutput2InputloverdriverOutput1InputbidhanroyOutput-1InputtestsetsesteeptesOutput3NoteImagine we have stringa=a1a2a3...a|a|, where|a|is the length of stringa, andaiis theithletter of the string.We will call stringalal+ 1al+ 2...ar(1 ≤l≤r≤ |a|)the substring[l,r]of the stringa.The substring[l,r]is unique inaif and only if there is no pairl1,r1such thatl1≠land the substring[l1,r1]is equal to the substring[l,r]ina.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "13a32825", "template_md5": "35d339e4", "result": "Given two strings $s_1$ and $s_2$, find the shortest common substring that appears only once in each string. If no such substring exists, print -1. \n\nThe length of each string is at most 5000 characters and they consist of lowercase letters."}, {"prompt_md5": "6db598b2", "template_md5": "465699a0", "result": "Given two strings, find the shortest common sequence of letters that appears only once in each string. If no such sequence exists, print -1."}]}