{"uid": "427-B", "url": "https://codeforces.com/contest/427/problem/B", "tags": ["data structures", " implementation"], "title": "427-B", "statement": "B. Prison Transfertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe prison of your city hasnprisoners. As the prison can't accommodate all of them, the city mayor has decided to transfercof the prisoners to a prison located in another city.For this reason, he made thenprisoners to stand in a line, with a number written on their chests. The number is the severity of the crime he/she has committed. The greater the number, the more severe his/her crime was.Then, the mayor told you to choose thecprisoners, who will be transferred to the other prison. He also imposed two conditions. They are,The chosencprisoners has to form a contiguous segment of prisoners.Any of the chosen prisoner's crime level should not be greater thent. Because, that will make the prisoner a severe criminal and the mayor doesn't want to take the risk of his running away during the transfer.Find the number of ways you can choose thecprisoners.InputThe first line of input will contain three space separated integersn(1 ≤n≤ 2·105),t(0 ≤t≤ 109)andc(1 ≤c≤n). The next line will containnspace separated integers, theithinteger is the severityithprisoner's crime. The value of crime severities will be non-negative and will not exceed109.OutputPrint a single integer — the number of ways you can choose thecprisoners.ExamplesInput4 3 32 3 1 1Output2Input1 1 12Output0Input11 4 22 2 0 7 3 2 2 4 9 1 4Output6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "06a2eab5", "template_md5": "35d339e4", "result": "You are given a line of $n$ prisoners, each with a crime severity level represented by an integer. The levels range from 0 to $10^9$.  You need to choose a contiguous group of $c$ prisoners to transfer to another prison.  \n\nThere are two rules:\n\n1. The chosen group must be a continuous segment of prisoners in the line.\n2. The maximum crime severity level in the chosen group cannot exceed a given value $t$.\n\nFind the number of ways you can choose the $c$ prisoners that satisfy these rules."}, {"prompt_md5": "9350276f", "template_md5": "465699a0", "result": "You have a line of people, each with a number representing their \"crime severity\".  You need to choose a group of a specific number of people from this line, where:\n\n* The chosen people must be next to each other in the line.\n* The highest \"crime severity\" number in the chosen group cannot be greater than a given limit.\n\nCount how many different groups you can choose."}]}