{"uid": "427-E", "url": "https://codeforces.com/contest/427/problem/E", "tags": ["greedy", " implementation", " math", " ternary search"], "title": "427-E", "statement": "E. Police Patroltime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutImagine that your city is an infinite 2D plane with Cartesian coordinate system. The only crime-affected road of your city is thex-axis. Currently, there arencriminals along the road. No police station has been built on this road yet, so the mayor wants to build one.As you are going to be in charge of this new police station, the mayor has asked you to choose a suitable position (some integer point) for building it. You should choose the best position for the police station, so that you could minimize the total time of your criminal catching mission. Your mission of catching the criminals will operate only from this station.The new station will have onlyonepatrol car. You will go to the criminals by this car, carry them on the car, bring them back to the police station and put them in prison. The patrol car can carry at mostmcriminals at a time. Note that, the criminals don't know about your mission. So, they will stay where they are instead of running away.Your task is to find the position for the police station, so that total distance you need to cover to catch all the criminals will be minimum possible. Note that, you also can built the police station on the positions where one or more criminals already exist. In such a case all these criminals are arrested instantly.InputThe first line of the input will have two integersn(1 ≤n≤ 106)andm(1 ≤m≤ 106)separated by spaces. The next line will containnintegers separated by spaces. Theithinteger is the position of theithcriminal on thex-axis. Absolute value of positions will not exceed109. If a criminal has positionx, he/she is located in the point(x, 0)of the plane.The positions of the criminals will be given in non-decreasing order. Note, that there can be more than one criminal standing at some point of the plane.Note: since the size of the input/output could be very large, don't use slow input/output techniques in your language. For example, do not use input/output streams (cin, cout) in C++.OutputPrint a single integer, that means the minimum possible distance you need to cover to catch all the criminals.ExamplesInput3 61 2 3Output4Input5 5-7 -6 -3 -1 1Output16Input1 3690Output0Input11 2-375 -108 1336 1453 1598 1892 2804 3732 4291 4588 4822Output18716", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7d3699e5", "template_md5": "35d339e4", "result": "You are tasked with finding the best location to build a police station on a number line. Criminals are located at various points on the number line. A police car with a capacity of  'm' criminals can be used to arrest them.  \n\nYou need to determine the location of the police station that minimizes the total distance the car has to travel to arrest all the criminals. \n\n**Input:**\n\n* The first line contains two integers, 'n' (the number of criminals) and 'm' (the car's capacity).\n* The second line contains 'n' integers representing the positions of the criminals on the number line.\n\n**Output:**\n\n* Output a single integer representing the minimum total distance the car needs to travel to arrest all criminals."}, {"prompt_md5": "ce84fcfe", "template_md5": "465699a0", "result": "You need to place a police station on a number line. Criminals are located at various points on the line. A police car can hold a maximum of a certain number of criminals at a time.  Find the best location for the police station to minimize the total distance the car has to travel to pick up all the criminals."}]}