{"uid": "427-C", "url": "https://codeforces.com/contest/427/problem/C", "tags": ["dfs and similar", " graphs", " two pointers"], "title": "427-C", "statement": "C. Checkpoststime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYour city hasnjunctions. There aremone-wayroads between the junctions. As a mayor of the city, you have to ensure the security of all the junctions.To ensure the security, you have to build some police checkposts. Checkposts can only be built in a junction. A checkpost at junctionican protect junctionjif eitheri=jor the police patrol car can go tojfromiand then come back toi.Building checkposts costs some money. As some areas of the city are more expensive than others, building checkpost at some junctions might cost more money than other junctions.You have to determine the minimum possible money needed to ensure the security of all the junctions. Also you have to find the number of ways to ensure the security in minimum price andin addition in minimum number of checkposts. Two ways are different if any of the junctions contains a checkpost in one of them and do not contain in the other.InputIn the first line, you will be given an integern, number of junctions(1 ≤n≤ 105). In the next line,nspace-separated integers will be given. Theithinteger is the cost of building checkpost at theithjunction (costs will be non-negative and will not exceed109).The next line will contain an integerm(0 ≤m≤ 3·105). And each of the nextmlines contains two integersuiandvi(1 ≤ui,vi≤n;u≠v). A pairui,vimeans, that there is a one-way road which goes fromuitovi. There will not be more than one road between two nodes in the same direction.OutputPrint two integers separated by spaces. The first one is the minimum possible money needed to ensure the security of all the junctions. And the second one is the number of ways you can ensure the security modulo1000000007(109+ 7).ExamplesInput31 2 331 22 33 2Output3 1Input52 8 0 6 061 41 32 43 44 55 1Output8 2Input101 3 2 2 1 3 1 4 10 10121 22 33 13 44 55 65 76 47 38 99 1010 9Output15 6Input27 9121 22 1Output7 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0e2ed172", "template_md5": "35d339e4", "result": "You have a city with $n$ junctions ($1 \\le n \\le 10^5$).  There are $m$ one-way roads between the junctions ($0 \\le m \\le 3 \\cdot 10^5$).  \n\nThe cost of building a checkpost at junction $i$ is given by a list of $n$ integers.  You need to build checkposts to ensure the security of all junctions. A checkpost at junction $i$ protects junction $j$ if either $i=j$ or a police patrol car can go from $i$ to $j$ and back to $i$.\n\nFind the minimum cost to secure all junctions and the number of ways to do so. Two ways are different if they use checkposts at different junctions.  The number of ways should be output modulo $10^9 + 7$."}, {"prompt_md5": "f237204f", "template_md5": "465699a0", "result": "You have a number of cities connected by one-way roads. You need to build checkpoints in some cities to ensure security. Each city has a different cost to build a checkpoint.  You need to find the cheapest way to build checkpoints so that every city is protected, meaning a checkpoint can protect a city if it's in that city or if a patrol car can travel to that city from a checkpoint and back.  You also need to find how many different ways you can achieve this cheapest solution."}]}