{"uid": "429-E", "url": "https://codeforces.com/contest/429/problem/E", "tags": ["graphs"], "title": "429-E", "statement": "E. Points and Segmentstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIahub isn't well prepared on geometry problems, but he heard that this year there will be a lot of geometry problems on the IOI selection camp. Scared, Iahub locked himself in the basement and started thinking of new problems of this kind. One of them is the following.Iahub wants to drawndistinct segments[li,ri]on theOXaxis. He can draw each segment with either red or blue. The drawing is good if and only if the following requirement is met: for each pointxof theOXaxis consider all the segments that contains pointx; suppose, thatrxred segments andbxblue segments contain pointx; for each pointxinequality|rx-bx| ≤ 1must be satisfied.A segment[l,r]contains a pointxif and only ifl≤x≤r.Iahub gives you the starting and ending points of all the segments. You have to find any good drawing for him.InputThe first line of input contains integern(1 ≤n≤ 105) — the number of segments. Thei-th of the nextnlines contains two integersliandri(0 ≤li≤ri≤ 109) — the borders of thei-th segment.It's guaranteed that all the segments are distinct.OutputIf there is no good drawing for a given test, output a single integer -1. Otherwise outputnintegers; each integer must be 0 or 1. Thei-th number denotes the color of thei-th segment (0 is red and 1 is blue).If there are multiple good drawings you can output any of them.ExamplesInput20 22 3Output0 1Input61 51 33 52 1011 1112 12Output0 1 0 1 0 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bcc96e46", "template_md5": "35d339e4", "result": "You are given $n$ segments on the number line, each defined by its start and end points ($l_i$, $r_i$).  You need to color each segment either red (0) or blue (1).  A coloring is valid if for every point $x$ on the number line, the absolute difference between the number of red segments containing $x$ and the number of blue segments containing $x$ is at most 1.\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the number of segments.\n* Each of the next $n$ lines contains two integers $l_i$ and $r_i$ (0 ≤ $l_i$ ≤ $r_i$ ≤ 10⁹) representing the start and end points of the $i$-th segment.\n\nOutput:\n\n* If a valid coloring is possible, output $n$ integers, where the $i$-th integer is 0 or 1 representing the color of the $i$-th segment.\n* If no valid coloring is possible, output -1."}, {"prompt_md5": "210415ca", "template_md5": "465699a0", "result": "You are given a list of intervals on a number line.  You need to color each interval either red or blue.  The coloring is valid if for every point on the number line, the difference between the number of red intervals containing that point and the number of blue intervals containing that point is at most 1.  \n\nIf a valid coloring exists, output a sequence of 0s and 1s representing the colors of the intervals. If no valid coloring exists, output -1."}]}