{"uid": "429-A", "url": "https://codeforces.com/contest/429/problem/A", "tags": ["dfs and similar", " trees"], "title": "429-A", "statement": "A. Xor-treetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIahub is very proud of his recent discovery, propagating trees. Right now, he invented a new tree, called xor-tree. After this new revolutionary discovery, he invented a game for kids which uses xor-trees.The game is played on a tree havingnnodes, numbered from1ton. Each nodeihas an initial valueiniti, which is either 0 or 1. The root of the tree is node 1.One can perform several (possibly, zero) operations on the tree during the game. The only available type of operation is to pick a nodex. Right after someone has picked nodex, the value of nodexflips, the values of sons ofxremain the same, the values of sons of sons ofxflips, the values of sons of sons of sons ofxremain the same and so on.The goal of the game is to get each nodeito have valuegoali, which can also be only 0 or 1. You need to reach the goal of the game by using minimum number of operations.InputThe first line contains an integern(1 ≤n≤ 105). Each of the nextn- 1lines contains two integersuiandvi(1 ≤ui,vi≤n;ui≠vi) meaning there is an edge between nodesuiandvi.The next line containsninteger numbers, thei-th of them corresponds toiniti(initiis either 0 or 1). The following line also containsninteger numbers, thei-th number corresponds togoali(goaliis either 0 or 1).OutputIn the first line output an integer numbercnt, representing the minimal number of operations you perform. Each of the nextcntlines should contain an integerxi, representing that you pick a nodexi.ExamplesInput102 13 14 25 16 27 58 69 810 51 0 1 1 0 1 0 1 0 11 0 1 0 0 1 1 1 0 1Output247", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f975357e", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, numbered from 1 to $n$. Each node has an initial value, either 0 or 1.  The goal is to change the value of each node to a target value, also either 0 or 1.\n\nYou can perform the following operation:\n\n* Choose a node $x$. Flip the value of node $x$. All of its children's children's values will also flip, and so on (grandchildren, great-grandchildren, etc.).\n\nFind the minimum number of operations needed to achieve the target values for all nodes.\n\n**Input:**\n\n* The first line contains an integer $n$ (the number of nodes).\n* The next $n-1$ lines each contain two integers $u$ and $v$ (representing an edge between nodes $u$ and $v$).\n* The next line contains $n$ integers, the $i$-th integer representing the initial value of node $i$.\n* The following line contains $n$ integers, the $i$-th integer representing the target value for node $i$.\n\n**Output:**\n\n* The first line contains an integer $cnt$ (the minimum number of operations).\n* The next $cnt$ lines each contain an integer $x_i$ (the node chosen for the $i$-th operation)."}, {"prompt_md5": "e4c855c6", "template_md5": "465699a0", "result": "You are given a tree with nodes, each initially having a value of 0 or 1. You also have a target value for each node.  You can perform operations on the tree where you flip the value of a node and all of its grandchildren. Find the minimum number of operations needed to make the value of each node match its target value."}]}