{"uid": "429-B", "url": "https://codeforces.com/contest/429/problem/B", "tags": ["dp"], "title": "429-B", "statement": "B. Working outtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSummer is coming! It's time for Iahub and Iahubina to work out, as they both want to look hot at the beach. The gym where they go is a matrixawithnlines andmcolumns. Let numbera[i][j]represents the calories burned by performing workout at the cell of gym in thei-th line and thej-th column.Iahub starts with workout located at line1and column1. He needs to finish with workouta[n][m]. After finishing workouta[i][j], he can go to workouta[i+ 1][j]ora[i][j+ 1]. Similarly, Iahubina starts with workouta[n][1]and she needs to finish with workouta[1][m]. After finishing workout from cella[i][j], she goes to eithera[i][j+ 1]ora[i- 1][j].There is one additional condition for their training. They have to meet in exactly one cell of gym. At that cell, none of them will work out. They will talk about fast exponentiation (pretty odd small talk) and then both of them will move to the next workout.If a workout was done by either Iahub or Iahubina, it counts as total gain. Please plan a workout for Iahub and Iahubina such as total gain to be as big as possible. Note, that Iahub and Iahubina can perform workouts with different speed, so the number of cells that they use to reach meet cell may differs.InputThe first line of the input contains two integersnandm(3 ≤n,m≤ 1000). Each of the nextnlines containsmintegers:j-th number fromi-th line denotes elementa[i][j](0 ≤a[i][j] ≤ 105).OutputThe output contains a single number — the maximum total gain possible.ExamplesInput3 3100 100 100100 1 100100 100 100Output800NoteIahub will choose exercisesa[1][1] →a[1][2] →a[2][2] →a[3][2] →a[3][3]. Iahubina will choose exercisesa[3][1] →a[2][1] →a[2][2] →a[2][3] →a[1][3].", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9fe0110d", "template_md5": "35d339e4", "result": "You are given a 2D grid of integers, where each cell represents the number of calories burned by working out at that cell. Two people start at opposite corners of the grid and need to move towards each other, meeting at a single cell.  They can only move to adjacent cells (up, down, left, right).  \n\nThe goal is to find the maximum total number of calories burned by both people during their workout, considering they can move at different speeds and meet at any cell."}, {"prompt_md5": "8001a1f8", "template_md5": "465699a0", "result": "You are given a grid of numbers. Two people start at opposite corners of the grid and must move towards each other, following specific rules.  They can only move to adjacent cells (up, down, left, right). At a specific cell, they will meet and then continue their path. The goal is to find the path that maximizes the sum of the numbers they encounter."}]}