{"uid": "43-D", "url": "https://codeforces.com/contest/43/problem/D", "tags": ["brute force", " constructive algorithms", " implementation"], "title": "43-D", "statement": "D. Journeytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe territory of Berland is represented by a rectangular fieldn×min size. The king of Berland lives in the capital, located on the upper left square(1, 1). The lower right square has coordinates(n,m). One day the king decided to travel through the whole country and return back to the capital, having visited every square (except the capital) exactly one time. The king must visit the capital exactly two times, at the very beginning and at the very end of his journey. The king can only move to the side-neighboring squares. However, the royal advise said that the King possibly will not be able to do it. But there is a way out — one can build the system of one way teleporters between some squares so that the king could fulfill his plan. No more than one teleporter can be installed on one square, every teleporter can be used any number of times, however every time it is used, it transports to the same given for any single teleporter square. When the king reaches a square with an installed teleporter he chooses himself whether he is or is not going to use the teleport. What minimum number of teleporters should be installed for the king to complete the journey? You should also compose the journey path route for the king.InputThe first line contains two space-separated integersnandm(1 ≤n,m≤ 100, 2 ≤n·m) — the field size. The upper left square has coordinates(1, 1), and the lower right square has coordinates of(n,m).OutputOn the first line output integerk— the minimum number of teleporters. Then outputklines each containing 4 integersx1y1x2y2(1 ≤x1,x2≤n, 1 ≤y1,y2≤m) — the coordinates of the square where the teleporter is installed (x1,y1), and the coordinates of the square where the teleporter leads (x2,y2).Then printnm+ 1lines containing 2 numbers each — the coordinates of the squares in the order in which they are visited by the king. The travel path must start and end at(1, 1). The king can move to side-neighboring squares and to the squares where a teleporter leads. Besides, he also should visit the capital exactly two times and he should visit other squares exactly one time.ExamplesInput2 2Output01 11 22 22 11 1Input3 3Output13 3 1 11 11 21 32 32 22 13 13 23 31 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d004458c", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$.  The top-left corner is cell $(1,1)$ and the bottom-right corner is $(n,m)$.\n\nYou need to find the minimum number of \"teleporters\" you need to place on the grid to allow a path that visits every cell exactly once (except the starting/ending cell), starting and ending at $(1,1)$.\n\n* Teleporters can only be placed on one cell each.\n* A teleporter allows you to instantly travel to a different cell.\n* You can use a teleporter any number of times.\n\nOutput:\n\n1. The minimum number of teleporters needed.\n2. For each teleporter, output the coordinates of the cell it is placed in and the cell it teleports to.\n3. Output the path the traveler takes through the grid, starting and ending at $(1,1)$."}, {"prompt_md5": "9359a54e", "template_md5": "465699a0", "result": "You are given a rectangular grid.  You need to find the minimum number of teleporters needed to create a path that visits every square on the grid exactly once, starting and ending at the top-left corner. Teleporters can only connect two squares, and you can use them any number of times."}]}