{"uid": "43-E", "url": "https://codeforces.com/contest/43/problem/E", "tags": ["brute force", " implementation", " two pointers"], "title": "43-E", "statement": "E. Racetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTodayskilometer long auto race takes place in Berland. The track is represented by a straight line as long asskilometers. There arencars taking part in the race, all of them start simultaneously at the very beginning of the track. For every car is known its behavior — the system of segments on each of which the speed of the car is constant. Thej-th segment of thei-th car is pair(vi,j,ti,j), wherevi,jis the car's speed on the whole segment in kilometers per hour andti,jis for how many hours the car had been driving at that speed. The segments are given in the order in which they are \"being driven on\" by the cars.Your task is to find out how many times during the race some car managed to have a lead over another car. A lead is considered a situation when one car appears in front of another car. It is known, that all the leads happen instantly, i. e. there are no such time segment of positive length, during which some two cars drive \"together\". At one moment of time on one and the same point several leads may appear. In this case all of them should be taken individually. Meetings of cars at the start and finish are not considered to be counted as leads.InputThe first line contains two integersnands(2 ≤n≤ 100, 1 ≤s≤ 106) — the number of cars and the length of the track in kilometers. Then follownlines — the description of the system of segments for each car. Every description starts with integerk(1 ≤k≤ 100) — the number of segments in the system. Thenkspace-separated pairs of integers are written. Each pair is the speed and time of the segment. These integers are positive and don't exceed 1000. It is guaranteed, that the sum of lengths of all segments (in kilometers) for each car equals tos; and all the leads happen instantly.OutputPrint the single number — the number of times some car managed to take the lead over another car during the race.ExamplesInput2 332 5 1 2 141 3 11Output1Input2 332 1 3 10 31 11 3Output0Input5 332 1 3 3 101 11 32 5 3 3 62 3 1 10 32 6 3 3 5Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a246a301", "template_md5": "35d339e4", "result": "There is a race on a straight track that is $s$ kilometers long.  $n$ cars are racing. Each car has a set of segments, where each segment has a constant speed ($v_{i,j}$) and a duration ($t_{i,j}$).  \n\nYou need to determine how many times during the race one car is ahead of another car.  A lead happens instantly, meaning cars don't drive side-by-side.  \n\n**Input:**\n\n* The first line contains two integers, $n$ (the number of cars) and $s$ (the length of the track).\n* For each car, the next line contains an integer $k$ (the number of segments for that car).\n* Then, $k$ space-separated pairs of integers are given, representing the speed and time for each segment of that car.\n\n**Output:**\n\n* Print a single integer representing the number of times a lead occurs during the race."}, {"prompt_md5": "b77aab6a", "template_md5": "465699a0", "result": "You have multiple cars racing on a track. Each car has a series of speed changes (speed for a certain amount of time).  Determine how many times one car is ahead of another car during the race."}]}