{"uid": "430-B", "url": "https://codeforces.com/contest/430/problem/B", "tags": ["brute force", " two pointers"], "title": "430-B", "statement": "B. Balls Gametime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIahub is training for the IOI. What is a better way to train than playing a Zuma-like game?There arenballs put in a row. Each ball is colored in one ofkcolors. Initially the row doesn't contain three or more contiguous balls with the same color. Iahub has a single ball of colorx. He can insert his ball at any position in the row (probably, between two other balls). If at any moment there are three or more contiguous balls of the same color in the row, they are destroyed immediately. This rule is applied multiple times, until there are no more sets of 3 or more contiguous balls of the same color.For example, if Iahub has the row of balls [black, black, white, white, black, black] and a white ball, he can insert the ball between two white balls. Thus three white balls are destroyed, and then four black balls become contiguous, so all four balls are destroyed. The row will not contain any ball in the end, so Iahub can destroy all 6 balls.Iahub wants to destroy as many balls as possible. You are given the description of the row of balls, and the color of Iahub's ball. Help Iahub train for the IOI by telling him the maximum number of balls from the row he can destroy.InputThe first line of input contains three integers:n(1 ≤n≤ 100),k(1 ≤k≤ 100) andx(1 ≤x≤k). The next line containsnspace-separated integersc1,c2, ...,cn(1 ≤ci≤k). Numbercimeans that thei-th ball in the row has colorci.It is guaranteed that the initial row of balls will never contain three or more contiguous balls of the same color.OutputPrint a single integer — the maximum number of balls Iahub can destroy.ExamplesInput6 2 21 1 2 2 1 1Output6Input1 1 11Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7989be70", "template_md5": "35d339e4", "result": "You are given a row of $n$ balls, each with a color from 1 to $k$.  The balls are initially arranged so that no three consecutive balls have the same color. You also have one ball of a specific color $x$. You can insert your ball into any position in the row.  \n\nWhen you insert your ball, if three or more consecutive balls have the same color, they are removed from the row. This process repeats until no more sets of three or more consecutive balls of the same color exist.\n\nWhat is the maximum number of balls you can remove from the row?"}, {"prompt_md5": "e7296bcd", "template_md5": "465699a0", "result": "You are given a line of colored balls. You have one ball of a specific color. You can insert your ball into any space between existing balls.  When three or more balls of the same color are next to each other, they disappear.  What is the maximum number of balls you can make disappear?"}]}