{"uid": "431-E", "url": "https://codeforces.com/contest/431/problem/E", "tags": ["binary search", " data structures", " ternary search"], "title": "431-E", "statement": "E. Chemistry Experimenttime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day two students, Grisha and Diana, found themselves in the university chemistry lab. In the lab the students foundntest tubes with mercury numbered from1tonand decided to conduct an experiment.The experiment consists ofqsteps. On each step, one of the following actions occurs:Diana pours all the contents from tube numberpiand then pours there exactlyxiliters of mercury.Let's consider all the ways to addviliters of water into the tubes; for each way let's count the volumeof liquid(water and mercury) in the tubewith waterwith maximum amount of liquid; finally let's find the minimum among counted maximums. That is the number the students want to count. At that, the students don't actually pour the mercury. They perform calculations without changing the contents of the tubes.Unfortunately, the calculations proved to be too complex and the students asked you to help them. Help them conduct the described experiment.InputThe first line contains two integersnandq(1 ≤n,q≤ 105) — the number of tubes ans the number of experiment steps. The next line containsnspace-separated integers:h1,h2, ...,hn(0 ≤hi≤ 109), wherehiis the volume of mercury in theі-th tube at the beginning of the experiment.The nextqlines contain the game actions in the following format:A line of form \"1pixi\" means an action of the first type (1 ≤pi≤n; 0 ≤xi≤ 109).A line of form \"2vi\" means an action of the second type (1 ≤vi≤ 1015).It is guaranteed that there is at least one action of the second type. It is guaranteed that all numbers that describe the experiment are integers.OutputFor each action of the second type print the calculated value. The answer will be considered correct if its relative or absolute error doesn't exceed10- 4.ExamplesInput3 31 2 02 21 2 12 3Output1.500001.66667Input4 51 3 0 12 32 11 3 22 32 4Output1.666671.000002.333332.66667", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ca2b9eb1", "template_md5": "35d339e4", "result": "There are $n$ test tubes, each containing an initial amount of mercury.  There are $q$ operations to be performed. Each operation is one of two types:\n\n* **Type 1:** Pour $x$ liters of mercury into tube number $p$.\n* **Type 2:**  Calculate the minimum maximum volume of liquid (water and mercury) in any tube after adding $v$ liters of water to the tubes in all possible ways.\n\nFor each Type 2 operation, output the calculated minimum maximum volume. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $q$ (1 ≤ $n$, $q$ ≤ 10⁵), representing the number of tubes and the number of operations.\n* The second line contains $n$ space-separated integers, $h_1$, $h_2$, ..., $h_n$ (0 ≤ $h_i$ ≤ 10⁹), representing the initial volume of mercury in each tube.\n* The following $q$ lines describe the operations. Each line is in one of the following formats:\n    * \"1 $p$ $x$\":  A Type 1 operation.\n    * \"2 $v$\": A Type 2 operation.\n\n**Output:**\n\nFor each Type 2 operation, output the calculated minimum maximum volume."}, {"prompt_md5": "fcc6d2be", "template_md5": "465699a0", "result": "You are given a set of containers with initial amounts of liquid.  You will be given a series of actions:\n\n* **Type 1:**  Take liquid from a specific container and add a given amount.\n* **Type 2:**  Find the maximum amount of liquid in any container after performing a series of actions (of either type) and output that maximum. \n\n\nYou need to determine the maximum liquid amount for each Type 2 action."}]}