{"uid": "431-C", "url": "https://codeforces.com/contest/431/problem/C", "tags": ["dp", " implementation", " trees"], "title": "431-C", "statement": "C. k-Treetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutQuite recently a creative student Lesha had a lecture on trees. After the lecture Lesha was inspired and came up with the tree of his own which he called ak-tree.Ak-tree is an infinite rooted tree where:each vertex has exactlykchildren;each edge has some weight;if we look at the edges that goes from some vertex to its children (exactlykedges), then their weights will equal1, 2, 3, ...,k.The picture below shows a part of a 3-tree.As soon as Dima, a good friend of Lesha, found out about the tree, he immediately wondered: \"How many paths of total weightn(the sum of all weights of the edges in the path) are there, starting from the root of ak-tree and also containing at least one edge of weight at leastd?\".Help Dima find an answer to his question. As the number of ways can be rather large, print it modulo1000000007(109+ 7).InputA single line contains three space-separated integers:n,kandd(1 ≤n,k≤ 100;1 ≤d≤k).OutputPrint a single integer — the answer to the problem modulo1000000007(109+ 7).ExamplesInput3 3 2Output3Input3 3 3Output1Input4 3 2Output6Input4 5 2Output7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3cfa4c90", "template_md5": "35d339e4", "result": "You are given a special type of tree called a k-tree. In a k-tree:\n\n* Each node has exactly *k* children.\n* Each edge has a weight, and the weights of the edges going from a node to its children are consecutive numbers from 1 to *k*.\n\nYou need to find the number of paths starting from the root of the k-tree that have a total weight of *n* and contain at least one edge with a weight of at least *d*.  \n\nPrint the answer modulo 1000000007 ($10^9 + 7$). \n\n**Input:**\n\nThree integers: *n*, *k*, and *d*\n\n**Output:**\n\nA single integer representing the number of paths."}, {"prompt_md5": "b288e100", "template_md5": "465699a0", "result": "You have a special tree where each node has the same number of children.  Each edge has a weight from 1 to the number of children.  Find the number of paths from the root to any node that have a total weight of a given number and include at least one edge with a weight of a given minimum value.  The answer should be the number of paths modulo 1000000007."}]}