{"uid": "432-C", "url": "https://codeforces.com/contest/432/problem/C", "tags": ["greedy", " sortings"], "title": "432-C", "statement": "C. Prime Swapstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou have an arraya[1],a[2], ...,a[n], containing distinct integers from1ton. Your task is to sort this array in increasing order with the following operation (you may need to apply it multiple times):choose two indexes,iandj(1 ≤i<j≤n;(j-i+ 1)is a prime number);swap the elements on positionsiandj; in other words, you are allowed to apply the following sequence of assignments:tmp=a[i],a[i] =a[j],a[j] =tmp(tmpis a temporary variable).You do not need to minimize the number of used operations. However, you need to make sure that there are at most5noperations.InputThe first line contains integern(1 ≤n≤ 105). The next line containsndistinct integersa[1],a[2], ...,a[n](1 ≤a[i] ≤n).OutputIn the first line, print integerk(0 ≤k≤ 5n)— the number of used operations. Next, print the operations. Each operation must be printed as \"ij\" (1 ≤i<j≤n;(j-i+ 1)is a prime).If there are multiple answers, you can print any of them.ExamplesInput33 2 1Output11 3Input21 2Output0Input44 2 3 1Output32 41 22 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2cceadfb", "template_md5": "35d339e4", "result": "You are given an array of $n$ distinct integers from 1 to $n$. Your task is to sort the array in increasing order using the following operation at most 5 times:\n\n1. Choose two indices $i$ and $j$ where $1 \\le i < j \\le n$ and $(j-i+1)$ is a prime number.\n2. Swap the elements at positions $i$ and $j$.\n\nOutput the number of operations used and the sequence of operations performed."}, {"prompt_md5": "34c4dd51", "template_md5": "465699a0", "result": "You are given a list of distinct numbers. You can swap any two numbers in the list if the difference between their positions is a prime number.  You need to sort the list in ascending order using at most 5 swaps. Output the number of swaps used and the pairs of numbers swapped."}]}