{"uid": "432-A", "url": "https://codeforces.com/contest/432/problem/A", "tags": ["greedy", " implementation", " sortings"], "title": "432-A", "statement": "A. Choosing Teamstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe Saratov State University Olympiad Programmers Training Center (SSU OPTC) hasnstudents. For each student you know the number of times he/she has participated in the ACM ICPC world programming championship. According to the ACM ICPC rules, each person can participate in the world championship at most 5 times.The head of the SSU OPTC is recently gathering teams to participate in the world championship. Each team must consist of exactly three people, at that, any person cannot be a member of two or more teams. What maximum number of teams can the head make if he wants each team to participate in the world championship with the same members at leastktimes?InputThe first line contains two integers,nandk(1 ≤n≤ 2000; 1 ≤k≤ 5). The next line containsnintegers:y1,y2, ...,yn(0 ≤yi≤ 5), whereyishows the number of times thei-th person participated in the ACM ICPC world championship.OutputPrint a single number — the answer to the problem.ExamplesInput5 20 4 5 1 0Output1Input6 40 1 2 3 4 5Output0Input6 50 0 0 0 0 0Output2NoteIn the first sample only one team could be made: the first, the fourth and the fifth participants.In the second sample no teams could be created.In the third sample two teams could be created. Any partition into two teams fits.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "12d9ee85", "template_md5": "35d339e4", "result": "You are given $n$ people, each having participated in a competition a certain number of times.  The number of times the $i$-th person participated is given by $y_i$ (where $0 \\le y_i \\le 5$).\n\nYou need to form teams of 3 people each.  Each person can only be on one team.  \n\nWhat is the maximum number of teams you can form if each team must have members who have all participated in the competition at least $k$ times? \n\n\nLet me know if you'd like help with the solution as well!"}, {"prompt_md5": "c3416358", "template_md5": "465699a0", "result": "You have a group of people. Each person has participated in a competition a certain number of times.  You need to form teams of 3 people.  Each team must have members who have participated in the competition at least a given number of times. What is the maximum number of teams you can form?"}]}