{"uid": "432-B", "url": "https://codeforces.com/contest/432/problem/B", "tags": ["brute force", " greedy", " implementation"], "title": "432-B", "statement": "B. Football Kittime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutConsider a football tournament wherenteams participate. Each team has two football kits: for home games, and for away games. The kit for home games of thei-th team has colorxiand the kit for away games of this team has coloryi(xi≠yi).In the tournament, each team plays exactly one home game and exactly one away game with each other team (n(n- 1)games in total). The team, that plays the home game, traditionally plays in its home kit. The team that plays an away game plays in its away kit. However, if two teams has the kits of the same color, they cannot be distinguished. In this case the away team plays in its home kit.Calculate how many games in the described tournament each team plays in its home kit and how many games it plays in its away kit.InputThe first line contains a single integern(2 ≤n≤ 105)— the number of teams. Nextnlines contain the description of the teams. Thei-th line contains two space-separated numbersxi,yi(1 ≤xi,yi≤ 105;xi≠yi)— the color numbers for the home and away kits of thei-th team.OutputFor each team, print on a single line two space-separated integers — the number of games this team is going to play in home and away kits, correspondingly. Print the answers for the teams in the order they appeared in the input.ExamplesInput21 22 1Output2 02 0Input31 22 11 3Output3 14 02 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0caf38c8", "template_md5": "35d339e4", "result": "There are $n$ teams participating in a football tournament. Each team has two different colored football kits: a home kit and an away kit. The $i$-th team's home kit has color $x_i$ and its away kit has color $y_i$ ($x_i \\neq y_i$).\n\nEach team plays one home game and one away game against every other team. The team playing at home wears their home kit, and the team playing away wears their away kit. However, if two teams have the same kit color, the away team must wear their home kit to avoid confusion.\n\nDetermine how many games each team will play in their home kit and how many games they will play in their away kit.\n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 10⁵) representing the number of teams.\n* The next $n$ lines each contain two space-separated integers, $x_i$ and $y_i$ (1 ≤ $x_i$, $y_i$ ≤ 10⁵; $x_i \\neq y_i$), representing the home and away kit colors for the $i$-th team.\n\n**Output:**\n\nFor each team, print two space-separated integers on a single line: the number of games played in their home kit and the number of games played in their away kit. Print the answers in the same order as the teams appeared in the input."}, {"prompt_md5": "a1f33cf2", "template_md5": "465699a0", "result": "You are given a list of teams, each with two different colored uniforms.  Each team plays one home game and one away game against every other team. If two teams have the same uniform color, the away team wears their home uniform.  Count how many home and away games each team plays."}]}