{"uid": "432-E", "url": "https://codeforces.com/contest/432/problem/E", "tags": ["constructive algorithms", " greedy"], "title": "432-E", "statement": "E. Square Tilingtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou have ann×mrectangle table, its cells are not initially painted. Your task is to paint all cells of the table. The resulting picture should be a tiling of the table with squares. More formally:each cell must be painted some color (the colors are marked by uppercase Latin letters);we will assume that two cells of the table are connected if they are of the same color and share a side; each connected region of the table must form a square.Givennandm, find lexicographically minimum coloring of the table that meets the described properties.InputThe first line contains two integers,nandm(1 ≤n,m≤ 100).OutputPrint lexicographically minimum coloring of the table that meets the described conditions.One coloring (let's call it X) is considered lexicographically less than the other one (let's call it Y), if:consider all the table cells from left to right and from top to bottom (first, the first cell in the first row, then the second cell in the first row and so on);let's find in this order the first cell that has distinct colors in two colorings;the letter that marks the color of the cell in X, goes alphabetically before the letter that marks the color of the cell in Y.ExamplesInput1 3OutputABAInput2 2OutputAAAAInput3 4OutputAAABAAACAAAB", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a005927b", "template_md5": "35d339e4", "result": "You are given a rectangle with $n$ rows and $m$ columns.  You need to color each cell of the rectangle with a letter from A to Z. The coloring must follow these rules:\n\n* **Connected cells must be the same color:** If two cells share a side, they must have the same color.\n* **Connected cells form squares:**  All connected cells of the same color must form a square.\n\nFind the lexicographically smallest possible coloring that follows these rules.  \n\n**Lexicographically smallest** means that if you compare two colorings, you look at the cells one by one from left to right and top to bottom. The first cell where the colors are different determines which coloring is smaller. The color that comes earlier in the alphabet is considered smaller."}, {"prompt_md5": "6809325d", "template_md5": "465699a0", "result": "You are given a rectangular grid.  You need to color each cell of the grid with a letter.  The colors must form squares, meaning connected cells must all have the same color. Find the lexicographically smallest way to color the grid."}]}