{"uid": "433-C", "url": "https://codeforces.com/contest/433/problem/C", "tags": ["implementation", " math", " sortings"], "title": "433-C", "statement": "C. Ryouko's Memory Notetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutRyouko is an extremely forgetful girl, she could even forget something that has just happened. So in order to remember, she takes a notebook with her, calledRyouko's Memory Note. She writes what she sees and what she hears on the notebook, and the notebook became her memory.Though Ryouko is forgetful, she is also born with superb analyzing abilities. However, analyzing depends greatly on gathered information, in other words, memory. So she has to shuffle through her notebook whenever she needs to analyze, which is tough work.Ryouko's notebook consists ofnpages, numbered from 1 ton. To make life (and this problem) easier, we consider that to turn from pagexto pagey,|x-y|pages should be turned. During analyzing, Ryouko needsmpieces of information, thei-th piece of information is on pageai. Information must be read from the notebook in order, so the total number of pages that Ryouko needs to turn is.Ryouko wants to decrease the number of pages that need to be turned. In order to achieve this, she can merge two pages of her notebook. If Ryouko merges pagexto pagey, she would copy all the information on pagextoy(1 ≤x,y≤n), and consequently, all elements in sequenceathat wasxwould becomey. Note thatxcan be equal toy, in which case no changes take place.Please tell Ryouko the minimum number of pages that she needs to turn. Note she can apply the described operation at most once before the reading. Note that the answer can exceed 32-bit integers.InputThe first line of input contains two integersnandm(1 ≤n,m≤ 105).The next line containsmintegers separated by spaces:a1,a2, ...,am(1 ≤ai≤n).OutputPrint a single integer — the minimum number of pages Ryouko needs to turn.ExamplesInput4 61 2 3 4 3 2Output3Input10 59 4 3 8 8Output6NoteIn the first sample, the optimal solution is to merge page 4 to 3, after merging sequenceabecomes{1, 2, 3, 3, 3, 2}, so the number of pages Ryouko needs to turn is|1 - 2| + |2 - 3| + |3 - 3| + |3 - 3| + |3 - 2| = 3.In the second sample, optimal solution is achieved by merging page 9 to 4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac3fbb8b", "template_md5": "35d339e4", "result": "You are given a notebook with $n$ pages numbered from 1 to $n$.  You need to read $m$ pieces of information located on pages $a_1, a_2, ..., a_m$.  \n\nYou can merge any two pages of the notebook into a single page.  For example, merging page $x$ and page $y$ means copying all the information on page $x$ to page $y$.  After merging, all elements in the sequence that was originally on page $x$ become page $y$.\n\nFind the minimum number of pages you need to turn to read all $m$ pieces of information, considering you can perform at most one merge operation before reading."}, {"prompt_md5": "4a848ee9", "template_md5": "465699a0", "result": "You have a list of numbers representing items on pages of a book. You need to find the minimum number of pages you need to turn to read a specific set of items from the list. You can merge two pages together, which means combining all the items on those pages into one. You can only merge pages once."}]}