{"uid": "433-B", "url": "https://codeforces.com/contest/433/problem/B", "tags": ["dp", " implementation", " sortings"], "title": "433-B", "statement": "B. Kuriyama Mirai's Stonestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutKuriyama Mirai has killed many monsters and got many (namelyn) stones. She numbers the stones from1ton. The cost of thei-th stone isvi. Kuriyama Mirai wants to know something about these stones so she will ask you two kinds of questions:She will tell you two numbers,landr(1 ≤l≤r≤n), and you should tell her.Letuibe the cost of thei-th cheapest stone (the cost that will be on thei-th place if we arrange all the stone costs in non-decreasing order). This time she will tell you two numbers,landr(1 ≤l≤r≤n), and you should tell her.For every question you should give the correct answer, or Kuriyama Mirai will say \"fuyukai desu\" and then become unhappy.InputThe first line contains an integern(1 ≤n≤ 105). The second line containsnintegers:v1,v2, ...,vn(1 ≤vi≤ 109)— costs of the stones.The third line contains an integerm(1 ≤m≤ 105)— the number of Kuriyama Mirai's questions. Then followmlines, each line contains three integerstype,landr(1 ≤l≤r≤n; 1 ≤type≤ 2), describing a question. Iftypeequal to1, then you should output the answer for the first question, else you should output the answer for the second one.OutputPrintmlines. Each line must contain an integer — the answer to Kuriyama Mirai's question. Print the answers to the questions in the order of input.ExamplesInput66 4 2 7 2 732 3 61 3 41 1 6Output24928Input45 5 2 3101 2 42 1 41 1 12 1 42 1 21 1 11 3 31 1 31 4 41 2 2Output10155155521235NotePlease note that the answers to the questions may overflow 32-bit integer type.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b24ac5ac", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, representing the cost of $n$ stones. You need to answer $m$ queries. \n\nEach query is one of two types:\n\n* **Type 1:** Given two integers $l$ and $r$ ($1 \\le l \\le r \\le n$), find the cost of the $l$-th cheapest stone in the subarray from index $l$ to $r$.\n* **Type 2:** Given two integers $l$ and $r$ ($1 \\le l \\le r \\le n$), find the cost of the $r$-th cheapest stone in the subarray from index $l$ to $r$.\n\nFor each query, output the corresponding cost."}, {"prompt_md5": "ddee802a", "template_md5": "465699a0", "result": "You are given a list of numbers representing the cost of items. You will be asked questions about the cost of the cheapest items within a given range. For each question, output the cost of the specified cheapest item within the range."}]}