{"uid": "434-E", "url": "https://codeforces.com/contest/434/problem/E", "tags": ["binary search", " divide and conquer", " sortings", " trees"], "title": "434-E", "statement": "E. Furukawa Nagisa's Treetime limit per test2 secondsmemory limit per test512 megabytesinputstdinoutputstdoutOne day, Okazaki Tomoya has bought a tree for Furukawa Nagisa's birthday. The tree is so strange that every node of the tree has a value. The value of thei-th node isvi. Now Furukawa Nagisa and Okazaki Tomoya want to play a game on the tree.Let(s,e)be the path from nodesto nodee, we can write down the sequence of the values of nodes on path(s,e), and denote this sequence asS(s,e). We define the value of the sequenceG(S(s,e))as follows. Suppose that the sequence isz0,z1...zl- 1, wherelis the length of the sequence. We defineG(S(s,e)) =z0×k0+z1×k1+ ... +zl- 1×kl- 1. If the path(s,e)satisfies, then the path(s,e)belongs to Furukawa Nagisa, otherwise it belongs to Okazaki Tomoya.Calculating who has more paths is too easy, so they want to play something more difficult. Furukawa Nagisa thinks that if paths(p1,p2)and(p2,p3)belong to her, then path(p1,p3)belongs to her as well. Also, she thinks that if paths(p1,p2)and(p2,p3)belong to Okazaki Tomoya, then path(p1,p3)belongs to Okazaki Tomoya as well. But in fact, this conclusion isn't always right. So now Furukawa Nagisa wants to know how many triplets(p1,p2,p3)are correct for the conclusion, and this is your task.InputThe first line contains four integersn,y,kandx(1 ≤n≤ 105; 2 ≤y≤ 109; 1 ≤k<y; 0 ≤x<y)—nbeing the number of nodes on the tree. It is guaranteed thatyis a prime number.The second line containsnintegers, thei-th integer isvi(0 ≤vi<y).Then follown- 1lines, each line contains two integers, denoting an edge of the tree. The nodes of the tree are numbered from 1 ton.OutputOutput a single integer — the number of triplets that are correct for Furukawa Nagisa's conclusion.ExamplesInput1 2 1 01Output1Input3 5 2 14 3 11 22 3Output14Input8 13 8 120 12 7 4 12 0 8 121 88 44 66 22 38 52 7Output341", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f804b7ca", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, each node having a value $v_i$ between 0 and $y-1$.  $y$ is a prime number.  \n\nThe tree is defined by $n-1$ edges, where each edge connects two nodes.\n\nA path from node $s$ to node $e$ is defined as $S(s,e)$. The value of a path $S(s,e)$ is calculated as:\n\n$$G(S(s,e)) = v_0 \\cdot k_0 + v_1 \\cdot k_1 + ... + v_{l-1} \\cdot k_{l-1}$$\n\nwhere $l$ is the length of the path and $k_i$ are some fixed constants.\n\nThe problem asks you to find the number of triplets $(p_1, p_2, p_3)$ where:\n\n* If paths $(p_1, p_2)$ and $(p_2, p_3)$ belong to a specific person, then path $(p_1, p_3)$ also belongs to that person.\n\nYou need to determine how many triplets satisfy this condition. \n\n\n\nLet me know if you need further clarification on any part of the problem."}, {"prompt_md5": "ea3c5759", "template_md5": "465699a0", "result": "You are given a tree with nodes, each having a value.  Two players take turns selecting paths between nodes based on a rule involving the values of the nodes on the path. The goal is to count how many sets of three nodes form a valid path sequence where the rule applies."}]}