{"uid": "435-A", "url": "https://codeforces.com/contest/435/problem/A", "tags": ["implementation"], "title": "435-A", "statement": "A. Queue on Bus Stoptime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIt's that time of the year when the Russians flood their countryside summer cottages (dachas) and the bus stop has a lot of people. People rarely go to the dacha on their own, it's usually a group, so the people stand in queue by groups.The bus stop queue hasngroups of people. Thei-th group from the beginning hasaipeople. Every30minutes an empty bus arrives at the bus stop, it can carry at mostmpeople. Naturally, the people from the first group enter the bus first. Then go the people from the second group and so on. Note that the order of groups in the queue never changes. Moreover, if some group cannot fit all of its members into the current bus, it waits for the next bus together with other groups standing after it in the queue.Your task is to determine how many buses is needed to transport allngroups to the dacha countryside.InputThe first line contains two integersnandm(1 ≤n,m≤ 100). The next line containsnintegers:a1,a2, ...,an(1 ≤ai≤m).OutputPrint a single integer — the number of buses that is needed to transport allngroups to the dacha countryside.ExamplesInput4 32 3 2 1Output3Input3 41 2 1Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "afb06956", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $m$.  $n$ represents the number of groups of people waiting at a bus stop, and $m$ represents the maximum capacity of each bus.  \n\nEach group has a size represented by an integer $a_i$, where $1 \\le i \\le n$.  Buses arrive every 30 minutes and can carry up to $m$ people. People board the bus in the order of their groups. If a group is too large to fit on a single bus, they wait for the next bus.\n\nDetermine the minimum number of buses required to transport all $n$ groups to their destination."}, {"prompt_md5": "509079e6", "template_md5": "465699a0", "result": "You have a line of groups of people waiting for a bus. Each group has a different number of people. The bus can hold a maximum number of people.  Determine the minimum number of buses needed to transport all the people."}]}