{"uid": "436-A", "url": "https://codeforces.com/contest/436/problem/A", "tags": ["greedy"], "title": "436-A", "statement": "A. Feed with Candytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe hero of the Cut the Rope game is a little monster named Om Nom. He loves candies. And what a coincidence! He also is the hero of today's problem.One day, Om Nom visited his friend Evan. Evan hasncandies of two types (fruit drops and caramel drops), thei-th candy hangs at the height ofhicentimeters above the floor of the house, its mass ismi. Om Nom wants to eat as many candies as possible. At the beginning Om Nom can make at mostxcentimeter high jumps. When Om Nom eats a candy of massy, he gets stronger and the height of his jump increases byycentimeters.What maximum number of candies can Om Nom eat if he never eats two candies of the same type in a row (Om Nom finds it too boring)?InputThe first line contains two integers,nandx(1 ≤n,x≤ 2000)— the number of sweets Evan has and the initial height of Om Nom's jump.Each of the followingnlines contains three integersti,hi,mi(0 ≤ti≤ 1; 1 ≤hi,mi≤ 2000)— the type, height and the mass of thei-th candy. If numbertiequals 0, then the current candy is a caramel drop, otherwise it is a fruit drop.OutputPrint a single integer — the maximum number of candies Om Nom can eat.ExamplesInput5 30 2 41 3 10 8 30 20 101 5 5Output4NoteOne of the possible ways to eat4candies is to eat them in the order:1,5,3,2. Let's assume the following scenario:Initially, the height of Om Nom's jump equals3. He can reach candies1and2. Let's assume that he eats candy1. As the mass of this candy equals4, the height of his jump will rise to3 + 4 = 7.Now Om Nom can reach candies2and5. Let's assume that he eats candy5. Then the height of his jump will be7 + 5 = 12.At this moment, Om Nom can reach two candies,2and3. He won't eat candy2as its type matches the type of the previously eaten candy. Om Nom eats candy3, the height of his jump is12 + 3 = 15.Om Nom eats candy2, the height of his jump is15 + 1 = 16. He cannot reach candy4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "57203b0c", "template_md5": "35d339e4", "result": "You are given a list of $n$ candies, each with a height $h_i$ and a mass $m_i$.  The candies come in two types: 0 for caramel and 1 for fruit.  \n\nYou start with a jump height of $x$.  After eating a candy of mass $m_i$, your jump height increases by $m_i$.  \n\nYou want to eat as many candies as possible, but you cannot eat two candies of the same type in a row.\n\nWhat is the maximum number of candies you can eat?"}, {"prompt_md5": "70c45c91", "template_md5": "465699a0", "result": "You have a list of candies at different heights. Each candy has a weight. You can jump a certain height initially, and your jump height increases by the weight of each candy you eat. You cannot eat two candies of the same type in a row. Find the maximum number of candies you can eat."}]}