{"uid": "436-D", "url": "https://codeforces.com/contest/436/problem/D", "tags": ["dp"], "title": "436-D", "statement": "D. Pudding Monsterstime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutHave you ever played Pudding Monsters? In this task, a simplified one-dimensional model of this game is used.Imagine an infinite checkered stripe, the cells of which are numbered sequentially with integers. Some cells of the strip have monsters, other cells of the strip are empty. All monsters are made of pudding, so if there are two monsters in the neighboring cells, they stick to each other (literally). Similarly, if several monsters are on consecutive cells, they all stick together in one block of monsters. We will call the stuck together monsters a block of monsters. A detached monster, not stuck to anyone else, is also considered a block.In one move, the player can take any block of monsters and with a movement of his hand throw it to the left or to the right. The selected monsters will slide on until they hit some other monster (or a block of monsters).For example, if a strip has three monsters in cells1,4and5, then there are only four possible moves: to send a monster in cell1to minus infinity, send the block of monsters in cells4and5to plus infinity, throw monster1to the right (it will stop in cell3), throw a block of monsters in cells4and5to the left (they will stop in cells2and3).Some cells on the strip are marked with stars. These are the special cells. The goal of the game is to make the largest possible number of special cells have monsters on them.You are given the numbers of the special cells on a strip as well as the initial position of all monsters. What is the maximum number of special cells that will contain monsters in the optimal game?InputThe first line contains two integersnandm(1 ≤n≤ 105; 1 ≤m≤ 2000)— the number of monsters on the strip and the number of special cells.The second line containsndistinct integers — the numbers of the cells with monsters, then the third line containsmdistinct integers — the numbers of the special cells. It is guaranteed that all the numbers of the cells are positive integers not exceeding2·105.OutputPrint a single integer — the maximum number of special cells that will contain monsters in the optimal game.ExamplesInput3 21 3 52 4Output2Input4 21 3 4 62 5Output2Input4 21 8 4 57 2Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5b7ca4cf", "template_md5": "35d339e4", "result": "You are given a line of cells numbered 1, 2, 3,... . Some cells contain monsters, and some are empty. Monsters next to each other stick together to form blocks.\n\nYou can move any block of monsters to the left or right until it hits another monster or block.\n\nSome cells are marked as special. The goal is to move the monsters so that the maximum number of special cells have a monster in them.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n \\le 10^5$, $1 \\le m \\le 2000$): the number of monsters and the number of special cells.\n* The second line contains $n$ distinct integers: the cell numbers where monsters are located.\n* The third line contains $m$ distinct integers: the cell numbers of the special cells.\n\n**Output:**\n\n* Print a single integer: the maximum number of special cells that can have a monster in them."}, {"prompt_md5": "b0f1f4a5", "template_md5": "465699a0", "result": "You have a line with numbered positions. Some positions have monsters, and some are special. You can move groups of adjacent monsters left or right until they hit another monster or the edge. The goal is to have as many monsters as possible on the special positions. What is the maximum number of special positions that can have monsters?"}]}