{"uid": "437-C", "url": "https://codeforces.com/contest/437/problem/C", "tags": ["graphs", " greedy", " sortings"], "title": "437-C", "statement": "C. The Child and Toytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOn Children's Day, the child got a toy from Delayyy as a present. However, the child is so naughty that he can't wait to destroy the toy.The toy consists ofnparts andmropes. Each rope links two parts, but every pair of parts is linked by at most one rope. To split the toy, the child must remove all its parts. The child can remove a single part at a time, and each remove consume an energy. Let's define an energy value of partiasvi. The child spendvf1+vf2+ ... +vfkenergy for removing partiwheref1,f2, ...,fkare the parts that are directly connected to thei-th and haven't been removed.Help the child to find out, what is the minimum total energy he should spend to remove allnparts.InputThe first line contains two integersnandm(1 ≤n≤ 1000;0 ≤m≤ 2000). The second line containsnintegers:v1,v2, ...,vn(0 ≤vi≤ 105). Then followedmlines, each line contains two integersxiandyi, representing a rope from partxito partyi(1 ≤xi,yi≤n;xi≠yi).Consider all the parts are numbered from1ton.OutputOutput the minimum total energy the child should spend to remove allnparts of the toy.ExamplesInput4 310 20 30 401 41 22 3Output40Input4 4100 100 100 1001 22 32 43 4Output400Input7 1040 10 20 10 20 80 401 54 74 55 25 76 41 61 34 31 4Output160NoteOne of the optimal sequence of actions in the first sample is:First, remove part3, cost of the action is20.Then, remove part2, cost of the action is10.Next, remove part4, cost of the action is10.At last, remove part1, cost of the action is0.So the total energy the child paid is20 + 10 + 10 + 0 = 40, which is the minimum.In the second sample, the child will spend400no matter in what order he will remove the parts.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ea88c88b", "template_md5": "35d339e4", "result": "You are given a toy made of $n$ parts connected by $m$ ropes. Each rope connects two distinct parts.  Each part has an energy value $v_i$. To destroy the toy, you must remove all $n$ parts.  \n\nRemoving a part costs energy equal to the sum of the energy values of all parts directly connected to it that haven't been removed yet.\n\nFind the minimum total energy required to remove all parts of the toy.\n\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n \\le 1000; 0 \\le m \\le 2000$).\n* The second line contains $n$ integers, $v_1, v_2, ..., v_n$ ($0 \\le v_i \\le 10^5$).\n* The following $m$ lines each contain two integers, $x_i$ and $y_i$ ($1 \\le x_i, y_i \\le n; x_i \\neq y_i$), representing a rope connecting part $x_i$ to part $y_i$.\n\n**Output:**\n\n* Output the minimum total energy required to remove all parts."}, {"prompt_md5": "1da99b51", "template_md5": "465699a0", "result": "You have a structure made of parts connected by ropes. Each part has a value. To dismantle the structure, you must remove each part one by one. The cost to remove a part is the sum of the values of all connected parts that haven't been removed yet. Find the minimum total cost to remove all parts."}]}