{"uid": "437-E", "url": "https://codeforces.com/contest/437/problem/E", "tags": ["dp", " geometry"], "title": "437-E", "statement": "E. The Child and Polygontime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThis time our child has a simple polygon. He has to find the number of ways to split the polygon into non-degenerate triangles, each way must satisfy the following requirements:each vertex of each triangle is one of the polygon vertex;each side of the polygon must be the side of exactly one triangle;the area of intersection of every two triangles equals to zero, and the sum of all areas of triangles equals to the area of the polygon;each triangle must be completely inside the polygon;each side of each triangle must contain exactly two vertices of the polygon.The picture below depicts an example of a correct splitting.Please, help the child. Calculate the described number of ways modulo1000000007(109+  7)for him.InputThe first line contains one integern(3 ≤n≤ 200)— the number of vertices of the polygon. Then follownlines, each line containing two integers. Thei-th line containsxi,yi(|xi|, |yi| ≤ 107)— thei-th vertex of the polygon in clockwise or counterclockwise order.It's guaranteed that the polygon is simple.OutputOutput the number of ways modulo1000000007(109+  7).ExamplesInput40 00 11 11 0Output2Input40 01 00 1-1 0Output1Input50 01 01 10 1-2 -1Output3NoteIn the first sample, there are two possible splittings:In the second sample, there are only one possible splitting:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "843e1f54", "template_md5": "35d339e4", "result": "Given a simple polygon with $n$ vertices, find the number of ways to divide it into non-overlapping triangles such that:\n\n* Each vertex of a triangle is a vertex of the polygon.\n* Each side of the polygon is a side of exactly one triangle.\n* The area of intersection of any two triangles is zero.\n* The sum of the areas of all triangles equals the area of the polygon.\n* Each triangle is entirely inside the polygon.\n\nOutput the number of ways modulo $10^9 + 7$.\n\nInput:\n\nThe first line contains an integer $n$ ($3 \\le n \\le 200$) representing the number of vertices. \nThe following $n$ lines each contain two integers $x_i$ and $y_i$ ($|x_i|, |y_i| \\le 10^7$) representing the coordinates of each vertex in clockwise or counterclockwise order.\n\nOutput:\n\nOutput the number of ways modulo $10^9 + 7$."}, {"prompt_md5": "d13e7a4c", "template_md5": "465699a0", "result": "Given a polygon, find the number of ways to divide it into triangles, where each triangle uses only the polygon's vertices and sides, and the triangles don't overlap.  The total area of all the triangles must equal the area of the original polygon.  Output the count modulo 1000000007."}]}