{"uid": "438-E", "url": "https://codeforces.com/contest/438/problem/E", "tags": ["combinatorics", " divide and conquer", " fft", " number theory"], "title": "438-E", "statement": "E. The Child and Binary Treetime limit per test7 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOur child likes computer science very much, especially he likes binary trees.Consider the sequence ofndistinct positive integers:c1,c2, ...,cn. The child calls a vertex-weighted rooted binary treegoodif and only if for every vertexv, the weight ofvis in the set{c1,c2, ...,cn}. Also our child thinks that theweightof a vertex-weighted tree is the sum of all vertices' weights.Given an integerm, can you for alls(1 ≤s≤m)calculate the number of good vertex-weighted rooted binary trees with weights? Please, check the samples for better understanding what trees are considered different.We only want to know the answer modulo998244353(7 × 17 × 223+ 1, a prime number).InputThe first line contains two integersn,m(1 ≤n≤ 105; 1 ≤m≤ 105). The second line containsnspace-separated pairwise distinct integersc1,c2, ...,cn.(1 ≤ci≤ 105).OutputPrintmlines, each line containing a single integer. Thei-th line must contain the number of good vertex-weighted rooted binary trees whose weight exactly equal toi. Print the answers modulo998244353(7 × 17 × 223+ 1, a prime number).ExamplesInput2 31 2Output139Input3 109 4 3Output00110242615Input5 1013 10 6 4 15Output0001010205NoteIn the first example, there are9good vertex-weighted rooted binary trees whose weight exactly equal to3:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "453a219f", "template_md5": "35d339e4", "result": "You are given a set of $n$ distinct positive integers: $c_1, c_2, ..., c_n$.  \n\nYou need to find, for each integer $s$ from 1 to $m$, the number of rooted binary trees that meet the following conditions:\n\n* Each vertex in the tree has a weight that is one of the integers in the set $c_1, c_2, ..., c_n$.\n* The weight of the tree is equal to $s$ (the sum of the weights of all vertices).\n\nThe answer for each $s$ should be modulo 998244353. \n\n\n\nLet me know if you'd like help with any specific part of the problem or need further clarification!"}, {"prompt_md5": "f05aef39", "template_md5": "465699a0", "result": "Given a set of distinct numbers, find the number of different rooted binary trees you can build using those numbers as weights, where the weight of a tree is the sum of all its node weights.  You need to do this for a range of target weights."}]}