{"uid": "439-A", "url": "https://codeforces.com/contest/439/problem/A", "tags": ["greedy", " implementation"], "title": "439-A", "statement": "A. Devu, the Singer and Churu, the Jokertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDevu is a renowned classical singer. He is invited to many big functions/festivals. Recently he was invited to \"All World Classical Singing Festival\". Other than Devu, comedian Churu was also invited.Devu has provided organizers a list of the songs and required time for singing them. He will singnsongs,ithsong will taketiminutes exactly.The Comedian, Churu will crack jokes. All his jokes are of 5 minutes exactly.People have mainly come to listen Devu. But you know that he needs rest of 10 minutes after each song. On the other hand, Churu being a very active person, doesn't need any rest.You as one of the organizers should make an optimal sсhedule for the event. For some reasons you must follow the conditions:The duration of the event must be no more thandminutes;Devu must complete all his songs;With satisfying the two previous conditions the number of jokes cracked by Churu should be as many as possible.If it is not possible to find a way to conduct all the songs of the Devu, output -1. Otherwise find out maximum number of jokes that Churu can crack in the grand event.InputThe first line contains two space separated integersn,d(1 ≤n≤ 100; 1 ≤d≤ 10000). The second line containsnspace-separated integers:t1,t2, ...,tn(1 ≤ti≤ 100).OutputIf there is no way to conduct all the songs of Devu, output -1. Otherwise output the maximum number of jokes that Churu can crack in the grand event.ExamplesInput3 302 2 1Output5Input3 202 1 1Output-1NoteConsider the first example. The duration of the event is30minutes. There could be maximum5jokes in the following way:First Churu cracks a joke in5minutes.Then Devu performs the first song for2minutes.Then Churu cracks2jokes in10minutes.Now Devu performs second song for2minutes.Then Churu cracks2jokes in10minutes.Now finally Devu will perform his last song in1minutes.Total time spent is5 + 2 + 10 + 2 + 10 + 1 = 30minutes.Consider the second example. There is no way of organizing Devu's all songs. Hence the answer is -1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "06ec570f", "template_md5": "35d339e4", "result": "You are given a list of $n$ songs, each taking $t_i$ minutes to sing.  There is also a comedian who can tell jokes that each take 5 minutes.  \n\nYou need to create a schedule for the event with the following constraints:\n\n* The total event duration must be no more than $d$ minutes.\n* All $n$ songs must be sung.\n* The comedian should tell as many jokes as possible.\n\nIf it's impossible to fit all the songs into the time limit, output -1. Otherwise, output the maximum number of jokes the comedian can tell."}, {"prompt_md5": "9b58e53c", "template_md5": "465699a0", "result": "You are given a list of song durations and a time limit.  You need to fit all the songs into the time limit, allowing for a 10 minute rest after each song.  A comedian can perform jokes that take 5 minutes each.  Find the maximum number of jokes the comedian can perform while staying within the time limit. If it's impossible to fit all the songs, output -1."}]}