{"uid": "439-C", "url": "https://codeforces.com/contest/439/problem/C", "tags": ["brute force", " constructive algorithms", " implementation", " number theory"], "title": "439-C", "statement": "C. Devu and Partitioning of the Arraytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDevu being a small kid, likes to play a lot, but he only likes to play with arrays. While playing he came up with an interesting question which he could not solve, can you please solve it for him?Given an array consisting of distinct integers. Is it possible to partition the whole array intokdisjoint non-empty parts such thatpof the parts have even sum (each of them must have even sum) and remainingk-phave odd sum? (note that parts need not to be continuous).If it is possible to partition the array, also give any possible way of valid partitioning.InputThe first line will contain three space separated integersn,k,p(1 ≤k≤n≤ 105; 0 ≤p≤k). The next line will containnspace-separated distinct integers representing the content of arraya:a1,a2, ...,an(1 ≤ai≤ 109).OutputIn the first line print \"YES\" (without the quotes) if it is possible to partition the array in the required way. Otherwise print \"NO\" (without the quotes).If the required partition exists, printklines after the first line. Theithof them should contain the content of theithpart. Print the content of the part in the line in the following way: firstly print the number of elements of the part, then print all the elements of the part in arbitrary order. There must be exactlypparts with even sum, each of the remainingk-pparts must have odd sum.As there can be multiple partitions, you are allowed to print any valid partition.ExamplesInput5 5 32 6 10 5 9OutputYES1 91 51 101 61 2Input5 5 37 14 2 9 5OutputNOInput5 3 11 2 3 7 5OutputYES3 5 1 31 71 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4832d6bd", "template_md5": "35d339e4", "result": "Given an array of distinct integers, determine if it's possible to divide the array into $k$ non-empty, disjoint parts such that $p$ of the parts have an even sum and the remaining $k-p$ parts have an odd sum. \n\nIf such a partition is possible, output \"YES\" and list the elements of each part.  \n\nIf it's not possible, output \"NO\".\n\n**Constraints:**\n\n* $1 \\le k \\le n \\le 10^5$\n* $0 \\le p \\le k$\n* $1 \\le a_i \\le 10^9$"}, {"prompt_md5": "ceb67f3f", "template_md5": "465699a0", "result": "You are given a list of distinct numbers.  Determine if you can divide the list into k groups such that p of the groups have an even sum of their numbers, and the remaining k-p groups have an odd sum. If possible, show one way to divide the list."}]}