{"uid": "44-D", "url": "https://codeforces.com/contest/44/problem/D", "tags": ["math"], "title": "44-D", "statement": "D. Hyperdrivetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn a far away galaxy there areninhabited planets, numbered with numbers from1ton. They are located at large distances from each other, that's why the communication between them was very difficult until on the planet number1a hyperdrive was invented. As soon as this significant event took place,n- 1spaceships were built on the planet number1, and those ships were sent to other planets to inform about the revolutionary invention.Paradoxical thought it may be, but the hyperspace is represented as simple three-dimensional Euclidean space. The inhabited planets may be considered fixed points in it, and no two points coincide and no three points lie on the same straight line. The movement of a ship with a hyperdrive between two planets is performed along a straight line at the constant speed, the same for all the ships. That's why the distance in the hyperspace are measured in hyperyears (a ship with a hyperdrive covers a distance ofshyperyears insyears).When the ship reaches an inhabited planet, the inhabitants of the planet dissemble it, maken- 2identical to it ships with a hyperdrive and send them to othern- 2planets (except for the one from which the ship arrived). The time to make a new ship compared to the time in which they move from one planet to another is so small that it can be disregarded. New ships are absolutely identical to the ones sent initially: they move at the same constant speed along a straight line trajectory and, having reached a planet, perform the very same mission, i.e. are dissembled to build newn- 2ships and send them to all the planets except for the one from which the ship arrived. Thus, the process of spreading the important news around the galaxy continues.However the hyperdrive creators hurried to spread the news about their invention so much that they didn't study completely what goes on when two ships collide in the hyperspace. If two moving ships find themselves at one point, they provoke an explosion of colossal power, leading to the destruction of the galaxy!Your task is to find the time the galaxy will continue to exist from the moment of the ships' launch from the first planet.InputThe first line contains a numbern(3 ≤n≤ 5000) — the number of inhabited planets in the galaxy. The nextnlines contain integer coordinates of the planets in format \"xiyizi\" (- 104≤xi,yi,zi≤ 104).OutputPrint the single number — the solution to the task with an absolute or relative error not exceeding10- 6.ExamplesInput40 0 00 0 10 1 01 0 0Output1.7071067812", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "490a0080", "template_md5": "35d339e4", "result": "You are given the coordinates of $n$ planets in 3-dimensional space.  Initially, one planet ($planet 1$) has $n-1$ spaceships. Each spaceship travels to a different planet and upon arrival, is disassembled and $n-2$ new spaceships are built. These new spaceships then travel to different planets, repeating the process.\n\nYour task is to determine the time it takes for two spaceships to collide, which will result in the destruction of the galaxy. \n\n**Input:**\n\n* The first line contains an integer $n$ (3 ≤ $n$ ≤ 5000), the number of planets.\n* The next $n$ lines each contain three integers $x_i$, $y_i$, and $z_i$ (-10⁴ ≤ $x_i$, $y_i$, $z_i$ ≤ 10⁴), representing the coordinates of each planet.\n\n**Output:**\n\n* Print a single number representing the time until the collision."}, {"prompt_md5": "33099f7e", "template_md5": "465699a0", "result": "You are given the locations of multiple points in 3D space.  Ships travel at the same speed between these points. When a ship reaches a point, it splits into multiple new ships that travel to other points.  Find the time until two ships collide."}]}