{"uid": "44-H", "url": "https://codeforces.com/contest/44/problem/H", "tags": ["dp"], "title": "44-H", "statement": "H. Phone Numbertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAlas, finding one's true love is not easy. Masha has been unsuccessful in that yet. Her friend Dasha told Masha about a way to determine the phone number of one's Prince Charming through arithmancy.The phone number is divined like that. First one needs to write down one's own phone numbers. For example, let's suppose that Masha's phone number is12345. After that one should write her favorite digit from0to9under the first digit of her number. That will be the first digit of the needed number. For example, Masha's favorite digit is9. The second digit is determined as a half sum of the second digit of Masha's number and the already written down first digit from her beloved one's number. In this case the arithmetic average equals to(2 + 9) / 2 = 5.5. Masha can round the number up or down, depending on her wishes. For example, she chooses the digit5. Having written down the resulting digit under the second digit of her number, Masha moves to finding the third digit in the same way, i.e. finding the half sum the the third digit of her number and the second digit of the new number. The result is(5 + 3) / 2 = 4. In this case the answer is unique. Thus, everyi-th digit is determined as an arithmetic average of thei-th digit of Masha's number and thei- 1-th digit of her true love's number. If needed, the digit can be rounded up or down. For example, Masha can get:1234595444Unfortunately, when Masha tried dialing the number, she got disappointed: as it turned out, the number was unavailable or outside the coverage area. But Masha won't give up. Perhaps, she rounded to a wrong digit or chose the first digit badly. That's why she keeps finding more and more new numbers and calling them. Count the number of numbers Masha calls. Masha calls all the possible numbers that can be found by the described means of arithmancy, except for, perhaps, her own one.InputThe first line contains nonempty sequence consisting of digits from0to9— Masha's phone number. The sequence length does not exceed50.OutputOutput the single number — the number of phone numbers Masha will dial.ExamplesInput12345Output48Input09Output15", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1c07ab9f", "template_md5": "35d339e4", "result": "Given a phone number consisting of digits from 0 to 9, find the number of possible phone numbers that can be generated using the following rule:\n\n1.  The first digit of the new number is the user's favorite digit from 0 to 9.\n2.  The second digit is the rounded average of the second digit of the input number and the first digit of the new number.\n3.  For each subsequent digit, calculate the rounded average of the corresponding digit in the input number and the previous digit of the new number.\n\nNote: The rounding can be done either up or down."}, {"prompt_md5": "fabe77c6", "template_md5": "465699a0", "result": "Given a number, generate all possible numbers that can be created by repeatedly taking the average of a digit in the input number and the previous digit in the generated number, rounding the result as needed.  Count the total number of unique generated numbers."}]}