{"uid": "442-B", "url": "https://codeforces.com/contest/442/problem/B", "tags": ["greedy", " math", " probabilities"], "title": "442-B", "statement": "B. Andrey and Problemtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAndrey needs one more problem to conduct a programming contest. He hasnfriends who are always willing to help. He can ask some of them to come up with a contest problem. Andrey knows one value for each of his fiends — the probability that this friend will come up with a problem if Andrey asks him.Help Andrey choose people to ask. As he needs only one problem, Andrey is going to be really upset if no one comes up with a problem or if he gets more than one problem from his friends. You need to choose such a set of people that maximizes the chances of Andrey not getting upset.InputThe first line contains a single integern(1 ≤n≤ 100)— the number of Andrey's friends. The second line containsnreal numberspi(0.0 ≤pi≤ 1.0)— the probability that thei-th friend can come up with a problem. The probabilities are given with at most 6 digits after decimal point.OutputPrint a single real number — the probability that Andrey won't get upset at the optimal choice of friends. The answer will be considered valid if it differs from the correct one by at most10- 9.ExamplesInput40.1 0.2 0.3 0.8Output0.800000000000Input20.1 0.2Output0.260000000000NoteIn the first sample the best strategy for Andrey is to ask only one of his friends, the most reliable one.In the second sample the best strategy for Andrey is to ask all of his friends to come up with a problem. Then the probability that he will get exactly one problem is0.1·0.8 + 0.9·0.2 = 0.26.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1cb49a45", "template_md5": "35d339e4", "result": "You have $n$ friends, each with a probability $p_i$ of coming up with a problem. You need to choose some friends to ask for a problem, with the goal of maximizing the probability that exactly one friend comes up with a problem. \n\nOutput the maximum probability of this happening."}, {"prompt_md5": "e5fa1732", "template_md5": "465699a0", "result": "You have a group of people, each with a chance of completing a task. You need exactly one task completed.  What combination of people should you ask to maximize the chance of getting exactly one completed task?"}]}