{"uid": "442-D", "url": "https://codeforces.com/contest/442/problem/D", "tags": ["data structures", " trees"], "title": "442-D", "statement": "D. Adam and Treetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutWhen Adam gets a rooted tree (connected non-directed graph without cycles), he immediately starts coloring it. More formally, he assigns a color to each edge of the tree so that it meets the following two conditions:There is no vertex that has more than two incident edges painted the same color.For any two vertexes that have incident edges painted the same color (say,c), the path between them consists of the edges of the colorc.Not all tree paintings are equally good for Adam. Let's consider the path from some vertex to the root. Let's call the number of distinct colors on this path the cost of the vertex. The cost of the tree's coloring will be the maximum cost among all the vertexes. Help Adam determine the minimum possible cost of painting the tree.Initially, Adam's tree consists of a single vertex that has number one and is the root. In one move Adam adds a new vertex to the already existing one, the new vertex gets the number equal to the minimum positive available integer. After each operation you need to calculate the minimum cost of coloring the resulting tree.InputThe first line contains integern(1 ≤n≤ 106) — the number of times a new vertex is added. The second line containsnnumberspi(1 ≤pi≤i) — the numbers of the vertexes to which we add another vertex.OutputPrintnintegers — the minimum costs of the tree painting after each addition.ExamplesInput111 1 1 3 4 4 7 3 7 6 6Output1 1 1 1 1 2 2 2 2 2 3NoteThe figure below shows one of the possible variants to paint a tree from the sample at the last moment. The cost of the vertexes with numbers 11 and 12 equals 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "89de1106", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices.  Initially, the tree has only one vertex. In each step, you add a new vertex to an existing vertex. The new vertex is assigned the smallest available integer greater than all existing vertex numbers.\n\nAfter each step, you need to color the edges of the tree so that:\n\n* No vertex has more than two edges with the same color.\n* For any two vertices connected by an edge of the same color, the path between them consists only of edges of that color.\n\nThe cost of a vertex is the number of distinct colors on the path from that vertex to the root. The goal is to find the minimum possible maximum cost (the maximum cost among all vertices) after each step.\n\nOutput the minimum cost after each step."}, {"prompt_md5": "3c52f36d", "template_md5": "465699a0", "result": "You are given a series of operations where you add a new node to a tree. After each operation, you need to find the minimum number of distinct colors needed to color the edges of the tree so that:\n\n* No node has more than two edges of the same color.\n* If two nodes have an edge of the same color, the path between them consists only of edges of that color.\n\nThe minimum number of colors needed is the maximum number of distinct colors found along any path from a node to the root."}]}