{"uid": "442-E", "url": "https://codeforces.com/contest/442/problem/E", "tags": ["geometry"], "title": "442-E", "statement": "E. Gena and Second Distancetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutGena doesn't like geometry, so he asks you to solve this problem for him.A rectangle with sides parallel to coordinate axes containsndots. Let's consider some point of the plane. Let's count the distances from this point to the givennpoints. Let's sort these numbers in the non-decreasing order. We'll call the beauty of the point the second element of this array. If there are two mimimum elements in this array, the beaty will be equal to this minimum.Find the maximum beauty of a point inside the given rectangle.InputThe first line contains three integersw,h,n(1 ≤w,h≤ 106, 2 ≤n≤ 1000) — the lengths of the rectangle sides and the number of points. Nextnlines contain two integersxi,yi(0 ≤xi≤w, 0 ≤yi≤h) each — the coordinates of a point. It is possible that it will be coincident points.OutputPrint a single number — the maximum beauty of a point with the absolute or relative error of at most10- 9.ExamplesInput5 5 40 05 00 55 5Output4.99999999941792339Input5 5 34 02 54 1Output5.65685424744772014NoteThe point which beauty we need to find must have coordinates (x,y), where0 ≤x≤w, 0 ≤y≤h. Some of thenpoints can coincide.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "961ed2cb", "template_md5": "35d339e4", "result": "You are given a rectangle with width $w$ and height $h$. There are $n$ points inside the rectangle, with coordinates $(x_i, y_i)$.\n\nFor each point $(x, y)$ inside the rectangle, calculate the distances to each of the $n$ given points. Sort these distances in non-decreasing order. The \"beauty\" of the point $(x, y)$ is the second smallest distance in this sorted list. If there are multiple smallest distances, the beauty is the smallest one.\n\nFind the maximum beauty of any point $(x, y)$ inside the rectangle."}, {"prompt_md5": "290a33c4", "template_md5": "465699a0", "result": "You are given a rectangle and a set of points inside it. For each point, find the distances to all other points, sort these distances, and pick the second smallest distance. Find the largest such \"second smallest distance\" you can get for any point inside the rectangle."}]}