{"uid": "444-A", "url": "https://codeforces.com/contest/444/problem/A", "tags": ["greedy", " math"], "title": "444-A", "statement": "A. DZY Loves Physicstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDZY loves Physics, and he enjoys calculating density.Almost everything has density, even a graph. We define the density of a non-directed graph (nodes and edges of the graph have some values) as follows:wherevis the sum of the values of the nodes,eis the sum of the values of the edges.Once DZY got a graphG, now he wants to find a connected induced subgraphG'of the graph, such that the density ofG'is as large as possible.An induced subgraphG'(V',E')of a graphG(V,E)is a graph that satisfies:;edgeif and only if, and edge;the value of an edge inG'is the same as the value of the corresponding edge inG, so as the value of a node.Help DZY to find the induced subgraph with maximum density. Note that the induced subgraph you choose must be connected.InputThe first line contains two space-separated integersn(1 ≤n≤ 500),. Integernrepresents the number of nodes of the graphG,mrepresents the number of edges.The second line containsnspace-separated integersxi(1 ≤xi≤ 106), wherexirepresents the value of thei-th node. Consider the graph nodes are numbered from1ton.Each of the nextmlines contains three space-separated integersai,bi,ci(1 ≤ai<bi≤n; 1 ≤ci≤ 103), denoting an edge between nodeaiandbiwith valueci. The graph won't contain multiple edges.OutputOutput a real number denoting the answer, with an absolute or relative error of at most10- 9.ExamplesInput1 01Output0.000000000000000Input2 11 21 2 1Output3.000000000000000Input5 613 56 73 98 171 2 561 3 291 4 422 3 952 4 883 4 63Output2.965517241379311NoteIn the first sample, you can only choose an empty subgraph, or the subgraph containing only node1.In the second sample, choosing the whole graph is optimal.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2c6ab28a", "template_md5": "35d339e4", "result": "You are given a graph with nodes and edges, each having a numerical value.  \n\nThe **density** of a subgraph is calculated as:\n\n $$ \\text{density} = \\frac{\\text{sum of node values}}{\\text{sum of edge values}}$$\n\nFind the connected subgraph (a subgraph where you can travel between any two nodes) with the highest density. \n\n**Input:**\n\n* The first line contains two integers: `n` (number of nodes) and `m` (number of edges).\n* The second line contains `n` integers, each representing the value of a node.\n* The next `m` lines each contain three integers: `ai`, `bi`, and `ci`, representing an edge between nodes `ai` and `bi` with value `ci`.\n\n**Output:**\n\n* Output a real number representing the maximum density of a connected induced subgraph."}, {"prompt_md5": "e1d82cb6", "template_md5": "465699a0", "result": "Given a graph with nodes and edges, each having a value, find the largest connected subset of nodes and edges (an induced subgraph) that has the highest ratio of the sum of node values to the sum of edge values."}]}