{"uid": "445-A", "url": "https://codeforces.com/contest/445/problem/A", "tags": ["dfs and similar", " implementation"], "title": "445-A", "statement": "A. DZY Loves Chessboardtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDZY loves chessboard, and he enjoys playing with it.He has a chessboard ofnrows andmcolumns. Some cells of the chessboard are bad, others are good. For every good cell, DZY wants to put a chessman on it. Each chessman is either white or black. After putting all chessmen, DZY wants that no two chessmen with the same color are on two adjacent cells. Two cells are adjacent if and only if they share a common edge.You task is to find any suitable placement of chessmen on the given chessboard.InputThe first line contains two space-separated integersnandm(1 ≤n,m≤ 100).Each of the nextnlines contains a string ofmcharacters: thej-th character of thei-th string is either \".\" or \"-\". A \".\" means that the corresponding cell (in thei-th row and thej-th column) is good, while a \"-\" means it is bad.OutputOutput must containnlines, each line must contain a string ofmcharacters. Thej-th character of thei-th string should be either \"W\", \"B\" or \"-\". Character \"W\" means the chessman on the cell is white, \"B\" means it is black, \"-\" means the cell is a bad cell.If multiple answers exist, print any of them. It is guaranteed that at least one answer exists.ExamplesInput1 1.OutputBInput2 2....OutputBWWBInput3 3.-.-----.OutputB-B-----BNoteIn the first sample, DZY puts a single black chessman. Of course putting a white one is also OK.In the second sample, all4cells are good. No two same chessmen share an edge in the sample output.In the third sample, no good cells are adjacent. So you can just put3chessmen, no matter what their colors are.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6187788d", "template_md5": "35d339e4", "result": "You are given a chessboard of size $n \\times m$. Some cells on the chessboard are marked as bad ('-') and some are good ('.').  You need to place chessmen on the good cells. Each chessman can be either white ('W') or black ('B').  The rule is that no two chessmen of the same color can be placed in adjacent cells (cells sharing an edge).\n\nYour task is to find any possible arrangement of chessmen that follows this rule. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of rows and columns of the chessboard.\n* The next $n$ lines each contain a string of $m$ characters, representing the chessboard. '.' represents a good cell, and '-' represents a bad cell.\n\n**Output:**\n\n* Output $n$ lines, each containing a string of $m$ characters. \n* Each character should be 'W', 'B', or '-'. \n* 'W' represents a white chessman, 'B' represents a black chessman, and '-' represents a bad cell.\n\n\n\nLet me know if you'd like help with any specific part of the problem or have any other questions."}, {"prompt_md5": "4be5f112", "template_md5": "465699a0", "result": "You are given a grid of cells. Some cells are marked as unusable.  You need to place white or black chess pieces on the usable cells so that no two pieces of the same color are next to each other.  Print one possible arrangement of chess pieces."}]}