{"uid": "445-B", "url": "https://codeforces.com/contest/445/problem/B", "tags": ["dfs and similar", " dsu", " greedy"], "title": "445-B", "statement": "B. DZY Loves Chemistrytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDZY loves chemistry, and he enjoys mixing chemicals.DZY hasnchemicals, andmpairs of them will react. He wants to pour these chemicals into a test tube, and he needs to pour them in one by one, in any order.Let's consider the danger of a test tube. Danger of an empty test tube is1. And every time when DZY pours a chemical, if there are already one or more chemicals in the test tube that can react with it, the danger of the test tube will be multiplied by2. Otherwise the danger remains as it is.Find the maximum possible danger after pouring all the chemicals one by one in optimal order.InputThe first line contains two space-separated integersnandm.Each of the nextmlines contains two space-separated integersxiandyi(1 ≤xi<yi≤n). These integers mean that the chemicalxiwill react with the chemicalyi. Each pair of chemicals will appear at most once in the input.Consider all the chemicals numbered from1tonin some order.OutputPrint a single integer — the maximum possible danger.ExamplesInput1 0Output1Input2 11 2Output2Input3 21 22 3Output4NoteIn the first sample, there's only one way to pour, and the danger won't increase.In the second sample, no matter we pour the1st chemical first, or pour the2nd chemical first, the answer is always2.In the third sample, there are four ways to achieve the maximum possible danger: 2-1-3, 2-3-1, 1-2-3 and 3-2-1 (that is the numbers of the chemicals in order of pouring).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "990b1ae8", "template_md5": "35d339e4", "result": "You are given a set of $n$ chemicals, and $m$ pairs of chemicals that can react with each other.  You want to pour these chemicals into a test tube one by one, in any order.  \n\nThe danger of an empty test tube is 1.  Each time you pour a chemical into the test tube, if there are already chemicals in the tube that can react with it, the danger level of the tube is doubled. Otherwise, the danger level stays the same.\n\nWhat is the maximum possible danger level of the test tube after pouring all the chemicals? \n\n\nLet me know if you'd like help with the input/output format as well!"}, {"prompt_md5": "2a1f98ca", "template_md5": "465699a0", "result": "You have a set of items. Each item can react with a specific other item. You must place the items into a container one at a time.  The danger level of the container starts at 1. If you add an item that can react with something already in the container, the danger level doubles. What is the highest possible danger level you can achieve?"}]}