{"uid": "446-E", "url": "https://codeforces.com/contest/446/problem/E", "tags": ["math", " matrices"], "title": "446-E", "statement": "E. DZY Loves Bridgestime limit per test5 secondsmemory limit per test512 megabytesinputstdinoutputstdoutDZY owns2mislands near his home, numbered from1to2m. He loves building bridges to connect the islands. Every bridge he builds takes one day's time to walk across.DZY has a strange rule of building the bridges. For every pair of islandsu,v(u≠v), he has built2kdifferent bridges connecting them, where(a|bmeansbis divisible bya). These bridges are bidirectional.Also, DZY has built some bridges connecting his home with the islands. Specifically, there areaidifferent bridges from his home to thei-th island. These are one-way bridges, so after he leaves his home he will never come back.DZY decides to go to the islands for sightseeing. At first he is at home. He chooses and walks across one of the bridges connecting with his home, and arrives at some island. After that, he will spendtday(s) on the islands. Each day, he can choose to stay and rest, or to walk to another island across the bridge. It is allowed to stay at an island for more than one day. It's also allowed to cross one bridge more than once.Suppose that right after thet-th day DZY stands at thei-th island. Letans[i]be the number of ways for DZY to reach thei-th island aftert-th day. Your task is to calculateans[i]for eachimodulo1051131.InputTo avoid huge input, we use the following way to generate the arraya. You are given the firstselements of array:a1,a2, ...,as. All the other elements should be calculated by formula:ai= (101·ai-s+ 10007)mod1051131(s<i≤ 2m).The first line contains three integersm,t,s(1 ≤m≤ 25; 1 ≤t≤ 1018; 1 ≤s≤min(2m, 105)).The second line containssintegersa1,a2, ...,as(1 ≤ai≤ 106).OutputTo avoid huge output, you only need to output xor-sum of all the answers for allimodulo1051131(1 ≤i≤ 2m), i.e.(ans[1]mod1051131)xor(ans[2]mod1051131)xor...xor(ans[n]mod1051131).ExamplesInput2 1 41 1 1 2Output1Input3 5 6389094 705719 547193 653800 947499 17024Output556970NoteIn the first sample,ans= [6, 7, 6, 6].If he wants to be at island 1 after one day, he has 6 different ways:home —> 1 -(stay)-> 1home —> 2 —> 1home —> 3 —> 1home —> 3 —> 1 (note that there are two different bridges between 1 and 3)home —> 4 —> 1home —> 4 —> 1 (note that there are two different bridges from home to 4)In the second sample,(a1,a2,a3,a4,a5,a6,a7,a8) = (389094, 705719, 547193, 653800, 947499, 17024, 416654, 861849),ans= [235771, 712729, 433182, 745954, 139255, 935785, 620229, 644335].", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "027a4f3a", "template_md5": "35d339e4", "result": "You are given two integers $m$ and $t$. There are $m$ islands numbered from 1 to $m$.  You are also given an integer $s$ and a sequence of $s$ integers $a_1, a_2, ..., a_s$. The remaining integers $a_{s+1}, a_{s+2}, ..., a_m$ are calculated using the formula:\n\n$$a_i = (101 \\cdot a_{i-s} + 10007) \\mod 1051131$$\n\nfor $s < i \\le m$.\n\nFor each pair of islands $u$ and $v$ ($u \\neq v$), there are $2^k$ bridges connecting them, where $k$ is the largest integer such that $2^k$ divides the distance between $u$ and $v$. These bridges are bidirectional.\n\nThere are also $a_i$ one-way bridges from a starting point (home) to each island $i$.\n\nYou need to calculate the number of ways to reach each island $i$ after $t$ days, starting from home.  You can stay on an island for multiple days and cross a bridge multiple times.\n\nFinally, output the bitwise XOR of all the answers for each island modulo 1051131."}, {"prompt_md5": "fbf90b16", "template_md5": "465699a0", "result": "You are given a number of islands and a number of days. You start at a designated home island and can travel to other islands using bridges. Each day you can stay on an island or travel to another island.  Calculate the number of ways to be on each island after a specific number of days.  Output the XOR sum of these counts for all islands."}]}