{"uid": "446-D", "url": "https://codeforces.com/contest/446/problem/D", "tags": ["math", " matrices", " probabilities"], "title": "446-D", "statement": "D. DZY Loves Gamestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutToday DZY begins to play an old game. In this game, he is in a big maze withnrooms connected bymcorridors (each corridor allows to move in both directions). You can assume that all the rooms are connected with corridors directly or indirectly.DZY has got lost in the maze. Currently he is in the first room and hasklives. He will act like the follows:Firstly he will randomly pick one of the corridors going from his current room. Each outgoing corridor has the same probability to be picked.Then he will go through the corridor and then the process repeats.There are some rooms which have traps in them. The first room definitely has no trap, then-th room definitely has a trap. Each time DZY enters one of these rooms, he will lost one life. Now, DZY knows that if he enters then-th room with exactly 2 lives, firstly he will lost one live, but then he will open a bonus round. He wants to know the probability for him to open the bonus round. Please, help him.InputThe first line contains three integersn,m,k(2 ≤n≤ 500; 1 ≤m≤ 105; 2 ≤k≤ 109).The second line containsnintegers, each of them is either0or1. If thei-th number is1, then thei-th room has a trap, otherwise it has not a trap.Please note, that the number of rooms with a trap is no more than101. It is guaranteed that the first room has no trap, and then-th room has a trap.Thenmlines follows. Each of them contains two integersui,vi(1 ≤ui,vi≤n;ui≠vi), meaning that current corridor connects two roomsuiandvi. It is guaranteed that the corridor system is connected.OutputPrint the only real number — the probability for DZY to open the bonus round. The answer will be considered correct if its relative or absolute error doesn't exceed10- 4.ExamplesInput5 5 30 0 1 0 11 22 33 44 51 2Output0.25000000Input3 2 20 1 11 22 3Output-0.00000000Input2 1 30 11 2Output1.00000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e74cf9cc", "template_md5": "35d339e4", "result": "There is a maze with $n$ rooms connected by $m$ corridors. Each corridor allows movement in both directions.  \n\n* Room 1 has no trap.\n* Room $n$ has a trap.\n* Rooms 2 through $n-1$ may or may not have traps.\n\nYou start in room 1 with $k$ lives.  \n\nYou randomly choose a corridor from your current room and move to a connected room. If you enter a room with a trap, you lose a life.\n\nIf you enter room $n$ with exactly 2 lives, you lose one life but then enter a bonus round.\n\nWhat is the probability of entering the bonus round?\n\n\n\nInput:\n\n* The first line contains three integers: $n$, $m$, and $k$.\n* The second line contains $n$ integers, where a 1 indicates a trap in that room and a 0 indicates no trap.\n* The next $m$ lines each contain two integers, $u$ and $v$, representing a corridor connecting rooms $u$ and $v$.\n\nOutput:\n\nPrint the probability of entering the bonus round as a real number."}, {"prompt_md5": "9f56c137", "template_md5": "465699a0", "result": "A person starts in room 1 of a maze and randomly walks through connected rooms. Some rooms have traps that cost a life. The person has a limited number of lives.  If the person enters a specific room with 2 lives left, they lose a life but get a bonus. What is the probability they will reach that specific room with exactly 2 lives?"}]}