{"uid": "447-B", "url": "https://codeforces.com/contest/447/problem/B", "tags": ["greedy", " implementation"], "title": "447-B", "statement": "B. DZY Loves Stringstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDZY loves collecting special strings which only contain lowercase letters. For each lowercase lettercDZY knows its valuewc. For each special strings=s1s2...s|s|(|s|is the length of the string) he represents its value with a functionf(s), whereNow DZY has a strings. He wants to insertklowercase letters into this string in order to get the largest possible value of the resulting string. Can you help him calculate the largest possible value he could get?InputThe first line contains a single strings(1 ≤ |s| ≤ 103).The second line contains a single integerk(0 ≤k≤ 103).The third line contains twenty-six integers fromwatowz. Each such number is non-negative and doesn't exceed1000.OutputPrint a single integer — the largest possible value of the resulting string DZY could get.ExamplesInputabc31 2 2 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1Output41NoteIn the test sample DZY can obtain \"abcbbc\",value= 1·1 + 2·2 + 3·2 + 4·2 + 5·2 + 6·2 = 41.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "66ee2239", "template_md5": "35d339e4", "result": "You are given a string  $s$ and an integer $k$. You can insert at most $k$ lowercase letters into the string.  Each lowercase letter has a corresponding value $w_c$ (where $c$ is the letter).  \n\nThe value of a string is the sum of the values of its letters.\n\nFind the largest possible value you can get for the string after inserting the letters. \n\n\nInput:\n\n* Line 1: The string $s$\n* Line 2: The integer $k$\n* Line 3: 26 integers representing the values $w_a$, $w_b$, ..., $w_z$\n\nOutput:\n\n* The largest possible value of the string."}, {"prompt_md5": "647adacb", "template_md5": "465699a0", "result": "You are given a string and a number of characters you can add to it. Each character has a value.  Find the largest possible total value you can achieve by adding characters to the string."}]}