{"uid": "448-A", "url": "https://codeforces.com/contest/448/problem/A", "tags": ["implementation"], "title": "448-A", "statement": "A. Rewardstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutBizon the Champion is called the Champion for a reason.Bizon the Champion has recently got a present — a new glass cupboard withnshelves and he decided to put all his presents there. All the presents can be divided into two types: medals and cups. Bizon the Champion hasa1first prize cups,a2second prize cups anda3third prize cups. Besides, he hasb1first prize medals,b2second prize medals andb3third prize medals.Naturally, the rewards in the cupboard must look good, that's why Bizon the Champion decided to follow the rules:any shelf cannot contain both cups and medals at the same time;no shelf can contain more than five cups;no shelf can have more than ten medals.Help Bizon the Champion find out if we can put all the rewards so that all the conditions are fulfilled.InputThe first line contains integersa1,a2anda3(0 ≤a1,a2,a3≤ 100). The second line contains integersb1,b2andb3(0 ≤b1,b2,b3≤ 100). The third line contains integern(1 ≤n≤ 100).The numbers in the lines are separated by single spaces.OutputPrint \"YES\" (without the quotes) if all the rewards can be put on the shelves in the described manner. Otherwise, print \"NO\" (without the quotes).ExamplesInput1 1 11 1 14OutputYESInput1 1 32 3 42OutputYESInput1 0 01 0 01OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ed4cff65", "template_md5": "35d339e4", "result": "You are given three types of cups ($a_1$, $a_2$, $a_3$) and three types of medals ($b_1$, $b_2$, $b_3$). You also have $n$ shelves.\n\n**Rules:**\n\n* Each shelf can only contain either cups or medals, not both.\n* A shelf cannot have more than 5 cups.\n* A shelf cannot have more than 10 medals.\n\nDetermine if it is possible to arrange all the cups and medals on the shelves following these rules. \n\n**Input:**\n\n* The first line contains the number of each type of cup ($a_1$, $a_2$, $a_3$).\n* The second line contains the number of each type of medal ($b_1$, $b_2$, $b_3$).\n* The third line contains the number of shelves ($n$).\n\n**Output:**\n\n* Print \"YES\" if it is possible to arrange the cups and medals according to the rules.\n* Print \"NO\" if it is not possible."}, {"prompt_md5": "b346593a", "template_md5": "465699a0", "result": "You have a certain number of first, second, and third prize cups and medals. You also have a number of shelves.  Each shelf can hold either cups or medals, but not both.  A shelf can hold up to 5 cups or 10 medals.  Can you arrange all the cups and medals on the shelves following these rules?"}]}