{"uid": "449-B", "url": "https://codeforces.com/contest/449/problem/B", "tags": ["graphs", " greedy", " shortest paths"], "title": "449-B", "statement": "B. Jzzhu and Citiestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutJzzhu is the president of country A. There arencities numbered from1tonin his country. City1is the capital of A. Also there aremroads connecting the cities. One can go from cityuitovi(and vise versa) using thei-th road, the length of this road isxi. Finally, there arektrain routes in the country. One can use thei-th train route to go from capital of the country to citysi(and vise versa), the length of this route isyi.Jzzhu doesn't want to waste the money of the country, so he is going to close some of the train routes. Please tell Jzzhu the maximum number of the train routes which can be closed under the following condition: the length of the shortest path from every city to the capital mustn't change.InputThe first line contains three integersn,m,k(2 ≤n≤ 105; 1 ≤m≤ 3·105; 1 ≤k≤ 105).Each of the nextmlines contains three integersui,vi,xi(1 ≤ui,vi≤n;ui≠vi; 1 ≤xi≤ 109).Each of the nextklines contains two integerssiandyi(2 ≤si≤n; 1 ≤yi≤ 109).It is guaranteed that there is at least one way from every city to the capital. Note, that there can be multiple roads between two cities. Also, there can be multiple routes going to the same city from the capital.OutputOutput a single integer representing the maximum number of the train routes which can be closed.ExamplesInput5 5 31 2 12 3 21 3 33 4 41 5 53 54 55 5Output2Input2 2 31 2 22 1 32 12 22 3Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "93ea92c9", "template_md5": "35d339e4", "result": "There are $n$ cities numbered from 1 to $n$. City 1 is the capital. There are $m$ roads connecting the cities. Road $i$ connects city $u_i$ to city $v_i$ and has a length of $x_i$. There are $k$ train routes. Each route $i$ connects the capital to city $s_i$ and has a length of $y_i$.\n\nYou need to find the maximum number of train routes that can be closed, such that the shortest distance from every city to the capital does not change. \n\n\nInput:\n\n* The first line contains three integers: $n$, $m$, and $k$.\n* The next $m$ lines each contain three integers: $u_i$, $v_i$, and $x_i$.\n* The next $k$ lines each contain two integers: $s_i$ and $y_i$.\n\nOutput:\n\n* Output a single integer representing the maximum number of train routes that can be closed."}, {"prompt_md5": "bb0f53e8", "template_md5": "465699a0", "result": "You are given a map with cities connected by roads and train routes.  Some train routes go directly from the capital city to other cities.  You need to find the maximum number of train routes that can be removed so that it's still possible to reach every city from the capital using the remaining roads and train routes."}]}