{"uid": "45-B", "url": "https://codeforces.com/contest/45/problem/B", "tags": ["dp", " dsu"], "title": "45-B", "statement": "B. Schooltime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arenstudents studying in the 6th grade, in group \"B\" of a berland secondary school. Every one of them has exactly one friend whom he calls when he has some news. Let us denote the friend of the person numberibyg(i). Note that the friendships are not mutual, i.e.g(g(i))is not necessarily equal toi.On dayithe person numbered asailearns the news with the rating ofbi(bi≥ 1). He phones the friend immediately and tells it. While he is doing it, the news becomes old and its rating falls a little and becomes equal tobi- 1. The friend does the same thing — he also calls his friend and also tells the news. The friend of the friend gets the news already rated asbi- 2. It all continues until the rating of the news reaches zero as nobody wants to tell the news with zero rating.More formally, everybody acts like this: if a personxlearns the news with a non-zero ratingy, he calls his friendg(i)and his friend learns the news with the rating ofy- 1and, if it is possible, continues the process.Let us note that during a day one and the same person may call his friend and tell him one and the same news with different ratings. Thus, the news with the rating ofbiwill lead to as much asbicalls.Your task is to count the values ofresi— how many students learned their first news on dayi.The values ofbiare known initially, whereasaiis determined from the following formula:where mod stands for the operation of taking the excess from the cleavage,res0is considered equal to zero andvi— some given integers.InputThe first line contains two space-separated integersnandm(2 ≤n,m≤ 105) — the number of students and the number of days. The second line containsnspace-separated integersg(i)(1 ≤g(i) ≤n,g(i) ≠i) — the number of a friend of thei-th student. The third line containsmspace-separated integersvi(1 ≤vi≤ 107). The fourth line containsmspace-separated integersbi(1 ≤bi≤ 107).OutputPrintmlines containing one number each. Thei-th line should containresi— for what number of students the first news they've learned over themdays in question, was the news numberi. The number of the news is the number of the day on which it can be learned. The days are numbered starting from one in the order in which they are given in the input file. Don't outputres0.ExamplesInput3 42 3 11 2 3 41 2 3 4Output1110Input8 67 6 4 2 3 5 5 710 4 3 8 9 11 1 1 2 2 2Output111211", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9ba9de88", "template_md5": "35d339e4", "result": "There are $n$ students in a school. Each student has one friend in the same school.  On each day $i$, a student receives a news with a rating of $b_i$. The student tells the news to their friend, and the rating of the news decreases by 1. The friend then tells the news to their friend, and the rating decreases by another 1, and so on. This continues until the rating of the news reaches 0.\n\nYou are given:\n\n* $n$: the number of students\n* $m$: the number of days\n* $g(i)$: the friend of the $i$-th student\n* $v_i$: a list of integers\n* $b_i$: the rating of the news on day $i$\n\nYour task is to find $res_i$, which is the number of students who learned their first news on day $i$. \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "e129acb2", "template_md5": "465699a0", "result": "There are 'n' students in a school. Each student has a friend in the school. On each day, a certain number of students receive a piece of news with a rating. They immediately tell the news to their friend, and the rating decreases by 1. This continues until the rating reaches 0.  You are given the initial ratings of the news for each day and the friendship connections between students.  Determine how many students learned their first news on each day."}]}