{"uid": "45-C", "url": "https://codeforces.com/contest/45/problem/C", "tags": ["data structures"], "title": "45-C", "statement": "C. Dancing Lessonstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arenpeople taking dancing lessons. Every person is characterized by his/her dancing skillai. At the beginning of the lesson they line up from left to right. While there is at least one couple of a boy and a girl in the line, the following process is repeated: the boy and girl who stand next to each other, having the minimal difference in dancing skills start to dance. If there are several such couples, the one first from the left starts to dance. After a couple leaves to dance, the line closes again, i.e. as a result the line is always continuous. The difference in dancing skills is understood as the absolute value of difference ofaivariable. Your task is to find out what pairs and in what order will start dancing.InputThe first line contains an integern(1 ≤n≤ 2·105) — the number of people. The next line containsnsymbolsBorGwithout spaces.Bstands for a boy,Gstands for a girl. The third line containsnspace-separated integersai(1 ≤ai≤ 107) — the dancing skill. People are specified from left to right in the order in which they lined up.OutputPrint the resulting number of couplesk. Then printklines containing two numerals each — the numbers of people forming the couple. The people are numbered with integers from1tonfrom left to right. When a couple leaves to dance you shouldn't renumber the people. The numbers in one couple should be sorted in the increasing order. Print the couples in the order in which they leave to dance.ExamplesInput4BGBG4 2 4 3Output23 41 2Input4BBGG4 6 1 5Output22 31 4Input4BGBB1 1 2 3Output11 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "da217831", "template_md5": "35d339e4", "result": "There are $n$ people taking dancing lessons.  Each person is assigned a dancing skill level. They line up in a row.  \n\nWhile there are still boys and girls in the line, the following happens:\n\n1. Find the boy and girl standing next to each other with the smallest difference in dancing skill levels. If there are multiple pairs with the same smallest difference, choose the pair furthest to the left.\n2. This boy and girl start dancing and leave the line.\n3. The line closes up so that it remains a continuous row.\n\nYour task is to determine:\n\n1. The total number of couples that will dance.\n2. The order in which the couples will dance (list each couple as a pair of numbers, with the lower numbered person first).\n\n**Input:**\n\n* The first line contains the number of people, $n$.\n* The second line contains a string of 'B's and 'G's representing the gender of each person in the line.\n* The third line contains $n$ space-separated integers representing the dancing skill level of each person.\n\n**Output:**\n\n* The first line should contain the total number of couples that will dance.\n* The following lines should list each dancing couple as a pair of numbers, with the lower numbered person first."}, {"prompt_md5": "eab474bd", "template_md5": "465699a0", "result": "You are given a line of people, some boys and some girls, each with a skill level.  Pairs of people (one boy and one girl) with the smallest skill difference next to each other dance together.  The line closes up after each pair dances.  Find all the dancing pairs in the order they dance."}]}