{"uid": "45-I", "url": "https://codeforces.com/contest/45/problem/I", "tags": ["greedy"], "title": "45-I", "statement": "I. TCMCF+++time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya has gotten interested in programming contests in TCMCF+++ rules. On the contestnproblems were suggested and every problem had a cost — a certain integral number of points (perhaps, negative or even equal to zero). According to TCMCF+++ rules, only accepted problems can earn points and the overall number of points of a contestant was equal to the product of the costs of all the problems he/she had completed. If a person didn't solve anything, then he/she didn't even appear in final standings and wasn't considered as participant. Vasya understood that to get the maximal number of points it is not always useful to solve all the problems. Unfortunately, he understood it only after the contest was finished. Now he asks you to help him: find out what problems he had to solve to earn the maximal number of points.InputThe first line contains an integern(1 ≤n≤ 100) — the number of the suggested problems. The next line containsnspace-separated integersci(- 100 ≤ci≤ 100) — the cost of thei-th task. The tasks' costs may coinсide.OutputPrint space-separatedthe costs of the problemsthat needed to be solved to get the maximal possible number of points. Do not forget, please, that it was necessary to solve at least one problem. If there are several solutions to that problem, print any of them.ExamplesInput51 2 -3 3 3Output3 1 2 3Input13100 100 100 100 100 100 100 100 100 100 100 100 100Output100 100 100 100 100 100 100 100 100 100 100 100 100Input4-2 -2 -2 -2Output-2 -2 -2 -2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "440adf2b", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers, where each integer represents the points awarded for solving a specific problem.  \n\nFind the subset of these problems that, when multiplied together, results in the maximum possible product. You must select at least one problem. \n\nOutput the points values of the problems in the optimal subset. If there are multiple solutions, output any one."}, {"prompt_md5": "6a15a29a", "template_md5": "465699a0", "result": "You are given a list of numbers, each representing the points earned for solving a problem.  Find the subset of these numbers that multiply together to give the largest possible sum. You must choose at least one number."}]}