{"uid": "451-B", "url": "https://codeforces.com/contest/451/problem/B", "tags": ["implementation", " sortings"], "title": "451-B", "statement": "B. Sort the Arraytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutBeing a programmer, you like arrays a lot. For your birthday, your friends have given you an arrayaconsisting ofndistinctintegers.Unfortunately, the size ofais too small. You want a bigger array! Your friends agree to give you a bigger array, but only if you are able to answer the following question correctly: is it possible to sort the arraya(in increasing order) by reversingexactly onesegment ofa? See definitions of segment and reversing in the notes.InputThe first line of the input contains an integern(1 ≤n≤ 105) — the size of arraya.The second line containsndistinct space-separated integers:a[1],a[2], ...,a[n](1 ≤a[i] ≤ 109).OutputPrint \"yes\" or \"no\" (without quotes), depending on the answer.If your answer is \"yes\", then also print two space-separated integers denoting start and end (start must not be greater than end) indices of the segment to be reversed. If there are multiple ways of selecting these indices, print any of them.ExamplesInput33 2 1Outputyes1 3Input42 1 3 4Outputyes1 2Input43 1 2 4OutputnoInput21 2Outputyes1 1NoteSample 1. You can reverse the entire array to get[1, 2, 3], which is sorted.Sample 3. No segment can be reversed such that the array will be sorted.DefinitionsA segment[l,r]of arrayais the sequencea[l],a[l+ 1], ...,a[r].If you have an arrayaof sizenand you reverse its segment[l,r], the array will become:a[1],a[2], ...,a[l- 2],a[l- 1],a[r],a[r- 1], ...,a[l+ 1],a[l],a[r+ 1],a[r+ 2], ...,a[n- 1],a[n].", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c41644f2", "template_md5": "35d339e4", "result": "You are given an array of $n$ distinct integers. Determine if it is possible to sort the array in increasing order by reversing exactly one segment of the array. If it is possible, output \"yes\" along with the start and end indices of the segment to be reversed. Otherwise, output \"no\"."}, {"prompt_md5": "1662ee54", "template_md5": "465699a0", "result": "You are given a list of distinct numbers.  Determine if you can sort the list in ascending order by reversing a single section of the list. If so, output \"yes\" along with the start and end positions of that section. Otherwise, output \"no\"."}]}