{"uid": "451-A", "url": "https://codeforces.com/contest/451/problem/A", "tags": ["implementation"], "title": "451-A", "statement": "A. Game With Stickstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAfter winning gold and silver in IOI 2014, Akshat and Malvika want to have some fun. Now they are playing a game on a grid made ofnhorizontal andmvertical sticks.Anintersection pointis any point on the grid which is formed by the intersection of one horizontal stick and one vertical stick.In the grid shown below,n= 3andm= 3. There aren+m= 6sticks in total (horizontal sticks are shown in red and vertical sticks are shown in green). There aren·m= 9intersection points, numbered from1to9.The rules of the game are very simple. The players move in turns. Akshat won gold, so he makes the first move. During his/her move, a player must choose any remaining intersection point and remove from the grid all sticks which pass through this point. A player will lose the game if he/she cannot make a move (i.e. there are no intersection points remaining on the grid at his/her move).Assume that both players play optimally. Who will win the game?InputThe first line of input contains two space-separated integers,nandm(1 ≤n,m≤ 100).OutputPrint a single line containing \"Akshat\" or \"Malvika\" (without the quotes), depending on the winner of the game.ExamplesInput2 2OutputMalvikaInput2 3OutputMalvikaInput3 3OutputAkshatNoteExplanation of the first sample:The grid has four intersection points, numbered from1to4.If Akshat chooses intersection point1, then he will remove two sticks (1 - 2and1 - 3). The resulting grid will look like this.Now there is only one remaining intersection point (i.e.4). Malvika must choose it and remove both remaining sticks. After her move the grid will be empty.In the empty grid, Akshat cannot make any move, hence he will lose.Since all4intersection points of the grid are equivalent, Akshat will lose no matter which one he picks.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "263c62e7", "template_md5": "35d339e4", "result": "There is a grid made of $n$ horizontal sticks and $m$ vertical sticks. An intersection point is formed where a horizontal stick and a vertical stick meet.  \n\nTwo players take turns removing sticks. On each turn, a player chooses an intersection point and removes all sticks that pass through that point. The game ends when a player cannot make a move (there are no more intersection points).\n\nAssuming both players play perfectly, who will win the game?\n\nYou are given $n$ and $m$ (the number of horizontal and vertical sticks, respectively). Determine the winner and print their name."}, {"prompt_md5": "aa0c19b7", "template_md5": "465699a0", "result": "Two players take turns removing sticks from a grid.  A player removes all sticks that pass through a chosen intersection point. The first player unable to make a move loses. Determine the winner if both players play optimally."}]}