{"uid": "452-C", "url": "https://codeforces.com/contest/452/problem/C", "tags": ["combinatorics", " math", " probabilities"], "title": "452-C", "statement": "C. Magic Tricktime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAlex enjoys performing magic tricks. He has a trick that requires a deck ofncards. He hasmidentical decks ofndifferent cards each, which have been mixed together. When Alex wishes to perform the trick, he grabsncards at random and performs the trick with those. The resulting deck looks like a normal deck, but may have duplicates of some cards.The trick itself is performed as follows: first Alex allows you to choose a random card from the deck. You memorize the card and put it back in the deck. Then Alex shuffles the deck, and pulls out a card. If the card matches the one you memorized, the trick is successful.You don't think Alex is a very good magician, and that he just pulls a card randomly from the deck. Determine the probability of the trick being successful if this is the case.InputFirst line of the input consists of two integersnandm(1 ≤n,m≤ 1000), separated by space — number of cards in each deck, and number of decks.OutputOn the only line of the output print one floating point number – probability of Alex successfully performing the trick. Relative or absolute error of your answer should not be higher than10- 6.ExamplesInput2 2Output0.6666666666666666Input4 4Output0.4000000000000000Input1 2Output1.0000000000000000NoteIn the first sample, with probabilityAlex will perform the trick with two cards with the same value from two different decks. In this case the trick is guaranteed to succeed.With the remainingprobability he took two different cards, and the probability of pulling off the trick is.The resulting probability is", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2f1f6ba", "template_md5": "35d339e4", "result": "There are $n$ different types of cards. There are $m$ decks of cards, and each deck has $n$ cards.  All the cards from all the decks are mixed together.\n\nA person randomly selects $n$ cards from the mixed deck. What is the probability that they will select a card that matches the card they previously chose and memorized?"}, {"prompt_md5": "9b14e436", "template_md5": "465699a0", "result": "You have multiple decks of cards, each with a unique set of cards.  You draw a card, memorize it, and put it back. Then, a random card is drawn from the deck. What is the chance the drawn card matches the one you memorized?"}]}