{"uid": "453-B", "url": "https://codeforces.com/contest/453/problem/B", "tags": ["bitmasks", " brute force", " dp"], "title": "453-B", "statement": "B. Little Pony and Harmony Chesttime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPrincess Twilight went to Celestia and Luna's old castle to research the chest from the Elements of Harmony.A sequence of positive integersbiis harmony if and only if for every two elements of the sequence their greatest common divisor equals 1. According to an ancient book, the key of the chest is a harmony sequencebiwhich minimizes the following expression:You are given sequenceai, help Princess Twilight to find the key.InputThe first line contains an integern(1 ≤n≤ 100) — the number of elements of the sequencesaandb. The next line containsnintegersa1,a2, ...,an(1 ≤ai≤ 30).OutputOutput the key — sequencebithat minimizes the sum described above. If there are multiple optimal sequences, you can output any of them.ExamplesInput51 1 1 1 1Output1 1 1 1 1Input51 6 4 2 8Output1 5 3 1 8", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0dd2b367", "template_md5": "35d339e4", "result": "You are given a sequence of integers $a_1, a_2, ..., a_n$.  Find a sequence of positive integers $b_1, b_2, ..., b_n$ that minimizes the following sum:\n\n$$\\sum_{i=1}^{n} \\sum_{j=1}^{n} \\text{gcd}(b_i, b_j)$$\n\nwhere $\\text{gcd}(x, y)$ is the greatest common divisor of $x$ and $y$.\n\nThe sequence $b_1, b_2, ..., b_n$ is considered \"harmony\" if for every pair of elements in the sequence, their greatest common divisor is 1. \n\n\nYou must output a harmony sequence that minimizes the sum. If there are multiple optimal sequences, you can output any of them."}, {"prompt_md5": "5a9c71e0", "template_md5": "465699a0", "result": "You are given a sequence of numbers. Find a sequence of numbers that minimizes the sum of the differences between corresponding numbers in the two sequences, where the second sequence must meet the following condition: any two numbers in the second sequence must have no common divisors other than 1."}]}