{"uid": "453-E", "url": "https://codeforces.com/contest/453/problem/E", "tags": ["data structures"], "title": "453-E", "statement": "E. Little Pony and Lord Tirektime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLord Tirek is a centaur and the main antagonist in the season four finale episodes in the series \"My Little Pony: Friendship Is Magic\". In \"Twilight's Kingdom\" (Part 1), Tirek escapes from Tartarus and drains magic from ponies to grow stronger.The core skill of Tirek is called Absorb Mana. It takes all mana from a magic creature and gives them to the caster.Now to simplify the problem, assume you havenponies (numbered from 1 ton). Each pony has three attributes:si: amount of mana that the pony has at time 0;mi: maximum mana that the pony can have;ri: mana regeneration per unit time.Lord Tirek will dominstructions, each of them can be described with three integers:ti,li,ri. The instruction means that at timeti, Tirek will use Absorb Mana on ponies with numbers fromlitori(both borders inclusive). We'll give you all theminstructions in order, count how much mana Tirek absorbs for each instruction.InputThe first line contains an integern(1 ≤n≤ 105) — the number of ponies. Each of the nextnlines contains three integerssi,mi,ri(0 ≤si≤mi≤ 105; 0 ≤ri≤ 105), describing a pony.The next line contains an integerm(1 ≤m≤ 105) — the number of instructions. Each of the nextmlines contains three integersti,li,ri(0 ≤ti≤ 109; 1 ≤li≤ri≤n), describing an instruction of Lord Tirek. The instructions are given in strictly increasing order ofti(alltiare distinct).OutputFor each instruction, output a single line which contains a single integer, the total mana absorbed in this instruction.ExamplesInput50 10 10 12 10 20 10 12 10 10 125 1 519 1 5Output2558NoteEvery pony starts with zero mana. For the first instruction, each pony has 5 mana, so you get 25 mana in total and each pony has 0 mana after the first instruction.For the second instruction, pony 3 has 14 mana and other ponies have mana equal to theirmi.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "92f855e3", "template_md5": "35d339e4", "result": "You are given $n$ ponies, each with an initial mana amount ($s_i$), a maximum mana capacity ($m_i$), and a mana regeneration rate ($r_i$). \n\nYou are also given $m$ instructions. Each instruction consists of a time ($t_i$), a starting pony index ($l_i$), and an ending pony index ($r_i$). At time $t_i$, all ponies from index $l_i$ to $r_i$ (inclusive) will have their mana drained by an entity. The amount of mana drained from each pony is equal to their current mana.\n\nFor each instruction, calculate the total mana drained by the entity.\n\n**Input:**\n\n* The first line contains $n$ (the number of ponies).\n* The next $n$ lines each contain three integers: $s_i$, $m_i$, and $r_i$ (initial mana, maximum mana, and regeneration rate for each pony).\n* The next line contains $m$ (the number of instructions).\n* The next $m$ lines each contain three integers: $t_i$, $l_i$, and $r_i$ (time, starting index, and ending index for each instruction).\n\n**Output:**\n\n* For each instruction, output a single line containing the total mana drained."}, {"prompt_md5": "5fe520d8", "template_md5": "465699a0", "result": "You are given a list of items, each with a starting amount, a maximum capacity, and a regeneration rate.  At specific times, you select a range of items and take all their current amount.  Calculate the total amount taken at each time."}]}