{"uid": "455-D", "url": "https://codeforces.com/contest/455/problem/D", "tags": ["data structures"], "title": "455-D", "statement": "D. Serega and Funtime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSerega loves fun. However, everyone has fun in the unique manner. Serega has fun by solving query problems. One day Fedor came up with such a problem.You are given an arrayaconsisting ofnpositive integers and queries to it. The queries can be of two types:Make a unit cyclic shift to the right on the segment fromltor(both borders inclusive). That is rearrange elements of the array in the following manner:a[l],a[l+ 1], ...,a[r- 1],a[r] →a[r],a[l],a[l+ 1], ...,a[r- 1].Count how many numbers equal tokare on the segment fromltor(both borders inclusive).Fedor hurried to see Serega enjoy the problem and Serega solved it really quickly. Let's see, can you solve it?InputThe first line contains integern(1 ≤n≤ 105) — the number of elements of the array. The second line containsnintegersa[1],a[2], ...,a[n](1 ≤a[i] ≤n).The third line contains a single integerq(1 ≤q≤ 105) — the number of queries. The nextqlines contain the queries.As you need to respond to the queries online, the queries will beencoded. A query of the first type will be given in format:1l'ir'i. A query of the second type will be given in format:2l'ir'ik'i. All the number in input are integer. They satisfy the constraints:1 ≤l'i,r'i,k'i≤n.To decode the queries from the data given in input, you need to perform the following transformations:li= ((l'i+lastans- 1)modn) + 1;ri= ((r'i+lastans- 1)modn) + 1;ki= ((k'i+lastans- 1)modn) + 1.Wherelastansis the last reply to the query of the 2-nd type (initially,lastans= 0). If after transformationliis greater thanri, you must swap these values.OutputFor each query of the 2-nd type print the answer on a single line.ExamplesInput76 6 2 7 4 2 571 3 62 2 4 22 2 4 72 2 2 51 2 61 1 42 1 7 3Output2100Input88 4 2 2 7 7 8 881 8 82 8 1 71 8 11 7 32 8 8 31 1 41 2 71 4 5Output20", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "295f7bc0", "template_md5": "35d339e4", "result": "You are given an array of $n$ positive integers. You will be given $q$ queries. \n\nThere are two types of queries:\n\n* **Type 1:** Make a cyclic shift to the right on the segment from index $l$ to $r$ (inclusive). This means rearranging the elements of the array as follows: $a[l], a[l+1], ..., a[r-1], a[r] \\rightarrow a[r], a[l], a[l+1], ..., a[r-1]$.\n* **Type 2:** Count how many numbers equal to $k$ are on the segment from index $l$ to $r$ (inclusive).\n\nThe queries are encoded. To decode them, you need to use the following formula:\n\n* $l_i = ((l'_i + lastans - 1) \\mod n) + 1$\n* $r_i = ((r'_i + lastans - 1) \\mod n) + 1$\n* $k_i = ((k'_i + lastans - 1) \\mod n) + 1$\n\nWhere $lastans$ is the last answer to a query of type 2 (initially, $lastans = 0$). If $l_i$ is greater than $r_i$, you must swap these values.\n\nFor each query of type 2, print the answer on a single line."}, {"prompt_md5": "3d957487", "template_md5": "465699a0", "result": "You are given a list of numbers. You can perform two types of operations:\n\n1. Rotate the list by one position to the right within a given range.\n2. Count how many numbers in a given range are equal to a specific target number.\n\nYou will be given a series of operations to perform and need to answer the count queries.  The ranges and target number for each operation are given in a coded format that depends on the previous answers."}]}