{"uid": "457-C", "url": "https://codeforces.com/contest/457/problem/C", "tags": ["brute force"], "title": "457-C", "statement": "C. Electionstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are running for a governor in a small city in Russia. You ran some polls and did some research, and for every person in the city you know whom he will vote for, and how much it will cost to bribe that person to vote for you instead of whomever he wants to vote for right now. You are curious, what is the smallest amount of money you need to spend on bribing to win the elections. To win elections you need to have strictly more votes than any other candidate.InputFirst line contains one integern(1 ≤n≤ 105) — number of voters in the city. Each of the nextnlines describes one voter and contains two integersaiandbi(0 ≤ai≤ 105; 0 ≤bi≤ 104) — number of the candidate that voter is going to vote for and amount of money you need to pay him to change his mind. You are the candidate0(so if a voter wants to vote for you,aiis equal to zero, in which casebiwill also be equal to zero).OutputPrint one integer — smallest amount of money you need to spend to win the elections.ExamplesInput51 21 21 22 10 0Output3Input41 21 22 10 0Output2Input1100000 0Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6582b424", "template_md5": "35d339e4", "result": "You are running in an election. You know how many people will vote for each candidate and how much it costs to bribe each person to vote for you instead.  What is the least amount of money you need to spend to win the election? To win, you need more votes than any other candidate.\n\nInput:\n\n* The first line contains the number of voters ($n$).\n* Each of the next $n$ lines describes a voter:\n    * The first number ($a_i$) is the candidate the voter will vote for.\n    * The second number ($b_i$) is the amount of money it costs to bribe that voter to vote for you.\n\nOutput:\n\n* Print the smallest amount of money you need to spend to win."}, {"prompt_md5": "1af71229", "template_md5": "465699a0", "result": "You need to determine the minimum amount of money to spend to influence voters to choose you in an election. Each voter has a preferred candidate and a bribe amount to switch their vote.  You want to win, meaning you need more votes than any other candidate."}]}