{"uid": "459-A", "url": "https://codeforces.com/contest/459/problem/A", "tags": ["implementation"], "title": "459-A", "statement": "A. Pashmak and Gardentime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPashmak has fallen in love with an attractive girl called Parmida since one year ago...Today, Pashmak set up a meeting with his partner in a romantic garden. Unfortunately, Pashmak has forgotten where the garden is. But he remembers that the garden looks like a square with sides parallel to the coordinate axes. He also remembers that there is exactly one tree on each vertex of the square. Now, Pashmak knows the position of only two of the trees. Help him to find the position of two remaining ones.InputThe first line contains four space-separatedx1,y1,x2,y2( - 100 ≤x1,y1,x2,y2≤ 100)integers, wherex1andy1are coordinates of the first tree andx2andy2are coordinates of the second tree. It's guaranteed that the given points are distinct.OutputIf there is no solution to the problem, print-1. Otherwise print four space-separated integersx3,y3,x4,y4that correspond to the coordinates of the two other trees. If there are several solutions you can output any of them.Note thatx3,y3,x4,y4must be in the range( - 1000 ≤x3,y3,x4,y4≤ 1000).ExamplesInput0 0 0 1Output1 0 1 1Input0 0 1 1Output0 1 1 0Input0 0 1 2Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4db53346", "template_md5": "35d339e4", "result": "You are given the coordinates of two points on a square.  Find the coordinates of the other two points on the square. \n\nThe coordinates of the points are given as four integers separated by spaces: $x_1$, $y_1$, $x_2$, $y_2$. \n\n*  $x_1$ and $y_1$ are the coordinates of the first point.\n*  $x_2$ and $y_2$ are the coordinates of the second point.\n\nThe coordinates of the other two points should be output as four integers separated by spaces: $x_3$, $y_3$, $x_4$, $y_4$.\n\nIf there is no solution, output -1."}, {"prompt_md5": "6733ddc4", "template_md5": "465699a0", "result": "You are given the location of two points. Find the locations of two other points that, along with the given points, form a square."}]}