{"uid": "459-C", "url": "https://codeforces.com/contest/459/problem/C", "tags": ["combinatorics", " constructive algorithms", " math"], "title": "459-C", "statement": "C. Pashmak and Busestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutRecently Pashmak has been employed in a transportation company. The company haskbuses and has a contract with a school which hasnstudents. The school planned to take the students toddifferent places forddays (each day in one place). Each day the company provides all the buses for the trip. Pashmak has to arrange the students in the buses. He wants to arrange the students in a way that no two students become close friends. In his ridiculous idea, two students will become close friends if and only if they are in the same buses for allddays.Please help Pashmak with his weird idea. Assume that each bus has an unlimited capacity.InputThe first line of input contains three space-separated integersn,k,d(1 ≤n,d≤ 1000; 1 ≤k≤ 109).OutputIf there is no valid arrangement just print-1. Otherwise printdlines, in each of them printnintegers. Thej-th integer of thei-th line shows which bus thej-th student has to take on thei-th day. You can assume that the buses are numbered from1tok.ExamplesInput3 2 2Output1 1 21 2 1Input3 2 1Output-1NoteNote that two students become close friends only if they share a bus each day. But the bus they share can differ from day to day.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6113ea2d", "template_md5": "35d339e4", "result": "There are $n$ students and $k$ buses.  The students need to be transported to $d$ different places over $d$ days. Each day, all buses are used.  \n\nThe problem is to arrange the students into buses each day so that no two students who are friends are in the same bus for all $d$ days.\n\n**Input:**\n\n* The first line contains three integers: $n$, $k$, and $d$.\n\n**Output:**\n\n* If it's impossible to arrange the students without any friends being in the same bus for all $d$ days, print $-1$.\n* Otherwise, print $d$ lines. Each line should contain $n$ integers. The $j$-th integer on the $i$-th line represents which bus the $j$-th student should take on the $i$-th day."}, {"prompt_md5": "cee4e1f0", "template_md5": "465699a0", "result": "You are given a number of students and a number of buses.  Students need to be assigned to buses over a number of days.  The goal is to assign students to buses so that no two students are assigned to the same bus for all the days. If this is impossible, output -1. Otherwise, output the bus assignments for each day."}]}