{"uid": "46-B", "url": "https://codeforces.com/contest/46/problem/B", "tags": ["implementation"], "title": "46-B", "statement": "B. T-shirts from Sponsortime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day a well-known sponsor of a well-known contest decided to give every participant of the contest a T-shirt as a present. A natural problem occurred: on the one hand, it is not clear how many T-shirts of what sizes should be ordered, and on the other hand, one doesn't want to order too many T-shirts (and we do not exactly paper the walls with the oversupply). After considerable brain racking and some pre-estimating, the sponsor representatives ordered a certain number of T-shirts of sizes S, M, L, XL and XXL. The T-shirts turned out to bring good luck, that's why on the contest day there built up a line ofKparticipants willing to get one. Every contestant is characterized by his/her desired T-shirt size (so it happens that for all the participants it is also one of the sizes S, M, L, XL and XXL). The participants come up to get a T-shirt one by one and try to choose the most suitable one, choosing it like this. If there is still a T-shirt of the optimal size left, that he/she takes it without further ado. Otherwise the contestant would prefer to choose a T-shirt with the size as close to the optimal one as possible (the distance between neighboring sizes is considered equal to one). If the variant of choice is not unique, the contestant will take a T-shirt of a bigger size (in case he/she grows more). For example, for a person whose optimal size is L the preference list looks like this: L, XL, M, XXL, S. Using the data on how many T-shirts of every size had been ordered by the organizers, on the size of contestants in the line determine who got a T-shirt of what size.InputThe first line contains five non-negative integersNS,NM,NL,NXL,NXXLnot exceeding 1000 which represent the number of T-shirts of the corresponding sizes. The second line contains an integerK(1 ≤K≤ 1000) which represents the number of participants. The nextKlines contain the optimal T-shirt sizes for the contestants. The sizes are given in the order in which the participants stand in the line. It is guaranteed thatNS+NM+NL+NXL+NXXL≥K.OutputFor each contestant, print a line containing the size of the T-shirt he/she got.ExamplesInput1 0 2 0 13XLXXLMOutputXXLLL", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f28bbcae", "template_md5": "35d339e4", "result": "There are $N_S$, $N_M$, $N_L$, $N_{XL}$, and $N_{XXL}$ T-shirts of sizes S, M, L, XL, and XXL respectively.  There are $K$ people in line, each wanting a T-shirt of a specific size. The $i$-th person wants a size $S_i$. If a size $S_i$ T-shirt is available, they take it. Otherwise, they take the next larger size that is available.\n\nGiven the number of T-shirts of each size and the desired sizes of the people in line, determine the size of the T-shirt each person gets. \n\n**Input:**\n\n* 5 integers: $N_S$, $N_M$, $N_L$, $N_{XL}$, $N_{XXL}$ (the number of each size T-shirt)\n* 1 integer: $K$ (the number of people in line)\n* $K$ lines, each containing a single character: $S_i$ (the desired size of the $i$-th person)\n\n**Output:**\n\n* $K$ lines, each containing a single character: the size of the T-shirt the $i$-th person gets."}, {"prompt_md5": "de4ca454", "template_md5": "465699a0", "result": "You are given a number of T-shirts in different sizes (S, M, L, XL, XXL).  A line of people each want a T-shirt of a specific size.  If their size is available, they take it. Otherwise, they take the next largest available size.  Determine what size T-shirt each person gets."}]}