{"uid": "46-E", "url": "https://codeforces.com/contest/46/problem/E", "tags": ["data structures", " dp"], "title": "46-E", "statement": "E. Combtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutHaving endured all the hardships, Lara Croft finally found herself in a room with treasures. To her surprise she didn't find golden mountains there. Lara looked around and noticed on the floor a painted tablen×mpanels in size with integers written on the panels. There also was a huge number of stones lying by the wall. On the pillar near the table Lara found a guidance note which said that to get hold of the treasures one has to choose some non-zero number of the first panels in each row of the table and put stones on all those panels to push them down. After that she will receive a number of golden coins equal to the sum of numbers written on the chosen panels. Lara quickly made up her mind on how to arrange the stones and was about to start when she noticed an addition to the note in small font below. According to the addition, for the room ceiling not to crush and smash the adventurer, the chosen panels should form a comb. It was explained that the chosen panels form a comb when the sequencec1,c2, ...,cnmade from the quantities of panels chosen in each table line satisfies the following property:c1>c2<c3>c4< ..., i.e. the inequation mark interchanges between the neighboring elements. Now Lara is bewildered and doesn't know what to do. Help her to determine the largest number of coins she can get and survive at the same time.InputThe first line contains a pair of integersn,m(2 ≤n,m≤ 1500). Nextnlines containmintegers each — that is the table itself. The absolute value of the numbers in the table does not exceed10000.OutputPrint the single number — the maximum number of coins Lara can get.ExamplesInput2 2-1 21 3Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aeb427de", "template_md5": "465699a0", "result": "You are given a grid of numbers.  You can choose some numbers in each row, following a specific pattern (increasing then decreasing), and add them together. What is the largest sum you can get?"}, {"prompt_md5": "e4cf5b8d", "template_md5": "35d339e4", "result": "You are given a table of size $n \\times m$ filled with integers.  You can choose a non-zero number of panels in each row of the table.  The sum of the integers on the chosen panels is your score.  \n\nHowever, there is a rule: the chosen panels must form a \"comb\". A comb is formed when the sequence of the number of panels chosen in each row follows the pattern:  $c_1 > c_2 < c_3 > c_4 < ...$.\n\nFind the maximum score you can achieve while following the comb rule. \n\n\nInput:\n\n* The first line contains two integers, $n$ and $m$ (2 ≤ $n$, $m$ ≤ 1500), representing the number of rows and columns in the table.\n* The next $n$ lines contain $m$ integers each, representing the table itself. The absolute value of each integer does not exceed 10000.\n\nOutput:\n\n* Print a single integer representing the maximum score you can achieve."}]}