{"uid": "46-F", "url": "https://codeforces.com/contest/46/problem/F", "tags": ["dsu", " graphs"], "title": "46-F", "statement": "F. Hercule Poirot Problemtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutToday you are to solve the problem even the famous Hercule Poirot can't cope with! That's why this crime has not yet been solved and this story was never included in Agatha Christie's detective story books.You are not informed on what crime was committed, when and where the corpse was found and other details. We only know that the crime was committed in a house that hasnrooms andmdoors between the pairs of rooms. The house residents are very suspicious, that's why all the doors can be locked with keys and all the keys are different. According to the provided evidence on Thursday night all the doors in the house were locked, and it is known in what rooms were the residents, and what kind of keys had any one of them. The same is known for the Friday night, when all the doors were also locked. On Friday it was raining heavily, that's why nobody left the house and nobody entered it. During the day the house residents couldopen and close doors to the neighboring rooms using the keys at their disposal (every door can be opened and closed from each side);move freely from a room to a room if a corresponding door is open;give keys to one another, being in one room.\"Little grey matter\" of Hercule Poirot are not capable of coping with such amount of information. Find out if the positions of people and keys on the Thursday night could result in the positions on Friday night, otherwise somebody among the witnesses is surely lying.InputThe first line contains three preset integersn,mиk(1 ≤n,m,k≤ 1000) — the number of rooms, the number of doors and the number of house residents respectively. The nextmlines contain pairs of room numbers which join the doors. The rooms are numbered with integers from1ton. There cannot be more that one door between the pair of rooms. No door connects a room with itself. The nextklines describe the residents' position on the first night. Every line contains a resident's name (a non-empty line consisting of no more than10Latin letters), then after a space follows the room number, then, after a space — the number of keys the resident has. Then follow written space-separated numbers of the doors that can be unlocked by these keys. The doors are numbered with integers from1tomin the order in which they are described in the input data. All the residents have different names, uppercase and lowercase letters considered to be different. Everymkeys occurs exactly once in the description. Multiple people may be present in one room, some rooms may be empty. The nextklines describe the position of the residents on the second night in the very same format. It is guaranteed that in the second night's description the residents' names remain the same and everymkeys occurs exactly once.OutputPrint \"YES\" (without quotes) if the second arrangement can result from the first one, otherwise, print \"NO\".ExamplesInput2 1 21 2Dmitry 1 1 1Natalia 2 0Natalia 1 1 1Dmitry 2 0OutputYESInput4 4 31 31 22 33 4Artem 1 1 4Dmitry 1 1 2Edvard 4 2 1 3Artem 2 0Dmitry 1 0Edvard 4 4 1 2 3 4OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bbe97983", "template_md5": "35d339e4", "result": "You are given a house with $n$ rooms and $m$ doors. Each door connects two rooms.  \n\nOn Thursday night, you know the location of $k$ residents in the house and the keys each resident possesses. You also know which doors each key can unlock.\n\nOn Friday night, you know the location of the same $k$ residents again, and which doors each key can unlock.\n\nYou are given the information about the doors and keys for both Thursday and Friday night.\n\nDetermine if it is possible for the residents to move between rooms and exchange keys on Thursday night in a way that would result in the positions and key distributions observed on Friday night. If it is possible, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "843fca8c", "template_md5": "465699a0", "result": "You are given information about the positions of people in rooms and the keys they have on two consecutive nights.  You also know the connections between the rooms. Determine if it's possible for the people to move between rooms and exchange keys on the first night to result in the positions on the second night. If it's possible, output \"YES\", otherwise output \"NO\"."}]}