{"uid": "463-E", "url": "https://codeforces.com/contest/463/problem/E", "tags": ["brute force", " dfs and similar", " math", " number theory", " trees"], "title": "463-E", "statement": "E. Caisa and Treetime limit per test10 secondsmemory limit per test256 megabytesinputstdinoutputstdoutCaisa is now at home and his son has a simple task for him.Given a rooted tree withnvertices, numbered from1ton(vertex1is the root). Each vertex of the tree has a value. You should answerqqueries. Each query is one of the following:Format of the query is \"1v\". Let's write out the sequence of vertices along the path from the root to vertexv:u1,u2, ...,uk(u1= 1;uk=v). You need to output such a vertexuithatgcd(valueofui,valueofv) > 1andi<k. If there are several possible verticesuipick the one with maximum value ofi. If there is no such vertex output-1.Format of the query is \"2vw\". You must change the value of vertexvtow.You are given all the queries, help Caisa to solve the problem.InputThe first line contains two space-separated integersn,q(1 ≤n,q≤ 105).The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 2·106), whereairepresent the value of nodei.Each of the nextn- 1lines contains two integersxiandyi(1 ≤xi,yi≤n;xi≠yi), denoting the edge of the tree between verticesxiandyi.Each of the nextqlines contains a query in the format that is given above. For each query the following inequalities hold:1 ≤v≤nand1 ≤w≤ 2·106.Note that: there are no more than50queries that changes the value of a vertex.OutputFor each query of the first type output the result of the query.ExamplesInput4 610 8 4 31 22 33 41 11 21 31 42 1 91 4Output-112-11Notegcd(x,y)is greatest common divisor of two integersxandy.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0359aa6c", "template_md5": "35d339e4", "result": "You are given a rooted tree with $n$ vertices, numbered from 1 to $n$ (vertex 1 is the root). Each vertex has a value. \n\nYou need to answer $q$ queries. \n\n* **Query Type 1:** \"1 v\" \n    * Find the largest vertex $u$ along the path from the root to vertex $v$ such that  $gcd(value_{u}, value_{v}) > 1$ and $i < k$. If no such vertex exists, output -1.\n* **Query Type 2:** \"2 v w\"\n    * Change the value of vertex $v$ to $w$.\n\n**Input:**\n\n* The first line contains two space-separated integers $n$ and $q$ (1 ≤ $n$, $q$ ≤ 10⁵).\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (1 ≤ $a_i$ ≤ 2·10⁶), representing the value of each node.\n* Each of the next $n-1$ lines contains two integers $x_i$ and $y_i$ (1 ≤ $x_i$, $y_i$ ≤ $n$; $x_i$ ≠ $y_i$), denoting the edge between vertices $x_i$ and $y_i$.\n* Each of the next $q$ lines contains a query in the format described above.\n\n**Output:**\n\nFor each query of type 1, output the result. \n\n\n\nLet me know if you have any other questions."}, {"prompt_md5": "321f70d4", "template_md5": "465699a0", "result": "You are given a tree with numbered nodes, each having a value. You need to answer queries of two types:\n\n1. **Find a node along the path from the root to a given node, whose value has a greatest common divisor greater than 1 with the target node's value. Return the highest numbered such node found. If none exists, return -1.**\n2. **Change the value of a given node to a new value.**"}]}