{"uid": "464-A", "url": "https://codeforces.com/contest/464/problem/A", "tags": ["greedy", " strings"], "title": "464-A", "statement": "A. No to Palindromes!time limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPaulhatespalindromes. He assumes that stringsistolerableif each its character is one of the firstpletters of the English alphabet andsdoesn't contain any palindrome contiguous substring of length 2 or more.Paul has found a tolerable stringsof lengthn. Help him find the lexicographically next tolerable string of the same length or else state that such string does not exist.InputThe first line contains two space-separated integers:nandp(1 ≤n≤ 1000;1 ≤p≤ 26). The second line contains strings, consisting ofnsmall English letters. It is guaranteed that the string is tolerable (according to the above definition).OutputIf the lexicographically next tolerable string of the same length exists, print it. Otherwise, print \"NO\" (without the quotes).ExamplesInput3 3cbaOutputNOInput3 4cbaOutputcbdInput4 4abcdOutputabdaNoteStringsislexicographically larger(or simplylarger) than stringtwith the same length, if there is numberi, such thats1=t1, ...,si=ti,si+ 1>ti+ 1.The lexicographically next tolerable string is the lexicographically minimum tolerable string which is larger than the given one.A palindrome is a string that reads the same forward or reversed.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2522300", "template_md5": "35d339e4", "result": "Given a string of length $n$ consisting of the first $p$ letters of the English alphabet, find the lexicographically next larger string of the same length that does not contain any palindromes of length 2 or more. If no such string exists, print \"NO\". \n\n**Example:**\n\n* Input: $n = 3$, $p = 3$, string = \"cba\"\n* Output: \"NO\"\n\n* Input: $n = 3$, $p = 4$, string = \"cba\"\n* Output: \"cbd\" \n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "4acf67d4", "template_md5": "465699a0", "result": "Given a string of lowercase letters, find the next lexicographically larger string of the same length that does not contain any palindromes of length 2 or more. If no such string exists, say \"NO\"."}]}