{"uid": "466-D", "url": "https://codeforces.com/contest/466/problem/D", "tags": ["combinatorics", " dp"], "title": "466-D", "statement": "D. Increase Sequencetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPeter has a sequence of integersa1,a2, ...,an. Peter wants all numbers in the sequence to equalh. He can perform the operation of \"adding one on the segment[l,r]\": add one to all elements of the sequence with indices fromltor(inclusive). At that, Peter never chooses any element as the beginning of the segment twice. Similarly, Peter never chooses any element as the end of the segment twice. In other words, for any two segments[l1,r1]and[l2,r2], where Peter added one, the following inequalities hold:l1≠l2andr1≠r2.How many distinct ways are there to make all numbers in the sequence equalh? Print this number of ways modulo1000000007 (109+ 7). Two ways are considered distinct if one of them has a segment that isn't in the other way.InputThe first line contains two integersn,h(1 ≤n,h≤ 2000). The next line containsnintegersa1,a2, ...,an(0 ≤ai≤ 2000).OutputPrint a single integer — the answer to the problem modulo1000000007 (109+ 7).ExamplesInput3 21 1 1Output4Input5 11 1 1 1 1Output1Input4 33 2 1 1Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c73c842d", "template_md5": "35d339e4", "result": "You are given a sequence of integers $a_1, a_2, ..., a_n$. You want to change all the numbers in the sequence to a target value $h$. You can perform the following operation any number of times:\n\n* **Add 1 to a segment of the sequence:** Choose two indices $l$ and $r$ ($1 \\le l \\le r \\le n$) and add 1 to all the elements in the sequence from index $l$ to $r$ (inclusive).\n\nThe only restriction is that you cannot choose the same starting or ending index for two different operations.\n\nFind the number of distinct ways to make all the numbers in the sequence equal to $h$.  Print the answer modulo $10^9 + 7$."}, {"prompt_md5": "f8ac9a97", "template_md5": "465699a0", "result": "You are given a list of numbers. You can repeatedly add 1 to a continuous range of numbers in the list.  The range cannot overlap.  Find how many different ways you can make all the numbers in the list equal to a target number."}]}