{"uid": "467-A", "url": "https://codeforces.com/contest/467/problem/A", "tags": ["implementation"], "title": "467-A", "statement": "A. George and Accommodationtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutGeorge has recently entered the BSUCP (Berland State University for Cool Programmers). George has a friend Alex who has also entered the university. Now they are moving into a dormitory.George and Alex want to live in the same room. The dormitory hasnrooms in total. At the moment thei-th room haspipeople living in it and the room can accommodateqipeople in total (pi≤qi). Your task is to count how many rooms has free place for both George and Alex.InputThe first line contains a single integern(1 ≤n≤ 100)— the number of rooms.Thei-th of the nextnlines contains two integerspiandqi(0 ≤pi≤qi≤ 100)— the number of people who already live in thei-th room and the room's capacity.OutputPrint a single integer — the number of rooms where George and Alex can move in.ExamplesInput31 12 23 3Output0Input31 100 1010 10Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "96545460", "template_md5": "35d339e4", "result": "There are $n$ rooms available in a dormitory. Each room has a current occupancy ($p_i$) and a maximum capacity ($q_i$).  \n\nDetermine the number of rooms that have enough space to accommodate two more people. \n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), representing the number of rooms.\n* Each of the next $n$ lines contains two integers, $p_i$ and $q_i$ (0 ≤ $p_i$ ≤ $q_i$ ≤ 100), representing the current occupancy and maximum capacity of the $i$-th room, respectively.\n\nOutput:\n\n* Print a single integer, representing the number of rooms that can accommodate two more people."}, {"prompt_md5": "60298536", "template_md5": "465699a0", "result": "You are given a list of rooms, each with a current number of occupants and a maximum capacity.  Count how many rooms have enough space for two more people."}]}