{"uid": "467-B", "url": "https://codeforces.com/contest/467/problem/B", "tags": ["bitmasks", " brute force", " constructive algorithms", " implementation"], "title": "467-B", "statement": "B. Fedor and New Gametime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAfter you had helped George and Alex to move in the dorm, they went to help their friend Fedor play a new computer game «Call of Soldiers 3».The game has(m+ 1)players andntypes of soldiers in total. Players «Call of Soldiers 3» are numbered form1to(m+ 1). Types of soldiers are numbered from0ton- 1. Each player has an army. Army of thei-th player can be described by non-negative integerxi. Consider binary representation ofxi: if thej-th bit of numberxiequal to one, then the army of thei-th player has soldiers of thej-th type.Fedor is the(m+ 1)-th player of the game. He assume that two players can become friends if their armies differ in at mostktypes of soldiers (in other words, binary representations of the corresponding numbers differ in at mostkbits). Help Fedor and count how many players can become his friends.InputThe first line contains three integersn,m,k(1 ≤k≤n≤ 20; 1 ≤m≤ 1000).Thei-th of the next(m+ 1)lines contains a single integerxi(1 ≤xi≤ 2n- 1), that describes thei-th player's army. We remind you that Fedor is the(m+ 1)-th player.OutputPrint a single integer — the number of Fedor's potential friends.ExamplesInput7 3 18511117Output0Input3 3 31234Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c772c7b5", "template_md5": "35d339e4", "result": "There are $n$ types of soldiers and $m$ players in a game. Each player has an army represented by a non-negative integer $x_i$. The $j$-th bit of $x_i$ being 1 means the $i$-th player has soldiers of the $j$-th type.\n\nTwo players can be friends if their armies differ in at most $k$ types of soldiers (meaning their binary representations differ in at most $k$ bits).\n\nGiven $n$, $m$, $k$, and the army representation of each player, count how many players can be friends with the $m+1$-th player."}, {"prompt_md5": "c08d014f", "template_md5": "465699a0", "result": "You are given a list of numbers representing the types of soldiers each of  'm+1' players has. Two players can be friends if their soldier types differ by at most 'k' types. Count how many players can be friends with the last player."}]}