{"uid": "47-B", "url": "https://codeforces.com/contest/47/problem/B", "tags": ["implementation"], "title": "47-B", "statement": "B. Coinstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day Vasya came across three Berland coins. They didn't have any numbers that's why Vasya didn't understand how their denominations differ. He supposed that if one coin is heavier than the other one, then it should be worth more. Vasya weighed all the three pairs of coins on pan balance scales and told you the results. Find out how the deminations of the coins differ or if Vasya has a mistake in the weighting results. No two coins are equal.InputThe input data contains the results of all the weighting, one result on each line. It is guaranteed that every coin pair was weighted exactly once. Vasya labelled the coins with letters «A», «B» and «C». Each result is a line that appears as (letter)(> or < sign)(letter). For example, if coin \"A\" proved lighter than coin \"B\", the result of the weighting isA<B.OutputIt the results are contradictory, printImpossible. Otherwise, print without spaces the rearrangement of letters «A», «B» and «C» which represent the coins in the increasing order of their weights.ExamplesInputA>BC<BA>COutputCBAInputA<BB>CC>AOutputACB", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fabfe9d0", "template_md5": "35d339e4", "result": "Three coins have unknown denominations.  We know that the heavier a coin is, the higher its denomination.  You are given the results of weighing all three pairs of coins.  \n\nFor example, if coin A is lighter than coin B, the result is written as A<B.\n\nDetermine the denominations of the coins in increasing order, or determine if the weighing results are contradictory. \n\n\nInput:\n\nEach line represents the result of weighing one pair of coins.\n\nOutput:\n\nIf the weighing results are contradictory, print \"Impossible\". Otherwise, print the denominations of the coins in increasing order (e.g., ABC)."}, {"prompt_md5": "9c582765", "template_md5": "465699a0", "result": "Three objects are weighed against each other in all possible pairs.  You are given the results of these weighings (e.g., A>B means object A is heavier than object B). Determine the order of the objects from lightest to heaviest, or if the weighings are impossible to reconcile."}]}