{"uid": "47-C", "url": "https://codeforces.com/contest/47/problem/C", "tags": ["implementation"], "title": "47-C", "statement": "C. Crosswordtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya trains to compose crossword puzzles. He can only compose crosswords of a very simplе type so far. All of them consist of exactly six words; the words can be read only from top to bottom vertically and from the left to the right horizontally. The words are arranged in the form of a rectangular \"eight\" or infinity sign, not necessarily symmetrical.The top-left corner of the crossword coincides with the top-left corner of the rectangle. The same thing is correct for the right-bottom corners. The crossword can't degrade, i.e. it always has exactly four blank areas, two of which are surrounded by letters. Look into the output for the samples for clarification.Help Vasya — compose a crossword of the described type using the given six words. It is allowed to use the words in any order.InputSix lines contain the given words. Every word consists of no more than 30 and no less than 3 uppercase Latin letters.OutputIf it is impossible to solve the problem, printImpossible. Otherwise, print the sought crossword.Allthe empty squares should be marked as dots.If there can be several solutions to that problem, print the lexicographically minimum one. I.e. the solution where the first line is less than the first line of other solutions should be printed. If the two lines are equal, compare the second lines and so on. The lexicographical comparison of lines is realized by the < operator in the modern programming languages.ExamplesInputNODBAAYARDAIRWAYNEWTONBURNOutputBAA...U.I...R.R...NEWTON..A..O..YARDInputAAAAAAAAAAAAAAAAAAAAAAOutputAAA..A.A..AAAAA..A.A..AAAInputPTCJYNYFDSGIZGPPCIXEJNDOPJJFSSSXXQOFGJUZOutputJJFS....Y..S....N..X....Y..X....F..Q....D..O....S..F....G..G....IXEJNDOP...U...T...ZGPPC", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "96600863", "template_md5": "35d339e4", "result": "You are given six words.  You need to arrange them into a crossword puzzle shape that looks like a rectangle with an \"8\" or infinity sign pattern. \n\n* The crossword must have exactly four empty squares.\n* Two of the empty squares must be surrounded by letters.\n* The words can be arranged in any order.\n* If there are multiple solutions, the lexicographically smallest solution should be printed (the solution where the first line is alphabetically smallest, and if the first lines are the same, the second line is compared, and so on).\n\n**Input:**\n\nSix lines, each containing one word. Each word has between 3 and 30 uppercase letters.\n\n**Output:**\n\nPrint the crossword puzzle as a series of lines.  Use \".\" to represent empty squares. If no solution is possible, print \"Impossible\"."}, {"prompt_md5": "74a61620", "template_md5": "465699a0", "result": "Arrange six words into a crossword puzzle shape that looks like a rectangle with a \"figure eight\" or infinity sign pattern. The puzzle must have four empty spaces, two of which are surrounded by letters.  If multiple solutions exist, choose the one that comes first alphabetically."}]}