{"uid": "47-D", "url": "https://codeforces.com/contest/47/problem/D", "tags": ["brute force"], "title": "47-D", "statement": "D. Safetime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya tries to break in a safe. He knows that a code consists ofnnumbers, and every number is a 0 or a 1. Vasya has mademattempts to enter the code. After each attempt the system told him in how many position stand the right numbers. It is not said in which positions the wrong numbers stand. Vasya has been so unlucky that he hasn’t entered the code where would be more than 5 correct numbers. Now Vasya is completely bewildered: he thinks there’s a mistake in the system and it is self-contradictory. Help Vasya — calculate how many possible code variants are left that do not contradict the previous system responses.InputThe first input line contains two integersnandm(6 ≤n≤ 35, 1 ≤m≤ 10) which represent the number of numbers in the code and the number of attempts made by Vasya. Then followmlines, each containing space-separatedsiandciwhich correspondingly indicate Vasya’s attempt (a line containingnnumbers which are 0 or 1) and the system’s response (an integer from 0 to 5 inclusively).OutputPrint the single number which indicates how many possible code variants that do not contradict themsystem responses are left.ExamplesInput6 2000000 2010100 4Output6Input6 3000000 2010100 4111100 0Output0Input6 3000000 2010100 4111100 2Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e6e2d2dc", "template_md5": "35d339e4", "result": "You are given a code consisting of $n$ numbers, where each number is either 0 or 1.  \n\nThere have been $m$ attempts to enter the code. For each attempt, you know the number of digits that were correct. You do not know the positions of the correct digits.\n\nDetermine how many possible codes are left that are consistent with the given attempts.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($6 \\le n \\le 35$, $1 \\le m \\le 10$).\n* The next $m$ lines each contain two space-separated integers:\n    * The first integer represents an attempt (a sequence of $n$ 0s and 1s).\n    * The second integer represents the number of correct digits in that attempt (between 0 and 5, inclusive).\n\n**Output:**\n\n* Print a single integer representing the number of possible codes that are consistent with the given attempts."}, {"prompt_md5": "8122d2aa", "template_md5": "465699a0", "result": "You are given a code with a certain number of digits.  You know the code has only 0s and 1s. You have made several attempts to guess the code, and after each attempt, the system tells you how many digits you guessed correctly.  You need to figure out how many possible codes could still be correct based on the information you have."}]}