{"uid": "470-D", "url": "https://codeforces.com/contest/470/problem/D", "tags": ["*special"], "title": "470-D", "statement": "D. Caesar Ciphertime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutCaesar cipher is one of the simplest encryption techniques. To transform the original message into encrypted one using keyk, one has to replace each letter with a letter which iskpositions later in the alphabet (if this takes the position beyond Z, the rest of it is counted from the start of the alphabet). In a more formal way, if letters of the alphabet are enumerated starting with0, the result of encryption for characterxwill be(26is the number of letters in the Latin alphabet).You are given the original message and the encryption keyk. Output the result of encryption.InputThe first line of input contains an integerk(0 ≤k≤ 25) — the encryption key.The second line contains the original message — a sequence of uppercase Latin letters ('A'-'Z'). The length of the message is from1to10, inclusive.OutputOutput the result of encryption.ExamplesInput5CODEFORCESOutputHTIJKTWHJXInput13FALSERULEZOutputSNYFREHYRM", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aadb6ffc", "template_md5": "35d339e4", "result": "You are given a number $k$ and a message made up of uppercase letters.  \n\nTo encrypt the message, shift each letter in the message $k$ positions forward in the alphabet. If the shifted letter goes past 'Z', wrap around to the beginning of the alphabet ('A').\n\nFor example, if $k=5$ and the message is \"CODEFORCES\", the encrypted message would be \"HTIJKTWHJX\".\n\nWrite a program that takes $k$ and a message as input and outputs the encrypted message."}, {"prompt_md5": "5aa831e9", "template_md5": "465699a0", "result": "You are given a number and a message made of uppercase letters. Shift each letter in the message forward in the alphabet by the given number of positions. If a letter goes past Z, wrap around to the beginning of the alphabet. Print the shifted message."}]}