{"uid": "471-E", "url": "https://codeforces.com/contest/471/problem/E", "tags": ["data structures", " dsu"], "title": "471-E", "statement": "E. MUH and Lots and Lots of Segmentstime limit per test2 secondsmemory limit per test512 megabytesinputstdinoutputstdoutPolar bears Menshykov and Uslada from the zoo of St. Petersburg and elephant Horace from the zoo of Kiev decided to do some painting. As they were trying to create their first masterpiece, they made a draft on a piece of paper. The draft consists ofnsegments. Each segment was either horizontal or vertical. Now the friends want to simplify the draft by deleting some segments or parts of segments so that the final masterpiece meets three conditions:Horace wants to be able to paint the whole picture in one stroke: by putting the brush on the paper and never taking it off until the picture is ready. The brush can paint the same place multiple times. That's why all the remaining segments must form a single connected shape.Menshykov wants the resulting shape to be simple. He defines a simple shape as a shape that doesn't contain any cycles.Initially all the segment on the draft have integer startpoint and endpoint coordinates. Uslada doesn't like real coordinates and she wants this condition to be fulfilled after all the changes.As in other parts the draft is already beautiful, the friends decided to delete such parts of the draft that the sum of lengths of the remaining segments is as large as possible. Your task is to count this maximum sum of the lengths that remain after all the extra segments are removed.InputThe first line of the input contains integern(1 ≤n≤ 2·105) — the number of segments on the draft. The nextnlines contain four integers each:x1,y1,x2,y2(- 109≤x1≤x2≤ 109;  - 109≤y1≤y2≤ 109)— the two startpoint and the two endpoint coordinates of a segment. All segments are non-degenerative and either are strictly horizontal or strictly vertical.No two horizontal segments share common points. No two vertical segments share common points.OutputPrint a single integer — the maximum sum of lengths for the remaining segments.ExamplesInput20 0 0 11 0 1 1Output1Input40 0 1 00 0 0 11 -1 1 20 1 1 1Output5NoteThe shapes that you can get in the two given samples are:In the first sample you need to delete any segment as the two segments together do not form a single connected shape.In the second sample the initial segments form a cycle, there are four ways to break the cycle: delete the first, second or fourth segment altogether or delete the middle of the third segment. The last way is shown on the picture.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7829f968", "template_md5": "35d339e4", "result": "You are given $n$ line segments on a 2D plane. Each segment is either horizontal or vertical and has integer start and end points.  \n\nFind the maximum total length of segments that can remain after removing some segments to satisfy these conditions:\n\n1. The remaining segments must form a single connected shape.\n2. The remaining shape must not contain any cycles.\n3. The start and end points of all remaining segments must be integers. \n\n\nOutput the maximum total length of the remaining segments."}, {"prompt_md5": "b53e6b7c", "template_md5": "465699a0", "result": "You are given a set of line segments.  Some segments are horizontal, and some are vertical.  Find the maximum total length of segments you can keep while ensuring the remaining segments form a single connected shape without any closed loops."}]}