{"uid": "472-B", "url": "https://codeforces.com/contest/472/problem/B", "tags": [], "title": "472-B", "statement": "B. Design Tutorial: Learn from Lifetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOne way to create a task is to learn from life. You can choose some experience in real life, formalize it and then you will get a new task.Let's think about a scene in real life: there are lots of people waiting in front of the elevator, each person wants to go to a certain floor. We can formalize it in the following way. We havenpeople standing on the first floor, thei-th person wants to go to thefi-th floor. Unfortunately, there is only one elevator and its capacity equal tok(that is at mostkpeople can use it simultaneously). Initially the elevator is located on the first floor. The elevator needs|a-b|seconds to move from thea-th floor to theb-th floor (we don't count the time the people need to get on and off the elevator).What is the minimal number of seconds that is needed to transport all the people to the corresponding floors and then return the elevator to the first floor?InputThe first line contains two integersnandk(1 ≤n,k≤ 2000)— the number of people and the maximal capacity of the elevator.The next line containsnintegers:f1,f2, ...,fn(2 ≤fi≤ 2000), wherefidenotes the target floor of thei-th person.OutputOutput a single integer — the minimal time needed to achieve the goal.ExamplesInput3 22 3 4Output8Input4 250 100 50 100Output296Input10 32 2 2 2 2 2 2 2 2 2Output8NoteIn first sample, an optimal solution is:The elevator takes up person #1 and person #2.It goes to the 2nd floor.Both people go out of the elevator.The elevator goes back to the 1st floor.Then the elevator takes up person #3.And it goes to the 2nd floor.It picks up person #2.Then it goes to the 3rd floor.Person #2 goes out.Then it goes to the 4th floor, where person #3 goes out.The elevator goes back to the 1st floor.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c2247f01", "template_md5": "35d339e4", "result": "You are given $n$ people, each wanting to go to a specific floor. There is one elevator with a maximum capacity of $k$ people. The elevator starts on the first floor. It takes $|a-b|$ seconds for the elevator to travel between floors $a$ and $b$. \n\nFind the minimum time required to transport all people to their desired floors and return the elevator to the first floor.\n\nInput:\n\n* The first line contains two integers, $n$ and $k$ ($1 \\le n, k \\le 2000$), representing the number of people and the elevator's capacity.\n* The second line contains $n$ integers, $f_1, f_2, ..., f_n$ ($2 \\le f_i \\le 2000$), representing the target floor for each person.\n\nOutput:\n\n* Output a single integer representing the minimum time required."}, {"prompt_md5": "11d8b950", "template_md5": "465699a0", "result": "You have a number of people who each want to go to a different floor. There is an elevator with a limited capacity.  Find the shortest amount of time it takes to transport everyone to their desired floor and return the elevator to its starting point."}]}