{"uid": "474-C", "url": "https://codeforces.com/contest/474/problem/C", "tags": ["brute force", " geometry"], "title": "474-C", "statement": "C. Captain Marmottime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutCaptain Marmot wants to prepare a huge and important battle against his enemy, Captain Snake. For this battle he hasnregiments, each consisting of4moles.Initially, each molei(1 ≤i≤ 4n) is placed at some position(xi,yi)in the Cartesian plane. Captain Marmot wants to move some moles to make the regimentscompact, if it's possible.Each moleihas a home placed at the position(ai,bi). Moving this mole one time means rotating his position point(xi,yi)90degrees counter-clockwise around it's home point(ai,bi).A regiment iscompactonly if the position points of the4moles form a square with non-zero area.Help Captain Marmot to find out for each regiment the minimal number of moves required to make that regiment compact, if it's possible.InputThe first line contains one integern(1 ≤n≤ 100), the number of regiments.The next4nlines contain4integersxi,yi,ai,bi(- 104≤xi,yi,ai,bi≤ 104).OutputPrintnlines to the standard output. If the regimentican be made compact, thei-th line should contain one integer, the minimal number of required moves. Otherwise, on thei-th line print\"-1\"(without quotes).ExamplesInput41 1 0 0-1 1 0 0-1 1 0 01 -1 0 01 1 0 0-2 1 0 0-1 1 0 01 -1 0 01 1 0 0-1 1 0 0-1 1 0 0-1 1 0 02 2 0 1-1 0 0 -23 0 0 -2-1 1 -2 0Output1-133NoteIn the first regiment we can move once the second or the third mole.We can't make the second regiment compact.In the third regiment, from the last3moles we can move once one and twice another one.In the fourth regiment, we can movetwicethe first mole andoncethe third mole.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2d00cce0", "template_md5": "35d339e4", "result": "You are given $n$ regiments, each consisting of 4 moles. Each mole has a starting position $(x_i, y_i)$ and a home position $(a_i, b_i)$.  A mole can be moved by rotating it 90 degrees counter-clockwise around its home position.\n\nA regiment is considered \"compact\" if the 4 moles form a square with non-zero area.\n\nDetermine the minimum number of moves required to make each regiment compact, if it's possible. If a regiment cannot be made compact, output -1."}, {"prompt_md5": "4ce0863c", "template_md5": "465699a0", "result": "You are given a set of groups of 4 points. Each group represents a formation.  Each point has a designated home location. You can rotate each point around its home location 90 degrees.  Determine the minimum number of rotations needed to make each formation a square, or report if it's impossible."}]}