{"uid": "474-B", "url": "https://codeforces.com/contest/474/problem/B", "tags": ["binary search", " implementation"], "title": "474-B", "statement": "B. Wormstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIt is lunch time for Mole. His friend, Marmot, prepared him a nice game for lunch.Marmot brought Molenordered piles of worms such thati-th pile containsaiworms. He labeled all these worms with consecutive integers: worms in first pile are labeled with numbers1toa1, worms in second pile are labeled with numbersa1+ 1toa1+a2and so on. See the example for a better understanding.Mole can't eat all the worms (Marmot brought a lot) and, as we all know, Mole is blind, so Marmot tells him the labels of the best juicy worms. Marmot will only give Mole a worm if Mole says correctly in which pile this worm is contained.Poor Mole asks for your help. For all juicy worms said by Marmot, tell Mole the correct answers.InputThe first line contains a single integern(1 ≤n≤ 105), the number of piles.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 103,a1+a2+ ... +an≤ 106), whereaiis the number of worms in thei-th pile.The third line contains single integerm(1 ≤m≤ 105), the number of juicy worms said by Marmot.The fourth line containsmintegersq1,q2, ...,qm(1 ≤qi≤a1+a2+ ... +an), the labels of the juicy worms.OutputPrintmlines to the standard output. Thei-th line should contain an integer, representing the number of the pile where the worm labeled with the numberqiis.ExamplesInput52 7 3 4 931 25 11Output153NoteFor the sample input:The worms with labels from [1,2] are in the first pile.The worms with labels from [3,9] are in the second pile.The worms with labels from [10,12] are in the third pile.The worms with labels from [13,16] are in the fourth pile.The worms with labels from [17,25] are in the fifth pile.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0adb8f4b", "template_md5": "35d339e4", "result": "You are given $n$ piles of worms. The $i$-th pile contains $a_i$ worms. Each worm in a pile is labeled with a consecutive number starting from 1.\n\nYou are also given $m$ worm labels. For each label, determine which pile it belongs to.\n\n**Input:**\n\n* The first line contains an integer $n$ (the number of piles).\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (the number of worms in each pile).\n* The third line contains an integer $m$ (the number of worm labels).\n* The fourth line contains $m$ integers $q_1, q_2, ..., q_m$ (the worm labels).\n\n**Output:**\n\nPrint $m$ lines, each containing an integer representing the pile number where the corresponding worm label belongs."}, {"prompt_md5": "d1e65673", "template_md5": "465699a0", "result": "You are given a number of piles with a different number of items in each pile.  You are also given a list of item labels. Determine which pile each labeled item belongs to."}]}