{"uid": "474-D", "url": "https://codeforces.com/contest/474/problem/D", "tags": ["dp"], "title": "474-D", "statement": "D. Flowerstime limit per test1.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutWe saw the little game Marmot made for Mole's lunch. Now it's Marmot's dinner time and, as we all know, Marmot eats flowers. At every dinner he eats some red and white flowers. Therefore a dinner can be represented as a sequence of several flowers, some of them white and some of them red.But, for a dinner to be tasty, there is a rule: Marmot wants to eat white flowers only in groups of sizek.Now Marmot wonders in how many ways he can eat betweenaandbflowers. As the number of ways could be very large, print it modulo1000000007(109+ 7).InputInput contains several test cases.The first line contains two integerstandk(1 ≤t,k≤ 105), wheretrepresents the number of test cases.The nexttlines contain two integersaiandbi(1 ≤ai≤bi≤ 105), describing thei-th test.OutputPrinttlines to the standard output. Thei-th line should contain the number of ways in which Marmot can eat betweenaiandbiflowers at dinner modulo1000000007(109+ 7).ExamplesInput3 21 32 34 4Output655NoteForK=2and length1Marmot can eat (R).ForK=2and length2Marmot can eat (RR) and (WW).ForK=2and length3Marmot can eat (RRR), (RWW) and (WWR).ForK=2and length4Marmot can eat, for example, (WWWW) or (RWWR), but for example he can't eat (WWWR).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1fb64e73", "template_md5": "35d339e4", "result": "You are given an integer $k$ and multiple pairs of integers $(a, b)$. For each pair, find the number of ways to arrange $a$ to $b$ flowers, where the flowers can be either red or white, but white flowers must be grouped together in sets of size $k$.  The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "d318c7e8", "template_md5": "465699a0", "result": "You are given a number k and a range of numbers from a to b.  Count how many ways you can arrange a sequence of 'R's and 'W's with length between a and b, where 'W's must always appear in groups of size k.  Print the count modulo 1000000007."}]}