{"uid": "475-A", "url": "https://codeforces.com/contest/475/problem/A", "tags": ["implementation"], "title": "475-A", "statement": "A. Bayan Bustime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe final round of Bayan Programming Contest will be held in Tehran, and the participants will be carried around with a yellow bus. The bus has 34 passenger seats: 4 seats in the last row and 3 seats in remaining rows.The event coordinator has a list ofkparticipants who should be picked up at the airport. When a participant gets on the bus, he will sit in the last row with an empty seat. If there is more than one empty seat in that row, he will take the leftmost one.In order to keep track of the people who are on the bus, the event coordinator needs a figure showing which seats are going to be taken bykparticipants. Your task is to draw the figure representing occupied seats.InputThe only line of input contains integerk,(0 ≤k≤ 34), denoting the number of participants.OutputPrint the figure of a bus withkpassengers as described in sample tests. Character '#' denotes an empty seat, while 'O' denotes a taken seat. 'D' is the bus driver and other characters in the output are for the purpose of beautifying the figure. Strictly follow the sample test cases output format. Print exactly six lines. Do not output extra space or other characters.ExamplesInput9Output+------------------------+|O.O.O.#.#.#.#.#.#.#.#.|D|)|O.O.O.#.#.#.#.#.#.#.#.|.||O.......................||O.O.#.#.#.#.#.#.#.#.#.|.|)+------------------------+Input20Output+------------------------+|O.O.O.O.O.O.O.#.#.#.#.|D|)|O.O.O.O.O.O.#.#.#.#.#.|.||O.......................||O.O.O.O.O.O.#.#.#.#.#.|.|)+------------------------+", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0401acf4", "template_md5": "35d339e4", "result": "A bus has 34 seats arranged in rows. There are 4 seats in the last row and 3 seats in each of the other rows.  \n\nYou are given a number $k$ (where $0 \\le k \\le 34$).  \n\nYour task is to draw a representation of the bus showing which seats will be occupied by $k$ people. \n\n* '#' represents an empty seat.\n* 'O' represents an occupied seat.\n* 'D' represents the driver.\n\nThe people will always sit in the last row, taking the leftmost empty seat if there are multiple available.\n\nFollow the exact format of the provided examples."}, {"prompt_md5": "2616e7e0", "template_md5": "465699a0", "result": "You are given a number representing the number of people.  You need to draw a picture of a bus with a specific seating arrangement. The bus has 4 seats in the last row and 3 seats in the remaining rows.  Each person sits in the leftmost empty seat in the last row.  Draw the bus with 'O' for occupied seats and '#' for empty seats."}]}