{"uid": "475-E", "url": "https://codeforces.com/contest/475/problem/E", "tags": ["dfs and similar"], "title": "475-E", "statement": "E. Strongly Connected City 2time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutImagine a city withnjunctions andmstreets. Junctions are numbered from1ton.In order to increase the traffic flow, mayor of the city has decided to make each street one-way. This means in the street between junctionsuandv, the traffic moves only fromutovor only fromvtou.The problem is to direct the traffic flow of streets in a way that maximizes the number of pairs(u,v)where1 ≤u,v≤nand it is possible to reach junctionvfromuby passing the streets in their specified direction. Your task is to find out maximal possible number of such pairs.InputThe first line of input contains integersnandm, (), denoting the number of junctions and streets of the city.Each of the followingmlines contains two integersuandv, (u≠v), denoting endpoints of a street in the city.Between every two junctions there will be at most one street. It is guaranteed that before mayor decision (when all streets were two-way) it was possible to reach each junction from any other junction.OutputPrint the maximal number of pairs(u,v)such that that it is possible to reach junctionvfromuafter directing the streets.ExamplesInput5 41 21 31 41 5Output13Input4 51 22 33 44 11 3Output16Input2 11 2Output3Input6 71 22 31 31 44 55 66 4Output27NoteIn the first sample, if the mayor makes first and second streets one-way towards the junction1and third and fourth streets in opposite direction, there would be 13 pairs of reachable junctions:{(1, 1), (2, 2), (3, 3), (4, 4), (5, 5), (2, 1), (3, 1), (1, 4), (1, 5), (2, 4), (2, 5), (3, 4), (3, 5)}", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3ddf65c8", "template_md5": "35d339e4", "result": "You are given a city with $n$ junctions and $m$ streets. Each street connects two junctions.  The goal is to make each street one-way (traffic can only flow in one direction).  You want to find the maximum number of pairs of junctions $(u, v)$ where you can travel from junction $u$ to junction $v$ by following the one-way streets. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of junctions and streets.\n* Each of the following $m$ lines contains two integers, $u$ and $v$, representing a street connecting junctions $u$ and $v$.\n\n**Output:**\n\n* Print the maximum number of pairs $(u, v)$ where you can travel from $u$ to $v$ after making the streets one-way."}, {"prompt_md5": "b5d28e2e", "template_md5": "465699a0", "result": "You have a network of cities connected by one-way roads.  You need to figure out the maximum number of pairs of cities that can be reached from each other after the roads are made one-way."}]}