{"uid": "476-B", "url": "https://codeforces.com/contest/476/problem/B", "tags": ["bitmasks", " brute force", " combinatorics", " dp", " math", " probabilities"], "title": "476-B", "statement": "B. Dreamoon and WiFitime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDreamoon is standing at the position0on a number line. Drazil is sending a list of commands through Wi-Fi to Dreamoon's smartphone and Dreamoon follows them.Each command is one of the following two types:Go 1 unit towards the positive direction, denoted as'+'Go 1 unit towards the negative direction, denoted as'-'But the Wi-Fi condition is so poor that Dreamoon's smartphone reports some of the commands can't be recognized and Dreamoon knows that some of them might even be wrong though successfully recognized. Dreamoon decides to follow every recognized command and toss a fair coin to decide those unrecognized ones (that means, he moves to the1unit to the negative or positive direction with the same probability0.5).You are given an original list of commands sent by Drazil and list received by Dreamoon. What is the probability that Dreamoon ends in the position originally supposed to be final by Drazil's commands?InputThe first line contains a strings1— the commands Drazil sends to Dreamoon, this string consists of only the characters in the set {'+','-'}.The second line contains a strings2— the commands Dreamoon's smartphone recognizes, this string consists of only the characters in the set {'+','-','?'}.'?'denotes an unrecognized command.Lengths of two strings are equal and do not exceed10.OutputOutput a single real number corresponding to the probability. The answer will be considered correct if its relative or absolute error doesn't exceed10- 9.ExamplesInput++-+-+-+-+Output1.000000000000Input+-+-+-??Output0.500000000000Input+++??-Output0.000000000000NoteFor the first sample, boths1ands2will lead Dreamoon to finish at the same position+ 1.For the second sample,s1will lead Dreamoon to finish at position 0, while there are four possibilites fors2: {\"+-++\",\"+-+-\",\"+--+\",\"+---\"} with ending position {+2, 0, 0, -2} respectively. So there are2correct cases out of4, so the probability of finishing at the correct position is0.5.For the third sample,s2could only lead us to finish at positions {+1, -1, -3}, so the probability to finish at the correct position+ 3is0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d44cabc7", "template_md5": "35d339e4", "result": "You are given two strings,  $s_1$ and $s_2$, of equal length, where each string consists of characters '+', '-', or '?'. \n\n* $s_1$ represents the original sequence of commands sent.\n* $s_2$ represents the sequence of commands received, where '?' indicates a command that was not recognized.\n\nFor each '?' in $s_2$, assume a fair coin flip determines whether the corresponding command in $s_1$ is '+' or '-'.\n\nDetermine the probability that the final position reached based on the received commands ($s_2$) is the same as the final position intended by the original commands ($s_1$)."}, {"prompt_md5": "12321a43", "template_md5": "465699a0", "result": "You are given two strings of characters, one representing a sequence of commands and the other representing the commands that were successfully received.  The commands are either \"+\" (move right) or \"-\" (move left).  Some commands were not received and need to be randomly guessed as either \"+\" or \"-\".  What is the probability that the final position after following the commands (including the guessed ones) matches the final position intended by the original command sequence?"}]}