{"uid": "476-D", "url": "https://codeforces.com/contest/476/problem/D", "tags": ["constructive algorithms", " greedy", " math"], "title": "476-D", "statement": "D. Dreamoon and Setstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDreamoon likes to play with sets, integers and.is defined as the largest positive integer that divides bothaandb.LetSbe a set of exactly four distinct integers greater than0. DefineSto be of rankkif and only if for all pairs of distinct elementssi,sjfromS,.Givenkandn, Dreamoon wants to make upnsets of rankkusing integers from1tomsuch that no integer is used in two different sets (of course you can leave some integers without use). Calculate the minimummthat makes it possible and print one possible solution.InputThe single line of the input contains two space separated integersn,k(1 ≤n≤ 10 000, 1 ≤k≤ 100).OutputOn the first line print a single integer — the minimal possiblem.On each of the nextnlines print four space separated integers representing thei-th set.Neither the order of the sets nor the order of integers within a set is important. If there are multiple possible solutions with minimalm, print any one of them.ExamplesInput1 1Output51 2 3 5Input2 2Output222 4 6 2214 18 10 16NoteFor the first example it's easy to see that set{1, 2, 3, 4}isn't a valid set of rank 1 since.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8c9702f4", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $k$.  \n\nYou need to create $n$ sets of four distinct integers, each greater than 0.  \n\nThe rank of a set is determined as follows: For any two distinct elements $s_i$ and $s_j$ in the set, the greatest common divisor (GCD) of $s_i$ and $s_j$ must be at least $k$.\n\nFind the smallest possible integer $m$ such that you can create these $n$ sets of rank $k$ using integers from 1 to $m$.  Print $m$ and then list the $n$ sets. \n\nIf there are multiple solutions with the same minimum $m$, print any one of them."}, {"prompt_md5": "efca08fc", "template_md5": "465699a0", "result": "You are given two numbers, n and k.  You need to create n sets of 4 distinct numbers each, where each set meets a specific condition related to the greatest common divisor (GCD) of its elements. The condition is based on the rank k. Find the smallest possible set of numbers (m) that allows you to create these sets and list one possible solution."}]}