{"uid": "478-A", "url": "https://codeforces.com/contest/478/problem/A", "tags": ["implementation"], "title": "478-A", "statement": "A. Initial Bettime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThere are five people playing a game called \"Generosity\". Each person gives some non-zero number of coinsbas an initial bet. After all players make their bets ofbcoins, the following operation is repeated for several times: a coin is passed from one player to some other player.Your task is to write a program that can, given the number of coins each player has at the end of the game, determine the sizebof the initial bet or find out that such outcome of the game cannot be obtained for any positive number of coinsbin the initial bet.InputThe input consists of a single line containing five integersc1,c2,c3,c4andc5— the number of coins that the first, second, third, fourth and fifth players respectively have at the end of the game (0 ≤c1,c2,c3,c4,c5≤ 100).OutputPrint the only line containing a single positive integerb— the number of coins in the initial bet of each player. If there is no such value ofb, then print the only value \"-1\" (quotes for clarity).ExamplesInput2 5 4 0 4Output3Input4 5 9 2 1Output-1NoteIn the first sample the following sequence of operations is possible:One coin is passed from the fourth player to the second player;One coin is passed from the fourth player to the fifth player;One coin is passed from the first player to the third player;One coin is passed from the fourth player to the second player.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5cf2033f", "template_md5": "35d339e4", "result": "Five players start a game by each betting a certain number of coins.  The game then involves repeatedly passing one coin from one player to another.  Given the number of coins each player has at the end of the game, determine the original bet amount for each player. If it's impossible to reach that final coin count with any positive bet amounts, output -1. \n\nInput: Five integers representing the final number of coins each player has.\n\nOutput: A single integer representing the original bet amount for each player, or -1 if it's impossible."}, {"prompt_md5": "fc1cd67c", "template_md5": "465699a0", "result": "Five people start with a certain number of coins. They repeatedly give coins to each other. You know how many coins each person has at the end.  Find out how many coins each person started with. If it's impossible, say -1."}]}