{"uid": "478-B", "url": "https://codeforces.com/contest/478/problem/B", "tags": ["combinatorics", " constructive algorithms", " greedy", " math"], "title": "478-B", "statement": "B. Random Teamstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutnparticipants of the competition were split intomteams in some manner so that each team has at least one participant. After the competition each pair of participants from the same team became friends.Your task is to write a program that will find the minimum and the maximum number of pairs of friends that could have formed by the end of the competition.InputThe only line of input contains two integersnandm, separated by a single space (1 ≤m≤n≤ 109) — the number of participants and the number of teams respectively.OutputThe only line of the output should contain two integerskminandkmax— the minimum possible number of pairs of friends and the maximum possible number of pairs of friends respectively.ExamplesInput5 1Output10 10Input3 2Output1 1Input6 3Output3 6NoteIn the first sample all the participants get into one team, so there will be exactly ten pairs of friends.In the second sample at any possible arrangement one team will always have two participants and the other team will always have one participant. Thus, the number of pairs of friends will always be equal to one.In the third sample minimum number of newly formed friendships can be achieved if participants were split on teams consisting of2people, maximum number can be achieved if participants were split on teams of1,1and4people.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fe8ff997", "template_md5": "35d339e4", "result": "You are given two numbers, $n$ and $m$.  $n$ represents the number of people and $m$ represents the number of teams.  \n\nPeople are divided into teams. Each team must have at least one person.  \n\nAfter the division, every two people on the same team become friends.\n\nFind the smallest and largest possible number of new friendships that can be formed."}, {"prompt_md5": "54a603ea", "template_md5": "465699a0", "result": "You are given the number of people and the number of teams they were divided into.  Find the fewest and most friendships that could have formed if everyone on each team became friends."}]}