{"uid": "479-E", "url": "https://codeforces.com/contest/479/problem/E", "tags": ["combinatorics", " dp"], "title": "479-E", "statement": "E. Riding in a Lifttime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutImagine that you are in a building that has exactlynfloors. You can move between the floors in a lift. Let's number the floors from bottom to top with integers from1ton. Now you're on the floor numbera. You are very bored, so you want to take the lift. Floor numberbhas a secret lab, the entry is forbidden. However, you already are in the mood and decide to makekconsecutive trips in the lift.Let us suppose that at the moment you are on the floor numberx(initially, you were on floora). For another trip between floors you choose some floor with numbery(y≠x) and the lift travels to this floor. As you cannot visit floorbwith the secret lab, you decided that the distance from the current floorxto the chosenymust be strictly less than the distance from the current floorxto floorbwith the secret lab. Formally, it means that the following inequation must fulfill:|x-y| < |x-b|. After the lift successfully transports you to floory, you write down numberyin your notepad.Your task is to find the number of distinct number sequences that you could have written in the notebook as the result ofktrips in the lift. As the sought number of trips can be rather large, find the remainder after dividing the number by1000000007(109+ 7).InputThe first line of the input contains four space-separated integersn,a,b,k(2 ≤n≤ 5000,1 ≤k≤ 5000,1 ≤a,b≤n,a≠b).OutputPrint a single integer — the remainder after dividing the sought number of sequences by1000000007(109+ 7).ExamplesInput5 2 4 1Output2Input5 2 4 2Output2Input5 3 4 1Output0NoteTwo sequencesp1,p2, ...,pkandq1,q2, ...,qkaredistinct, if there is such integerj(1 ≤j≤k), thatpj≠qj.Notes to the samples:In the first sample after the first trip you are either on floor1, or on floor3, because|1 - 2| < |2 - 4|and|3 - 2| < |2 - 4|.In the second sample there are two possible sequences:(1, 2);(1, 3). You cannot choose floor3for the first trip because in this case no floor can be the floor for the second trip.In the third sample there are no sought sequences, because you cannot choose the floor for the first trip.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a9baea91", "template_md5": "35d339e4", "result": "You are on floor $a$ of a building with $n$ floors. You cannot visit floor $b$. You want to take the elevator $k$ times.  For each trip, you must choose a floor $y$ that is closer to your current floor $x$ than floor $b$.  \n\nFind the number of different sequences of floors you could visit in your $k$ trips.  The answer should be the remainder when the number of sequences is divided by $10^9 + 7$."}, {"prompt_md5": "78272b10", "template_md5": "465699a0", "result": "You are on a floor in a building with multiple floors. You can take an elevator to other floors, but you cannot go to a specific forbidden floor. You want to take the elevator  a certain number of times and write down the floors you visit.  You must always choose a floor closer to your current floor than the forbidden floor.  Find how many different sequences of floors you can write down."}]}