{"uid": "479-B", "url": "https://codeforces.com/contest/479/problem/B", "tags": ["brute force", " constructive algorithms", " greedy", " implementation", " sortings"], "title": "479-B", "statement": "B. Towerstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAs you know, all the kids in Berland love playing with cubes. Little Petya hasntowers consisting of cubes of the same size. Tower with numbericonsists ofaicubes stacked one on top of the other. Petya defines theinstabilityof a set of towers as a value equal to the difference between the heights of the highest and the lowest of the towers. For example, if Petya built five cube towers with heights (8, 3, 2, 6, 3), the instability of this set is equal to 6 (the highest tower has height 8, the lowest one has height 2).The boy wants the instability of his set of towers to be as low as possible. All he can do is to perform the following operation several times: take the top cube from some tower and put it on top of some other tower of his set. Please note that Petya would never put the cube on the same tower from which it was removed because he thinks it's a waste of time.Before going to school, the boy will have time to perform no more thanksuch operations. Petya does not want to be late for class, so you have to help him accomplish this task.InputThe first line contains two space-separated positive integersnandk(1 ≤n≤ 100,1 ≤k≤ 1000) — the number of towers in the given set and the maximum number of operations Petya can perform. The second line containsnspace-separated positive integersai(1 ≤ai≤ 104) — the towers' initial heights.OutputIn the first line print two space-separated non-negative integerssandm(m≤k). The first number is the value of the minimum possible instability that can be obtained after performing at mostkoperations, the second number is the number of operations needed for that.In the nextmlines print the description of each operation as two positive integersiandj, each of them lies within limits from1ton. They represent that Petya took the top cube from thei-th tower and put in on thej-th one (i≠j). Note that in the process of performing operations the heights of some towers can become equal to zero.If there are multiple correct sequences at which the minimum possible instability is achieved, you are allowed to print any of them.ExamplesInput3 25 8 5Output0 22 12 3Input3 42 2 4Output1 13 2Input5 38 3 2 6 3Output3 31 31 21 3NoteIn the first sample you need to move the cubes two times, from the second tower to the third one and from the second one to the first one. Then the heights of the towers are all the same and equal to 6.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "10f4e6c8", "template_md5": "35d339e4", "result": "You are given $n$ towers, each with a height of $a_i$. You can perform at most $k$ operations. In each operation, you choose two different towers and move the top cube from one tower to the other.  \n\nFind the minimum possible difference in height between the tallest and shortest towers after performing the operations. Also, output the number of operations required to achieve this minimum difference."}, {"prompt_md5": "ed6e5cdc", "template_md5": "465699a0", "result": "You are given a set of towers of different heights. You can move the top cube from one tower to another tower (not the same tower).  Find the minimum possible difference in height between the tallest and shortest tower after performing a given number of moves.  Output the minimum difference and a sequence of moves to achieve it."}]}