{"uid": "48-E", "url": "https://codeforces.com/contest/48/problem/E", "tags": ["dp", " games", " graphs"], "title": "48-E", "statement": "E. Ivan the Fool VS Gorynych the Dragontime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOnce upon a time in a kingdom far, far away… Okay, let’s start at the point where Ivan the Fool met Gorynych the Dragon. Ivan took out his magic sword and the battle began. First Gorynych hadhheads andttails. With each strike of the sword Ivan can either cut off several heads (from1ton, but not more than Gorynych has at the moment), or several tails (from1tom, but not more than Gorynych has at the moment). At the same time, horrible though it seems, Gorynych the Dragon can also grow new heads and tails. And the number of growing heads and tails is determined uniquely by the number of heads or tails cut by the current strike. When the total number of heads and tails exceedsR, Gorynych the Dragon strikes its final blow and destroys Ivan the Fool. That’s why Ivan aims to cut off all the dragon’s heads and tails as quickly as possible and win. The events can also develop in a third way: neither of the opponents can win over the other one and they will continue fighting forever.The tale goes like this; easy to say, hard to do. Your task is to write a program that will determine the battle’s outcome. Consider that Ivan strikes consecutively. After each blow Gorynych grows a number of new heads and tails depending on the number of cut ones. Gorynych the Dragon is defeated if after the blow he loses all his heads and tails and can’t grow new ones. Ivan fights in the optimal way (fools are lucky), i.e.if Ivan can win, he wins having struck the least number of blows;if it is impossible to defeat Gorynych, but is possible to resist him for an infinitely long period of time, then that’s the strategy Ivan chooses;if Gorynych wins in any case, Ivan aims to resist him for as long as possible.InputThe first line contains three integersh,tandR(0 ≤h,t,R≤ 200,0 <h+t≤R) which represent the initial numbers of Gorynych’s heads and tails and the largest total number of heads and tails with which Gorynych the Dragon does not yet attack. The next line contains integern(1 ≤n≤ 200). The nextncontain pairs of non-negative numbers \"hiti\" which represent the number of heads and the number of tails correspondingly, that will grow if Gorynych hasiheads (1 ≤i≤n) cut. The next line contains an integerm(1 ≤m≤ 200) and then — the description of Gorynych’s behavior when his tails are cut off in the format identical to the one described above. All the numbers in the input file do not exceed200.OutputPrint \"Ivan\" (without quotes) in the first line if Ivan wins, or \"Zmey\" (that means a dragon in Russian) if Gorynych the Dragon wins. In the second line print a single integer which represents the number of blows Ivan makes. If the battle will continue forever, print in the first line \"Draw\".ExamplesInput2 2 421 00 130 10 10 0OutputIvan2Input2 2 410 111 0OutputDrawInput2 2 511 113 0OutputZmey2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6165760d", "template_md5": "35d339e4", "result": "There are two entities, each with a number of heads and tails.  \n\n* **Initial state:**  The first entity starts with $h$ heads and $t$ tails.\n* **Growth rule:** When a certain number of heads or tails are removed, the entity grows new heads and tails according to a set of rules.  \n* **Limit:** If the total number of heads and tails ($h+t$) exceeds a value $R$, the entity attacks and the game ends.\n\n**Input:**\n\n* $h$, $t$, $R$: The initial number of heads, tails, and the limit.\n* A list of rules describing how many heads and tails grow when a certain number of heads are removed.\n* Another list of rules describing how many heads and tails grow when a certain number of tails are removed.\n\n**Output:**\n\n* \"Ivan\" if Ivan wins, \"Zmey\" if the other entity wins, or \"Draw\" if the battle continues forever.\n* The number of moves Ivan makes if he wins or the battle ends.\n\n\n\nLet me know if you'd like me to elaborate on any specific part of the problem."}, {"prompt_md5": "9b880706", "template_md5": "465699a0", "result": "You are given the initial number of heads and tails of a creature, and a limit on the total number of heads and tails before it attacks. You can cut off heads or tails, and the creature grows new ones based on how many you cut. Determine if you can defeat the creature, and if so, the minimum number of cuts required. If you cannot defeat it, determine if the battle will continue forever or if the creature will win."}]}