{"uid": "48-H", "url": "https://codeforces.com/contest/48/problem/H", "tags": ["constructive algorithms"], "title": "48-H", "statement": "H. Black and Whitetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAccording to the legends the king of Berland Berl I was noted for his love of beauty and order. One day he ordered to tile the palace hall's floor where balls and receptions used to take place with black and white tiles according to a regular geometrical pattern invented by him. However, as is after the case, due to low financing there were onlyablack andbwhite tiles delivered to the palace. The otherctiles were black and white (see the picture).The initial plan failed! Having learned of that, the king gave a new command: tile the floor with the available tiles so that no black side of a tile touched a white one. The tiles are squares of one size1 × 1, every black and white tile can be rotated in one of the four ways.The court programmer was given the task to work out the plan of tiling and he coped with the task and didn't suffer the consequences of disobedience. And can you cope with it?InputThe first line contains given integersnandm(1 ≤n,m≤ 100) which represent the sizes of the rectangle that needs to be tiled. The next line contains non-negative numbersa,bandc,a+b+c=nm,c≥m.OutputPrint2nlines containing2mcharacters each — the tiling scheme. Every tile is represented by a square2 × 2in the following manner (the order corresponds to the order of the picture above):If multiple solutions exist, output any.ExamplesInput2 20 0 4Output\\\\../#\\\\/#\\\\##/.\\\\/.Input2 31 2 3Output###/\\\\###/..\\\\#/..../.....", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4d948aba", "template_md5": "35d339e4", "result": "You are given a rectangle with dimensions $n \\times m$. You have $a$ black tiles, $b$ white tiles, and $c$ tiles that are both black and white.  The tiles are square and have sides of length 1.  \n\nYou need to tile the rectangle with the available tiles so that no black side of a tile touches a white side.  Each tile can be rotated in one of four ways.\n\nOutput a 2D representation of the tiling, where each cell is either a '/' (black), '\\' (white), or '.' (empty)."}, {"prompt_md5": "025b6116", "template_md5": "465699a0", "result": "You are given a rectangle that needs to be tiled with squares. You have a limited number of each type of square. The squares can be rotated.  The goal is to tile the rectangle so that no two squares of opposite colors touch. \n\n\nYou need to output a visual representation of the tiling."}]}