{"uid": "483-B", "url": "https://codeforces.com/contest/483/problem/B", "tags": ["binary search", " math"], "title": "483-B", "statement": "B. Friends and Presentstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutYou have two friends. You want to present each of them several positive integers. You want to presentcnt1numbers to the first friend andcnt2numbers to the second friend. Moreover, you want all presented numbers to be distinct, that also means that no number should be presented to both friends.In addition, the first friend does not like the numbers that are divisible without remainder by prime numberx. The second one does not like the numbers that are divisible without remainder by prime numbery. Of course, you're not going to present your friends numbers they don't like.Your task is to find such minimum numberv, that you can form presents using numbers from a set1, 2, ...,v. Of course you may choose not to present some numbers at all.A positive integer number greater than 1 is calledprimeif it has no positive divisors other than 1 and itself.InputThe only line contains four positive integerscnt1,cnt2,x,y(1 ≤cnt1,cnt2< 109;cnt1+cnt2≤ 109;2 ≤x<y≤ 3·104) — the numbers that are described in the statement. It is guaranteed that numbersx,yare prime.OutputPrint a single integer — the answer to the problem.ExamplesInput3 1 2 3Output5Input1 3 2 3Output4NoteIn the first sample you give the set of numbers{1, 3, 5}to the first friend and the set of numbers{2}to the second friend. Note that if you give set{1, 3, 5}to the first friend, then we cannot give any of the numbers1,3,5to the second friend.In the second sample you give the set of numbers{3}to the first friend, and the set of numbers{1, 2, 4}to the second friend. Thus, the answer to the problem is4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "19f252e6", "template_md5": "35d339e4", "result": "You need to find the smallest number $v$ such that you can give presents to two friends using numbers from 1 to $v$. \n\n* The first friend wants $cnt1$ numbers, and the second friend wants $cnt2$ numbers.\n* No number can be given to both friends.\n* The first friend doesn't like numbers divisible by prime number $x$.\n* The second friend doesn't like numbers divisible by prime number $y$.\n\nWhat is the smallest $v$ that allows you to give presents to both friends following these rules?"}, {"prompt_md5": "455d9cf0", "template_md5": "465699a0", "result": "You need to find the smallest number that allows you to give a set of distinct numbers to two people.  The first person doesn't like multiples of a given number, and the second person doesn't like multiples of a different given number.  You need to give a certain number of numbers to each person."}]}