{"uid": "485-B", "url": "https://codeforces.com/contest/485/problem/B", "tags": ["brute force", " greedy"], "title": "485-B", "statement": "B. Valuable Resourcestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMany computer strategy games require building cities, recruiting army, conquering tribes, collecting resources. Sometimes it leads to interesting problems.Let's suppose that your task is to build a square city. The world map uses the Cartesian coordinates. The sides of the city should be parallel to coordinate axes. The map contains mines with valuable resources, located at some points with integer coordinates. The sizes of mines are relatively small, i.e. they can be treated as points. The city should be built in such a way that all the mines are inside or on the border of the city square.Building a city takes large amount of money depending on the size of the city, so you have to build the city with the minimum area. Given the positions of the mines find the minimum possible area of the city.InputThe first line of the input contains numbern— the number of mines on the map (2 ≤n≤ 1000). Each of the nextnlines contains a pair of integersxiandyi— the coordinates of the corresponding mine (- 109≤xi,yi≤ 109). All points are pairwise distinct.OutputPrint the minimum area of the city that can cover all the mines with valuable resources.ExamplesInput20 02 2Output4Input20 00 3Output9", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b0a4182f", "template_md5": "465699a0", "result": "You are given a set of points on a grid. Find the smallest square that can enclose all of these points."}, {"prompt_md5": "7e5ab6d8", "template_md5": "35d339e4", "result": "You are given a set of points on a 2D plane.  Find the smallest square that encloses all of these points. Output the area of this square. \n\nInput:\n\n* The first line contains an integer $n$ representing the number of points (2 ≤ $n$ ≤ 1000).\n* Each of the next $n$ lines contains two integers, $x_i$ and $y_i$, representing the coordinates of a point.\n\nOutput:\n\n* Print the smallest possible area of the square."}]}