{"uid": "486-C", "url": "https://codeforces.com/contest/486/problem/C", "tags": ["brute force", " greedy", " implementation"], "title": "486-C", "statement": "C. Palindrome Transformationtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutNam is playing with a string on his computer. The string consists ofnlowercase English letters. It is meaningless, so Nam decided to make the string more beautiful, that is to make it be a palindrome by using 4 arrow keys: left, right, up, down.There is a cursor pointing at some symbol of the string. Suppose that cursor is at positioni(1 ≤i≤n, the string uses 1-based indexing) now. Left and right arrow keys are used to move cursor around the string. The string is cyclic, that means that when Nam presses left arrow key, the cursor will move to positioni- 1ifi> 1or to the end of the string (i. e. positionn) otherwise. The same holds when he presses the right arrow key (ifi=n, the cursor appears at the beginning of the string).When Nam presses up arrow key, the letter which the text cursor is pointing to will change to the next letter in English alphabet (assuming that alphabet is also cyclic, i. e. after 'z' follows 'a'). The same holds when he presses the down arrow key.Initially, the text cursor is at positionp.Because Nam has a lot homework to do, he wants to complete this as fast as possible. Can you help him by calculating the minimum number of arrow keys presses to make the string to be a palindrome?InputThe first line contains two space-separated integersn(1 ≤n≤ 105) andp(1 ≤p≤n), the length of Nam's string and the initial position of the text cursor.The next line containsnlowercase characters of Nam's string.OutputPrint the minimum number of presses needed to change string into a palindrome.ExamplesInput8 3aeabcaezOutput6NoteA string is a palindrome if it reads the same forward or reversed.In the sample test, initial Nam's string is:(cursor position is shown bold).In optimal solution, Nam may do6following steps:The result,, is now a palindrome.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e464d23", "template_md5": "35d339e4", "result": "You are given a string of lowercase English letters. You can move a cursor within the string using left, right, up, and down arrow keys.  \n\n* Left and right arrows move the cursor cyclically through the string.\n* Up and down arrows change the character at the cursor position to the next letter in the alphabet (wrapping around from 'z' to 'a').\n\nYour goal is to find the minimum number of arrow key presses needed to transform the string into a palindrome (reads the same forward and backward). \n\nThe input will be:\n\n* The length of the string ($n$)\n* The initial position of the cursor ($p$)\n* The string itself\n\nOutput the minimum number of arrow key presses required."}, {"prompt_md5": "c5c48204", "template_md5": "465699a0", "result": "You are given a string of lowercase letters. You can move a cursor along the string (wrapping around the ends) and change each letter to the next letter in the alphabet (wrapping around). What is the minimum number of moves needed to make the string a palindrome?"}]}