{"uid": "487-A", "url": "https://codeforces.com/contest/487/problem/A", "tags": ["binary search", " brute force", " implementation"], "title": "487-A", "statement": "A. Fight the Monstertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA monster is attacking the Cyberland!Master Yang, a braver, is going to beat the monster. Yang and the monster each have 3 attributes: hitpoints (HP), offensive power (ATK) and defensive power (DEF).During the battle, every second the monster's HP decrease bymax(0,ATKY-DEFM), while Yang's HP decreases bymax(0,ATKM-DEFY), where indexYdenotes Master Yang and indexMdenotes monster. Both decreases happen simultaneously Once monster'sHP≤ 0and the same time Master Yang'sHP> 0, Master Yang wins.Master Yang can buy attributes from the magic shop of Cyberland:hbitcoins perHP,abitcoins perATK, anddbitcoins perDEF.Now Master Yang wants to know the minimum number of bitcoins he can spend in order to win.InputThe first line contains three integersHPY,ATKY,DEFY, separated by a space, denoting the initialHP,ATKandDEFof Master Yang.The second line contains three integersHPM,ATKM,DEFM, separated by a space, denoting theHP,ATKandDEFof the monster.The third line contains three integersh,a,d, separated by a space, denoting the price of1HP,1ATKand1DEF.All numbers in input areintegerand lie between1and100inclusively.OutputThe only output line should contain an integer, denoting the minimum bitcoins Master Yang should spend in order to win.ExamplesInput1 2 11 100 11 100 100Output99Input100 100 1001 1 11 1 1Output0NoteFor the first sample, prices forATKandDEFare extremely high. Master Yang can buy99HP, then he can beat the monster with1HP left.For the second sample, Master Yang is strong enough to beat the monster, so he doesn't need to buy anything.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "749d81ed", "template_md5": "35d339e4", "result": "Two entities, Player 1 and Player 2, have attributes: hitpoints (HP), attack power (ATK), and defense power (DEF).  \n\nEach second:\n\n* Player 2's HP decreases by the maximum of 0 and ($Player1_{ATK} - Player2_{DEF}$).\n* Player 1's HP decreases by the maximum of 0 and ($Player2_{ATK} - Player1_{DEF}$).\n\nThe battle ends when Player 2's HP is less than or equal to 0 and Player 1's HP is greater than 0.\n\nPlayer 1 can buy attributes at the following costs:\n\n* $h$ bitcoins per HP\n* $a$ bitcoins per ATK\n* $d$ bitcoins per DEF\n\nWhat is the minimum number of bitcoins Player 1 must spend to win?\n\nInput:\n\n* Three integers: $Player1_{HP}$, $Player1_{ATK}$, $Player1_{DEF}$\n* Three integers: $Player2_{HP}$, $Player2_{ATK}$, $Player2_{DEF}$\n* Three integers: $h$, $a$, $d$\n\nOutput:\n\n* An integer representing the minimum bitcoins Player 1 must spend to win."}, {"prompt_md5": "5caf6d7a", "template_md5": "465699a0", "result": "You have a certain amount of resources (HP, ATK, DEF). You need to increase these resources to defeat an enemy who also has these resources.  You can buy increases to these resources at a cost. What is the minimum cost to defeat the enemy?"}]}