{"uid": "488-A", "url": "https://codeforces.com/contest/488/problem/A", "tags": ["brute force"], "title": "488-A", "statement": "A. Giga Towertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutGiga Tower is the tallest and deepest building in Cyberland. There are17 777 777 777floors, numbered from- 8 888 888 888to8 888 888 888. In particular, there is floor0between floor- 1and floor1. Every day, thousands of tourists come to this place to enjoy the wonderful view.In Cyberland, it is believed that the number \"8\" is a lucky number (that's why Giga Tower has8 888 888 888floors above the ground), and, an integer islucky, if and only if its decimal notation contains at least one digit \"8\". For example,8,  - 180, 808are allluckywhile42,  - 10are not. In the Giga Tower, if you write code at a floor with lucky floor number, good luck will always be with you (Well, this round is #278, also lucky, huh?).Tourist Henry goes to the tower to seek good luck. Now he is at the floor numbereda. He wants to find the minimumpositiveintegerb, such that, if he walksbfloors higher, he will arrive at a floor with aluckynumber.InputThe only line of input contains an integera(- 109≤a≤ 109).OutputPrint the minimumbin a line.ExamplesInput179Output1Input-1Output9Input18Output10NoteFor the first sample, he has to arrive at the floor numbered180.For the second sample, he will arrive at8.Note thatbshould be positive, so the answer for the third sample is10, not0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "854a6a59", "template_md5": "35d339e4", "result": "Given an integer $a$ (-10^9 ≤ $a$ ≤ 10^9), find the minimum positive integer $b$ such that $a + b$ is a lucky number. A lucky number is any integer that contains at least one digit '8'."}, {"prompt_md5": "2cbd3031", "template_md5": "465699a0", "result": "Given a starting floor number, find the minimum number of floors to walk upwards to reach a floor with a number containing the digit '8'."}]}