{"uid": "489-B", "url": "https://codeforces.com/contest/489/problem/B", "tags": ["dfs and similar", " dp", " graph matchings", " greedy", " sortings", " two pointers"], "title": "489-B", "statement": "B. BerSU Balltime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe Berland State University is hosting a ballroom dance in celebration of its 100500-th anniversary!nboys andmgirls are already busy rehearsing waltz, minuet, polonaise and quadrille moves.We know that several boy&girl pairs are going to be invited to the ball. However, the partners' dancing skill in each pair must differ by at most one.For each boy, we know his dancing skills. Similarly, for each girl we know her dancing skills. Write a code that can determine the largest possible number of pairs that can be formed fromnboys andmgirls.InputThe first line contains an integern(1 ≤n≤ 100) — the number of boys. The second line contains sequencea1,a2, ...,an(1 ≤ai≤ 100), whereaiis thei-th boy's dancing skill.Similarly, the third line contains an integerm(1 ≤m≤ 100) — the number of girls. The fourth line contains sequenceb1,b2, ...,bm(1 ≤bj≤ 100), wherebjis thej-th girl's dancing skill.OutputPrint a single number — the required maximum possible number of pairs.ExamplesInput41 4 6 255 1 5 7 9Output3Input41 2 3 4410 11 12 13Output0Input51 1 1 1 131 2 3Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9f0e950d", "template_md5": "35d339e4", "result": "You are given two lists of numbers: one representing the dancing skills of $n$ boys and another representing the dancing skills of $m$ girls.  Each pair of a boy and a girl can form a dancing pair if the difference between their dancing skills is at most 1.  Find the largest number of pairs that can be formed. \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100) - the number of boys.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (1 ≤ $a_i$ ≤ 100), where $a_i$ is the $i$-th boy's dancing skill.\n* The third line contains an integer $m$ (1 ≤ $m$ ≤ 100) - the number of girls.\n* The fourth line contains $m$ integers $b_1, b_2, ..., b_m$ (1 ≤ $b_j$ ≤ 100), where $b_j$ is the $j$-th girl's dancing skill.\n\nOutput:\n\n* Print a single integer - the maximum number of pairs that can be formed."}, {"prompt_md5": "6db73690", "template_md5": "465699a0", "result": "You are given two lists of numbers representing the skill levels of boys and girls.  Find the maximum number of pairs you can make where the skill difference between a boy and girl in each pair is at most 1."}]}