{"uid": "489-A", "url": "https://codeforces.com/contest/489/problem/A", "tags": ["greedy", " implementation", " sortings"], "title": "489-A", "statement": "A. SwapSorttime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIn this problem your goal is to sort an array consisting ofnintegers in at mostnswaps. For the given array find the sequence of swaps that makes the array sorted in the non-descending order. Swaps are performed consecutively, one after another.Note that in this problem you do not have to minimize the number of swaps — your task is to find any sequence that is no longer thann.InputThe first line of the input contains integern(1 ≤n≤ 3000) — the number of array elements. The second line contains elements of array:a0,a1, ...,an- 1(- 109≤ai≤ 109), whereaiis thei-th element of the array. The elements are numerated from 0 ton- 1from left to right. Some integers may appear in the array more than once.OutputIn the first line printk(0 ≤k≤n) — the number of swaps. Nextklines must contain the descriptions of thekswaps, one per line. Each swap should be printed as a pair of integersi,j(0 ≤i,j≤n- 1), representing the swap of elementsaiandaj. You can print indices in the pairs in any order. The swaps are performed in the order they appear in the output, from the first to the last. It is allowed to printi=jand swap the same pair of elements multiple times.If there are multiple answers, print any of them. It is guaranteed that at least one answer exists.ExamplesInput55 2 5 1 4Output20 34 2Input610 20 20 40 60 60Output0Input2101 100Output10 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "65fd4cdd", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers. Your task is to sort the array in non-decreasing order using at most $n$ swaps.  \n\nFor each swap, you need to specify two indices $i$ and $j$ representing the elements at those positions in the array. You can swap the elements at these indices.\n\nOutput the minimum number of swaps required and a sequence of swaps that achieve the sorted order. \n\n**Input:**\n\n* The first line contains the number of integers in the array, $n$.\n* The second line contains the $n$ integers of the array.\n\n**Output:**\n\n* The first line contains the number of swaps required.\n* The following lines each contain a pair of integers $i$ and $j$ representing a swap.\n\n**Example:**\n\n**Input:**\n```\n5\n5 2 5 1 4\n```\n\n**Output:**\n```\n2\n3 4\n2 4\n```"}, {"prompt_md5": "4bb2de18", "template_md5": "465699a0", "result": "You are given a list of numbers.  Find a sequence of swaps (exchanging two numbers in the list) that will sort the list in ascending order. You can swap numbers at most as many times as there are numbers in the list."}]}