{"uid": "489-F", "url": "https://codeforces.com/contest/489/problem/F", "tags": ["combinatorics", " dp"], "title": "489-F", "statement": "F. Special Matricestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAnn×nsquare matrix isspecial, if:it is binary, that is, each cell contains either a 0, or a 1;the number of ones in each row and column equals 2.You are givennand the firstmrows of the matrix. Print the number of specialn×nmatrices, such that the firstmrows coincide with the given ones.As the required value can be rather large, print the remainder after dividing the value by the given numbermod.InputThe first line of the input contains three integersn,m,mod(2 ≤n≤ 500,0 ≤m≤n,2 ≤mod≤ 109). Thenmlines follow, each of them containsncharacters — the first rows of the required special matrices. Each of these lines contains exactly two characters '1', the rest characters are '0'. Each column of the givenm×ntable contains at most two numbers one.OutputPrint the remainder after dividing the required value by numbermod.ExamplesInput3 1 1000011Output2Input4 4 1005000110101001011001Output1NoteFor the first test the required matrices are:011101110011110101In the second test the required matrix is already fully given, so the answer is 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "70211e31", "template_md5": "35d339e4", "result": "You are given a number $n$ and the first $m$ rows of an $n \\times n$ binary matrix.  A binary matrix has only 0s and 1s. A special matrix has exactly two 1s in each row and each column.\n\nFind the number of special $n \\times n$ matrices where the first $m$ rows match the given rows.  The answer may be very large, so print the remainder when the answer is divided by a given number $mod$."}, {"prompt_md5": "54f373a7", "template_md5": "465699a0", "result": "You are given a partially filled square grid.  Each cell can be either a 0 or a 1.  You need to find how many ways you can fill the rest of the grid so that:\n\n* Every row has exactly two 1s.\n* Every column has exactly two 1s. \n\n\nThe answer should be the remainder when the total number of possible grids is divided by a given number."}]}