{"uid": "49-A", "url": "https://codeforces.com/contest/49/problem/A", "tags": ["implementation"], "title": "49-A", "statement": "A. Sleuthtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya plays the sleuth with his friends. The rules of the game are as follows: those who play for the first time, that is Vasya is the sleuth, he should investigate a \"crime\" and find out what is happening. He can ask any questions whatsoever that can be answered with \"Yes\" or \"No\". All the rest agree beforehand to answer the questions like that: if the question’s last letter is a vowel, they answer \"Yes\" and if the last letter is a consonant, they answer \"No\". Of course, the sleuth knows nothing about it and his task is to understand that.Unfortunately, Vasya is not very smart. After 5 hours of endless stupid questions everybody except Vasya got bored. That’s why Vasya’s friends ask you to write a program that would give answers instead of them.The English alphabet vowels are: A, E, I, O, U, YThe English alphabet consonants are: B, C, D, F, G, H, J, K, L, M, N, P, Q, R, S, T, V, W, X, ZInputThe single line contains a question represented by a non-empty line consisting of large and small Latin letters, spaces and a question mark. The line length does not exceed 100. It is guaranteed that the question mark occurs exactly once in the line — as the last symbol and that the line contains at least one letter.OutputPrint answer for the question in a single line:YESif the answer is \"Yes\",NOif the answer is \"No\".Remember that in the reply to the question the lastletter, not the last character counts. I. e. the spaces and the question mark do not count as letters.ExamplesInputIs it a melon?OutputNOInputIs it an apple?OutputYESInputIs     it a banana ?OutputYESInputIs   it an apple  and a  banana   simultaneouSLY?OutputYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "80ea0980", "template_md5": "35d339e4", "result": "Given a question as input, determine if the answer would be \"Yes\" or \"No\" based on the following rule:\n\n* If the last letter of the question is a vowel (A, E, I, O, U, Y), the answer is \"Yes\".\n* If the last letter of the question is a consonant (all other letters), the answer is \"No\".\n\nOutput \"YES\" if the answer is \"Yes\" and \"NO\" if the answer is \"No\"."}, {"prompt_md5": "0dc32a66", "template_md5": "465699a0", "result": "Determine if the last letter of a given question is a vowel. If it is, output \"YES\". If it is not, output \"NO\"."}]}