{"uid": "49-E", "url": "https://codeforces.com/contest/49/problem/E", "tags": ["dp"], "title": "49-E", "statement": "E. Common ancestortime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe DNA sequence for every living creature in Berland can be represented as a non-empty line consisting of lowercase Latin letters. Berland scientists found out that all the creatures evolve by stages. During one stage exactly one symbol of the DNA line is replaced by exactly two other ones. At that overall there arenpermissible substitutions. The substitutionai->bicimeans that anyonesymbolaican be replaced with two symbolsbici. Every substitution could happen an unlimited number of times.They say that two creatures with DNA sequencess1ands2can have a common ancestor if there exists such a DNA sequences3that throughout evolution it can result ins1ands2, perhaps after a different number of stages. Your task is to find out by the givens1ands2whether the creatures possessing such DNA sequences can have a common ancestor. If the answer is positive, you have to find the length of the shortest sequence of the common ancestor’s DNA.InputThe first line contains a non-empty DNA sequences1, the second line contains a non-empty DNA sequences2. The lengths of these lines do not exceed 50, the lines contain only lowercase Latin letters. The third line contains an integern(0 ≤n≤ 50) — the number of permissible substitutions. Then follownlines each of which describes a substitution in the formatai->bici. The charactersai,bi, andciare lowercase Latin letters. Liness1ands2can coincide, the list of substitutions can contain similar substitutions.OutputIfs1ands2cannot have a common ancestor, print -1. Otherwise print the length of the shortest sequences3, from whichs1ands2could have evolved.ExamplesInputababaaba2c->bac->ccOutput2Inputababaaba7c->bac->cce->abz->eab->bad->ddd->abOutput1Inputababaaba1c->baOutput-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0a745cb0", "template_md5": "35d339e4", "result": "You are given two DNA sequences, $s_1$ and $s_2$.  There are $n$ allowed substitutions, each of the form $a \\rightarrow bc$, meaning that any occurrence of 'a' in a DNA sequence can be replaced with 'b' followed by 'c'.\n\nDetermine if $s_1$ and $s_2$ can have a common ancestor. If they can, find the length of the shortest possible DNA sequence $s_3$ that could evolve into both $s_1$ and $s_2$ through these substitutions. If they cannot have a common ancestor, output -1."}, {"prompt_md5": "e04bd90b", "template_md5": "465699a0", "result": "Given two DNA sequences and a list of allowed DNA substitutions, determine if the sequences can have a common ancestor. If so, find the shortest possible length of that ancestor sequence."}]}