{"uid": "490-E", "url": "https://codeforces.com/contest/490/problem/E", "tags": ["binary search", " brute force", " greedy", " implementation"], "title": "490-E", "statement": "E. Restoring Increasing Sequencetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPeter wrote on the board a strictly increasing sequence of positive integersa1,a2, ...,an. Then Vasil replaced some digits in the numbers of this sequence by question marks. Thus, each question mark corresponds to exactly one lost digit.Restore the the original sequence knowing digits remaining on the board.InputThe first line of the input contains integern(1 ≤n≤ 105) — the length of the sequence. Nextnlines contain one element of the sequence each. Each element consists only of digits and question marks. No element starts from digit0. Each element has length from 1 to 8 characters, inclusive.OutputIf the answer exists, print in the first line \"YES\" (without the quotes). Nextnlines must contain the sequence of positive integers — a possible variant of Peter's sequence. The found sequence must be strictly increasing, it must be transformed from the given one by replacing each question mark by a single digit. All numbers on the resulting sequence must be written without leading zeroes. If there are multiple solutions, print any of them.If there is no answer, print a single line \"NO\" (without the quotes).ExamplesInput3?181?OutputYES11819Input2???OutputNOInput51222412??512226?0000?00000OutputYES12224122251222620000100000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a283de55", "template_md5": "35d339e4", "result": "You are given a sequence of positive integers with some digits replaced by question marks.  \n\n* The sequence is strictly increasing (each number is larger than the one before it).\n* Each question mark represents a missing digit.\n\nYour task is to:\n\n1. **Determine if a valid sequence can be restored** by replacing the question marks with digits. \n2. **If a valid sequence exists, print \"YES\" followed by the restored sequence.** The restored sequence must be strictly increasing and have no leading zeros.\n3. **If no valid sequence exists, print \"NO\".**\n\n\n\nLet me know if you'd like help with any specific part of the problem or have any other questions."}, {"prompt_md5": "24407b5f", "template_md5": "465699a0", "result": "You are given a sequence of numbers with some digits replaced by question marks.  You need to fill in the missing digits to create a strictly increasing sequence of numbers. If a valid sequence can be created, print \"YES\" followed by the sequence. If not, print \"NO\"."}]}