{"uid": "491-B", "url": "https://codeforces.com/contest/491/problem/B", "tags": ["greedy", " math"], "title": "491-B", "statement": "B. New York Hoteltime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThink of New York as a rectangular grid consisting ofNvertical avenues numerated from1toNandMhorizontal streets numerated1toM.Cfriends are staying atChotels located at some street-avenue crossings. They are going to celebrate birthday of one of them in the one ofHrestaurants also located at some street-avenue crossings. They also want that the maximum distance covered by one of them while traveling to the restaurant to be minimum possible. Help friends choose optimal restaurant for a celebration.Suppose that the distance between neighboring crossings are all the same equal to one kilometer.InputThe first line contains two integersNиM— size of the city (1 ≤N,M≤ 109). In the next line there is a single integerC(1 ≤C≤ 105) — the number of hotels friends stayed at. FollowingClines contain descriptions of hotels, each consisting of two coordinatesxandy(1 ≤x≤N,1 ≤y≤M). The next line contains an integerH— the number of restaurants (1 ≤H≤ 105). FollowingHlines contain descriptions of restaurants in the same format.Several restaurants and hotels may be located near the same crossing.OutputIn the first line output the optimal distance. In the next line output index of a restaurant that produces this optimal distance. If there are several possibilities, you are allowed to output any of them.ExamplesInput10 1021 13 321 104 4Output62", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "35faabef", "template_md5": "35d339e4", "result": "You are given a grid of size $N \\times M$. There are $C$ hotels located at different points on the grid and $H$ restaurants also located at different points on the grid.  \n\nYou need to find the restaurant that minimizes the maximum distance any person has to travel from their hotel to the restaurant. The distance between any two adjacent points on the grid is 1.\n\nOutput the minimum maximum distance and the index of one such restaurant."}, {"prompt_md5": "49516717", "template_md5": "465699a0", "result": "You are given a grid of streets and avenues. Some points on the grid represent hotels and some represent restaurants. Find the restaurant that minimizes the maximum distance any person has to travel from their hotel to the restaurant. Output the minimum distance and the index of the restaurant."}]}