{"uid": "493-A", "url": "https://codeforces.com/contest/493/problem/A", "tags": ["implementation"], "title": "493-A", "statement": "A. Vasya and Footballtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya has started watching football games. He has learned that for some fouls the players receive yellow cards, and for some fouls they receive red cards. A player who receives the second yellow card automatically receives a red card.Vasya is watching a recorded football match now and makes notes of all the fouls that he would give a card for. Help Vasya determine all the moments in time when players would be given red cards if Vasya were the judge. For each player, Vasya wants to know only thefirstmoment of time when he would receive a red card from Vasya.InputThe first line contains the name of the team playing at home. The second line contains the name of the team playing away. Both lines are not empty. The lengths of both lines do not exceed 20. Each line contains only of large English letters. The names of the teams are distinct.Next follows numbern(1 ≤n≤ 90) — the number of fouls.Each of the followingnlines contains information about a foul in the following form:first goes numbert(1 ≤t≤ 90) — the minute when the foul occurs;then goes letter \"h\" or letter \"a\" — if the letter is \"h\", then the card was given to a home team player, otherwise the card was given to an away team player;then goes the player's numberm(1 ≤m≤ 99);then goes letter \"y\" or letter \"r\" — if the letter is \"y\", that means that the yellow card was given, otherwise the red card was given.The players from different teams can have the same number. The players within one team have distinct numbers. The fouls go chronologically, no two fouls happened at the same minute.OutputFor each event when a player received his first red cardin a chronological orderprint a string containing the following information:The name of the team to which the player belongs;the player's number in his team;the minute when he received the card.If no player received a card, then you do not need to print anything.It is possible case that the program will not print anything to the output (if there were no red cards).ExamplesInputMCCSKA928 a 3 y62 h 25 y66 h 42 y70 h 25 y77 a 4 y79 a 25 y82 h 42 r89 h 16 y90 a 13 rOutputMC 25 70MC 42 82CSKA 13 90", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "af7e7a44", "template_md5": "35d339e4", "result": "You are given a list of fouls that occur during a football match. Each foul is described by:\n\n* The minute the foul occurs.\n* The team the foul is committed by (home or away).\n* The player number who committed the foul.\n* The type of card given (yellow or red).\n\nA player receives a red card if they receive two yellow cards.\n\nYour task is to determine the first time each player receives a red card. Output the team, player number, and minute for each red card given."}, {"prompt_md5": "7e13f9d7", "template_md5": "465699a0", "result": "Given a list of fouls in a football match, determine the first time each player receives a red card. A player gets a red card after receiving two yellow cards."}]}