{"uid": "493-B", "url": "https://codeforces.com/contest/493/problem/B", "tags": ["implementation"], "title": "493-B", "statement": "B. Vasya and Wrestlingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya has become interested in wrestling. In wrestling wrestlers use techniques for which they are awarded points by judges. The wrestler who gets the most points wins.When the numbers of points of both wrestlers are equal, the wrestler whose sequence of points islexicographically greater, wins.If the sequences of the awarded points coincide, the wrestler who performed the last technique wins. Your task is to determine which wrestler won.InputThe first line contains numbern— the number of techniques that the wrestlers have used (1 ≤n≤ 2·105).The followingnlines contain integer numbersai(|ai| ≤ 109,ai≠ 0). Ifaiis positive, that means that the first wrestler performed the technique that was awarded withaipoints. And ifaiis negative, that means that the second wrestler performed the technique that was awarded with( -ai)points.The techniques are given in chronological order.OutputIf the first wrestler wins, print string \"first\", otherwise print \"second\"ExamplesInput512-3-43OutputsecondInput3-1-23OutputfirstInput24-4OutputsecondNoteSequencex=x1x2...x|x|islexicographically largerthan sequencey=y1y2...y|y|, if either|x|  >  |y|andx1=y1,x2=y2, ... ,x|y|=y|y|, or there is such numberr(r<  |x|,r<  |y|), thatx1=y1,x2=y2,  ... ,xr=yrandxr+  1>yr+  1.We use notation|a|to denote length of sequencea.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9063baf6", "template_md5": "35d339e4", "result": "Two wrestlers compete, earning points for successful techniques.  The wrestler with the most points wins. If the point totals are equal, the wrestler with the lexicographically larger sequence of points wins. If the point sequences are identical, the wrestler who performed the last technique wins.\n\nYou are given a sequence of integers representing the points awarded to each wrestler for each technique. A positive integer indicates a point for the first wrestler, and a negative integer indicates a point for the second wrestler.  \n\nDetermine which wrestler won the competition."}, {"prompt_md5": "de22ff94", "template_md5": "465699a0", "result": "Two players take turns scoring points.  The player with the most points wins. If the scores are tied, the player with the higher sequence of scores wins. If the sequences are the same, the player who scored last wins. Determine the winner based on the given sequence of scores."}]}