{"uid": "494-E", "url": "https://codeforces.com/contest/494/problem/E", "tags": ["data structures", " games"], "title": "494-E", "statement": "E. Shartitime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDuring the last 24 hours Hamed and Malek spent all their time playing \"Sharti\". Now they are too exhausted to finish the last round. So they asked you for help to determine the winner of this round.\"Sharti\" is played on an×nboard with some of cells colored white and others colored black. The rows of the board are numbered from top to bottom using number1ton. Also the columns of the board are numbered from left to right using numbers1ton. The cell located at the intersection ofi-th row andj-th column is denoted by(i,j).The players alternatively take turns. In each turn the player must choose a square with side-length at mostkwith its lower-right cell painted white. Then the colors of all the cells in this square are inversed (white cells become black and vice-versa). The player who cannot perform a move in his turn loses.You know Hamed and Malek are very clever and they would have played their best moves at each turn. Knowing this and the fact that Hamed takes the first turn, given the initial board as described in the input, you must determine which one of them will be the winner.InputIn this problem the initial board is specified as a set ofmrectangles. All cells that lie inside at least one of these rectangles are colored white and the rest are colored black.In the first line of input three space-spereated integersn,m,k(1 ≤k≤n≤ 109,1 ≤m≤ 5·104) follow, denoting size of the board, number of rectangles and maximum size of the turn square during the game, respectively.Ini-th line of the nextmlines four space-seperated integersai,bi,ci,di(1 ≤ai≤ci≤n,1 ≤bi≤di≤n) are given meaning thati-th rectangle determining the initial board is a rectangle with upper-left cell at(ai,bi)and lower-right cell at(ci,di).OutputIf Hamed wins, print \"Hamed\", otherwise print \"Malek\" (without the quotes).ExamplesInput5 2 11 1 3 32 2 4 4OutputMalekInput12 5 73 4 5 61 2 1 24 5 9 98 6 12 1012 4 12 4OutputHamed", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e106a958", "template_md5": "35d339e4", "result": "You are given a board of size $n \\times n$. The board is initially filled with black cells except for some cells that are white. These white cells are arranged in a set of $m$ rectangles. \n\nTwo players take turns. In each turn, a player must choose a square of side length at most $k$ with its bottom-right corner being a white cell. The player then flips the colors of all cells within that square. The game continues until a player cannot make a valid move.\n\nGiven the initial board configuration, determine which player will win if both players play optimally."}, {"prompt_md5": "e2e51920", "template_md5": "465699a0", "result": "Two players take turns on a grid. Each turn, a player must select a square of a certain maximum size where the bottom-right corner is white. They then flip the colors of all the squares in that selection. The first player to be unable to make a move loses. Given the initial state of the grid (some squares are white, others are black), determine who will win."}]}