{"uid": "495-A", "url": "https://codeforces.com/contest/495/problem/A", "tags": ["implementation"], "title": "495-A", "statement": "A. Digital Countertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMalek lives in an apartment block with100floors numbered from0to99. The apartment has an elevator with a digital counter showing the floor that the elevator is currently on. The elevator shows each digit of a number with7light sticks by turning them on or off. The picture below shows how the elevator shows each digit.One day when Malek wanted to go from floor88to floor0using the elevator he noticed that the counter shows number89instead of88. Then when the elevator started moving the number on the counter changed to87. After a little thinking Malek came to the conclusion that there is only one explanation for this: One of the sticks of the counter was broken. Later that day Malek was thinking about the broken stick and suddenly he came up with the following problem.Suppose the digital counter is showing numbern. Malek calls an integerx(0 ≤x≤ 99)goodif it's possible that the digital counter was supposed to showxbut because of some(possibly none) broken sticks it's showingninstead. Malek wants to know number of good integers for a specificn. So you must write a program that calculates this number. Please note that the counteralwaysshows two digits.InputThe only line of input contains exactly two digits representing numbern(0 ≤n≤ 99). Note thatnmay have a leading zero.OutputIn the only line of the output print the number of good integers.ExamplesInput89Output2Input00Output4Input73Output15NoteIn the first sample the counter may be supposed to show88or89.In the second sample the good integers are00,08,80and88.In the third sample the good integers are03, 08, 09, 33, 38, 39, 73, 78, 79, 83, 88, 89, 93, 98, 99.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5fe90e59", "template_md5": "35d339e4", "result": "A digital counter displays two-digit numbers ($00$ to $99$) using seven light sticks per digit. One of the light sticks is broken, causing the counter to sometimes display an incorrect number. \n\nGiven a displayed number $n$, determine how many numbers $x$ ($0 \\le x \\le 99$) could have been intended to be displayed but are shown as $n$ due to the broken light stick. \n\n**Input:**\n\nA single line containing the displayed two-digit number $n$.\n\n**Output:**\n\nA single line containing the number of possible intended numbers $x$."}, {"prompt_md5": "ced62f0d", "template_md5": "465699a0", "result": "A two-digit number is given.  Find how many other two-digit numbers could be displayed if one of the light bulbs in the display is broken."}]}