{"uid": "496-B", "url": "https://codeforces.com/contest/496/problem/B", "tags": ["brute force", " constructive algorithms", " implementation"], "title": "496-B", "statement": "B. Secret Combinationtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou got a box with a combination lock. The lock has a display showingndigits. There are two buttons on the box, each button changes digits on the display. You have quickly discovered that the first button adds 1 to all the digits (all digits 9 become digits 0), and the second button shifts all the digits on the display one position to the right (the last digit becomes the first one). For example, if the display is currently showing number579, then if we push the first button, the display will show680, and if after that we push the second button, the display will show068.You know that the lock will open if the display is showing the smallest possible number that can be obtained by pushing the buttons in some order. The leading zeros are ignored while comparing numbers. Now your task is to find the desired number.InputThe first line contains a single integern(1 ≤n≤ 1000) — the number of digits on the display.The second line containsndigits — the initial state of the display.OutputPrint a single line containingndigits — the desired state of the display containing the smallest possible number.ExamplesInput3579Output024Input42014Output0142", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "77aa5b58", "template_md5": "35d339e4", "result": "You have a lock with a $n$-digit display. There are two buttons:\n\n* Button 1: Adds 1 to each digit (wrapping around from 9 to 0).\n* Button 2: Shifts all digits one position to the right (the last digit becomes the first).\n\nYou need to find the smallest possible number that can be displayed on the lock by pressing the buttons in any order. Leading zeros are ignored when comparing numbers.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 1000), the number of digits on the display.\n* The second line contains $n$ digits, representing the initial state of the display.\n\n**Output:**\n\n* Print a line containing $n$ digits, representing the smallest possible number that can be displayed on the lock."}, {"prompt_md5": "e9c17a5c", "template_md5": "465699a0", "result": "You have a lock with a display of digits. You can change the digits by adding 1 to each digit (wrapping around from 9 to 0) or shifting the digits one position to the right. Find the smallest possible number you can display on the lock."}]}