{"uid": "496-C", "url": "https://codeforces.com/contest/496/problem/C", "tags": ["brute force", " constructive algorithms", " implementation"], "title": "496-C", "statement": "C. Removing Columnstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are given ann×mrectangular table consisting of lower case English letters. In one operation you can completely remove one column from the table. The remaining parts are combined forming a new table. For example, after removing the second column from the tableabcdedfghijkwe obtain the table:acdefghjkA table is calledgoodif its rows are ordered from top to bottom lexicographically, i.e. each row is lexicographically no larger than the following one. Determine the minimum number of operations of removing a column needed to make a given table good.InputThe first line contains two integers  —nandm(1 ≤n,m≤100).Nextnlines containmsmall English letters each — the characters of the table.OutputPrint a single number — the minimum number of columns that you need to remove in order to make the table good.ExamplesInput1 10codeforcesOutput0Input4 4casecaretestcodeOutput2Input5 4codeforcescodeforcesOutput4NoteIn the first sample the table is already good.In the second sample you may remove the first and third column.In the third sample you have to remove all the columns (note that the table where all rows are empty is considered good by definition).Let stringssandthave equal length. Then,sislexicographically largerthantif they are not equal and the character following the largest common prefix ofsandt(the prefix may be empty) insis alphabetically larger than the corresponding character oft.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8916fc18", "template_md5": "35d339e4", "result": "You are given a table of letters arranged in $n$ rows and $m$ columns.  You can remove entire columns from the table.  \n\nA table is \"good\" if each row is lexicographically smaller than the row below it (like a dictionary).\n\nFind the fewest number of columns you need to remove to make the table \"good\"."}, {"prompt_md5": "7e4cdaaa", "template_md5": "465699a0", "result": "You have a rectangular grid of letters. You can remove entire columns from the grid.  What is the fewest columns you need to remove so that the rows of the remaining grid are in alphabetical order from top to bottom?"}]}