{"uid": "496-E", "url": "https://codeforces.com/contest/496/problem/E", "tags": ["greedy", " sortings"], "title": "496-E", "statement": "E. Distributing Partstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are an assistant director in a new musical play. The play consists ofnmusical parts, each part must be performed by exactly one actor. After the casting the director chosemactors who can take part in the play. Your task is to assign the parts to actors. However, there are several limitations.First, each actor has a certain voice range and there are some parts that he cannot sing. Formally, there are two integers for each actor,cianddi(ci≤di) — the pitch of the lowest and the highest note that the actor can sing. There also are two integers for each part —ajandbj(aj≤bj) — the pitch of the lowest and the highest notes that are present in the part. Thei-th actor can perform thej-th part if and only ifci≤aj≤bj≤di, i.e. each note of the part is in the actor's voice range.According to the contract, thei-th actor can perform at mostkiparts. Besides, you are allowed not to give any part to some actors (then they take part in crowd scenes).The rehearsal starts in two hours and you need to do the assignment quickly!InputThe first line contains a single integern— the number of parts in the play (1 ≤n≤ 105).Nextnlines contain two space-separated integers each,ajandbj— the range of notes for thej-th part (1 ≤aj≤bj≤ 109).The next line contains a single integerm— the number of actors (1 ≤m≤ 105).Nextmlines contain three space-separated integers each,ci,diandki— the range of thei-th actor and the number of parts that he can perform (1 ≤ci≤di≤ 109,1 ≤ki≤ 109).OutputIf there is an assignment that meets all the criteria aboce, print a single word \"YES\" (without the quotes) in the first line.In the next line printnspace-separated integers. Thei-th integer should be the number of the actor who should perform thei-th part. If there are multiple correct assignments, print any of them.If there is no correct assignment, print a single word \"NO\" (without the quotes).ExamplesInput31 32 43 521 4 22 5 1OutputYES1 1 2Input31 32 43 521 3 22 5 1OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "de932cd1", "template_md5": "35d339e4", "result": "You are given $n$ musical parts, each with a range of notes from $a_j$ to $b_j$. You also have $m$ actors, each with a voice range from $c_i$ to $d_i$ and a maximum of $k_i$ parts they can perform.\n\nDetermine if it's possible to assign each part to an actor such that:\n\n*  The actor's voice range covers all the notes in the assigned part ($c_i \\le a_j \\le b_j \\le d_i$).\n*  Each actor does not perform more than $k_i$ parts.\n\nIf a valid assignment is possible, output \"YES\" followed by $n$ space-separated integers representing the actor assigned to each part. If no valid assignment is possible, output \"NO\"."}, {"prompt_md5": "3412dc42", "template_md5": "465699a0", "result": "You need to assign musical parts to actors. Each part has a range of notes, and each actor has a range of notes they can sing. Each actor can only perform a limited number of parts.  Find a way to assign parts to actors so that:\n\n* Each part is assigned to an actor who can sing all the notes in that part.\n* Each actor does not perform more parts than their limit.\n\nIf a valid assignment is possible, say \"YES\" and list which actor gets each part. If no valid assignment is possible, say \"NO\"."}]}