{"uid": "498-A", "url": "https://codeforces.com/contest/498/problem/A", "tags": ["geometry"], "title": "498-A", "statement": "A. Crazy Towntime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutCrazy Town is a plane on which there areninfinite line roads. Each road is defined by the equationaix+biy+ci= 0, whereaiandbiare not both equal to the zero. The roads divide the plane into connected regions, possibly of infinite space. Let's call each such region a block. We define an intersection as the point where at least two different roads intersect.Your home is located in one of the blocks. Today you need to get to the University, also located in some block. In one step you can move from one block to another, if the length of their common border is nonzero (in particular, this means that if the blocks are adjacent to one intersection, but have no shared nonzero boundary segment, then it are not allowed to move from one to another one in one step).Determine what is the minimum number of steps you have to perform to get to the block containing the university. It is guaranteed that neither your home nor the university is located on the road.InputThe first line contains two space-separated integersx1,y1(- 106≤x1,y1≤ 106) — the coordinates of your home.The second line contains two integers separated by a spacex2,y2(- 106≤x2,y2≤ 106) — the coordinates of the university you are studying at.The third line contains an integern(1 ≤n≤ 300) — the number of roads in the city. The followingnlines contain 3 space-separated integers (- 106≤ai,bi,ci≤ 106;|ai| + |bi| > 0) — the coefficients of the lineaix+biy+ci= 0, defining thei-th road. It is guaranteed that no two roads are the same. In addition, neither your home nor the university lie on the road (i.e. they do not belong to any one of the lines).OutputOutput the answer to the problem.ExamplesInput1 1-1 -120 1 01 0 0Output2Input1 1-1 -131 0 00 1 01 1 -3Output2NotePictures to the samples are presented below (A is the point representing the house; B is the point representing the university, different blocks are filled with different colors):", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "09487e6c", "template_md5": "35d339e4", "result": "You are given a plane divided into regions by infinitely many lines. Each line is defined by the equation $ax + by + c = 0$.  \n\nYou start at a point $(x_1, y_1)$ and need to reach another point $(x_2, y_2)$. You can only move between regions that share a non-zero length of boundary.  \n\nFind the minimum number of moves required to reach the destination.\n\n**Input:**\n\n* Two integers $x_1$, $y_1$ representing your starting point.\n* Two integers $x_2$, $y_2$ representing the destination point.\n* An integer $n$ representing the number of lines.\n* $n$ lines, each containing three integers $a$, $b$, $c$ defining a line in the form $ax + by + c = 0$.\n\n**Output:**\n\n* The minimum number of moves required to reach the destination."}, {"prompt_md5": "2b6a6334", "template_md5": "465699a0", "result": "You are at a point on a plane. You need to reach another point on the plane. The plane is divided into regions by lines. You can only move between regions that share a border. What is the fewest moves it takes to get from your starting point to your destination?"}]}