{"uid": "498-B", "url": "https://codeforces.com/contest/498/problem/B", "tags": ["dp", " probabilities", " two pointers"], "title": "498-B", "statement": "B. Name That Tunetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutIt turns out that you are a great fan of rock band AC/PE. Peter learned that and started the following game: he plays the first song of the list ofnsongs of the group, and you have to find out the name of the song. After you tell the song name, Peter immediately plays the following song in order, and so on.Thei-th song of AC/PE has its recognizabilitypi. This means that if the song has not yet been recognized by you, you listen to it for exactly one more second and with probability ofpipercent you recognize it and tell it's name. Otherwise you continue listening it. Note that you can only try to guess it only when it is integer number of seconds after the moment the song starts playing.In all AC/PE songs the first words of chorus are the same as the title, so when you've heard the firsttiseconds ofi-th song and its chorus starts, you immediately guess its name for sure.For example, in the song Highway To Red the chorus sounds pretty late, but the song has high recognizability. In the song Back In Blue, on the other hand, the words from the title sound close to the beginning of the song, but it's hard to name it before hearing those words. You can name both of these songs during a few more first seconds.Determine the expected number songs of you will recognize if the game lasts for exactlyTseconds (i. e. you can make the last guess on the secondT, after that the game stops).If all songs are recognized faster than inTseconds, the game stops after the last song is recognized.InputThe first line of the input contains numbersnandT(1 ≤n≤ 5000,1 ≤T≤ 5000), separated by a space. Nextnlines contain pairs of numberspiandti(0 ≤pi≤ 100,1 ≤ti≤T). The songs are given in the same order as in Petya's list.OutputOutput a single number — the expected number of the number of songs you will recognize inTseconds. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.ExamplesInput2 250 210 1Output1.500000000Input2 20 2100 2Output1.000000000Input3 350 350 225 2Output1.687500000Input2 20 20 2Output1.000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "451efc2f", "template_md5": "35d339e4", "result": "You are playing a game where you listen to songs and try to guess their titles. \n\nThere are $n$ songs, and each song has a recognizability value $p_i$ (a percentage) and a chorus start time $t_i$. \n\n*  The recognizability means that if you haven't guessed the song yet, after listening for one more second, you have a $p_i\\%$ chance of recognizing it.\n*  You can only guess the song when you've listened to an integer number of seconds.\n*  Once you hear the chorus ($t_i$ seconds in), you know the song title for sure.\n\nThe game lasts for $T$ seconds.  \n\nYour goal is to find the expected number of songs you will recognize within those $T$ seconds. \n\n\n\nInput:\n\n* The first line contains two numbers, $n$ (the number of songs) and $T$ (the game duration).\n* The next $n$ lines each contain two numbers, $p_i$ and $t_i$ (the recognizability and chorus start time for each song).\n\nOutput:\n\n* A single number representing the expected number of songs you will recognize."}, {"prompt_md5": "b9fefddf", "template_md5": "465699a0", "result": "You listen to a list of songs, one after another. Each song has a recognizability score and a time until its chorus starts. You can guess the song's name when you hear its chorus or after a certain number of seconds.  You have a limited amount of time to listen. What is the average number of songs you can guess correctly?"}]}