{"uid": "498-D", "url": "https://codeforces.com/contest/498/problem/D", "tags": ["data structures", " dp", " number theory"], "title": "498-D", "statement": "D. Traffic Jams in the Landtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutSome country consists of(n+ 1)cities, located along a straight highway. Let's number the cities with consecutive integers from1ton+ 1in the order they occur along the highway. Thus, the cities are connected bynsegments of the highway, thei-th segment connects cities numberiandi+ 1. Every segment of the highway is associated with a positive integerai> 1— the period of traffic jams appearance on it.In order to get from cityxto cityy(x<y), some drivers use the following tactics.Initially the driver is in cityxand the current timetequals zero. Until the driver arrives in cityy, he perfors the following actions:if the current timetis a multiple ofax, then the segment of the highway numberxis now having traffic problems and the driver stays in the current city for one unit of time (formally speaking, we assignt=t+ 1);if the current timetis not amultipleofax, then the segment of the highway numberxis now clear and that's why the driver uses one unit of time to move to cityx+ 1(formally, we assignt=t+ 1andx=x+ 1).You are developing a new traffic control system. You want to consecutively processqqueries of two types:determine the final value of timetafter the ride from cityxto cityy(x<y) assuming that we apply the tactics that is described above. Note that for each querytis being reset to0.replace the period of traffic jams appearing on the segment numberxby valuey(formally, assignax=y).Write a code that will effectively process the queries given above.InputThe first line contains a single integern(1 ≤n≤ 105) — the number of highway segments that connect then+ 1cities.The second line containsnintegersa1,a2, ...,an(2 ≤ai≤ 6) — the periods of traffic jams appearance on segments of the highway.The next line contains a single integerq(1 ≤q≤ 105) — the number of queries to process.The nextqlines contain the descriptions of the queries in the formatc,x,y(c— the query type).Ifcis character 'A', then your task is to process a query of the first type. In this case the following constraints are satisfied:1 ≤x<y≤n+ 1.Ifcis character 'C', then you need to process a query of the second type. In such case, the following constraints are satisfied:1 ≤x≤n,2 ≤y≤ 6.OutputFor each query of the first type output a single integer — the final value of timetafter driving from cityxto cityy. Process the queries in the order in which they are given in the input.ExamplesInput102 5 3 2 3 5 3 4 2 410C 10 6A 2 6A 1 3C 3 4A 3 11A 4 9A 5 6C 7 3A 8 10A 2 5Output53146244", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "54c26037", "template_md5": "35d339e4", "result": "There are $n+1$ cities on a highway numbered 1 to $n+1$.  Each segment between consecutive cities has a period $a_i$ representing how often traffic jams occur.\n\nA driver wants to travel from city $x$ to city $y$ ($x<y$).  They follow these rules:\n\n* If the current time $t$ is a multiple of $a_i$ (where they are currently on segment $i$), they are stuck in traffic for one time unit.\n* If the current time $t$ is not a multiple of $a_i$, they travel to the next city in one time unit.\n\nYou are given $q$ queries:\n\n* **Type A:**  Find the final time $t$ it takes to travel from city $x$ to city $y$.  Reset $t$ to 0 before each query.\n* **Type C:** Change the traffic jam period for segment $x$ to $y$.\n\nProcess the queries in the order they are given."}, {"prompt_md5": "4ee1e825", "template_md5": "465699a0", "result": "You are given a number of road segments, each with a specific time interval at which traffic jams occur.  You need to calculate the time it takes to travel between two cities on this road, considering the traffic jams. You can also update the traffic jam intervals for specific road segments."}]}