{"uid": "50-D", "url": "https://codeforces.com/contest/50/problem/D", "tags": ["binary search", " dp", " probabilities"], "title": "50-D", "statement": "D. Bombingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe commanding officers decided to drop a nuclear bomb on the enemy's forces. You are ordered to determine the power of the warhead that needs to be used.The enemy hasNstrategically important objects. Their positions are known due to the intelligence service. The aim of the strike is to deactivate at leastKimportant objects of the enemy. The bombing impact point is already determined and has coordinates of[X0;Y0].The nuclear warhead is marked by the estimated impact radiusR≥ 0. All the buildings that are located closer thanRto the bombing epicentre will be destroyed. All the buildings that are located further thanRfrom the epicentre, can also be deactivated with some degree of probability. Let's assume thatDis the distance between a building and the epicentre. This building's deactivation probabilityP(D,R)is calculated according to the following formula:We should regardasea, wheree≈ 2.7182818284590452353602874713527If the estimated impact radius of the warhead is equal to zero, then all the buildings located in the impact point will be completely demolished and all the rest of important objects will not be damaged.The commanding officers want the probability of failing the task to be no more thanε. Nuclear warheads are too expensive a luxury, that's why you have to minimise the estimated impact radius of the warhead.InputThe first line contains an integerNwhich represents the number of the enemy's objects (1 ≤N≤ 100). The second line contains two integers:Kis the required number of deactivated objects, andεis the maximally permitted probability of not completing the task, given in per mils (1 ≤K≤N,1 ≤ ε ≤ 999). The third line containsX0andY0which are the coordinates of the strike impact point. The nextNlines contain two numbersXiandYieach which are the coordinates of every strategically important object. All the coordinates are integer, their absolute values do not exceed1000.Let us remind you that there are a thousand per mils in unity (number one).There can be several objects in one point.OutputPrint the sought estimated impact radius of the warhead. The absolute or relative measure of the inaccuracy of your answer should not exceed10- 6.ExamplesInput11 5005 51 2Output3.84257761518762740Input53 1000 03 460 70100 10010 105 12Output13.45126176453737600", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d18623e1", "template_md5": "35d339e4", "result": "You are given the locations of $N$ enemy objects. You need to determine the minimum radius of a bomb that will deactivate at least $K$ of these objects with a probability of at least $1 - \\epsilon$.\n\nThe bomb will completely destroy any object within a radius $R$ of the impact point. Objects further than $R$ away have a deactivation probability calculated as:\n\n$$P(D, R) = e^{-D/R}$$\n\nwhere $D$ is the distance from the object to the impact point.\n\nInput:\n\n* $N$: The number of enemy objects.\n* $K$: The minimum number of objects that need to be deactivated.\n* $\\epsilon$: The maximum allowed probability of failure.\n* $X_0$, $Y_0$: The coordinates of the bomb's impact point.\n* $X_i$, $Y_i$: The coordinates of each enemy object.\n\nOutput:\n\n* The minimum radius $R$ of the bomb."}, {"prompt_md5": "582d621c", "template_md5": "465699a0", "result": "You need to find the smallest radius needed for a bomb to destroy or disable at least a certain number of targets.  Each target has a chance of being disabled based on its distance from the bomb. The chance of failing to disable enough targets must be below a given limit."}]}