{"uid": "500-F", "url": "https://codeforces.com/contest/500/problem/F", "tags": ["divide and conquer", " dp"], "title": "500-F", "statement": "F. New Year Shoppingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDohyun is running a grocery store. He sellsnitems numbered by integers from 1 ton. Thei-th (1 ≤i≤n) of them costscidollars, and if I buy it, my happiness increases byhi. Each item can be displayed only forpunits of time because of freshness. As Dohyun displays thei-th item at timeti, the customers can buy thei-th item only from timetito timeti+ (p- 1)inclusively. Also, each customer cannot buy the same item more than once.I'd like to visit Dohyun's grocery store and buy some items for the New Year Party, and maximize my happiness. Because I am a really busy person, I can visit the store only once, and for very short period of time. In other words, if I visit the store at timet, I can only buy the items available at timet. But I can buy as many items as possible, if the budget holds. I can't buy same item several times due to store rules. It is not necessary to use the whole budget.I made a list ofqpairs of integers(aj,bj), which means I may visit the store at timeaj, and spend at mostbjdollars at the store. For each pair, I'd like to know the maximum happiness I can obtain. But there are so many pairs that I can't handle them. Can you help me?InputThe first line contains two space-separated integersnandp(1 ≤n≤ 4000,1 ≤p≤ 10 000) — the number of items, and the display time of each item.Nextnlines describe the items. Thei-th (1 ≤i≤n) of them contains three space-separated integersci,hi,ti(1 ≤ci,hi≤ 4000,1 ≤ti≤ 10 000) — the cost of thei-th item, the happiness of thei-th item, and the time when thei-th item starts to be displayed.The next line contains an integerq(1 ≤q≤ 20 000)— the number of candidates.Nextqlines describe the candidates. Thej-th (1 ≤j≤q) of them contains two space-separated integersaj,bj(1 ≤aj≤ 20 000,1 ≤bj≤ 4000) — the visit time and the budget forj-th visit of store.OutputFor each candidate, print a single line containing the maximum happiness that I can obtain by buying some items.ExamplesInput4 42 3 23 5 14 7 211 15 541 32 52 65 14Output581018Input5 43 2 17 4 42 1 26 3 53 2 2101 52 54 84 94 105 85 95 108 47 9Output2355645604NoteConsider the first sample.At time 1, only the 2nd item is available. I can buy the 2nd item using 3 dollars and my happiness will increase by 5.At time 2, the 1st, 2nd, and 3rd item is available. I can buy the 1st item using 2 dollars, and the 2nd item using 3 dollars. My happiness will increase by 3 + 5 = 8.At time 2, the 1st, 2nd, and 3rd item is available. I can buy the 1st item using 2 dollars, and the 3nd item using 4 dollars. My happiness will increase by 3 + 7 = 10.At time 5, the 1st, 3rd, and 4th item is available. I can buy the 1st item using 2 dollars, and the 4th item using 11 dollars. My happiness will increase by 3 + 15 = 18. Note that I don't need to use the whole budget in this case.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cba3dde5", "template_md5": "35d339e4", "result": "There are $n$ items for sale, each with a cost $c_i$ and a happiness value $h_i$. Each item is displayed for $p$ time units. The $i$-th item is displayed from time $t_i$ to $t_i + p - 1$.  \n\nYou can visit the store only once and for a short period of time.  You can buy as many items as possible during your visit, but you cannot buy the same item multiple times. You also have a budget of $b_j$ for the $j$-th visit.\n\nGiven $q$ visit times $a_j$ and budgets $b_j$, find the maximum happiness you can obtain for each visit."}, {"prompt_md5": "1225f8c3", "template_md5": "465699a0", "result": "You have a limited amount of time to visit a store with items for sale. Each item has a cost and a happiness value. Items are only available for a short period of time. You want to find the maximum happiness you can achieve by buying items within your budget and during your available time slots."}]}