{"uid": "501-B", "url": "https://codeforces.com/contest/501/problem/B", "tags": ["data structures", " dsu", " strings"], "title": "501-B", "statement": "B. Misha and Changing Handlestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMisha hacked the Codeforces site. Then he decided to let all the users change their handles. A user can now change his handle any number of times. But each new handle must not be equal to any handle that is already used or that was used at some point.Misha has a list of handle change requests. After completing the requests he wants to understand the relation between the original and the new handles of the users. Help him to do that.InputThe first line contains integerq(1 ≤q≤ 1000), the number of handle change requests.Nextqlines contain the descriptions of the requests, one per line.Each query consists of two non-empty stringsoldandnew, separated by a space. The strings consist of lowercase and uppercase Latin letters and digits. Stringsoldandneware distinct. The lengths of the strings do not exceed20.The requests are given chronologically. In other words, by the moment of a query there is a single person with handleold, and handlenewis not used and has not been used by anyone.OutputIn the first line output the integern— the number of users that changed their handles at least once.In the nextnlines print the mapping between the old and the new handles of the users. Each of them must contain two strings,oldandnew, separated by a space, meaning that before the user had handleold, and after all the requests are completed, his handle isnew. You may output lines in any order.Each user who changes the handle must occur exactly once in this description.ExamplesInput5Misha ILoveCodeforcesVasya PetrovPetrov VasyaPetrov123ILoveCodeforces MikeMirzayanovPetya IvanovOutput3Petya IvanovMisha MikeMirzayanovVasya VasyaPetrov123", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "269d94a7", "template_md5": "35d339e4", "result": "You are given a list of handle changes. Each change consists of an old handle and a new handle.  Handles cannot be reused.  \n\nDetermine:\n\n1. The total number of users who changed their handles.\n2. A list of all users and their corresponding old and new handles. \n\n\n\nInput:\n\nThe first line contains an integer $q$ ($1 \\le q \\le 1000$), the number of handle changes.\n\nThe next $q$ lines each contain two strings, separated by a space, representing the old and new handles.\n\nOutput:\n\nThe first line should contain an integer $n$, the number of users who changed their handles.\n\nThe next $n$ lines should each contain two strings, separated by a space, representing the old and new handles of each user."}, {"prompt_md5": "e9ab0b26", "template_md5": "465699a0", "result": "A list of handle changes is given, where each change is from an old handle to a new handle.  Determine the number of unique users who changed their handles and list each user's old and new handles."}]}