{"uid": "504-E", "url": "https://codeforces.com/contest/504/problem/E", "tags": ["binary search", " dfs and similar", " hashing", " string suffix structures", " trees"], "title": "504-E", "statement": "E. Misha and LCP on Treetime limit per test8 secondsmemory limit per test512 megabytesinputstdinoutputstdoutMisha has a tree with characters written on the vertices. He can choose two verticessandtof this tree and write down characters of vertices lying on a path fromstot. We'll say that such string corresponds to pair(s,t).Misha hasmqueries of type: you are given4verticesa,b,c,d; you need to find the largest common prefix of the strings that correspond to pairs(a,b)and(c,d). Your task is to help him.InputThe first line contains integern(1 ≤n≤ 300 000) — the number of vertices in the tree.Next follows a line consisting ofnsmall English letters. Thei-th character of the string corresponds to the character written on thei-th vertex.Nextn- 1lines contain information about edges. An edge is defined by a pair of integersu,v(1 ≤u,v≤n,u≠v), separated by spaces.The next line contains integerm(1 ≤m≤ 1 000 000) — the number of queries.Nextmlines contain information about queries. A query is defined by four integersa,b,c,d(1 ≤a,b,c,d≤n), separated by spaces.OutputFor each query print the length of the largest common prefix on a separate line.ExamplesInput6bbbabb2 13 24 35 26 562 5 3 11 5 2 35 6 5 66 3 4 16 2 3 42 2 4 5Output222010", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3437f13d", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices, each labeled with a character.  \n\nYou can choose any two vertices $s$ and $t$ in the tree and form a string by concatenating the characters along the path from $s$ to $t$.\n\nYou will be given $m$ queries, each consisting of four vertices $a$, $b$, $c$, and $d$. For each query, find the length of the longest common prefix of the strings formed by the paths from $a$ to $b$ and from $c$ to $d$.\n\n\n\nLet me know if you'd like me to elaborate on any part of the problem statement."}, {"prompt_md5": "0741875c", "template_md5": "465699a0", "result": "You are given a tree with letters on each node.  You can choose two nodes and find the longest string of letters that appears in the path between them. You will be given multiple pairs of nodes, and for each pair you need to find the longest string of letters that appears in both of the paths."}]}