{"uid": "505-B", "url": "https://codeforces.com/contest/505/problem/B", "tags": ["dfs and similar", " dp", " dsu", " graphs"], "title": "505-B", "statement": "B. Mr. Kitayuta's Colorful Graphtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMr. Kitayuta has just bought an undirected graph consisting ofnvertices andmedges. The vertices of the graph are numbered from 1 ton. Each edge, namely edgei, has a colorci, connecting vertexaiandbi.Mr. Kitayuta wants you to process the followingqqueries.In thei-th query, he gives you two integers —uiandvi.Find the number of the colors that satisfy the following condition: the edges of that color connect vertexuiand vertexvidirectly or indirectly.InputThe first line of the input contains space-separated two integers —nandm(2 ≤n≤ 100, 1 ≤m≤ 100), denoting the number of the vertices and the number of the edges, respectively.The nextmlines contain space-separated three integers —ai,bi(1 ≤ai<bi≤n) andci(1 ≤ci≤m). Note that there can be multiple edges between two vertices. However, there are no multiple edges of the same color between two vertices, that is, ifi≠j,(ai,bi,ci) ≠ (aj,bj,cj).The next line contains a integer —q(1 ≤q≤ 100), denoting the number of the queries.Then followsqlines, containing space-separated two integers —uiandvi(1 ≤ui,vi≤n). It is guaranteed thatui≠vi.OutputFor each query, print the answer in a separate line.ExamplesInput4 51 2 11 2 22 3 12 3 32 4 331 23 41 4Output210Input5 71 5 12 5 13 5 14 5 11 2 22 3 23 4 251 55 12 51 51 4Output11112NoteLet's consider the first sample.The figure above shows the first sample.Vertex1and vertex2are connected by color1and2.Vertex3and vertex4are connected by color3.Vertex1and vertex4are not connected by any single color.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "39bb6639", "template_md5": "35d339e4", "result": "You are given an undirected graph with $n$ vertices and $m$ edges. Each edge has a unique color from 1 to $m$. \n\nYou need to process $q$ queries. Each query consists of two vertices, $u$ and $v$. For each query, find the number of colors that connect vertex $u$ to vertex $v$ either directly or indirectly. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of vertices and edges, respectively.\n* The next $m$ lines each contain three integers, $a_i$, $b_i$, and $c_i$, representing an edge connecting vertex $a_i$ to vertex $b_i$ with color $c_i$.\n* The next line contains an integer, $q$, representing the number of queries.\n* The next $q$ lines each contain two integers, $u_i$ and $v_i$, representing a query.\n\n**Output:**\n\n* For each query, print the number of colors that connect $u_i$ and $v_i$."}, {"prompt_md5": "59e07442", "template_md5": "465699a0", "result": "You are given a graph with nodes and edges, each edge having a color.  You need to answer queries asking for the number of colors that connect two given nodes, either directly or indirectly."}]}