{"uid": "505-A", "url": "https://codeforces.com/contest/505/problem/A", "tags": ["brute force", " implementation", " strings"], "title": "505-A", "statement": "A. Mr. Kitayuta's Gifttime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutMr. Kitayuta has kindly given you a stringsconsisting of lowercase English letters. You are asked to insert exactly one lowercase English letter intosto make it a palindrome. Apalindromeis a string that reads the same forward and backward. For example, \"noon\", \"testset\" and \"a\" are all palindromes, while \"test\" and \"kitayuta\" are not.You can choose any lowercase English letter, and insert it to any position ofs, possibly to the beginning or the end ofs. You have to insert a letter even if the given string is already a palindrome.If it is possible to insert one lowercase English letter intosso that the resulting string will be a palindrome, print the string after the insertion. Otherwise, print \"NA\" (without quotes, case-sensitive). In case there is more than one palindrome that can be obtained, you are allowed to print any of them.InputThe only line of the input contains a strings(1 ≤ |s| ≤ 10). Each character insis a lowercase English letter.OutputIf it is possible to turnsinto a palindrome by inserting one lowercase English letter, print the resulting string in a single line. Otherwise, print \"NA\" (without quotes, case-sensitive). In case there is more than one solution, any of them will be accepted.ExamplesInputreviveOutputreviverInputeeOutputeyeInputkitayutaOutputNANoteFor the first sample, insert 'r' to the end of \"revive\" to obtain a palindrome \"reviver\".For the second sample, there is more than one solution. For example, \"eve\" will also be accepted.For the third sample, it is not possible to turn \"kitayuta\" into a palindrome by just inserting one letter.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0946dc61", "template_md5": "35d339e4", "result": "You are given a string of lowercase English letters. Your task is to insert exactly one lowercase English letter into the string to make it a palindrome. A palindrome is a word or phrase that reads the same backward as forward (e.g., \"racecar\", \"madam\").  \n\nIf you can make a palindrome by inserting one letter, print the resulting palindrome. If it's not possible, print \"NA\"."}, {"prompt_md5": "ee42f02e", "template_md5": "465699a0", "result": "Given a string, insert one letter into it to make it read the same backward as forward. If this is possible, print the resulting palindrome. Otherwise, print \"NA\"."}]}