{"uid": "505-D", "url": "https://codeforces.com/contest/505/problem/D", "tags": ["dfs and similar"], "title": "505-D", "statement": "D. Mr. Kitayuta's Technologytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutShuseki Kingdom is the world's leading nation for innovation and technology. There arencities in the kingdom, numbered from1ton.Thanks to Mr. Kitayuta's research, it has finally become possible to construct teleportation pipes between two cities. A teleportation pipe will connect two cities unidirectionally, that is, a teleportation pipe from cityxto cityycannot be used to travel from cityyto cityx. The transportation within each city is extremely developed, therefore if a pipe from cityxto cityyand a pipe from cityyto cityzare both constructed, people will be able to travel from cityxto cityzinstantly.Mr. Kitayuta is also involved in national politics. He considers that the transportation between thempairs of city(ai,bi)(1 ≤i≤m) is important. He is planning to construct teleportation pipes so that for each important pair(ai,bi), it will be possible to travel from cityaito citybiby using one or more teleportation pipes (but not necessarily from citybito cityai). Find the minimum number of teleportation pipes that need to be constructed. So far, no teleportation pipe has been constructed, and there is no other effective transportation between cities.InputThe first line contains two space-separated integersnandm(2 ≤n≤ 105, 1 ≤m≤ 105), denoting the number of the cities in Shuseki Kingdom and the number of the important pairs, respectively.The followingmlines describe the important pairs. Thei-th of them (1 ≤i≤m) contains two space-separated integersaiandbi(1 ≤ai,bi≤n,ai≠bi), denoting that it must be possible to travel from cityaito citybiby using one or more teleportation pipes (but not necessarily from citybito cityai). It is guaranteed that all pairs(ai,bi)are distinct.OutputPrint the minimum required number of teleportation pipes to fulfill Mr. Kitayuta's purpose.ExamplesInput4 51 21 31 42 32 4Output3Input4 61 21 42 32 43 23 4Output4NoteFor the first sample, one of the optimal ways to construct pipes is shown in the image below:For the second sample, one of the optimal ways is shown below:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6b5b7a84", "template_md5": "35d339e4", "result": "You are given $n$ cities numbered from 1 to $n$ and $m$ pairs of cities $(a_i, b_i)$.  You need to build a minimum number of one-way teleportation pipes between the cities so that it is possible to travel from city $a_i$ to city $b_i$ using one or more pipes for each pair $(a_i, b_i)$.  \n\nThe pipes are unidirectional, meaning a pipe from city $x$ to city $y$ does not allow travel from city $y$ to city $x$. \n\nFind the minimum number of pipes needed."}, {"prompt_md5": "0059d815", "template_md5": "465699a0", "result": "You are given a list of pairs of cities. You need to build one-way connections (pipes) between cities so that you can travel from each city in a pair to the other city, even if there isn't a direct connection. Find the fewest pipes needed to achieve this."}]}