{"uid": "505-C", "url": "https://codeforces.com/contest/505/problem/C", "tags": ["dfs and similar", " dp", " two pointers"], "title": "505-C", "statement": "C. Mr. Kitayuta, the Treasure Huntertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe Shuseki Islands are an archipelago of30001small islands in the Yutampo Sea. The islands are evenly spaced along a line, numbered from0to30000from the west to the east. These islands are known to contain many treasures. There arengems in the Shuseki Islands in total, and thei-th gem is located on islandpi.Mr. Kitayuta has just arrived at island0. With his great jumping ability, he will repeatedly perform jumps between islands to the east according to the following process:First, he will jump from island0to islandd.After that, he will continue jumping according to the following rule. Letlbe the length of the previous jump, that is, if his previous jump was from islandprevto islandcur, letl=cur-prev. He will perform a jump of lengthl- 1,lorl+ 1to the east. That is, he will jump to island(cur+l- 1),(cur+l)or(cur+l+ 1)(if they exist). The length of a jump must be positive, that is, he cannot perform a jump of length0whenl= 1. If there is no valid destination, he will stop jumping.Mr. Kitayuta will collect the gems on the islands visited during the process. Find the maximum number of gems that he can collect.InputThe first line of the input contains two space-separated integersnandd(1 ≤n,d≤ 30000), denoting the number of the gems in the Shuseki Islands and the length of the Mr. Kitayuta's first jump, respectively.The nextnlines describe the location of the gems. Thei-th of them (1 ≤i≤n) contains a integerpi(d≤p1≤p2≤ ... ≤pn≤ 30000), denoting the number of the island that contains thei-th gem.OutputPrint the maximum number of gems that Mr. Kitayuta can collect.ExamplesInput4 1010212727Output3Input8 8919283645556678Output6Input13 788916171718212324242630Output4NoteIn the first sample, the optimal route is 0→10 (+1 gem)→19→27 (+2 gems)→ ...\u0001In the second sample, the optimal route is 0→8→15→21→28 (+1 gem)→36 (+1 gem)→45 (+1 gem)→55 (+1 gem)→66 (+1 gem)→78 (+1 gem)→ ...In the third sample, the optimal route is 0→7→13→18 (+1 gem)→24 (+2 gems)→30 (+1 gem)→ ...", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "560145ba", "template_md5": "35d339e4", "result": "There are $n$ gems located on islands numbered from $0$ to $30000$.  You start on island $0$. You can jump to an island to the east, and the length of your jump follows these rules:\n\n* Your first jump is to island $d$.\n* After that, your jump length can be one less than, equal to, or one more than the length of your previous jump.\n* You must always jump to a valid island (i.e., an island that exists).\n\nWhat is the maximum number of gems you can collect? \n\nInput:\n\n* The first line contains two integers, $n$ and $d$.\n* The next $n$ lines each contain an integer, representing the island number where a gem is located.\n\nOutput:\n\n* The maximum number of gems you can collect."}, {"prompt_md5": "b35288f0", "template_md5": "465699a0", "result": "You start at location 0. You can jump to a location that is 1, or 2, or 3 further away than your previous jump.  You want to collect as many items as possible, where each item is located at a specific numbered location.  What is the maximum number of items you can collect?"}]}