{"uid": "507-A", "url": "https://codeforces.com/contest/507/problem/A", "tags": ["greedy", " implementation", " sortings"], "title": "507-A", "statement": "A. Amr and Musictime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAmr is a young coder who likes music a lot. He always wanted to learn how to play music but he was busy coding so he got an idea.Amr hasninstruments, it takesaidays to learni-th instrument. Being busy, Amr dedicatedkdays to learn how to play the maximum possible number of instruments.Amr asked for your help to distribute his free days between instruments so that he can achieve his goal.InputThe first line contains two numbersn,k(1 ≤n≤ 100,0 ≤k≤ 10 000), the number of instruments and number of days respectively.The second line containsnintegersai(1 ≤ai≤ 100), representing number of days required to learn thei-th instrument.OutputIn the first line output one integermrepresenting the maximum number of instruments Amr can learn.In the second line outputmspace-separated integers: the indices of instruments to be learnt. You may output indices in any order.if there are multiple optimal solutions output any. It is not necessary to use all days for studying.ExamplesInput4 104 3 1 2Output41 2 3 4Input5 64 3 1 1 2Output31 3 4Input1 34Output0NoteIn the first test Amr can learn all4instruments.In the second test other possible solutions are:{2, 3, 5}or{3, 4, 5}.In the third test Amr doesn't have enough time to learn the only presented instrument.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "08dad930", "template_md5": "35d339e4", "result": "You are given $n$ instruments, where the $i$-th instrument takes $a_i$ days to learn. You have $k$ days available to learn instruments.  \n\nFind the maximum number of instruments you can learn and output a list of their indices.  It is not necessary to use all $k$ days."}, {"prompt_md5": "8d53a0c7", "template_md5": "465699a0", "result": "You are given a list of numbers representing the time it takes to learn each of several skills. You have a limited amount of time.  Find the maximum number of skills you can learn within the time limit and list the indices of those skills."}]}