{"uid": "507-B", "url": "https://codeforces.com/contest/507/problem/B", "tags": ["geometry", " math"], "title": "507-B", "statement": "B. Amr and Pinstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAmr loves Geometry. One day he came up with a very interesting problem.Amr has a circle of radiusrand center in point(x,y). He wants the circle center to be in new position(x',y').In one step Amr can put a pin to the border of the circle in a certain point, then rotate the circle around that pin by any angle and finally remove the pin.Help Amr to achieve his goal in minimum number of steps.InputInput consists of 5 space-separated integersr,x,y,x'y'(1 ≤r≤ 105,- 105≤x,y,x',y' ≤ 105), circle radius, coordinates of original center of the circle and coordinates of destination center of the circle respectively.OutputOutput a single integer — minimum number of steps required to move the center of the circle to the destination point.ExamplesInput2 0 0 0 4Output1Input1 1 1 4 4Output3Input4 5 6 5 6Output0NoteIn the first sample test the optimal way is to put a pin at point(0, 2)and rotate the circle by180degrees counter-clockwise (or clockwise, no matter).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dba8c82f", "template_md5": "35d339e4", "result": "You are given a circle with radius $r$ and center at coordinates $(x, y)$. You want to move the center of the circle to a new position $(x', y')$.  You can do this by performing the following operation any number of times:\n\n1. Place a pin on the circle's edge at some point.\n2. Rotate the circle around that pin by any angle.\n3. Remove the pin.\n\nWhat is the minimum number of operations needed to move the circle's center to $(x', y')$?"}, {"prompt_md5": "53d09242", "template_md5": "465699a0", "result": "You are given the starting position and the target position of a circle's center. You can move the circle's center by placing a pin on the circle's edge, rotating the circle around that pin, and then removing the pin. What is the minimum number of these steps needed to move the circle's center to the target position?"}]}