{"uid": "508-A", "url": "https://codeforces.com/contest/508/problem/A", "tags": ["brute force"], "title": "508-A", "statement": "A. Pasha and Pixelstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutPasha loves his phone and also putting his hair up... But the hair is now irrelevant.Pasha has installed a new game to his phone. The goal of the game is following. There is a rectangular field consisting ofnrow withmpixels in each row. Initially, all the pixels are colored white. In one move, Pasha can choose any pixel and color it black. In particular, he can choose the pixel that is already black, then after the boy's move the pixel does not change, that is, it remains black. Pasha loses the game when a2 × 2square consisting of black pixels is formed.Pasha has made a plan ofkmoves, according to which he will paint pixels. Each turn in his plan is represented as a pair of numbersiandj, denoting respectively the row and the column of the pixel to be colored on the current move.Determine whether Pasha loses if he acts in accordance with his plan, and if he does, on what move the2 × 2square consisting of black pixels is formed.InputThe first line of the input contains three integersn,m,k(1 ≤n,m≤ 1000,1 ≤k≤ 105) — the number of rows, the number of columns and the number of moves that Pasha is going to perform.The nextklines contain Pasha's moves in the order he makes them. Each line contains two integersiandj(1 ≤i≤n,1 ≤j≤m), representing the row number and column number of the pixel that was painted during a move.OutputIf Pasha loses, print the number of the move when the2 × 2square consisting of black pixels is formed.If Pasha doesn't lose, that is, no2 × 2square consisting of black pixels is formed during the givenkmoves, print0.ExamplesInput2 2 41 11 22 12 2Output4Input2 3 62 32 21 32 21 21 1Output5Input5 3 72 31 21 14 13 15 33 2Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dd46b402", "template_md5": "35d339e4", "result": "You are given a rectangular grid of $n$ rows and $m$ columns. Initially, all cells are white.  You can choose any cell and color it black.  You can choose a cell that is already black, and it will remain black.\n\nYou lose the game if you form a $2 \\times 2$ square of black cells.\n\nYou are given a sequence of $k$ moves, where each move is a pair of numbers $(i,j)$ representing the row and column of a cell to be colored.\n\nDetermine if you will lose the game following these moves, and if so, on which move the $2 \\times 2$ square of black cells is formed. If you do not lose, output 0."}, {"prompt_md5": "404b700e", "template_md5": "465699a0", "result": "You are given a grid of squares. You can color any square black.  You have a list of squares to color. Determine if coloring the squares in the list will ever create a 2x2 square of all black squares. If so, say which move creates the square. If not, say 0."}]}