{"uid": "508-C", "url": "https://codeforces.com/contest/508/problem/C", "tags": ["constructive algorithms", " greedy"], "title": "508-C", "statement": "C. Anya and Ghoststime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAnya loves to watch horror movies. In the best traditions of horror, she will be visited bymghosts tonight. Anya has lots of candles prepared for the visits, each candle can produce light for exactlytseconds. It takes the girl one second to light one candle. More formally, Anya can spend one second to light one candle, then this candle burns for exactlytseconds and then goes out and can no longer be used.For each of themghosts Anya knows the time at which it comes: thei-th visit will happenwiseconds after midnight, allwi's are distinct. Each visit lasts exactly one second.What is the minimum number of candles Anya should use so that during each visit, at leastrcandles are burning? Anya can start to light a candle at any time that is integer number of seconds from midnight, possibly, at the time before midnight.That means, she can start to light a candle integer number of seconds before midnight or integer number of seconds after a midnight, or in other words in any integer moment of time.InputThe first line contains three integersm,t,r(1 ≤m,t,r≤ 300), representing the number of ghosts to visit Anya, the duration of a candle's burning and the minimum number of candles that should burn during each visit.The next line containsmspace-separated numberswi(1 ≤i≤m,1 ≤wi≤ 300), thei-th of them repesents at what second after the midnight thei-th ghost will come. Allwi's are distinct, they follow in the strictly increasing order.OutputIf it is possible to make at leastrcandles burn during each visit, then print the minimum number of candles that Anya needs to light for that.If that is impossible, print- 1.ExamplesInput1 8 310Output3Input2 10 15 8Output1Input1 1 310Output-1NoteAnya can start lighting a candle in the same second with ghost visit. But this candle isn't counted as burning at this visit.It takes exactly one second to light up a candle and only after that second this candle is considered burning; it means that if Anya starts lighting candle at moment x, candle is buring from second x + 1 to second x + t inclusively.In the first sample test three candles are enough. For example, Anya can start lighting them at the3-rd,5-th and7-th seconds after the midnight.In the second sample test one candle is enough. For example, Anya can start lighting it one second before the midnight.In the third sample test the answer is- 1, since during each second at most one candle can burn but Anya needs three candles to light up the room at the moment when the ghost comes.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "57428f7d", "template_md5": "35d339e4", "result": "You are given $m$ time points ($w_1, w_2, ..., w_m$) representing when ghosts will visit. Each visit lasts 1 second. You have candles that burn for $t$ seconds each. It takes 1 second to light a candle.\n\nFind the minimum number of candles you need to light so that at least $r$ candles are burning during each ghost visit. You can light candles at any integer time point.\n\nIf it's impossible to satisfy the condition, output -1."}, {"prompt_md5": "f06b1e35", "template_md5": "465699a0", "result": "You have a limited number of items that last for a set amount of time. You need to figure out the minimum number of items you need to use so that at least a certain number are active during a series of events that happen at specific times."}]}