{"uid": "508-E", "url": "https://codeforces.com/contest/508/problem/E", "tags": ["dp", " greedy"], "title": "508-E", "statement": "E. Arthur and Bracketstime limit per test2 secondsmemory limit per test128 megabytesinputstdinoutputstdoutNotice that the memory limit is non-standard.Recently Arthur and Sasha have studied correct bracket sequences. Arthur understood this topic perfectly and become so amazed about correct bracket sequences, so he even got himself a favorite correct bracket sequence of length2n. Unlike Arthur, Sasha understood the topic very badly, and broke Arthur's favorite correct bracket sequence just to spite him.All Arthur remembers about his favorite sequence is for each opening parenthesis ('(') the approximate distance to the corresponding closing one (')'). For thei-th opening bracket he remembers the segment[li,ri], containing the distance to the corresponding closing bracket.Formally speaking, for thei-th opening bracket (in order from left to right) we know that the difference of its position and the position of the corresponding closing bracket belongs to the segment[li,ri].Help Arthur restore his favorite correct bracket sequence!InputThe first line contains integern(1 ≤n≤ 600), the number of opening brackets in Arthur's favorite correct bracket sequence.Nextnlines contain numbersliandri(1 ≤li≤ri< 2n), representing the segment where lies the distance from thei-th opening bracket and the corresponding closing one.The descriptions of the segments are given in the order in which the opening brackets occur in Arthur's favorite sequence if we list them from left to right.OutputIf it is possible to restore the correct bracket sequence by the given data, print any possible choice.If Arthur got something wrong, and there are no sequences corresponding to the given information, print a single line \"IMPOSSIBLE\" (without the quotes).ExamplesInput41 11 11 11 1Output()()()()Input35 53 31 1Output((()))Input35 53 32 2OutputIMPOSSIBLEInput32 31 41 4Output(())()", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d2d0c8b9", "template_md5": "35d339e4", "result": "You are given a number $n$ representing the number of opening brackets in a sequence.  You are also given $n$ pairs of numbers, $(l_i, r_i)$, where $1 \\le l_i \\le r_i < 2n$.  \n\nFor each opening bracket, the $i$-th pair $(l_i, r_i)$ tells you that the distance between the opening bracket and its corresponding closing bracket is somewhere between $l_i$ and $r_i$ (inclusive).\n\nYour task is to reconstruct a valid bracket sequence that satisfies these distance constraints. If it is impossible to reconstruct a valid sequence, print \"IMPOSSIBLE\"."}, {"prompt_md5": "8ec2a902", "template_md5": "465699a0", "result": "You are given a list of ranges. Each range represents the possible positions of a closing bracket corresponding to an opening bracket.  Find a valid sequence of opening and closing brackets that satisfies these constraints. If no such sequence exists, output \"IMPOSSIBLE\"."}]}