{"uid": "509-D", "url": "https://codeforces.com/contest/509/problem/D", "tags": ["constructive algorithms", " math"], "title": "509-D", "statement": "D. Restoring Numberstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutVasya had two arrays consisting of non-negative integers:aof sizenandbof sizem. Vasya chose a positive integerkand created ann×mmatrixvusing the following formula:Vasya wrote down matrixvon a piece of paper and put it in the table.A year later Vasya was cleaning his table when he found a piece of paper containing ann×mmatrixw. He remembered making a matrix one day by the rules given above but he was not sure if he had found the paper with the matrixvfrom those days. Your task is to find out if the matrixwthat you've found could have been obtained by following these rules and if it could, then for what numbersk,a1,a2, ...,an,b1,b2, ...,bmit is possible.InputThe first line contains integersnandm(1 ≤n,m≤ 100), separated by a space — the number of rows and columns in the found matrix, respectively.Thei-th of the following lines contains numberswi, 1,wi, 2, ...,wi,m(0 ≤wi,j≤ 109), separated by spaces — the elements of thei-th row of matrixw.OutputIf the matrixwcould not have been obtained in the manner described above, print \"NO\" (without quotes) in the single line of output.Otherwise, print four lines.In the first line print \"YES\" (without quotes).In the second line print an integerk(1 ≤k≤ 1018). Note that each element of tablewshould be in range between0andk- 1inclusively.In the third line printnintegersa1,a2, ...,an(0 ≤ai≤ 1018), separated by spaces.In the fourth line printmintegersb1,b2, ...,bm(0 ≤bi≤ 1018), separated by spaces.ExamplesInput2 31 2 32 3 4OutputYES10000000070 11 2 3Input2 21 22 0OutputYES30 11 2Input2 21 22 1OutputNONoteBywe denote the remainder of integer division ofbbyc.It is guaranteed that if there exists some set of numbersk,a1, ...,an,b1, ...,bm, that you could use to make matrixw, then there also exists a set of numbers that meets the limits1 ≤k≤ 1018,1 ≤ai≤ 1018,1 ≤bi≤ 1018in the output format. In other words, these upper bounds are introduced only for checking convenience purposes.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e3d6346d", "template_md5": "35d339e4", "result": "You are given a matrix $w$ of size $n \\times m$.  Determine if there exist positive integers $k$, $a_1, a_2, ..., a_n$, and $b_1, b_2, ..., b_m$ such that the following condition holds for all $i$ and $j$:\n\n$$w_{i,j} = (a_i + b_j) \\mod k$$\n\nIf such integers exist, output \"YES\" followed by the values of $k$, $a_1, a_2, ..., a_n$, and $b_1, b_2, ..., b_m$. Otherwise, output \"NO\".\n\nNote that $mod$ represents the modulo operation (remainder after division)."}, {"prompt_md5": "e7dea5c5", "template_md5": "465699a0", "result": "Given a matrix of numbers, determine if it could have been created by using a single number and two arrays of numbers, applying a specific operation to each element of the matrix. If it's possible, output the single number and the two arrays. If it's not possible, output \"NO\"."}]}