{"uid": "509-C", "url": "https://codeforces.com/contest/509/problem/C", "tags": ["dp", " greedy", " implementation"], "title": "509-C", "statement": "C. Sums of Digitstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya had astrictly increasingsequence of positive integersa1, ...,an. Vasya used it to build a new sequenceb1, ...,bn, wherebiis the sum of digits ofai's decimal representation. Then sequenceaigot lost and all that remained is sequencebi.Vasya wonders what the numbersaicould be like. Of all the possible options he likes the one sequence with the minimum possible last numberan. Help Vasya restore the initial sequence.It is guaranteed that such a sequence always exists.InputThe first line contains a single integer numbern(1 ≤n≤ 300).Nextnlines contain integer numbersb1, ...,bn— the required sums of digits. Allbibelong to the range1 ≤bi≤ 300.OutputPrintninteger numbers, one per line — the correct option for numbersai, in order of following in sequence. The sequence should be strictly increasing. The sum of digits of thei-th number should be equal tobi.If there are multiple sequences with least possible numberan, print any of them. Print the numbers without leading zeroes.ExamplesInput3123Output123Input3321Output311100", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ced17488", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers $b_1, b_2, ..., b_n$ where each $b_i$ is the sum of the digits of an unknown integer $a_i$.  \n\nYour task is to find one possible sequence of integers $a_1, a_2, ..., a_n$ that satisfies these conditions:\n\n* $a_1 < a_2 < ... < a_n$ (the sequence is strictly increasing)\n* $b_i$ is the sum of the digits of $a_i$ for each $i$\n\nYou should output the sequence $a_1, a_2, ..., a_n$ where $a_n$ is as small as possible. \n\nIt is guaranteed that a solution exists."}, {"prompt_md5": "b71508a1", "template_md5": "465699a0", "result": "You are given a list of numbers. Each number is the sum of the digits of a larger number that is unknown.  Find one possible list of the original larger numbers, where the last number in the list is as small as possible. The list of larger numbers must be in increasing order."}]}