{"uid": "509-B", "url": "https://codeforces.com/contest/509/problem/B", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "509-B", "statement": "B. Painting Pebblestime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThere arenpiles of pebbles on the table, thei-th pile containsaipebbles. Your task is to paint each pebble using one of thekgiven colors so that for each colorcand any two pilesiandjthe difference between the number of pebbles of colorcin pileiand number of pebbles of colorcin pilejis at most one.In other words, let's say thatbi,cis the number of pebbles of colorcin thei-th pile. Then for any1 ≤c≤k,1 ≤i,j≤nthe following condition must be satisfied|bi,c-bj,c| ≤ 1. It isn't necessary to use allkcolors: if colorchasn't been used in pilei, thenbi,cis considered to be zero.InputThe first line of the input contains positive integersnandk(1 ≤n,k≤ 100), separated by a space — the number of piles and the number of colors respectively.The second line containsnpositive integersa1,a2, ...,an(1 ≤ai≤ 100) denoting number of pebbles in each of the piles.OutputIf there is no way to paint the pebbles satisfying the given condition, output \"NO\" (without quotes) .Otherwise in the first line output \"YES\" (without quotes). Thennlines should follow, thei-th of them should containaispace-separated integers.j-th (1 ≤j≤ai) of these integers should be equal to the color of thej-th pebble in thei-th pile.If there are several possible answers, you may output any of them.ExamplesInput4 41 2 3 4OutputYES11 41 2 41 2 3 4Input5 23 2 4 1 3OutputNOInput5 43 2 4 3 5OutputYES1 2 31 31 2 3 41 3 41 1 2 3 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "54b944bf", "template_md5": "35d339e4", "result": "You have $n$ piles of pebbles. The $i$-th pile has $a_i$ pebbles. You want to paint each pebble with one of $k$ colors so that for each color $c$ and any two piles $i$ and $j$, the difference between the number of pebbles of color $c$ in pile $i$ and the number of pebbles of color $c$ in pile $j$ is at most 1.  \n\nIn other words, let $b_{i,c}$ be the number of pebbles of color $c$ in the $i$-th pile. Then for any $1 \\le c \\le k$, $1 \\le i, j \\le n$, the following condition must be satisfied:\n\n$$|b_{i,c} - b_{j,c}| \\le 1$$\n\nYou don't have to use all $k$ colors. If color $c$ hasn't been used in pile $i$, then $b_{i,c}$ is considered to be zero.\n\n**Input:**\n\n* The first line contains two positive integers $n$ and $k$ (1 ≤ $n$, $k$ ≤ 100), separated by a space — the number of piles and the number of colors respectively.\n* The second line contains $n$ positive integers $a_1$, $a_2$, ..., $a_n$ (1 ≤ $a_i$ ≤ 100) denoting the number of pebbles in each of the piles.\n\n**Output:**\n\n* If there is no way to paint the pebbles satisfying the given condition, output \"NO\".\n* Otherwise, output \"YES\" followed by $n$ lines. The $i$-th of these lines should contain $a_i$ space-separated integers. The $j$-th (1 ≤ $j$ ≤ $a_i$) of these integers should be equal to the color of the $j$-th pebble in the $i$-th pile."}, {"prompt_md5": "b451a2d8", "template_md5": "465699a0", "result": "You have several piles of objects. You need to color each object with one of several colors. The rule is that for each color, the difference in the number of objects of that color between any two piles can be at most one.  Determine if it's possible to color the objects according to this rule and, if so, provide one way to do it."}]}