{"uid": "509-A", "url": "https://codeforces.com/contest/509/problem/A", "tags": ["brute force", " implementation"], "title": "509-A", "statement": "A. Maximum in Tabletime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAnn×ntableais defined as follows:The first row and the first column contain ones, that is:ai, 1=a1,i= 1for alli= 1, 2, ...,n.Each of the remaining numbers in the table is equal to the sum of the number above it and the number to the left of it. In other words, the remaining elements are defined by the formulaai,j=ai- 1,j+ai,j- 1.These conditions define all the values in the table.You are given a numbern. You need to determine the maximum value in then×ntable defined by the rules above.InputThe only line of input contains a positive integern(1 ≤n≤ 10) — the number of rows and columns of the table.OutputPrint a single line containing a positive integerm— the maximum value in the table.ExamplesInput1Output1Input5Output70NoteIn the second test the rows of the table look as follows:{1, 1, 1, 1, 1},{1, 2, 3, 4, 5},{1, 3, 6, 10, 15},{1, 4, 10, 20, 35},{1, 5, 15, 35, 70}.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7a73af81", "template_md5": "35d339e4", "result": "You are given a number $n$.  You need to find the largest possible value in a square table of size $n \\times n$ that follows these rules:\n\n* The first row and the first column of the table are all filled with 1s.\n* Every other cell in the table is the sum of the cell above it and the cell to its left.\n\nFor example, if $n=5$, the largest value in the table would be 70. \n\n\nLet me know if you'd like help with figuring out how to find this maximum value!"}, {"prompt_md5": "a939c21f", "template_md5": "465699a0", "result": "You are given a number n.  You need to find the largest possible number in a square table of size n x n. The table is filled in a specific way: the first row and column are all 1s. Each other number in the table is the sum of the number above it and the number to its left."}]}