{"uid": "51-C", "url": "https://codeforces.com/contest/51/problem/C", "tags": ["binary search", " greedy"], "title": "51-C", "statement": "C. Three Base Stationstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThe New Vasjuki village is stretched along the motorway and that's why every house on it is characterized by its shift relative to some fixed point — thexicoordinate. The village consists ofnhouses, thei-th house is located in the point with coordinates ofxi.TELE3, a cellular communication provider planned to locate three base stations so as to provide every house in the village with cellular communication. The base station having powerdlocated in the pointtprovides with communication all the houses on the segment[t-d,t+d](including boundaries).To simplify the integration (and simply not to mix anything up) all the three stations are planned to possess the equal power ofd. Which minimal value ofdis enough to provide all the houses in the village with cellular communication.InputThe first line contains an integern(1 ≤n≤ 2·105) which represents the number of houses in the village. The second line contains the coordinates of houses — the sequencex1,x2, ...,xnof integer numbers (1 ≤xi≤ 109). It is possible that two or more houses are located on one point. The coordinates are given in a arbitrary order.OutputPrint the required minimal powerd. In the second line print three numbers — the possible coordinates of the base stations' location. Print the coordinates with 6 digits after the decimal point. The positions of the stations can be any from0to2·109inclusively. It is accepted for the base stations to have matching coordinates. If there are many solutions, print any of them.ExamplesInput41 2 3 4Output0.5000001.500000 2.500000 3.500000Input310 20 30Output010.000000 20.000000 30.000000Input510003 10004 10001 10002 1Output0.5000001.000000 10001.500000 10003.500000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4a1fa02d", "template_md5": "35d339e4", "result": "You are given a list of $n$ house locations along a road, represented by the integers $x_1, x_2, ..., x_n$.  A cellular company wants to place three base stations along the road to provide coverage to all houses. Each base station has a power $d$ and provides coverage to all houses within a distance of $d$ units in either direction from its location.\n\nFind the minimum power $d$ required to cover all houses. Also, provide three possible locations for the base stations. \n\nThe locations of the base stations can be any integer between 0 and $2 \\cdot 10^9$, inclusive.  It is acceptable for two or more base stations to be located at the same point."}, {"prompt_md5": "c76e3178", "template_md5": "465699a0", "result": "You are given a list of house locations along a line. You need to place three base stations of equal range along the line so that all houses are covered.  Find the smallest possible range for the base stations and give three possible locations for them."}]}