{"uid": "513-A", "url": "https://codeforces.com/contest/513/problem/A", "tags": ["constructive algorithms", " math"], "title": "513-A", "statement": "A. Gametime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTwo players play a simple game. Each player is provided with a box with balls. First player's box contains exactlyn1balls and second player's box contains exactlyn2balls. In one move first player can take from 1 tok1balls from his box and throw them away. Similarly, the second player can take from 1 tok2balls from his box in his move. Players alternate turns and the first player starts the game. The one who can't make a move loses. Your task is to determine who wins if both players play optimally.InputThe first line contains four integersn1,n2,k1,k2. All numbers in the input are from 1 to 50.This problem doesn't have subproblems. You will get 3 points for the correct submission.OutputOutput \"First\" if the first player wins and \"Second\" otherwise.ExamplesInput2 2 1 2OutputSecondInput2 1 1 1OutputFirstNoteConsider the first sample test. Each player has a box with 2 balls. The first player draws a single ball from his box in one move and the second player can either take 1 or 2 balls from his box in one move. No matter how the first player acts, the second player can always win if he plays wisely.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e65ccc9b", "template_md5": "35d339e4", "result": "Two players take turns removing balls from their boxes. \n\n* Player 1 starts with $n_1$ balls and can remove 1 to $k_1$ balls on their turn.\n* Player 2 starts with $n_2$ balls and can remove 1 to $k_2$ balls on their turn.\n\nThe first player to be unable to remove any balls loses. Determine which player wins if both players play optimally. \n\nInput: Four integers $n_1$, $n_2$, $k_1$, $k_2$ (all between 1 and 50).\n\nOutput: \"First\" if Player 1 wins, \"Second\" if Player 2 wins."}, {"prompt_md5": "5573d687", "template_md5": "465699a0", "result": "Two players take turns removing balls from their boxes. The first player starts.  The first player can remove 1 to k1 balls from their box, and the second player can remove 1 to k2 balls from their box. The game ends when a player cannot remove any more balls. Determine which player wins if both players play optimally."}]}