{"uid": "514-C", "url": "https://codeforces.com/contest/514/problem/C", "tags": ["binary search", " data structures", " hashing", " string suffix structures", " strings"], "title": "514-C", "statement": "C. Watto and Mechanismtime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutWatto, the owner of a spare parts store, has recently got an order for the mechanism that can process strings in a certain way. Initially the memory of the mechanism is filled withnstrings. Then the mechanism should be able to process queries of the following type: \"Given strings, determine if the memory of the mechanism contains stringtthat consists of the same number of characters assand differs fromsin exactly one position\".Watto has already compiled the mechanism, all that's left is to write a program for it and check it on the data consisting ofninitial lines andmqueries. He decided to entrust this job to you.InputThe first line contains two non-negative numbersnandm(0 ≤n≤ 3·105,0 ≤m≤ 3·105) — the number of the initial strings and the number of queries, respectively.Next follownnon-empty strings that are uploaded to the memory of the mechanism.Next followmnon-empty strings that are the queries to the mechanism.The total length of lines in the input doesn't exceed6·105. Each line consistsonlyof letters'a','b','c'.OutputFor each query print on a single line \"YES\" (without the quotes), if the memory of the mechanism contains the required string, otherwise print \"NO\" (without the quotes).ExamplesInput2 3aaaaaacacacaaabaaccacacccaaacOutputYESNONO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c861e652", "template_md5": "35d339e4", "result": "You are given a list of $n$ strings. Then you are given $m$ queries. Each query consists of two strings, $s$ and $t$.  For each query, determine if there is a string in the initial list that:\n\n* Has the same length as $t$\n* Differs from $t$ in exactly one position.\n\nFor each query, print \"YES\" if such a string exists, and \"NO\" otherwise."}, {"prompt_md5": "7f64c19f", "template_md5": "465699a0", "result": "You are given a list of strings. Then you are given a series of queries, each asking if there is a string in the list that is one character different from a given query string and has the same length. For each query, say \"YES\" if such a string exists, and \"NO\" otherwise."}]}