{"uid": "514-B", "url": "https://codeforces.com/contest/514/problem/B", "tags": ["brute force", " data structures", " geometry", " implementation", " math"], "title": "514-B", "statement": "B. Han Solo and Lazer Guntime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutThere arenImperial stormtroopers on the field. The battle field is a plane with Cartesian coordinate system. Each stormtrooper is associated with his coordinates(x,y)on this plane.Han Solo has the newest duplex lazer gun to fight these stormtroopers. It is situated at the point(x0,y0). In one shot it can can destroy all the stormtroopers, situated on some line that crosses point(x0,y0).Your task is to determine what minimum number of shots Han Solo needs to defeat all the stormtroopers.The gun is the newest invention, it shoots very quickly and even after a very large number of shots the stormtroopers don't have enough time to realize what's happening and change their location.InputThe first line contains three integersn,x0иy0(1 ≤n≤ 1000,- 104≤x0,y0≤ 104) — the number of stormtroopers on the battle field and the coordinates of your gun.Nextnlines contain two integers eachxi,yi(- 104≤xi,yi≤ 104) — the coordinates of the stormtroopers on the battlefield. It is guaranteed that no stormtrooper stands at the same point with the gun. Multiple stormtroopers can stand at the same point.OutputPrint a single integer — the minimum number of shots Han Solo needs to destroy all the stormtroopers.ExamplesInput4 0 01 12 22 0-1 -1Output2Input2 1 21 11 0Output1NoteExplanation to the first and second samples from the statement, respectively:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ea90afed", "template_md5": "35d339e4", "result": "You are given a set of points on a 2D plane.  Each point represents a target. You also have a starting point.  You can shoot a laser from the starting point that will destroy all targets on a straight line passing through the starting point.  \n\nFind the minimum number of shots needed to destroy all the targets. \n\n\nLet:\n\n*  $n$ be the number of targets.\n* $(x_0, y_0)$ be the starting point.\n* $(x_i, y_i)$ be the coordinates of each target."}, {"prompt_md5": "4008dee7", "template_md5": "465699a0", "result": "You have a gun at a specific location. There are multiple targets scattered on a 2D plane.  Each shot from the gun destroys all targets on a straight line passing through the gun's location. Find the minimum number of shots needed to destroy all targets."}]}