{"uid": "516-D", "url": "https://codeforces.com/contest/516/problem/D", "tags": ["dfs and similar", " dp", " dsu", " trees", " two pointers"], "title": "516-D", "statement": "D. Drazil and Morning Exercisetime limit per test3.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutDrazil and Varda are the earthworm couple. They want to find a good place to bring up their children. They found a good ground containing nature hole. The hole contains many rooms, some pairs of rooms are connected by small tunnels such that earthworm can move between them.Let's consider rooms and small tunnels as the vertices and edges in a graph. This graph is atree. In the other words, any pair of vertices has an unique path between them.Each room that isleafin the graph is connected with a ground by a vertical tunnel. Here,leafis a vertex that has only one outgoing edge in the graph.Each room is large enough only to fit one earthworm living in it. Earthworm can't live in a tunnel.Drazil and Varda have a plan to educate their children. They want all their children to do morning exercises immediately after getting up!When the morning is coming, all earthworm children get up in the same time, then each of them chooses thefarthestpath to the ground for gathering with others (these children are lazy, so they all want to do exercises as late as possible).Drazil and Varda want the difference between the time first earthworm child arrives outside and the time the last earthworm child arrives outside to be not larger thanl(otherwise children will spread around the ground and it will be hard to keep them exercising together).Also, The rooms that are occupied by their children should form aconnectedset. In the other words, for any two rooms that are occupied with earthworm children, all rooms that lie on the path between them should be occupied with earthworm children too.How many children Drazil and Varda may have at most in order to satisfy all conditions above? Drazil and Varda want to know the answer for many different choices ofl.(Drazil and Varda don't live in the hole with their children)InputThe first line contains one integerndenoting how many rooms there are in the hole (2 ≤n≤ 105).Then there aren- 1lines following. Each of these lines contains three integersx,y,v(1 ≤x,y≤n,1 ≤v≤ 106) denoting there is a small tunnel between roomxand roomythat takes timevto pass.Suppose that the time for an earthworm to get out to the ground from any leaf room is the same.The next line contains an integerq(1 ≤q≤ 50), denoting the number of different value oflyou need to process.The last line containsqnumbers, each number denoting a value ofl(1 ≤l≤ 1011).OutputYou should printqlines. Each line should contain one integer denoting the answer for a corresponding value ofl.ExamplesInput51 2 32 3 44 5 33 4 251 2 3 4 5Output13335Input125 9 32 1 711 7 26 5 52 5 36 7 21 4 48 5 71 3 811 12 310 8 21013 14 14 13 13 4 6 7 2 1Output101010101033521NoteFor the first sample the hole looks like the following. Rooms 1 and 5 are leaves, so they contain a vertical tunnel connecting them to the ground. The lengths of farthest path from rooms1 – 5to the ground are12, 9, 7, 9, 12respectively.If l = 1, we may only choose any single room.If l = 2..4, we may choose rooms 2, 3, and 4 as the answer.If l = 5, we may choose all rooms.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "190d9b18", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, where each node represents a room.  Each edge in the tree represents a tunnel between two rooms, and the weight of each edge represents the time it takes to travel through the tunnel.  \n\nThere are $q$ queries, each with a value $l$. For each query, determine the maximum number of rooms that can be occupied such that:\n\n* All children in the occupied rooms must be able to reach the ground (which is outside the tree) within a time difference of $l$ or less.\n* All occupied rooms must be connected.\n\n\nInput:\n\n* The first line contains $n$, the number of rooms.\n* The next $n-1$ lines each contain three integers $x$, $y$, and $v$, representing an edge between rooms $x$ and $y$ with a weight of $v$.\n* The next line contains $q$, the number of queries.\n* The last line contains $q$ integers, each representing a value of $l$.\n\nOutput:\n\n* For each query, print the maximum number of rooms that can be occupied."}, {"prompt_md5": "b6538058", "template_md5": "465699a0", "result": "You are given a tree-shaped network of rooms. Each room can house one person. Some rooms have a direct connection to the ground.  \n\nPeople wake up at the same time and want to reach the ground as late as possible.  \n\nGiven a time limit *l*, find the maximum number of people that can be in the network such that the time it takes for the first person to reach the ground and the last person to reach the ground is less than or equal to *l*.  All occupied rooms must be connected."}]}