{"uid": "518-D", "url": "https://codeforces.com/contest/518/problem/D", "tags": ["combinatorics", " dp", " math", " probabilities"], "title": "518-D", "statement": "D. Ilya and Escalatortime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIlya got tired of sports programming, left university and got a job in the subway. He was given the task to determine the escalator load factor.Let's assume thatnpeople stand in the queue for the escalator. At each second one of the two following possibilities takes place: either the first person in the queue enters the escalator with probabilityp, or the first person in the queue doesn't move with probability(1 -p), paralyzed by his fear of escalators and making the whole queue wait behind him.Formally speaking, thei-th person in the queue cannot enter the escalator until people with indices from1toi- 1inclusive enter it. In one second only one person can enter the escalator. The escalator is infinite, so if a person enters it, he never leaves it, that is he will be standing on the escalator at any following second. Ilya needs to count the expected value of the number of people standing on the escalator aftertseconds.Your task is to help him solve this complicated task.InputThe first line of the input contains three numbersn,p,t(1 ≤n,t≤ 2000,0 ≤p≤ 1). Numbersnandtare integers, numberpis real, given with exactly two digits after the decimal point.OutputPrint a single real number — the expected number of people who will be standing on the escalator aftertseconds. The absolute or relative error mustn't exceed10- 6.ExamplesInput1 0.50 1Output0.5Input1 0.50 4Output0.9375Input4 0.20 2Output0.4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "343cd190", "template_md5": "35d339e4", "result": "There are $n$ people waiting in a line for an escalator.  Each second, the first person in line has a probability $p$ of stepping onto the escalator, and a probability $(1-p)$ of remaining in line.  Once a person steps onto the escalator, they never get off.  \n\nGiven $n$, $p$, and the number of seconds $t$, calculate the expected number of people on the escalator after $t$ seconds."}, {"prompt_md5": "1260b3da", "template_md5": "465699a0", "result": "People line up for an escalator. Each second, the person at the front has a chance to step on. If they do, they stay on. If not, they stay in line.  What is the average number of people on the escalator after a certain amount of time?"}]}