{"uid": "518-B", "url": "https://codeforces.com/contest/518/problem/B", "tags": ["greedy", " implementation", " strings"], "title": "518-B", "statement": "B. Tanya and Postcardtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLittle Tanya decided to present her dad a postcard on his Birthday. She has already created a message — stringsof lengthn, consisting of uppercase and lowercase English letters. Tanya can't write yet, so she found a newspaper and decided to cut out the letters and glue them into the postcard to achieve strings. The newspaper contains stringt, consisting of uppercase and lowercase English letters. We know that the length of stringtgreater or equal to the length of the strings.The newspaper may possibly have too few of some letters needed to make the text and too many of some other letters. That's why Tanya wants to cut somenletters out of the newspaper and make a message of length exactlyn, so that it looked as much as possible likes. If the letter in some position has correct value and correct letter case (in the stringsand in the string that Tanya will make), then she shouts joyfully \"YAY!\", and if the letter in the given position has only the correct value but it is in the wrong case, then the girl says \"WHOOPS\".Tanya wants to make such message that lets her shout \"YAY!\" as much as possible. If there are multiple ways to do this, then her second priority is to maximize the number of times she says \"WHOOPS\". Your task is to help Tanya make the message.InputThe first line contains lines(1 ≤ |s| ≤ 2·105), consisting of uppercase and lowercase English letters — the text of Tanya's message.The second line contains linet(|s| ≤ |t| ≤ 2·105), consisting of uppercase and lowercase English letters — the text written in the newspaper.Here|a|means the length of the stringa.OutputPrint two integers separated by a space:the first number is the number of times Tanya shouts \"YAY!\" while making the message,the second number is the number of times Tanya says \"WHOOPS\" while making the message.ExamplesInputAbCDCbAOutput3 0InputABCabcOutput0 3InputabacabaAbaCaBAOutput3 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3d353076", "template_md5": "35d339e4", "result": "You are given two strings,  $s$ and $t$, where $|s| \\le |t|$.  \n\nThe goal is to find the maximum number of times you can make the characters in $s$ match the characters in $t$ while maintaining the correct case.\n\n* If a character in $s$ matches the corresponding character in $t$ with the correct case, you shout \"YAY!\".\n* If a character in $s$ matches the corresponding character in $t$ but has the wrong case, you say \"WHOOPS!\".\n\nOutput the number of \"YAY!\"s and \"WHOOPS!\"s you can achieve."}, {"prompt_md5": "a3618fba", "template_md5": "465699a0", "result": "You are given two strings, one shorter and one longer.  The goal is to rearrange the letters in the longer string to create a string that matches the shorter string as closely as possible.  Count how many times the rearranged string matches the shorter string exactly and how many times it matches except for the case of the letter (uppercase vs. lowercase)."}]}