{"uid": "518-C", "url": "https://codeforces.com/contest/518/problem/C", "tags": ["constructive algorithms", " data structures", " implementation"], "title": "518-C", "statement": "C. Anya and Smartphonetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutAnya has bought a new smartphone that usesBerdroidoperating system. The smartphone menu has exactlynapplications, each application has its own icon. The icons are located on different screens, one screen containskicons. The icons from the first to thek-th one are located on the first screen, from the(k+ 1)-th to the2k-th ones are on the second screen and so on (the last screen may be partially empty).Initially the smartphone menu is showing the screen number1. To launch the application with the icon located on the screent, Anya needs to make the following gestures: first she scrolls to the required screen numbert, by makingt- 1gestures (if the icon is on the screent), and then make another gesture — press the icon of the required application exactly once to launch it.After the application is launched, the menu returns to the first screen. That is, to launch the next application you need to scroll through the menu again starting from the screen number1.All applications are numbered from1ton. We know a certain order in which the icons of the applications are located in the menu at the beginning, but it changes as long as you use the operating system.Berdroidis intelligent system, so it changes the order of the icons by moving the more frequently used icons to the beginning of the list. Formally, right after an application is launched, Berdroid swaps the application icon and the icon of a preceding application (that is, the icon of an application on the position that is smaller by one in the order of menu). The preceding icon may possibly be located on the adjacent screen. The only exception is when the icon of the launched application already occupies the first place, in this case the icon arrangement doesn't change.Anya has planned the order in which she will launch applications. How many gestures should Anya make to launch the applications in the planned order?Note that one application may be launched multiple times.InputThe first line of the input contains three numbersn,m,k(1 ≤n,m,k≤ 105) — the number of applications that Anya has on her smartphone, the number of applications that will be launched and the number of icons that are located on the same screen.The next line containsnintegers, permutationa1,a2, ...,an— the initial order of icons from left to right in the menu (from the first to the last one),ai—  is the id of the application, whose icon goesi-th in the menu. Each integer from1tonoccurs exactly once amongai.The third line containsmintegersb1,b2, ...,bm(1 ≤bi≤n)— the ids of the launched applications in the planned order. One application may be launched multiple times.OutputPrint a single number — the number of gestures that Anya needs to make to launch all the applications in the desired order.ExamplesInput8 3 31 2 3 4 5 6 7 87 8 1Output7Input5 4 23 1 5 2 44 4 4 4Output8NoteIn the first test the initial configuration looks like(123)(456)(78), that is, the first screen contains icons of applications1, 2, 3, the second screen contains icons4, 5, 6, the third screen contains icons7, 8.After application7is launched, we get the new arrangement of the icons —(123)(457)(68). To launch it Anya makes3gestures.After application8is launched, we get configuration(123)(457)(86). To launch it Anya makes3gestures.After application1is launched, the arrangement of icons in the menu doesn't change. To launch it Anya makes1gesture.In total, Anya makes7gestures.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8bed0685", "template_md5": "465699a0", "result": "You have a list of items. Each item can be moved to the front of the list after being selected.  You are given a list of items to select in a specific order. What is the minimum number of moves needed to select all the items in the given order?"}, {"prompt_md5": "66e5e6e4", "template_md5": "35d339e4", "result": "You are given a menu with $n$ applications, arranged on $m$ screens, with $k$ applications per screen.  \n\nInitially, the applications are arranged in a specific order. After launching an application, the system rearranges the menu by swapping the launched application with the application immediately preceding it. If the launched application is already in the first position, the arrangement doesn't change.\n\nYou are given a list of $m$ applications that you want to launch in a specific order.  \n\nDetermine the minimum number of gestures required to launch all the applications in the given order. \n\n**Note:**\n\n* A gesture consists of scrolling to a screen and then selecting an application.\n* Scrolling to a screen takes $t-1$ gestures, where $t$ is the screen number.\n\n\n\nLet me know if you'd like me to clarify any part of the problem statement."}]}