{"uid": "519-E", "url": "https://codeforces.com/contest/519/problem/E", "tags": ["binary search", " data structures", " dfs and similar", " dp", " trees"], "title": "519-E", "statement": "E. A and B and Lecture Roomstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA and B are preparing themselves for programming contests.The University where A and B study is a set of rooms connected by corridors. Overall, the University hasnrooms connected byn- 1corridors so that you can get from any room to any other one by moving along the corridors. The rooms are numbered from1ton.Every day А and B write contests in some rooms of their university, and after each contest they gather together in the same room and discuss problems. A and B want the distance from the rooms where problems are discussed to the rooms where contests are written to be equal. The distance between two rooms is the number of edges on the shortest path between them.As they write contests in new rooms every day, they asked you to help them find the number of possible rooms to discuss problems for each of the followingmdays.InputThe first line contains integern(1 ≤n≤ 105) — the number of rooms in the University.The nextn- 1lines describe the corridors. Thei-th of these lines (1 ≤i≤n- 1) contains two integersaiandbi(1 ≤ai,bi≤n), showing that thei-th corridor connects roomsaiandbi.The next line contains integerm(1 ≤m≤ 105) — the number of queries.Nextmlines describe the queries. Thej-th of these lines (1 ≤j≤m) contains two integersxjandyj(1 ≤xj,yj≤n) that means that on thej-th day A will write the contest in the roomxj, B will write in the roomyj.OutputIn thei-th (1 ≤i≤m) line print the number of rooms that are equidistant from the rooms where A and B write contest on thei-th day.ExamplesInput41 21 32 412 3Output1Input41 22 32 421 21 3Output02Notein the first sample there is only one room at the same distance from rooms number 2 and 3 — room number 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fb8ae127", "template_md5": "465699a0", "result": "There are multiple rooms connected by paths.  Each day, two people write in different rooms.  Find the number of rooms that are the same distance from both of their rooms."}, {"prompt_md5": "b96456e1", "template_md5": "35d339e4", "result": "There are $n$ rooms connected by $n-1$ corridors. You can travel between any two rooms by following the corridors.  \n\nFor each of $m$ days, two rooms, $x_j$ and $y_j$, are given.  \n\nFind the number of rooms that are the same distance from both $x_j$ and $y_j$. The distance between two rooms is the shortest number of corridors needed to travel between them."}]}