{"uid": "519-C", "url": "https://codeforces.com/contest/519/problem/C", "tags": ["greedy", " implementation", " math", " number theory"], "title": "519-C", "statement": "C. A and B and Team Trainingtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA and B are preparing themselves for programming contests.An important part of preparing for a competition is sharing programming knowledge from the experienced members to those who are just beginning to deal with the contests. Therefore, during the next team training A decided to make teams so that newbies are solving problems together with experienced participants.A believes that the optimal team of three people should consist of one experienced participant and two newbies. Thus, each experienced participant can share the experience with a large number of people.However, B believes that the optimal team should have two experienced members plus one newbie. Thus, each newbie can gain more knowledge and experience.As a result, A and B have decided that all the teams during the training session should belong to one of the two types described above. Furthermore, they agree that the total number of teams should be as much as possible.There arenexperienced members andmnewbies on the training session. Can you calculate what maximum number of teams can be formed?InputThe first line contains two integersnandm(0 ≤n,m≤ 5·105) — the number of experienced participants and newbies that are present at the training session.OutputPrint the maximum number of teams that can be formed.ExamplesInput2 6Output2Input4 5Output3NoteLet's represent the experienced players as XP and newbies as NB.In the first test the teams look as follows: (XP, NB, NB), (XP, NB, NB).In the second test sample the teams look as follows: (XP, NB, NB), (XP, NB, NB), (XP, XP, NB).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7243746d", "template_md5": "35d339e4", "result": "There are $n$ experienced programmers and $m$ newbie programmers.  You need to form teams of programmers for training. Each team can have one of two structures:\n\n*  Team 1: 1 experienced programmer and 2 newbie programmers\n*  Team 2: 2 experienced programmers and 1 newbie programmer\n\nWhat is the maximum number of teams you can form?"}, {"prompt_md5": "c867397b", "template_md5": "465699a0", "result": "You have a group of experienced people and a group of newbies.  You need to form teams where each team has either one experienced person and two newbies, or two experienced people and one newbie.  Find the maximum number of teams you can make."}]}