{"uid": "520-D", "url": "https://codeforces.com/contest/520/problem/D", "tags": ["games", " greedy", " implementation"], "title": "520-D", "statement": "D. Cubestime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOnce Vasya and Petya assembled a figure ofmcubes, each of them is associated with a number between0andm- 1(inclusive, each number appeared exactly once). Let's consider a coordinate system such that theOXis the ground, and theOYis directed upwards. Each cube is associated with the coordinates of its lower left corner, these coordinates are integers for each cube.The figure turned out to bestable. This means that for any cube that is not on the ground, there is at least one cube under it such that those two cubes touchby a side or a corner. More formally, this means that for the cube with coordinates(x,y)eithery= 0, or there is a cube with coordinates(x- 1,y- 1),(x,y- 1)or(x+ 1,y- 1).Now the boys want to disassemble the figure and put all the cubes in a row. In one step the cube is removed from the figure and being put to the right of the blocks that have already been laid. The guys remove the cubes in such order that the figure remains stable. To make the process more interesting, the guys decided to play the following game. The guys take out the cubes from the figure in turns. It is easy to see that after the figure is disassembled, the integers written on the cubes form a number, written in them-ary positional numerical system (possibly, with a leading zero). Vasya wants the resulting number to be maximum possible, and Petya, on the contrary, tries to make it as small as possible. Vasya starts the game.Your task is to determine what number is formed after the figure is disassembled, if the boys play optimally. Determine the remainder of the answer modulo109+ 9.InputThe first line contains numberm(2 ≤m≤ 105).The followingmlines contain the coordinates of the cubesxi,yi(- 109≤xi≤ 109,0 ≤yi≤ 109) in ascending order of numbers written on them. It is guaranteed that the original figure is stable.No two cubes occupy the same place.OutputIn the only line print the answer to the problem.ExamplesInput32 11 00 1Output19Input50 00 10 20 30 4Output2930", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2c972e7c", "template_md5": "35d339e4", "result": "You are given a set of $m$ cubes, each with a unique number between 0 and $m-1$. Each cube has a position in a 2D coordinate system. The figure formed by these cubes is stable, meaning that for every cube not on the ground ($y \\neq 0$), there is at least one cube directly below it touching by a side or corner.\n\nTwo players take turns removing cubes from the figure one at a time.  A cube can be removed if it is not supporting any other cubes above it.  Removed cubes are placed in a row to the right.\n\nThe goal is to determine the largest possible number formed by the order in which the cubes are removed.  \n\n**Input:**\n\n* The first line contains the number of cubes, $m$.\n* The following $m$ lines each contain the $x$ and $y$ coordinates of a cube.\n\n**Output:**\n\n* The largest possible number formed by the optimal removal order, modulo $10^9 + 9$."}, {"prompt_md5": "91a9abaa", "template_md5": "465699a0", "result": "You are given a set of blocks arranged in a stable structure.  Each block has a number.  Two players take turns removing blocks from the structure, placing them in a line to the right. The goal is to maximize (player 1) or minimize (player 2) the number formed by the order of the blocks when all are removed. Determine the resulting number after optimal play."}]}