{"uid": "522-D", "url": "https://codeforces.com/contest/522/problem/D", "tags": ["*special", " data structures"], "title": "522-D", "statement": "D. Closest Equalstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given sequencea1,a2, ...,anandmquerieslj,rj(1 ≤lj≤rj≤n). For each query you need to print the minimum distance between such pair of elementsaxanday(x≠y), that:both indexes of the elements lie within range [lj,rj], that is,lj≤x,y≤rj;the values of the elements are equal, that isax=ay.The text above understands distance as|x-y|.InputThe first line of the input contains a pair of integersn,m(1 ≤n,m≤ 5·105) — the length of the sequence and the number of queries, correspondingly.The second line contains the sequence of integersa1,a2, ...,an(- 109≤ai≤ 109).Nextmlines contain the queries, one per line. Each query is given by a pair of numberslj,rj(1 ≤lj≤rj≤n) — the indexes of the query range limits.OutputPrintmintegers — the answers to each query. If there is no valid match for some query, please print-1as an answer to this query.ExamplesInput5 31 1 2 3 21 52 43 5Output1-12Input6 51 2 1 3 2 34 61 32 52 41 6Output223-12", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8806bfa6", "template_md5": "35d339e4", "result": "You are given a sequence of numbers $a_1, a_2, ..., a_n$ and $m$ queries. Each query is defined by a range $[l_j, r_j]$. For each query, find the minimum distance between two elements in the sequence that:\n\n1. Both elements are within the range $[l_j, r_j]$.\n2. The values of the two elements are equal.\n\nIf no such pair of elements exists for a query, print -1. \n\nThe distance between two indices $x$ and $y$ is defined as $|x-y|$."}, {"prompt_md5": "0b11b522", "template_md5": "465699a0", "result": "You are given a list of numbers and a series of ranges. For each range, find the smallest distance between two equal numbers within that range. If no equal numbers are found in a range, output -1."}]}