{"uid": "523-B", "url": "https://codeforces.com/contest/523/problem/B", "tags": ["*special", " implementation"], "title": "523-B", "statement": "B. Mean Requeststime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn this problem you will have to deal with a real algorithm that is used in the VK social network.As in any other company that creates high-loaded websites, the VK developers have to deal with request statistics regularly. An important indicator reflecting the load of the site is the mean number of requests for a certain period of time ofTseconds (for example,T= 60seconds= 1minandT= 86400seconds= 1day). For example, if this value drops dramatically, that shows that the site has access problem. If this value grows, that may be a reason to analyze the cause for the growth and add more servers to the website if it is really needed.However, even such a natural problem as counting the mean number of queries for some period of time can be a challenge when you process the amount of data of a huge social network. That's why the developers have to use original techniques to solve problems approximately, but more effectively at the same time.Let's consider the following formal model. We have a service that works fornseconds. We know the number of queries to this resourceatat each moment of timet(1 ≤t≤n). Let's formulate the following algorithmof calculating the mean with exponential decay. Letcbe some real number, strictly larger than one.// setting this constant value correctly can adjust// the time range for which statistics will be calculateddouble c =some constant value;// as the result of the algorithm's performance this variable will contain// the mean number of queries for the last// T seconds by the current moment of timedouble mean = 0.0;for t = 1..n: // at each second, we do the following://atis the number of queries that came at the last second;mean = (mean +at/ T) / c;Thus, the mean variable is recalculated each second using the number of queries that came at that second. We can make some mathematical calculations and prove that choosing the value of constantccorrectly will make the value ofmeannot very different from the real mean valueaxatt-T+ 1 ≤x≤t.The advantage of such approach is that it only uses the number of requests at the current moment of time and doesn't require storing the history of requests for a large time range. Also, it considers the recent values with the weight larger than the weight of the old ones, which helps to react to dramatic change in values quicker.However before using the new theoretical approach in industrial programming, there is an obligatory step to make, that is, to test its credibility practically on given test data sets. Your task is to compare the data obtained as a result of the work of an approximate algorithm to the real data.You are givennvaluesat, integerTand real numberc. Also, you are givenmmomentspj(1 ≤j≤m), where we are interested in the mean value of the number of queries for the lastTseconds. Implement two algorithms. The first one should calculate the required value by definition, i.e. by the formula. The second algorithm should calculate the mean value as is described above. Print both values and calculate the relative error of the second algorithm by the formula, whereapproxis the approximate value, obtained by the second algorithm, andrealis the exact value obtained by the first algorithm.InputThe first line contains integern(1 ≤n≤ 2·105), integerT(1 ≤T≤n) and real numberc(1 <c≤ 100) — the time range when the resource should work, the length of the time range during which we need the mean number of requests and the coefficientcof the work of approximate algorithm. Numbercis given with exactly six digits after the decimal point.The next line containsnintegersat(1 ≤at≤ 106) — the number of queries to the service at each moment of time.The next line contains integerm(1 ≤m≤n) — the number of moments of time when we are interested in the mean number of queries for the lastTseconds.The next line containsmintegerspj(T≤pj≤n), representing another moment of time for which we need statistics. Momentspjare strictly increasing.OutputPrintmlines. Thej-th line must contain three numbersreal,approxanderror, where:is the real mean number of queries for the lastTseconds;approxis calculated by the given algorithm and equalsmeanat the moment of timet=pj(that is, after implementing thepj-th iteration of the cycle);is the relative error of the approximate algorithm.The numbers you printed will be compared to the correct numbers with the relative or absolute error10- 4. It is recommended to print the numbers with at least five digits after the decimal point.ExamplesInput1 1 2.000000111Output1.000000 0.500000 0.500000Input11 4 1.2500009 11 7 5 15 6 6 6 6 6 684 5 6 7 8 9 10 11Output8.000000 4.449600 0.4438009.500000 6.559680 0.3095078.250000 6.447744 0.2184558.000000 6.358195 0.2052268.250000 6.286556 0.2379936.000000 6.229245 0.0382076.000000 6.183396 0.0305666.000000 6.146717 0.024453Input13 4 1.2500003 3 3 3 3 20 3 3 3 3 3 3 3104 5 6 7 8 9 10 11 12 13Output3.000000 1.771200 0.4096003.000000 2.016960 0.3276807.250000 5.613568 0.2257157.250000 5.090854 0.2978137.250000 4.672684 0.3554927.250000 4.338147 0.4016353.000000 4.070517 0.3568393.000000 3.856414 0.2854713.000000 3.685131 0.2283773.000000 3.548105 0.182702", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b179a78a", "template_md5": "35d339e4", "result": "You are given a sequence of integers $a_1, a_2, ..., a_n$ representing the number of requests to a service at each moment in time from 1 to $n$. You are also given an integer $T$ (the time window) and a real number $c$ (a decay factor).\n\n**Task:**\n\n1. **Calculate the exact mean number of requests** for the last $T$ seconds at each moment $p_j$ (where $T \\le p_j \\le n$).\n\n2. **Implement an approximate algorithm** that calculates the mean number of requests for the last $T$ seconds at each moment $p_j$ using the following formula:\n\n   $$mean = \\frac{mean + \\frac{a_t}{T}}{c}$$\n\n   where $mean$ is initialized to 0.0 and $t = p_j$.\n\n3. **Print the exact mean, the approximate mean, and the relative error** for each moment $p_j$.\n\n**Relative Error:**\n\n$$error = \\frac{|approximate - exact|}{exact}$$\n\n**Constraints:**\n\n* $1 \\le n \\le 2 \\cdot 10^5$\n* $1 \\le T \\le n$\n* $1 < c \\le 100$\n* $1 \\le a_i \\le 10^6$\n* $1 \\le m \\le n$\n* $T \\le p_j \\le n$\n* $p_j$ are strictly increasing."}, {"prompt_md5": "ececd1a1", "template_md5": "465699a0", "result": "You are given a list of numbers representing the number of requests at each second over a period of time. You need to calculate the average number of requests over a fixed window of time for several specific points in time. \n\nImplement two methods:\n\n1.  Calculate the average directly using all the data within the window.\n2.  Calculate the average using a simplified algorithm that only considers the current request and previous averages.\n\nCompare the results of the two methods and calculate the relative error."}]}