{"uid": "524-B", "url": "https://codeforces.com/contest/524/problem/B", "tags": ["dp", " greedy"], "title": "524-B", "statement": "B. Фото на память - 2 (round version)ограничение по времени на тест2 секундыограничение по памяти на тест256 мегабайтвводстандартный вводвыводстандартный выводПрошло много лет, и на вечеринке снова встретилисьnдрузей. С момента последней встречи техника шагнула далеко вперёд, появились фотоаппараты с автоспуском, и теперь не требуется, чтобы один из друзей стоял с фотоаппаратом, и, тем самым, оказывался не запечатлённым на снимке.Упрощенно процесс фотографирования можно описать следующим образом. На фотографии каждый из друзей занимает прямоугольник из пикселей: в стоячем положенииi-й из них занимает прямоугольник шириныwiпикселей и высотыhiпикселей. Но также, при фотографировании каждый человек может лечь, и тогда он будет занимать прямоугольник шириныhiпикселей и высотыwiпикселей.Общая фотография будет иметь размерыW×H, гдеW— суммарная ширина всех прямоугольников-людей, аH— максимальная из высот. Друзья хотят определить, какую минимальную площадь может иметь общая фотография. Помогите им в этом.Входные данныеВ первой строке следует целое числоn(1 ≤n≤ 1000) — количество друзей.В последующихnстроках следуют по два целых числаwi,hi(1 ≤wi,hi≤ 1000), обозначающие размеры прямоугольника, соответствующегоi-му из друзей.Выходные данныеВыведите единственное целое число, равное минимальной возможной площади фотографии, вмещающей всех друзей.ПримерыВходные данные310 120 230 3Выходные данные180Входные данные33 12 24 3Выходные данные21Входные данные15 10Выходные данные50", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dbddf240", "template_md5": "35d339e4", "result": "You are given $n$ rectangles, where the $i$-th rectangle has width $w_i$ and height $h_i$.  Each rectangle represents a person.  A person can stand up or lie down.  When standing, a person occupies a rectangle of width $w_i$ and height $h_i$. When lying down, a person occupies a rectangle of width $h_i$ and height $w_i$.\n\nFind the smallest possible area of a rectangle that can contain all $n$ rectangles, regardless of whether they are standing or lying down. \n\n\nOutput the smallest possible area."}, {"prompt_md5": "7f0b632d", "template_md5": "465699a0", "result": "You are given a list of rectangles, each representing a person. Each person can be standing or lying down, changing the dimensions of their rectangle. Find the smallest possible area for a rectangle that can fit all the people."}]}