{"uid": "524-C", "url": "https://codeforces.com/contest/524/problem/C", "tags": ["binary search", " sortings"], "title": "524-C", "statement": "C. The Art of Dealing with ATMtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputATMs of a well-known bank of a small country are arranged so that they can not give any amount of money requested by the user. Due to the limited size of the bill dispenser (the device that is directly giving money from an ATM) and some peculiarities of the ATM structure, you can get at mostkbills from it, and the bills may be of at most two distinct denominations.For example, if a country uses bills with denominations10,50,100,500,1000and5000burles, then atk= 20such ATM can give sums100 000burles and96 000burles, but it cannot give sums99 000and101 000burles.Let's suppose that the country uses bills ofndistinct denominations, and the ATM that you are using has an unlimited number of bills of each type. You know that during the day you will need to withdraw a certain amount of cashqtimes. You know that when the ATM has multiple ways to give money, it chooses the one which requires the minimum number of bills, or displays an error message if it cannot be done. Determine the result of each of theqof requests for cash withdrawal.InputThe first line contains two integersn,k(1 ≤n≤ 5000,1 ≤k≤ 20).The next line containsnspace-separated integersai(1 ≤ai≤ 107) — the denominations of the bills that are used in the country. Numbersaifollow in the strictly increasing order.The next line contains integerq(1 ≤q≤ 20) — the number of requests for cash withdrawal that you will make.The nextqlines contain numbersxi(1 ≤xi≤ 2·108) — the sums of money in burles that you are going to withdraw from the ATM.OutputFor each request for cash withdrawal print on a single line the minimum number of bills it can be done, or print- 1, if it is impossible to get the corresponding sum.ExamplesInput6 2010 50 100 500 1000 5000842001000009500096000990001010020159950Output6201920-13-1-1Input5 21 2 3 5 8813579111315Output1112222-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "032d0b90", "template_md5": "35d339e4", "result": "You are given a set of $n$ distinct bill denominations ($a_1$, $a_2$, ..., $a_n$) and an integer $k$ representing the maximum number of bills that can be dispensed at once.  You need to determine the minimum number of bills required to withdraw a given amount of money $x$ from an ATM that can only dispense bills in denominations from the given set and has a maximum limit of $k$ bills per transaction. If it is impossible to withdraw the amount using the given constraints, output -1.\n\nInput:\n\n* The first line contains two integers $n$ and $k$ (1 ≤ $n$ ≤ 5000, 1 ≤ $k$ ≤ 20).\n* The second line contains $n$ space-separated integers $a_1$, $a_2$, ..., $a_n$ (1 ≤ $a_i$ ≤ 10⁷) representing the bill denominations in strictly increasing order.\n* The third line contains an integer $q$ (1 ≤ $q$ ≤ 20) representing the number of withdrawal requests.\n* The next $q$ lines contain integers $x_1$, $x_2$, ..., $x_q$ (1 ≤ $x_i$ ≤ 2·10⁸) representing the amounts to be withdrawn.\n\nOutput:\n\nFor each withdrawal request, print the minimum number of bills required or -1 if it is impossible to withdraw the amount."}, {"prompt_md5": "507560c5", "template_md5": "465699a0", "result": "You have a machine that can give out money using a limited number of different bill types.  You need to figure out the minimum number of bills needed to give out specific amounts of money. If it's impossible to make the amount using the available bills, say so."}]}