{"uid": "524-D", "url": "https://codeforces.com/contest/524/problem/D", "tags": ["greedy", " two pointers"], "title": "524-D", "statement": "D. Social Networktime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarpus got an internship in one well-known social network. His test task is to count the number of unique users who have visited a social network during the day. Polycarpus was provided with information on all user requests for this time period. For each query, we know its time... and nothing else, because Polycarpus has already accidentally removed the user IDs corresponding to the requests from the database. Thus, it is now impossible to determine whether any two requests are made by the same person or by different people.But wait, something is still known, because that day a record was achieved —Msimultaneous users online! In addition, Polycarpus believes that if a user made a request at seconds, then he was online forTseconds after that, that is, at secondss,s+ 1,s+ 2, ...,s+T- 1. So, the user's time online can be calculated as the union of time intervals of the form[s,s+T- 1]over all timessof requests from him.Guided by these thoughts, Polycarpus wants to assign a user ID to each request so that:the number of different users online did not exceedMat any moment,at some second the number of distinct users online reached valueM,the total number of users (the number of distinct identifiers) was as much as possible.Help Polycarpus cope with the test.InputThe first line contains three integersn,MandT(1 ≤n,M≤ 20 000,1 ≤T≤ 86400) — the number of queries, the record number of online users and the time when the user was online after a query was sent. Nextnlines contain the times of the queries in the format \"hh:mm:ss\", where hh are hours, mm are minutes, ss are seconds. The times of the queries follow in the non-decreasing order, some of them can coincide. It is guaranteed that all the times and even all the segments of type[s,s+T- 1]are within one 24-hour range (from 00:00:00 to 23:59:59).OutputIn the first line print numberR— the largest possible number of distinct users. The followingnlines should contain the user IDs for requests in the same order in which the requests are given in the input. User IDs must be integers from1toR. The requests of the same user must correspond to the same identifiers, the requests of distinct users must correspond to distinct identifiers. If there are multiple solutions, print any of them. If there is no solution, print \"No solution\" (without the quotes).ExamplesInput4 2 1017:05:5317:05:5817:06:0122:39:47Output31223Input1 2 8640000:00:00OutputNo solutionNoteConsider the first sample. The user who sent the first request was online from 17:05:53 to 17:06:02, the user who sent the second request was online from 17:05:58 to 17:06:07, the user who sent the third request, was online from 17:06:01 to 17:06:10. Thus, these IDs cannot belong to three distinct users, because in that case all these users would be online, for example, at 17:06:01. That is impossible, becauseM= 2. That means that some two of these queries belonged to the same user. One of the correct variants is given in the answer to the sample. For it user1was online from 17:05:53 to 17:06:02, user2— from 17:05:58 to 17:06:10 (he sent the second and third queries), user3— from 22:39:47 to 22:39:56.In the second sample there is only one query. So, only one user visited the network within the 24-hour period and there couldn't be two users online on the network simultaneously. (The time the user spent online is the union of time intervals for requests, so users who didn't send requests could not be online in the network.)", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c0b5784f", "template_md5": "35d339e4", "result": "You are given a list of timestamps representing user requests to a social network.  You also know:\n\n*  $M$: The maximum number of users online simultaneously at any time.\n*  $T$: The number of seconds a user remains online after making a request.\n\nYour task is to:\n\n1. Assign a unique ID to each request, representing a user.\n2. Ensure that the number of distinct users online never exceeds $M$ at any time.\n3.  At some point, the number of distinct users online must reach $M$.\n4.  Maximize the total number of distinct user IDs used.\n\nOutput the maximum number of distinct users ($R$) and the user ID assigned to each request. If no solution is possible, output \"No solution\"."}, {"prompt_md5": "86da2512", "template_md5": "465699a0", "result": "You are given a list of timestamps representing user activity on a website.  You need to determine the maximum number of unique users who were active at any given time, given that each user stays active for a fixed duration after each interaction.  \n\nThe goal is to assign user IDs to the timestamps so that:\n\n* The maximum number of unique users online at any time does not exceed a given limit.\n* At some point, the number of unique users online reaches the given limit. \n\n\n\nLet me know if you'd like me to elaborate on any specific aspect of the problem."}]}