{"uid": "524-E", "url": "https://codeforces.com/contest/524/problem/E", "tags": ["data structures", " sortings"], "title": "524-E", "statement": "E. Rooks and Rectanglestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarpus has a chessboard of sizen×m, wherekrooks are placed. Polycarpus hasn't yet invented the rules of the game he will play. However, he has already allocatedqrectangular areas of special strategic importance on the board, they must be protected well. According to Polycarpus, a rectangular area of ​​the board is well protected if all its vacant squares can be beaten by the rooks that stand on this area. The rooks on the rest of the board do not affect the area's defense. The position of the rooks is fixed and cannot be changed. We remind you that the the rook beats the squares located on the same vertical or horizontal line with it, if there are no other pieces between the square and the rook. Help Polycarpus determine whether all strategically important areas are protected.InputThe first line contains four integersn,m,kandq(1 ≤n,m≤ 100 000,1 ≤k,q≤ 200 000) — the sizes of the board, the number of rooks and the number of strategically important sites. We will consider that the cells of the board are numbered by integers from1tonhorizontally and from1tomvertically. Nextklines contain pairs of integers \"xy\", describing the positions of the rooks (1 ≤x≤n,1 ≤y≤m). It is guaranteed that all the rooks are in distinct squares. Nextqlines describe the strategically important areas as groups of four integers \"x1y1x2y2\" (1 ≤x1≤x2≤n,1 ≤y1≤y2≤m). The corresponding rectangle area consists of cells(x,y), for whichx1≤x≤x2,y1≤y≤y2. Strategically important areas can intersect of coincide.OutputPrintqlines. For each strategically important site print \"YES\" if it is well defended and \"NO\" otherwise.ExamplesInput4 3 3 31 13 22 32 3 2 32 1 3 31 2 2 3OutputYESYESNONotePicture to the sample:For the last area the answer is \"NO\", because cell(1, 2)cannot be hit by a rook.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fd04b65c", "template_md5": "35d339e4", "result": "You are given a chessboard of size $n \\times m$.  There are $k$ rooks placed on the board.  There are $q$ rectangles on the board that need to be protected.  \n\nA rectangle is considered well protected if every empty square within the rectangle can be attacked by a rook. A rook attacks any square in the same row or column as itself, as long as there are no other pieces blocking the way.\n\nDetermine if each of the $q$ rectangles is well protected.\n\n**Input:**\n\n* The first line contains four integers: $n$, $m$, $k$, and $q$.\n* The next $k$ lines each contain two integers, $x$ and $y$, representing the position of a rook on the board.\n* The next $q$ lines each contain four integers, $x_1$, $y_1$, $x_2$, and $y_2$, representing the coordinates of a rectangle.\n\n**Output:**\n\n* For each rectangle, print \"YES\" if it is well protected and \"NO\" otherwise."}, {"prompt_md5": "456c8af5", "template_md5": "465699a0", "result": "You are given a grid and some rooks placed on it.  You are also given some rectangles on the grid. Determine if each rectangle is fully covered by the rooks' attack range (horizontally or vertically)."}]}