{"uid": "525-A", "url": "https://codeforces.com/contest/525/problem/A", "tags": ["greedy", " hashing", " strings"], "title": "525-A", "statement": "A. Vitaliy and Pietime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter a hard day Vitaly got very hungry and he wants to eat his favorite potato pie. But it's not that simple. Vitaly is in the first room of the house withnroom located in a line and numbered starting from one from left to right. You can go from the first room to the second room, from the second room to the third room and so on — you can go from the (n- 1)-th room to then-th room. Thus, you can go to roomxonly from roomx- 1.The potato pie is located in then-th room and Vitaly needs to go there.Each pair of consecutive rooms has a door between them. In order to go to roomxfrom roomx- 1, you need to open the door between the rooms with the corresponding key.In total the house has several types of doors (represented by uppercase Latin letters) and several types of keys (represented by lowercase Latin letters). The key of typetcan open the door of typeTif and only iftandTare the same letter, written in different cases. For example, keyfcan open doorF.Each of the firstn- 1rooms contains exactly one key of some type that Vitaly can use to get to next rooms. Once the door is open with some key, Vitaly won't get the key from the keyhole but he will immediately run into the next room. In other words, each key can open no more than one door.Vitaly realizes that he may end up in some room without the key that opens the door to the next room. Before the start his run for the potato pie Vitaly can buy any number of keys of any type that is guaranteed to get to roomn.Given the plan of the house, Vitaly wants to know what is the minimum number of keys he needs to buy to surely get to the roomn, which has a delicious potato pie. Write a program that will help Vitaly find out this number.InputThe first line of the input contains a positive integern(2 ≤n≤ 105) — the number of rooms in the house.The second line of the input contains stringsof length2·n- 2. Let's number the elements of the string from left to right, starting from one.The odd positions in the given stringscontain lowercase Latin letters — the types of the keys that lie in the corresponding rooms. Thus, each odd positioniof the given stringscontains a lowercase Latin letter — the type of the key that lies in room number(i+ 1) / 2.The even positions in the given string contain uppercase Latin letters — the types of doors between the rooms. Thus, each even positioniof the given stringscontains an uppercase letter — the type of the door that leads from roomi/ 2to roomi/ 2 + 1.OutputPrint the only integer — the minimum number of keys that Vitaly needs to buy to surely get from room one to roomn.ExamplesInput3aAbBOutput0Input4aBaCaBOutput3Input5xYyXzZaZOutput2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "723e2e90", "template_md5": "465699a0", "result": "You are given a sequence of rooms connected by doors. Each room has a key of a specific type, and each door requires a key of a corresponding type to open. You start in the first room and need to reach the last room.  You can buy any number of keys of any type. Find the minimum number of keys you need to buy to reach the last room."}, {"prompt_md5": "57f94a43", "template_md5": "35d339e4", "result": "There are $n$ rooms numbered from 1 to $n$ in a line.  Each room has a key of a certain type and a door to the next room.  The key types are lowercase letters and the door types are uppercase letters. A key of type $t$ can open a door of type $T$ if and only if $t$ and $T$ are the same letter, written in different cases.\n\nEach room except the last room has a key that can open the door to the next room.  You start in room 1.  You can buy any number of keys of any type.\n\nWhat is the minimum number of keys you need to buy to be able to reach the last room? \n\n\nThe input will be a string of length $2n-2$ where:\n\n* Odd positions represent the key types in the rooms.\n* Even positions represent the door types.\n\nThe output is a single integer representing the minimum number of keys to buy."}]}