{"uid": "525-B", "url": "https://codeforces.com/contest/525/problem/B", "tags": ["constructive algorithms", " greedy", " math", " strings"], "title": "525-B", "statement": "B. Pasha and Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPasha got a very beautiful stringsfor his birthday, the string consists of lowercase Latin letters. The letters in the string are numbered from 1 to|s|from left to right, where|s|is the length of the given string.Pasha didn't like his present very much so he decided to change it. After his birthday Pasha spentmdays performing the following transformations on his string — each day he chose integeraiandreverseda piece of string (a segment) from positionaito position|s| -ai+ 1. It is guaranteed that2·ai≤ |s|.You face the following task: determine what Pasha's string will look like aftermdays.InputThe first line of the input contains Pasha's stringsof length from2to2·105characters, consisting of lowercase Latin letters.The second line contains a single integerm(1 ≤m≤ 105) —  the number of days when Pasha changed his string.The third line containsmspace-separated elementsai(1 ≤ai;2·ai≤ |s|) — the position from which Pasha started transforming the string on thei-th day.OutputIn the first line of the output print what Pasha's stringswill look like aftermdays.ExamplesInputabcdef12OutputaedcbfInputvwxyz22 2OutputvwxyzInputabcdef31 2 3Outputfbdcea", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4c1b88a3", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters.  You are also given a number of days, and for each day, a starting position in the string.  On each day, reverse the portion of the string from the starting position to the end of the string.  What is the final string after all the reversals are performed? \n\n**Input:**\n\n* Line 1: The original string.\n* Line 2: The number of days of reversals.\n* Line 3: A list of integers, one for each day, representing the starting position for the reversal on that day.\n\n**Output:**\n\n* Line 1: The final string after all the reversals."}, {"prompt_md5": "03f9ecf9", "template_md5": "465699a0", "result": "You are given a string and a list of positions.  For each position in the list, reverse the portion of the string starting at that position and extending to the end. What is the final string after all the reversals are performed?"}]}