{"uid": "526-G", "url": "https://codeforces.com/contest/526/problem/G", "tags": ["greedy", " trees"], "title": "526-G", "statement": "G. Spiders Evil Plantime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSpiders are Om Nom's old enemies. They love eating candies as much as he does and that's why they keep trying to keep the monster away from his favorite candies. They came up with an evil plan to trap Om Nom.Let's consider a rope structure consisting ofnnodes andn- 1ropes connecting the nodes. The structure is connected, thus, the ropes and the nodes form a tree. Each rope of the formed structure is associated with its length. A candy is tied to nodexof the structure. Om Nom really wants to eat this candy.Theyspiders are trying to stop him from doing it. They decided to entangle the candy and some part of the structure into a web, thus attaching the candy to as large as possible part of the rope structure.Each spider can use his web to cover all ropes on the path between two arbitrary nodesaandb. Thus,yspiders can cover the set of ropes which is a union ofypaths in the given tree. Theseypaths can arbitrarily intersect each other. The spiders want the following conditions to be hold:the node containing the candy is adjacent to at least one rope covered with a webthe ropes covered with the web form a connected structure (what's the idea of covering with a web the ropes that are not connected with the candy?)the total length of the ropes covered with web is as large as possibleThe spiders haven't yet decided to what node of the structure they will tie the candy and how many spiders will cover the structure with web, so they asked you to help them. Help them calculate the optimal plan for multiple values ofxandy.InputThe first line contains numbersnandq(1 ≤n,q≤ 105) — the number of nodes in the structure and the number of questions that the spiders want to ask you.The nextn- 1lines determine the rope structure. Thei-th line contains three integersui,vi,li(1 ≤ui,vi≤n,ui≠vi,1 ≤li≤ 1000), showing that there is a rope of lengthlibetween nodesuiandvi.Nextqlines describe the spiders' questions. As they want you to answer their question online, they encoded their messages in a special manner.Each of the nextqlines contains two numbersxi,yi. In the first question of the spidersx=x1,y=y1.To calculate valuesxandyin the spiders'i-th (2 ≤i≤q) question, you need to use the following formulas:whereAnsi- 1is the total length of the ropes covered by a web in the answer for the(i- 1)-th question.The following inequality holds:1 ≤xi,yi≤n.OutputFor each question of the spiders print on a separate line a single integerAnsi— the total length of the ropes covered with web in the optimal plan.ExamplesInput6 31 2 22 3 23 4 24 6 13 5 103 12 51 1Output141317", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5553714f", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes and $n-1$ edges. Each edge has a length.  A candy is attached to one of the nodes.\n\nYou need to find the maximum total length of edges that can be covered by webs, given the following rules:\n\n* At least one edge connected to the candy node must be covered.\n* The covered edges must form a connected structure.\n\nYou are given $q$ queries, each with two numbers $x_i$ and $y_i$.  To calculate $x_i$ and $y_i$ for each query, use the following formulas:\n\n* $x_1 = x$\n* $y_1 = y$\n* $x_i = x_{i-1} + a$\n* $y_i = y_{i-1} + b$\n\nwhere $a$ and $b$ are constants.\n\nFor each query, output the maximum total length of edges that can be covered."}, {"prompt_md5": "a48efdd2", "template_md5": "465699a0", "result": "You are given a tree-like structure with nodes connected by ropes of varying lengths.  A candy is attached to one of the nodes.  \n\nYou need to determine the maximum total length of ropes that can be covered by webs, given certain constraints:\n\n* At least one rope connected to the candy's node must be covered.\n* All covered ropes must form a connected structure. \n\n\nYou will be given multiple queries, each specifying a new target node. For each query, find the maximum length of ropes that can be covered while meeting the constraints."}]}