{"uid": "529-B", "url": "https://codeforces.com/contest/529/problem/B", "tags": ["brute force", " greedy", " sortings"], "title": "529-B", "statement": "B. Group Photo 2 (online mirror version)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMany years have passed, andnfriends met at a party again. Technologies have leaped forward since the last meeting, cameras with timer appeared and now it is not obligatory for one of the friends to stand with a camera, and, thus, being absent on the photo.Simply speaking, the process of photographing can be described as follows. Each friend occupies a rectangle of pixels on the photo: thei-th of them in a standing state occupies awipixels wide and ahipixels high rectangle. But also, each person can lie down for the photo, and then he will occupy ahipixels wide and awipixels high rectangle.The total photo will have sizeW×H, whereWis the total width of all the people rectangles, andHis the maximum of the heights. The friends want to determine what minimum area the group photo can they obtain if no more thann/ 2of them can lie on the ground (it would be strange if more thann/ 2gentlemen lie on the ground together, isn't it?..)Help them to achieve this goal.InputThe first line contains integern(1 ≤n≤ 1000) — the number of friends.The nextnlines have two integerswi,hi(1 ≤wi,hi≤ 1000) each, representing the size of the rectangle, corresponding to thei-th friend.OutputPrint a single integer equal to the minimum possible area of the photo containing all friends if no more thann/ 2of them can lie on the ground.ExamplesInput310 120 230 3Output180Input33 12 24 3Output21Input15 10Output50", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "abe75769", "template_md5": "35d339e4", "result": "You are given $n$ rectangles, where the $i$-th rectangle has width $w_i$ and height $h_i$.  You need to arrange these rectangles in a way that they fit together to form a single larger rectangle.  \n\nThe total number of rectangles that can be laid down (rotated to be horizontal) is limited to at most $n/2$.  \n\nFind the smallest possible area of the resulting larger rectangle. \n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 1000), the number of rectangles.\n* The next $n$ lines each contain two integers $w_i$ and $h_i$ (1 ≤ $w_i$, $h_i$ ≤ 1000), representing the width and height of the $i$-th rectangle.\n\nOutput:\n\n* Print a single integer, the minimum possible area of the resulting larger rectangle."}, {"prompt_md5": "2fd6ea71", "template_md5": "465699a0", "result": "You have a group of people, each taking up a certain amount of space when standing. They can also lie down, which changes their space requirement.  Find the smallest possible area needed to fit everyone in a picture, with no more than half the people lying down."}]}