{"uid": "530-F", "url": "https://codeforces.com/contest/530/problem/F", "tags": ["*special"], "title": "530-F", "statement": "F. Jumping frogstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA rectangular swamp is inhabited by 10 species of frogs. Frogs of speciesican jump from hillocks to hillock exactlyiunits along X-axis or Y-axis. Initially frogs of all types sit at the hillock at coordinates (0, 0). You are given coordinates of all other hillocks in the swamp. Find the largest Manhattan distance from (0, 0) to any hillock to which one of the frogs can travel by jumping between hillocks.Manhattan distance between(x1,y1)and(x2,y2)is|x1-x2| + |y1-y2|.InputThe first line of the input contains an integerN(1 ≤N≤ 100) - the number of hillocks. The followingNlines contain the coordinates of the hillocks, formatted as \"X Y\" (- 20 ≤X,Y≤ 20). All hillocks are distinct, and none of them is located at (0, 0).OutputOutput a single integer — the largest Manhattan distance to any hillock reachable by one of the frogs by jumping between hillocks.ExamplesInput30 10 -20 3Output3Input50 10 20 32 22 4Output6Input118 0Output0NoteIn the first example frogs of species 1, 2 and 3 can jump as far as the first, the second and the third hillocks, respectively.In the second example frog of species 2 can jump to the second hillock, then to the fourth and finally to the fifth.In the third example no frog can reach the hillock.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d57efc2c", "template_md5": "35d339e4", "result": "You are given a rectangular grid with a starting point (0, 0). There are N other points on the grid. Each point represents a hillock.  There are 10 types of frogs, each able to jump a specific distance in either the x or y direction.  \n\nFind the largest Manhattan distance from the starting point (0, 0) to any hillock that a frog can reach by jumping between hillocks.\n\nManhattan distance between two points $(x_1, y_1)$ and $(x_2, y_2)$ is  $|x_1 - x_2| + |y_1 - y_2|$."}, {"prompt_md5": "933994eb", "template_md5": "465699a0", "result": "You have a grid with a starting point. There are multiple points on the grid. Each point has a different jump distance. Find the farthest point you can reach from the starting point by jumping between points."}]}