{"uid": "530-H", "url": "https://codeforces.com/contest/530/problem/H", "tags": ["*special", " geometry"], "title": "530-H", "statement": "H. Points in triangletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a set of points on a plane with positive integer coordinates. Find a triangle of minimum area with vertices in points(0, 0),(A, 0)and(0,B)(AandBare unknown positive integers) that contains all the given points inside it (points on the edges count towards being inside).InputThe first line of the input contains an integerN(1 ≤N≤ 100) — the number of points. The followingNlines contain pairs of numbersXandY(1 ≤X,Y≤ 100) - the coordinates of the points. All points are distinct.OutputOutput one floating-point number — the minimal area of the triangle. The answer is considered to be correct if its absolute or relative error does not exceed10- 4.ExamplesInput21 11 3Output6.0Input22 11 2Output4.5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0ec7181e", "template_md5": "35d339e4", "result": "You are given a set of points on a plane with integer coordinates.  Find the smallest possible area of a triangle that contains all the given points inside it. The triangle must have vertices at $(0,0)$, $(A,0)$, and $(0,B)$, where $A$ and $B$ are unknown positive integers.\n\nThe input will be:\n\n* The first line contains the number of points $N$ (between 1 and 100).\n* The following $N$ lines each contain two integers, $X$ and $Y$ (between 1 and 100), representing the coordinates of a point.\n\nThe output should be:\n\n* A floating-point number representing the smallest possible area of the triangle."}, {"prompt_md5": "9551caaf", "template_md5": "465699a0", "result": "You are given a set of points. Find the smallest triangle that can contain all the points inside it.  The triangle must have its corners at (0,0), (A,0), and (0,B), where A and B are unknown positive numbers.  Output the area of this smallest triangle."}]}