{"uid": "530-D", "url": "https://codeforces.com/contest/530/problem/D", "tags": ["*special"], "title": "530-D", "statement": "D. Set subtractiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a starting set consisting of all integers from 1 to 1000, inclusive. You are also given several sets which need to be subtracted from the starting set (i.e., each number which is in at least one of these sets needs to be removed from the starting set). Each subtracted set is represented as an interval of integers fromAtoB, inclusive. Output the result after all subtractions.InputThe first line of input contains an integerN(0 ≤N≤ 100) — the number of intervals to be subtracted. The followingNlines contain pairs of integersAandB(1 ≤A≤B≤ 1000) — lower and upper bounds of the intervals. Intervals can intersect. An interval can consist of a single number.OutputOutput the result of subtractions in the following format: in one line output first the number of integers in the resulting set and then the integers of the set, sorted in increasing order, separated by single space.ExamplesInput21 900902 999Output2 901 1000Input31 500200 746150 1000Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "32b39560", "template_md5": "35d339e4", "result": "You start with a set of all integers from 1 to 1000. You are given a list of intervals. Each interval represents a range of numbers to be removed from the starting set.  \n\nFor example, an interval from $A$ to $B$ means all numbers from $A$ to $B$ (inclusive) should be removed from the starting set.\n\nOutput the remaining numbers in the set after all the intervals have been subtracted. The output should list the numbers in increasing order, separated by spaces."}, {"prompt_md5": "14043cf9", "template_md5": "465699a0", "result": "You start with a set of numbers from 1 to 1000. You are given a list of ranges of numbers. Remove all numbers from the set that are within any of these ranges.  Output the remaining numbers in sorted order."}]}