{"uid": "530-G", "url": "https://codeforces.com/contest/530/problem/G", "tags": ["*special"], "title": "530-G", "statement": "G. Levenshtein distancetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLevenshtein distance between two strings of letters is calculated as the minimal total cost of a sequence of edit actions that converts one of the strings into the other one. The allowed edit actions are:substitution: the cost of substituting one letter with another is equal to the difference of index numbers of these letters in English alphabet.insertion/deletion: the cost of inserting a letter into a string or deleting a letter from a string is equal to the index number of this letter in English alphabet (see examples).You are given two strings. Find the Levenshtein distance between them.InputThe input data consists of two lines, each line contains a string of lowercase Latin letters. Each string is between 1 and 100 letters long, inclusive.OutputOutput a single integer — the Levenshtein distance between the strings.ExamplesInputarcbugOutput8InputdomedroneOutput19NoteIn the first example you should replace a with b (cost 1), r with u (cost 3) and c with g (cost 4).In the second example you should insert r (cost 18) are replace m with n (cost 1).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "03e4563c", "template_md5": "35d339e4", "result": "You are given two strings of lowercase letters.  Find the smallest number of edits needed to change one string into the other. \n\nHere are the allowed edits:\n\n* **Substitution:** Replace one letter with another. The cost of this edit is the difference in their positions in the alphabet (e.g., replacing 'a' with 'b' costs 1).\n* **Insertion:** Add a letter to the string. The cost is the position of that letter in the alphabet.\n* **Deletion:** Remove a letter from the string. The cost is the position of that letter in the alphabet. \n\n\nFor example, the Levenshtein distance between \"arcbug\" and \"bug\" is 8."}, {"prompt_md5": "f326546f", "template_md5": "465699a0", "result": "Given two strings of letters, find the minimum number of changes needed to transform one string into the other.  Changes can be:\n\n* Replacing one letter with another. The cost of replacing letters is the difference in their position in the alphabet.\n* Inserting a letter. The cost of inserting a letter is its position in the alphabet.\n* Deleting a letter. The cost of deleting a letter is its position in the alphabet."}]}