{"uid": "530-I", "url": "https://codeforces.com/contest/530/problem/I", "tags": ["*special"], "title": "530-I", "statement": "I. Different variablestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputNvariablesX1, ...,XNcan have positive integer values. You are givenKconstraints for these value that look like \"the values of variablesXi1,Xi2, ...,XiMare different\". Among all possible lists of values of these variables that satisfy these constraints select the ones which have minimum possiblemax(Xi). Output lexicographically least of these lists.InputThe first line of input contains two integersnandk(2 ≤N≤ 10,1 ≤K≤ 100) — the number of variables and the number of constraints.The followingKlines contain the constraints, formatted as follows: the first number in the lineM(2 ≤M≤N) gives the number of variables in the constraint. After it followMspace-separated integersi1, ...,iM— the indices of the variables used in the constraint (1 ≤ij≤N). Allijin one constraint are different.OutputOutput the values ofX1,X2, ...,XNin a single line, separated with single spaces.ExamplesInput2 12 1 2Output1 2Input3 22 1 22 2 3Output1 2 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d3829793", "template_md5": "35d339e4", "result": "You are given $N$ variables ($X_1, X_2, ..., X_N$) and $K$ constraints. Each constraint specifies a group of variables ($X_{i_1}, X_{i_2}, ..., X_{i_M}$) that must have different values. \n\nFind a list of values for the variables that satisfies all the constraints and minimizes the maximum value among the variables. Output the lexicographically smallest such list.\n\n**Input:**\n\n* The first line contains two integers, $N$ and $K$.\n* The following $K$ lines describe the constraints. Each line starts with an integer $M$ (the number of variables in the constraint), followed by $M$ space-separated integers representing the indices of the variables in the constraint.\n\n**Output:**\n\n* A single line containing the values of the variables ($X_1, X_2, ..., X_N$) separated by spaces."}, {"prompt_md5": "6935194d", "template_md5": "465699a0", "result": "You have a set of items. You are given rules that say certain items must have different values. Find the smallest possible set of values for the items that follow all the rules, and list them in the smallest possible order."}]}