{"uid": "533-F", "url": "https://codeforces.com/contest/533/problem/F", "tags": ["hashing", " string suffix structures", " strings"], "title": "533-F", "statement": "F. Encodingtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp invented a new way to encode strings. Let's assume that we have stringT, consisting of lowercase English letters. Let's choose several pairs of letters of the English alphabet in such a way that each letter occurs in at most one pair. Then let's replace each letter inTwith its pair letter if there is a pair letter for it. For example, if you chose pairs (l,r), (p,q) and (a,o), then word \"parallelogram\" according to the given encoding principle transforms to word \"qolorreraglom\".Polycarpus already has two strings,SandT. He suspects that stringTwas obtained after applying the given encoding method from some substring of stringS. Find all positionsmiinS(1 ≤mi≤ |S| - |T| + 1), such thatTcan be obtained fro substringSmiSmi+ 1...Smi+ |T| - 1by applying the described encoding operation by using some set of pairs of English alphabet lettersInputThe first line of the input contains two integers,|S|and|T|(1 ≤ |T| ≤ |S| ≤ 2·105) — the lengths of stringSand stringT, respectively.The second and third line of the input contain stringsSandT, respectively. Both strings consist only of lowercase English letters.OutputPrint numberk— the number of suitable positions in stringS.In the next line printkintegersm1,m2, ...,mk— the numbers of the suitable positions in the increasing order.ExamplesInput11 5abacabadabaacabaOutput31 3 7Input21 13paraparallelogramgramqolorreraglomOutput15", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e3d65317", "template_md5": "35d339e4", "result": "You are given two strings, $S$ and $T$, where $|T| \\le |S|$.  \n\nString $T$ was created by taking a substring of $S$ and applying a special encoding:\n\n*  Choose a set of pairs of lowercase English letters.\n*  Each letter in the alphabet appears in at most one pair.\n*  Replace each letter in the substring with its corresponding pair letter (if it exists).\n\nFind all possible starting positions in $S$ where this encoding could have been applied to produce $T$. \n\nOutput the number of such positions, followed by the positions themselves in increasing order."}, {"prompt_md5": "8daacded", "template_md5": "465699a0", "result": "Given two strings, find all starting positions in the first string where a substring of that length can be transformed into the second string by replacing some letters with other letters according to a specific rule."}]}