{"uid": "533-C", "url": "https://codeforces.com/contest/533/problem/C", "tags": ["games", " greedy", " implementation", " math"], "title": "533-C", "statement": "C. Board Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp and Vasiliy love simple logical games. Today they play a game with infinite chessboard and one pawn for each player. Polycarp and Vasiliy move in turns, Polycarp starts. In each turn Polycarp can move his pawn from cell(x,y)to(x- 1,y)or(x,y- 1). Vasiliy can move his pawn from(x,y)to one of cells:(x- 1,y), (x- 1,y- 1)and(x,y- 1).Both playersare also allowed to skip move.There are some additional restrictions — a player is forbidden to move his pawn to a cell with negativex-coordinate ory-coordinate or to the cell containing opponent's pawn The winner is the first person to reach cell(0, 0).You are given the starting coordinates of both pawns. Determine who will win if both of them play optimally well.InputThe first line contains four integers:xp,yp,xv,yv(0 ≤xp,yp,xv,yv≤ 105)— Polycarp's and Vasiliy's starting coordinates.It is guaranteed that in the beginning the pawns are in different cells and none of them is in the cell(0, 0).OutputOutput the name of the winner: \"Polycarp\" or \"Vasiliy\".ExamplesInput2 1 2 2OutputPolycarpInput4 7 7 4OutputVasiliyNoteIn the first sample test Polycarp starts in(2, 1)and will move to(1, 1)in the first turn. No matter what his opponent is doing, in the second turn Polycarp can move to(1, 0)and finally to(0, 0)in the third turn.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "385e623e", "template_md5": "35d339e4", "result": "Two players start at different points on an infinite chessboard. Player 1 starts.  \n\n* Player 1 can move one square down ($x-1, y$) or one square left ($x, y-1$).\n* Player 2 can move one square down ($x-1, y$), one square left ($x, y-1$), or diagonally down-left ($x-1, y-1$).\n\nPlayers cannot move to a square with negative coordinates or a square occupied by the other player. The first player to reach the origin ($0, 0$) wins.\n\nGiven the starting coordinates of both players, determine who will win if both players play optimally."}, {"prompt_md5": "3adf32b2", "template_md5": "465699a0", "result": "Two players take turns moving on a grid. Player 1 can move one space left or down. Player 2 can move one space left, down, or diagonally down-left. The first player to reach the bottom-left corner wins. Given the starting positions of the two players, determine who will win if both play optimally."}]}