{"uid": "534-C", "url": "https://codeforces.com/contest/534/problem/C", "tags": ["math"], "title": "534-C", "statement": "C. Polycarpus' Dicetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp hasndiced1,d2, ...,dn. Thei-th dice shows numbers from1todi. Polycarp rolled all the dice and the sum of numbers they showed isA. Agrippina didn't see which dice showed what number, she knows only the sumAand the valuesd1,d2, ...,dn. However, she finds it enough to make a series of statements of the following type: diceicouldn't show numberr. For example, if Polycarp had two six-faced dice and the total sum isA= 11, then Agrippina can state that each of the two dice couldn't show a value less than five (otherwise, the remaining dice must have a value of at least seven, which is impossible).For each dice find the number of values for which it can be guaranteed that the dice couldn't show these values if the sum of the shown values isA.InputThe first line contains two integersn,A(1 ≤n≤ 2·105,n≤A≤s) — the number of dice and the sum of shown values wheres=d1+d2+ ... +dn.The second line containsnintegersd1,d2, ...,dn(1 ≤di≤ 106), wherediis the maximum value that thei-th dice can show.OutputPrintnintegersb1,b2, ...,bn, wherebiis the number of values for which it is guaranteed that thei-th dice couldn't show them.ExamplesInput2 84 4Output3 3Input1 35Output4Input2 32 3Output0 1NoteIn the first sample from the statementAequal to 8 could be obtained in the only case when both the first and the second dice show 4. Correspondingly, both dice couldn't show values 1, 2 or 3.In the second sample from the statementAequal to 3 could be obtained when the single dice shows 3. Correspondingly, it couldn't show 1, 2, 4 or 5.In the third sample from the statementAequal to 3 could be obtained when one dice shows 1 and the other dice shows 2. That's why the first dice doesn't have any values it couldn't show and the second dice couldn't show 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fb2c227c", "template_md5": "35d339e4", "result": "You are given $n$ dice, each with a maximum value of $d_i$. The sum of the values shown on all the dice is $A$.  \n\nDetermine for each die, the number of values it *could not* have shown to result in the sum $A$. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $A$ ($1 \\le n \\le 2 \\cdot 10^5$, $n \\le A \\le s$), where $s = d_1 + d_2 + ... + d_n$.\n* The second line contains $n$ integers, $d_1, d_2, ..., d_n$ ($1 \\le d_i \\le 10^6$), representing the maximum values of each die.\n\n**Output:**\n\nPrint $n$ integers, $b_1, b_2, ..., b_n$, where $b_i$ is the number of values the $i$-th die could not have shown."}, {"prompt_md5": "85427070", "template_md5": "465699a0", "result": "You have multiple dice, each with a maximum number it can show. You know the total sum of the numbers rolled.  For each die, determine how many numbers it *couldn't* have shown to achieve that total sum."}]}