{"uid": "535-D", "url": "https://codeforces.com/contest/535/problem/D", "tags": ["greedy", " hashing", " string suffix structures", " strings"], "title": "535-D", "statement": "D. Tavas and Malekastime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTavas is a strange creature. Usually \"zzz\" comes out of people's mouth while sleeping, but stringsof lengthncomes out from Tavas' mouth instead.Today Tavas fell asleep in Malekas' place. While he was sleeping, Malekas did a little process ons. Malekas has a favorite stringp. He determined all positionsx1<x2< ... <xkwherepmatchess. More formally, for eachxi(1 ≤i≤k) he conditionsxisxi+ 1...sxi+ |p| - 1=pis fullfilled.Then Malekas wrote down one of subsequences ofx1,x2, ...xk(possibly, he didn't write anything) on a piece of paper. Here a sequencebis a subsequence of sequenceaif and only if we can turnaintobby removing some of its elements (maybe no one of them or all).After Tavas woke up, Malekas told him everything. He couldn't remember strings, but he knew that bothpandsonly contains lowercase English letters and also he had the subsequence he had written on that piece of paper.Tavas wonders, what is the number of possible values ofs? He asked SaDDas, but he wasn't smart enough to solve this. So, Tavas asked you to calculate this number for him.Answer can be very large, so Tavas wants you to print the answer modulo109+ 7.InputThe first line contains two integersnandm, the length ofsand the length of the subsequence Malekas wrote down (1 ≤n≤ 106and0 ≤m≤n- |p| + 1).The second line contains stringp(1 ≤ |p| ≤n).The next line containsmspace separated integersy1,y2, ...,ym, Malekas' subsequence (1 ≤y1<y2< ... <ym≤n- |p| + 1).OutputIn a single line print the answer modulo1000 000 007.ExamplesInput6 2ioi1 3Output26Input5 2ioi1 2Output0NoteIn the first sample test all strings of form\"ioioi?\"where the question mark replaces arbitrary English letter satisfy.Here|x|denotes the length of string x.Please note that it's possible that there is no such string (answer is 0).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e6a3b377", "template_md5": "35d339e4", "result": "Given a string $p$ of length $|p|$ and a subsequence $y_1, y_2, ..., y_m$ of possible positions, find the number of strings $s$ of length $n$ ($n \\ge |p|$) that satisfy the following conditions:\n\n* $s$ contains only lowercase English letters.\n* For each $i$ ($1 \\le i \\le m$), the substring of $s$ starting at position $y_i$ and of length $|p|$ is equal to $p$.\n\nThe answer should be modulo $10^9 + 7$."}, {"prompt_md5": "4e0bb2ef", "template_md5": "465699a0", "result": "Given a string 'p' and a subsequence of numbers 'y', find the number of strings of length 'n' that contain 'p' as a substring at the positions specified by 'y'.  The answer should be modulo 10^9 + 7."}]}