{"uid": "535-E", "url": "https://codeforces.com/contest/535/problem/E", "tags": ["geometry", " math"], "title": "535-E", "statement": "E. Tavas and Pashmakstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputTavas is a cheerleader in the new sports competition named \"Pashmaks\".This competition consists of two part: swimming and then running. People will immediately start runningRmeters after they finished swimming exactlySmeters. A winner is a such person that nobody else finishes running before him/her (there may be more than one winner).Before the match starts, Tavas knows that there arencompetitors registered for the match. Also, he knows thati-th person's swimming speed issimeters per second and his/her running speed isrimeters per second. Unfortunately, he doesn't know the values ofRandS, but he knows that they are real numbers greater than0.As a cheerleader, Tavas wants to know who to cheer up. So, he wants to know all people that might win. We consider a competitor might win if and only if there are some values ofRandSsuch that with these values, (s)he will be a winner.Tavas isn't really familiar with programming, so he asked you to help him.InputThe first line of input contains a single integern(1 ≤n≤ 2 × 105).The nextnlines contain the details of competitors.i-th line contains two integerssiandri(1 ≤si,ri≤ 104).OutputIn the first and the only line of output, print a sequence of numbers of possible winners in increasing order.ExamplesInput31 32 23 1Output1 2 3Input31 21 12 1Output1 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "752bed28", "template_md5": "35d339e4", "result": "There are $n$ competitors in a race. Each competitor has a swimming speed ($s_i$) and a running speed ($r_i$).  Competitors swim for a distance $S$ and then run for a distance $R$. The exact values of $S$ and $R$ are unknown.\n\nDetermine all the competitors who could potentially win the race. A competitor wins if they finish running before any other competitor, regardless of the values of $S$ and $R$.  \n\n**Input:**\n\n* The first line contains an integer $n$ (the number of competitors).\n* The next $n$ lines each contain two integers, $s_i$ and $r_i$ (the swimming and running speeds of the $i$-th competitor).\n\n**Output:**\n\n* Print a list of the potential winners in increasing order."}, {"prompt_md5": "a9069eff", "template_md5": "465699a0", "result": "Given a list of people, each with a swimming speed and a running speed, determine which people could potentially win a race where everyone swims a certain distance and then runs a certain distance.  A winner is someone who finishes running before anyone else.  You don't know the exact swimming and running distances, but they are both positive."}]}