{"uid": "54-B", "url": "https://codeforces.com/contest/54/problem/B", "tags": ["hashing", " implementation"], "title": "54-B", "statement": "B. Cutting Jigsaw Puzzletime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Hedgehog recently remembered one of his favorite childhood activities, — solving puzzles, and got into it with new vigor. He would sit day in, day out with his friend buried into thousands of tiny pieces of the picture, looking for the required items one by one.Soon the Hedgehog came up with a brilliant idea: instead of buying ready-made puzzles, one can take his own large piece of paper with some picture and cut it into many small rectangular pieces, then mix them and solve the resulting puzzle, trying to piece together the picture. The resulting task is even more challenging than the classic puzzle: now all the fragments have the same rectangular shape, and one can assemble the puzzle only relying on the picture drawn on the pieces.All puzzle pieces turn out to be of the same sizeX×Y, because the picture is cut first by horizontal cuts with the pitch ofX, then with vertical cuts with the pitch ofY. If we denote the initial size of the picture asA×B, thenAmust be divisible byXandBmust be divisible byY(XandYare integer numbers).However, not every such cutting of the picture will result in agoodpuzzle. The Hedgehog finds a puzzle good if no two pieces in it are the same (It isallowed to rotatethe pieces when comparing them, but it is forbidden to turn them over).Your task is to count for a given picture the number of good puzzles that you can make from it, and also to find the puzzle with the minimal piece size.InputThe first line contains two numbersAandBwhich are the sizes of the picture. They are positive integers not exceeding 20.Then followAlines containingBsymbols each, describing the actual picture. The lines only contain uppercase English letters.OutputIn the first line print the number of possible good puzzles (in other words, the number of pairs(X,Y)such that the puzzle with the corresponding element sizes will be good). This number should always be positive, because the whole picture is a good puzzle itself.In the second line print two numbers — the sizesXandYof the smallest possible element among all good puzzles. The comparison is made firstly by the areaXYof one element and secondly — by the lengthX.ExamplesInput2 4ABDCABDCOutput32 1Input2 6ABCCBAABCCBAOutput12 6NoteThe picture in the first sample test has the following good puzzles:(2, 1),(2, 2),(2, 4).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b1c9b6b6", "template_md5": "35d339e4", "result": "You are given a picture of size $A \\times B$.  You can cut this picture into smaller rectangular pieces of size $X \\times Y$.  \n\nThe goal is to find:\n\n1. The number of ways to cut the picture into pieces so that no two pieces are the same (you can rotate pieces, but not flip them).\n2. The smallest possible size ($X \\times Y$) of a piece that will result in a valid cut. \n\n**Input:**\n\n* Two integers $A$ and $B$ representing the size of the picture.\n* $A$ lines of $B$ characters each, representing the picture.\n\n**Output:**\n\n* The number of valid cuts.\n* Two integers $X$ and $Y$ representing the smallest possible piece size."}, {"prompt_md5": "b33dc65a", "template_md5": "465699a0", "result": "Given a rectangular picture, find the number of ways to cut it into smaller identical rectangles so that no two pieces are the same (rotation allowed, flipping not allowed). Also, find the smallest possible size of these rectangles."}]}