{"uid": "54-D", "url": "https://codeforces.com/contest/54/problem/D", "tags": ["brute force", " dp", " strings"], "title": "54-D", "statement": "D. Writing a Songtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne of the Hedgehog and his friend's favorite entertainments is to take some sentence or a song and replace half of the words (sometimes even all of them) with each other's names.The friend's birthday is approaching and the Hedgehog decided to make a special present to his friend: a very long song, where his name will be repeated many times. But try as he might, he can't write a decent song!The problem is that the Hedgehog has already decided how long the resulting sentence should be (i.e. how many letters it should contain) and in which positions in the sentence the friend's name should occur, and it must not occur in any other position in the sentence. Besides, the Hedgehog decided to limit himself to using only the firstKletters of an English alphabet in this sentence (so it will be not even a sentence, but one long word).The resulting problem is indeed quite complicated, that's why the Hedgehog asks you to help him and write a program that will make the desired word by the given nameP, the lengthNof the required word, the given positions of the occurrences of the namePin the desired word and the alphabet's sizeK. Note that the occurrences of the name can overlap with each other.InputThe first line contains numbersNandKwhich are the length of the required string and the alphabet size accordingly. The limitations are:1 ≤N≤ 100,2 ≤K≤ 26.The second line contains the namePwhich is a non-empty string whose length does not exceedNcharacters. The string consists only of the firstKlowercase symbols of an English alphabet.The third line contains the string of lengthN-length(P) + 1, consisting only of numbers zero and one. A number one in thei-th position means that an occurrence of the namePshould start fromi-th position of the desired word, while a zero means that there is no occurrence starting here.OutputPrint the desired wordS. If there are several answers, print any of them.If there is no solution, then print \"No solution\".ExamplesInput5 2aba101OutputababaInput5 2a10001OutputabbbaInput6 2abba101OutputNo solution", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b7b96d33", "template_md5": "35d339e4", "result": "Given a target word length $N$, an alphabet size $K$, a name $P$ (consisting of the first $K$ lowercase letters of the alphabet), and a binary string indicating the starting positions of occurrences of $P$ within the target word, construct a word of length $N$ that satisfies the following conditions:\n\n* The word uses only the first $K$ lowercase letters of the alphabet.\n* The name $P$ appears at the specified positions within the word.\n* Overlapping occurrences of $P$ are allowed.\n\nIf no such word can be constructed, output \"No solution\"."}, {"prompt_md5": "0d662201", "template_md5": "465699a0", "result": "Given a target word length and a name, determine if a word can be created using only the first K letters of the alphabet where the name appears at specific positions within the word. If possible, output the word; otherwise, output \"No solution\"."}]}