{"uid": "540-E", "url": "https://codeforces.com/contest/540/problem/E", "tags": ["binary search", " data structures", " implementation", " sortings", " trees"], "title": "540-E", "statement": "E. Infinite Inversionstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is an infinite sequence consisting of all positive integers in the increasing order:p= {1, 2, 3, ...}. We performednswapoperations with this sequence. Aswap(a,b)is an operation of swapping the elements of the sequence on positionsaandb. Your task is to find the number of inversions in the resulting sequence, i.e. the number of such index pairs(i,j), thati<jandpi>pj.InputThe first line contains a single integern(1 ≤n≤ 105) — the number ofswapoperations applied to the sequence.Each of the nextnlines contains two integersaiandbi(1 ≤ai,bi≤ 109,ai≠bi) — the arguments of theswapoperation.OutputPrint a single integer — the number of inversions in the resulting sequence.ExamplesInput24 21 4Output4Input31 63 42 5Output15NoteIn the first sample the sequence is being modified as follows:. It has 4 inversions formed by index pairs(1, 4),(2, 3),(2, 4)and(3, 4).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "afe8ea1c", "template_md5": "35d339e4", "result": "You are given a sequence of positive integers starting from 1 and going to infinity. You are also given a list of pairs of numbers. Each pair represents a swap operation, where the numbers at those positions in the sequence are exchanged. \n\nYour task is to determine the number of \"inversions\" in the sequence after all the swap operations are performed. An inversion is a pair of numbers (i, j) where i < j but the number at position i is greater than the number at position j. \n\n\n\nFor example, if the sequence is [2, 1, 4, 3] there are 3 inversions: (1, 2), (2, 3), and (2, 4)."}, {"prompt_md5": "e2a44ed2", "template_md5": "465699a0", "result": "You are given a list of pairs of numbers. Each pair represents a swap operation to be performed on a sequence of numbers from 1 to infinity.  Find the number of times a smaller number appears after a larger number in the final sequence after all swaps are applied."}]}