{"uid": "542-A", "url": "https://codeforces.com/contest/542/problem/A", "tags": ["data structures", " sortings"], "title": "542-A", "statement": "A. Place Your Ad Heretime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIvan Anatolyevich's agency is starting to become famous in the town.They have already ordered and madenTV commercial videos. Each video is made in a special way: the colors and the soundtrack are adjusted to the time of the day and the viewers' mood. That's why thei-th video can only be shown within the time range of[li,ri](it is not necessary to use the whole segment but the broadcast time should be within this segment).Now it's time to choose a TV channel to broadcast the commercial. Overall, there aremTV channels broadcasting in the city, thej-th one hascjviewers, and is ready to sell time[aj,bj]to broadcast the commercial.Ivan Anatolyevich is facing a hard choice: he has to choose exactly one videoiand exactly one TV channeljto broadcast this video and also a time range to broadcast[x,y]. At that the time range should be chosen so that it is both within range[li,ri]and within range[aj,bj].Let's define theefficiencyof the broadcast as value(y-x)·cj— the total sum of time that all the viewers of the TV channel are going to spend watching the commercial. Help Ivan Anatolyevich choose the broadcast with the maximumefficiency!InputThe first line contains two integersnandm(1 ≤n,m≤ 2·105) — the number of commercial videos and channels, respectively.Each of the followingnlines contains two integersli,ri(0 ≤li≤ri≤ 109) — the segment of time when it is possible to show the corresponding video.Each of the followingmlines contains three integersaj,bj,cj(0 ≤aj≤bj≤ 109,1 ≤cj≤ 109), characterizing the TV channel.OutputIn the first line print an integer — the maximum possibleefficiencyof the broadcast. If there is no correct way to get a strictly positiveefficiency, print a zero.If the maximumefficiencyisstrictlypositive, in the second line also print the number of the videoi(1 ≤i≤n) and the number of the TV channelj(1 ≤j≤m) in the most effective broadcast.If there are multiple optimal answers, you can print any of them.ExamplesInput2 37 91 42 8 20 4 18 9 3Output42 1Input1 10 01 1 10Output0NoteIn the first sample test the most optimal solution is to show the second commercial using the first TV channel at time[2, 4]. The efficiency of such solution is equal to(4 - 2)·2 = 4.In the second sample test Ivan Anatolievich's wish does not meet the options of the TV channel, the segments do not intersect, so the answer is zero.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9288b753", "template_md5": "35d339e4", "result": "You are given $n$ videos and $m$ TV channels. Each video $i$ has a time range $[l_i, r_i]$ during which it can be shown. Each channel $j$ has a viewership of $c_j$ and a time range $[a_j, b_j]$ during which it is available for broadcasting.\n\nYou need to choose one video and one channel and a time range $[x, y]$ within both the video's time range and the channel's time range. The efficiency of the broadcast is defined as $(y-x) \\cdot c_j$.\n\nFind the maximum possible efficiency and output it. If no valid broadcast is possible, output 0. If a valid broadcast is possible, also output the chosen video number and channel number."}, {"prompt_md5": "393b736a", "template_md5": "465699a0", "result": "You have a set of videos that can only be shown within specific time ranges. You also have a set of TV channels, each with a viewership and a time range when they are available for advertising.  \n\nYou need to choose one video and one TV channel to broadcast on, and select a time range within both the video's allowed time and the channel's available time. The goal is to maximize the total time viewers will watch the ad. \n\n\nIf no valid broadcast is possible, output 0."}]}