{"uid": "542-E", "url": "https://codeforces.com/contest/542/problem/E", "tags": ["graphs", " shortest paths"], "title": "542-E", "statement": "E. Playing on Graphtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVova and Marina love offering puzzles to each other. Today Marina offered Vova to cope with the following task.Vova has a non-directed graph consisting ofnvertices andmedges without loops and multiple edges. Let's define the operation ofcontractiontwo verticesaandbthat arenot connected by an edge. As a result of this operation verticesaandbare deleted and instead of them a new vertexxis added into the graph, and also edges are drawn from it to all vertices that were connected withaor withb(specifically, if the vertex was connected with bothaandb, then also exactly one edge is added fromxto it). Thus, as a result ofcontractionagain a non-directed graph is formed, it contains no loops nor multiple edges, and it contains(n- 1)vertices.Vova must perform thecontractionan arbitrary number of times to transform the given graph into achainof the maximum length. Achainof lengthk(k≥ 0) is a connected graph whose vertices can be numbered with integers from1tok+ 1so that the edges of the graph connect all pairs of vertices(i,i+ 1)(1 ≤i≤k) and only them. Specifically, the graph that consists of one vertex is a chain of length0. The vertices that are formed as a result of thecontractionare allowed to be used in the following operations ofcontraction.The picture illustrates the contraction of two vertices marked by red.Help Vova cope with his girlfriend's task. Find the maximum length of the chain that can be obtained from the resulting graph or else determine that it is impossible to obtain the chain.InputThe first line contains two integersn,m(1 ≤n≤ 1000,0 ≤m≤ 100 000) — the number of vertices and the number of edges in the original graph.Nextmlines contain the descriptions of edges in the formatai,bi(1 ≤ai,bi≤n,ai≠bi), which means that there is an edge between verticesaiandbi. It is guaranteed that there is at most one edge between each pair of vertexes.OutputIf it is impossible to obtain a chain from the given graph, print- 1. Otherwise, print the maximum possible number of edges in the resulting chain.ExamplesInput5 41 22 33 43 5Output3Input4 61 22 31 33 42 41 4Output-1Input4 21 32 4Output2NoteIn the first sample test you can contract vertices4and5and obtain a chain of length3.In the second sample test it is initially impossible to contract any pair of vertexes, so it is impossible to achieve the desired result.In the third sample test you can contract vertices1and2and obtain a chain of length2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "28bcdae7", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices and $m$ edges.  The graph has no loops or multiple edges.\n\nYou can perform the following operation:\n\n* **Contraction:** Choose two vertices $a$ and $b$ that are not connected by an edge.  Delete vertices $a$ and $b$, and add a new vertex $x$. Connect $x$ to every vertex that was previously connected to either $a$ or $b$.\n\nThe goal is to perform contractions to transform the graph into a chain. A chain is a connected graph where the vertices can be numbered $1, 2, ..., k$ such that the edges connect vertices $(i, i+1)$ for $1 \\le i \\le k-1$.\n\nFind the maximum possible length of a chain that can be obtained from the graph. If it is impossible to obtain a chain, output $-1$."}, {"prompt_md5": "0164fb22", "template_md5": "465699a0", "result": "You are given a graph with nodes and edges. You can merge any two unconnected nodes into a single node, connecting it to all the nodes the original nodes were connected to.  Find the longest possible chain of nodes you can create by repeatedly merging nodes. If it's impossible to create a chain, output -1."}]}