{"uid": "543-E", "url": "https://codeforces.com/contest/543/problem/E", "tags": ["constructive algorithms", " data structures"], "title": "543-E", "statement": "E. Listening to Musictime limit per test7 secondsmemory limit per test64 megabytesinputstandard inputoutputstandard outputPlease note that the memory limit differs from the standard.You really love to listen to music. During the each of nextsdays you will listen to exactlymsongs from the playlist that consists of exactlynsongs. Let's number the songs from the playlist with numbers from1ton, inclusive. The quality of song numberiisai.On thei-th day you choose some integerv(li≤v≤ri) and listen to songs numberv,v+ 1, ...,v+m- 1. On thei-th day listening to one song with quality less thanqiincreases your displeasure by exactly one.Determine what minimum displeasure you can get on each of thesnext days.InputThe first line contains two positive integersn,m(1 ≤m≤n≤ 2·105). The second line containsnpositive integersa1,a2, ...,an(0 ≤ai< 230) — the description of songs from the playlist.The next line contains a single numbers(1 ≤s≤ 2·105) — the number of days that you consider.The nextslines contain three integers eachli,ri,xi(1 ≤li≤ri≤n-m+ 1;0 ≤xi< 230) — the description of the parameters for thei-th day. In order to calculate valueqi, you need to use formula:, whereansiis the answer to the problem for dayi. Assume thatans0= 0.OutputPrint exactlysintegersans1,ans2, ...,anss, whereansiis the minimum displeasure that you can get on dayi.ExamplesInput5 31 2 1 2 351 1 21 3 21 3 31 3 51 3 1Output20231", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f824f382", "template_md5": "35d339e4", "result": "You have a playlist of $n$ songs. Each song has a quality value $a_i$ from 0 to 229.  You will listen to music for $s$ days.\n\nOn each day $i$, you choose a starting song number $v$ between $l_i$ and $r_i$ inclusive, and listen to $m$ consecutive songs starting from $v$.  \n\nThe displeasure you get on day $i$ is the sum of the quality values of all songs you listen to that have a quality less than $q_i$.  $q_i$ is calculated as $q_i = ans_{i-1} + x_i$, where $ans_{i-1}$ is the minimum displeasure on the previous day and $x_i$ is given in the input.\n\nFind the minimum displeasure you can get on each of the $s$ days.\n\n\n\nInput:\n\n* The first line contains two integers $n$ and $m$ (1 ≤ $m$ ≤ $n$ ≤ 2 * 10⁵).\n* The second line contains $n$ integers $a_1$, $a_2$, ..., $a_n$ (0 ≤ $a_i$ < 230).\n* The third line contains an integer $s$ (1 ≤ $s$ ≤ 2 * 10⁵).\n* The next $s$ lines each contain three integers $l_i$, $r_i$, and $x_i$ (1 ≤ $l_i$ ≤ $r_i$ ≤ $n - m + 1$; 0 ≤ $x_i$ < 230).\n\nOutput:\n\nPrint $s$ integers $ans_1$, $ans_2$, ..., $ans_s$, where $ans_i$ is the minimum displeasure you can get on day $i$."}, {"prompt_md5": "2cd82454", "template_md5": "465699a0", "result": "You have a playlist of songs with different qualities. Each day, you listen to a consecutive group of songs.  You want to minimize the total displeasure you get from listening to songs with qualities below a certain threshold.  \n\nThe threshold for each day depends on the displeasure from the previous days.  Find the minimum displeasure for each day."}]}