{"uid": "543-B", "url": "https://codeforces.com/contest/543/problem/B", "tags": ["constructive algorithms", " graphs", " shortest paths"], "title": "543-B", "statement": "B. Destroying Roadstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn some country there are exactlyncities andmbidirectional roads connecting the cities. Cities are numbered with integers from1ton. If citiesaandbare connected by a road, then in an hour you can go along this road either from cityato cityb, or from citybto citya. The road network is such that from any city you can get to any other one by moving along the roads.You want to destroy the largest possible number of roads in the country so that the remaining roads would allow you to get from citys1to cityt1in at mostl1hours and get from citys2to cityt2in at mostl2hours.Determine what maximum number of roads you need to destroy in order to meet the condition of your plan. If it is impossible to reach the desired result, print -1.InputThe first line contains two integersn,m(1 ≤n≤ 3000,) — the number of cities and roads in the country, respectively.Nextmlines contain the descriptions of the roads as pairs of integersai,bi(1 ≤ai,bi≤n,ai≠bi). It is guaranteed that the roads that are given in the description can transport you from any city to any other one. It is guaranteed that each pair of cities has at most one road between them.The last two lines contains three integers each,s1,t1,l1ands2,t2,l2, respectively (1 ≤si,ti≤n,0 ≤li≤n).OutputPrint a single number — the answer to the problem. If the it is impossible to meet the conditions, print -1.ExamplesInput5 41 22 33 44 51 3 23 5 2Output0Input5 41 22 33 44 51 3 22 4 2Output1Input5 41 22 33 44 51 3 23 5 1Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b6ab904a", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ roads connecting them. Each road connects two different cities. You can travel between cities by using these roads.\n\nYou want to remove the maximum number of roads so that:\n\n* You can travel from city $s_1$ to city $t_1$ in at most $l_1$ hours.\n* You can travel from city $s_2$ to city $t_2$ in at most $l_2$ hours.\n\nIf it's impossible to meet these conditions after removing roads, print -1. \n\n\nOtherwise, print the maximum number of roads you can remove."}, {"prompt_md5": "47a64a15", "template_md5": "465699a0", "result": "You have a network of cities connected by roads. You can travel between any two cities by following the roads.  You need to remove the maximum number of roads so that you can still travel between two specific pairs of cities within a given time limit for each pair. If it's impossible to meet these time limits after removing roads, output -1."}]}