{"uid": "543-A", "url": "https://codeforces.com/contest/543/problem/A", "tags": ["dp"], "title": "543-A", "statement": "A. Writing Codetime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputProgrammers working on a large project have just received a task to write exactlymlines of code. There arenprogrammers working on a project, thei-th of them makes exactlyaibugs in every line of code that he writes.Let's call a sequence of non-negative integersv1,v2, ...,vnaplan, ifv1+v2+ ... +vn=m. The programmers follow the plan like that: in the beginning the first programmer writes the firstv1lines of the given task, then the second programmer writesv2more lines of the given task, and so on. In the end, the last programmer writes the remaining lines of the code. Let's call a plangood, if all the written lines of the task contain at mostbbugs in total.Your task is to determine how many distinctgoodplans are there. As the number of plans can be large, print the remainder of this number modulo given positive integermod.InputThe first line contains four integersn,m,b,mod(1 ≤n,m≤ 500,0 ≤b≤ 500;1 ≤mod≤ 109+ 7) — the number of programmers, the number of lines of code in the task, the maximum total number of bugs respectively and the modulo you should use when printing the answer.The next line containsnspace-separated integersa1,a2, ...,an(0 ≤ai≤ 500) — the number of bugs per line for each programmer.OutputPrint a single integer — the answer to the problem modulomod.ExamplesInput3 3 3 1001 1 1Output10Input3 6 5 10000000071 2 3Output0Input3 5 6 111 2 1Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "67428d6d", "template_md5": "35d339e4", "result": "There are $n$ programmers working on a project that requires writing $m$ lines of code. The $i$-th programmer makes $a_i$ bugs in every line of code they write.\n\nA plan is a sequence of non-negative integers $v_1, v_2, ..., v_n$ where $v_1 + v_2 + ... + v_n = m$.  \n\nA plan is considered \"good\" if the total number of bugs in all the lines written according to the plan is at most $b$.\n\nFind the number of distinct good plans, and print the remainder when this number is divided by a given positive integer $mod$."}, {"prompt_md5": "900b2ac5", "template_md5": "465699a0", "result": "You have a task to write a certain number of lines of code.  Several people will write the code, each making a certain number of errors per line.  You need to figure out how many different ways they can split up the work so that the total number of errors in the final code doesn't exceed a limit.  The answer should be the number of valid ways, reduced by a given number."}]}