{"uid": "543-D", "url": "https://codeforces.com/contest/543/problem/D", "tags": ["dp", " trees"], "title": "543-D", "statement": "D. Road Improvementtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe country hasncities andn- 1bidirectional roads, it is possible to get from every city to any other one if you move only along the roads. The cities are numbered with integers from1toninclusive.All the roads are initially bad, but the government wants to improve the state of some roads. We will assume that the citizens are happy about road improvement if the path from the capital located in cityxto any other city contains at most one bad road.Your task is — for every possiblexdetermine the number of ways of improving the quality of some roads in order to meet the citizens' condition. As those values can be rather large, you need to print each value modulo1 000 000 007(109+ 7).InputThe first line of the input contains a single integern(2 ≤n≤ 2·105) — the number of cities in the country. Next line containsn- 1positive integersp2,p3,p4, ...,pn(1 ≤pi≤i- 1) — the description of the roads in the country. Numberpimeans that the country has a road connecting citypiand cityi.OutputPrintnintegersa1,a2, ...,an, whereaiis the sought number of ways to improve the quality of the roads modulo1 000 000 007(109+ 7), if the capital of the country is at city numberi.ExamplesInput31 1Output4 3 3Input51 2 3 4Output5 8 9 8 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fd0f062b", "template_md5": "465699a0", "result": "You have a network of cities connected by roads.  Some roads are bad.  You need to figure out how many ways you can fix some roads so that from any city, you can reach the capital city with at most one bad road along the way.  You need to do this for each city as a possible capital."}, {"prompt_md5": "49f0148a", "template_md5": "35d339e4", "result": "There are $n$ cities and $n-1$ roads connecting them.  Each road connects two cities.  You need to determine, for each city $i$ (where $1 \\le i \\le n$), the number of ways to improve some of the roads so that:\n\n*  The capital city is city $i$.\n*  Every path from the capital city to any other city has at most one bad road.\n\nThe number of ways to improve the roads should be calculated modulo $10^9 + 7$. \n\n\n\nLet me know if you'd like help with the solution!"}]}