{"uid": "545-D", "url": "https://codeforces.com/contest/545/problem/D", "tags": ["greedy", " implementation", " sortings"], "title": "545-D", "statement": "D. Queuetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle girl Susie went shopping with her mom and she wondered how to improve service quality.There arenpeople in the queue. For each person we know timetineeded to serve him. A person will be disappointed if the time he waits is more than the time needed to serve him. The time a person waits is the total time when all the people who stand in the queue in front of him are served. Susie thought that if we swap some people in the queue, then we can decrease the number of people who are disappointed.Help Susie find out what is the maximum number of not disappointed people can be achieved by swapping people in the queue.InputThe first line contains integern(1 ≤n≤ 105).The next line containsnintegersti(1 ≤ti≤ 109), separated by spaces.OutputPrint a single number — the maximum number of not disappointed people in the queue.ExamplesInput515 2 1 5 3Output4NoteValue4is achieved at such an arrangement, for example:1, 2, 3, 5, 15. Thus, you can make everything feel not disappointed except for the person with time 5.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "55d1f488", "template_md5": "35d339e4", "result": "You are given $n$ integers, $t_1, t_2, ..., t_n$, where each integer represents the time needed to serve a person.  \n\nFind the maximum number of people who will not be disappointed, given that a person will be disappointed if the time they wait in line is greater than the time it takes to serve them.  \n\nYou can rearrange the order of the people in line."}, {"prompt_md5": "162adbbd", "template_md5": "465699a0", "result": "You are given a list of numbers representing the time it takes to serve each person in a queue.  Find the maximum number of people who will not be disappointed if the queue order is rearranged. A person is disappointed if the time they wait in line is longer than the time it takes to serve them."}]}