{"uid": "546-B", "url": "https://codeforces.com/contest/546/problem/B", "tags": ["brute force", " greedy", " implementation", " sortings"], "title": "546-B", "statement": "B. Soldier and Badgestime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputColonel hasnbadges. He wants to give one badge to every of hisnsoldiers. Each badge has acoolness factor, which shows how much it's owner reached. Coolness factor can be increased by one for the cost of one coin.For every pair of soldiers one of them should get a badge with strictly higher factor than the second one. Exact values of their factors aren't important, they just need to have distinct factors.Colonel knows, which soldier is supposed to get which badge initially, but there is a problem. Some of badges may have the same factor of coolness. Help him and calculate how much money has to be paid for making all badges have different factors of coolness.InputFirst line of input consists of one integern(1 ≤n≤ 3000).Next line consists ofnintegersai(1 ≤ai≤n), which stand for coolness factor of each badge.OutputOutput single integer — minimum amount of coins the colonel has to pay.ExamplesInput41 3 1 4Output1Input51 2 3 2 5Output2NoteIn first sample test we can increase factor of first badge by1.In second sample test we can increase factors of the second and the third badge by1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6fb4901a", "template_md5": "35d339e4", "result": "You are given $n$ integers, $a_1, a_2, ..., a_n$, representing the coolness factors of $n$ badges.  You need to make sure that each badge has a unique coolness factor. You can increase the coolness factor of a badge by 1, which costs 1 coin. \n\nFind the minimum number of coins needed to make all the badges have distinct coolness factors."}, {"prompt_md5": "97caca9a", "template_md5": "465699a0", "result": "You are given a list of numbers representing the coolness factor of each of  items. You need to make sure each number is unique by increasing some of them.  What is the minimum number of increases needed?"}]}