{"uid": "546-C", "url": "https://codeforces.com/contest/546/problem/C", "tags": ["brute force", " dfs and similar", " games"], "title": "546-C", "statement": "C. Soldier and Cardstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTwo bored soldiers are playing card war. Their card deck consists of exactlyncards, numbered from1ton,all values are different. They divide cards between them in some manner, it's possible that they have different number of cards. Then they play a \"war\"-like card game.The rules are following. On each turn afighthappens. Each of them picks card from the top of his stack and puts on the table. The one whose card value is bigger wins thisfightand takes both cards from the table to the bottom of his stack. More precisely, he first takes his opponent's card and puts to the bottom of his stack, and then he puts his card to the bottom of his stack. If after some turn one of the player's stack becomes empty, he loses and the other one wins.You have to calculate how manyfightswill happen and who will win the game, or state that game won't end.InputFirst line contains a single integern(2 ≤n≤ 10), the number of cards.Second line contains integerk1(1 ≤k1≤n- 1), the number of the first soldier's cards. Then followk1integers that are the values on the first soldier's cards, from top to bottom of his stack.Third line contains integerk2(k1+k2=n), the number of the second soldier's cards. Then followk2integers that are the values on the second soldier's cards, from top to bottom of his stack.All card values are different.OutputIf somebody wins in this game, print2integers where the first one stands for the number offightsbefore end of game and the second one is1or2showing which player has won.If the game won't end and will continue forever output- 1.ExamplesInput42 1 32 4 2Output6 2Input31 22 1 3Output-1NoteFirst sample:Second sample:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cd7cf728", "template_md5": "35d339e4", "result": "Two players are playing a card game. They each have a deck of cards with unique numbers from 1 to $n$.  The number of cards each player has is given.  \n\nOn each turn, both players reveal the top card from their deck. The player with the higher card takes both cards and places them at the bottom of their own deck.  \n\nThe game continues until one player runs out of cards.\n\nGiven the number of cards ($n$) and the values of the cards in each player's deck, determine:\n\n1. The number of turns the game will last.\n2. Which player will win the game (1 or 2).\n\nIf the game will continue forever, output -1."}, {"prompt_md5": "fe2b34c6", "template_md5": "465699a0", "result": "Two players have different sets of numbered cards. They take turns revealing the top card from their sets. The player with the higher card takes both cards and adds them to the bottom of their set. The game continues until one player runs out of cards. Determine the number of turns played and the winner. If the game never ends, output -1."}]}