{"uid": "547-C", "url": "https://codeforces.com/contest/547/problem/C", "tags": ["bitmasks", " combinatorics", " dp", " math", " number theory"], "title": "547-C", "statement": "C. Mike and Foamtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMike is a bartender at Rico's bar. At Rico's, they put beer glasses in a special shelf. There arenkinds of beer at Rico's numbered from1ton.i-th kind of beer hasaimilliliters of foam on it.Maxim is Mike's boss. Today he told Mike to performqqueries. Initially the shelf is empty. In each request, Maxim gives him a numberx. If beer numberxis already in the shelf, then Mike should remove it from the shelf, otherwise he should put it in the shelf.After each query, Mike should tell him the score of the shelf. Bears are geeks. So they think that the score of a shelf is the number of pairs(i,j)of glasses in the shelf such thati<jandwhereis the greatest common divisor of numbersaandb.Mike is tired. So he asked you to help him in performing these requests.InputThe first line of input contains numbersnandq(1 ≤n,q≤ 2 × 105), the number of different kinds of beer and number of queries.The next line containsnspace separated integers,a1,a2, ... ,an(1 ≤ai≤ 5 × 105), the height of foam in top of each kind of beer.The nextqlines contain the queries. Each query consists of a single integer integerx(1 ≤x≤n), the index of a beer that should be added or removed from the shelf.OutputFor each query, print the answer for that query in one line.ExamplesInput5 61 2 3 4 6123451Output013562", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dbdab05c", "template_md5": "35d339e4", "result": "There are $n$ types of beer, each with a different amount of foam. You are given an array $a$ of size $n$ where $a_i$ represents the amount of foam on the $i$-th type of beer.\n\nYou will be given $q$ queries. Each query is an integer $x$ representing a type of beer. If the $x$-th type of beer is already on the shelf, remove it. Otherwise, add it to the shelf.\n\nAfter each query, calculate the \"score\" of the shelf. The score is the number of pairs $(i, j)$ where $1 \\le i < j \\le n$ and the greatest common divisor (GCD) of $a_i$ and $a_j$ is greater than 1.\n\nFor each query, output the score of the shelf."}, {"prompt_md5": "ac9c087b", "template_md5": "465699a0", "result": "You are given a list of numbers representing the amount of foam on different types of drinks.  You will be given queries asking you to either add or remove a drink from a shelf. After each change, you need to count the number of pairs of drinks on the shelf where the greatest common divisor of their foam amounts is greater than 1."}]}