{"uid": "547-E", "url": "https://codeforces.com/contest/547/problem/E", "tags": ["data structures", " string suffix structures", " strings", " trees"], "title": "547-E", "statement": "E. Mike and Friendstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhat-The-Fatherland is a strange country! All phone numbers there are strings consisting of lowercase English letters. What is double strange that a phone number can be associated with several bears!In that country there is a rock band called CF consisting ofnbears (including Mike) numbered from1ton.Phone number ofi-th member of CF issi. May 17th is a holiday named Phone Calls day. In the last Phone Calls day, everyone called all the numbers that are substrings of his/her number (one may call some number several times). In particular, everyone called himself (that was really strange country).Denote ascall(i,j)the number of times thati-th member of CF called thej-th member of CF.The geek Mike hasqquestions that he wants to ask you. In each question he gives you numbersl,randkand you should tell him the numberInputThe first line of input contains integersnandq(1 ≤n≤ 2 × 105and1 ≤q≤ 5 × 105).The nextnlines contain the phone numbers,i-th line contains a stringsiconsisting of lowercase English letters ().The nextqlines contain the information about the questions, each of them contains integersl,randk(1 ≤l≤r≤nand1 ≤k≤n).OutputPrint the answer for each question in a separate line.ExamplesInput5 5aababababababb1 5 13 5 11 5 21 5 31 4 5Output75636", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c21c7975", "template_md5": "35d339e4", "result": "There are $n$ phone numbers, each consisting of lowercase English letters.  You are given $n$ phone numbers.  \n\nFor each phone number, count how many times each of the other phone numbers is a substring of it.\n\nThen, for $q$ queries, you are given three numbers $l$, $r$, and $k$. For each query, output the number of times the $l$-th phone number called the $k$-th phone number."}, {"prompt_md5": "0315f513", "template_md5": "465699a0", "result": "You are given a list of phone numbers.  For each query, you need to find the number of times a specific phone number called all the other phone numbers that are substrings of it."}]}