{"uid": "55-E", "url": "https://codeforces.com/contest/55/problem/E", "tags": ["geometry", " two pointers"], "title": "55-E", "statement": "E. Very simple problemtime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou are given a convex polygon. Count, please, the number of triangles that contain a given point in the plane and their vertices are the vertices of the polygon. It is guaranteed, that the point doesn't lie on the sides and the diagonals of the polygon.InputThe first line contains integern— the number of vertices of the polygon (3 ≤n≤ 100000). The polygon description is following:nlines containing coordinates of the vertices in clockwise order (integerxandynot greater than109by absolute value). It is guaranteed that the given polygon is nondegenerate and convex (no three points lie on the same line).The next line contains integert(1 ≤t≤ 20) — the number of points which you should count the answer for. It is followed bytlines with coordinates of the points (integerxandynot greater than109by absolute value).OutputThe output should containtinteger numbers, each on a separate line, wherei-th number is the answer for thei-th point.Please, do not use%lldspecificator to read or write 64-bit integers in C++. It is preffered to usecin(also you may use%I64d).ExamplesInput45 00 00 55 511 3Output2Input30 00 55 021 110 10Output10Input57 66 34 11 22 443 32 35 54 2Output5334", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7d753441", "template_md5": "35d339e4", "result": "You are given a convex polygon.  For each of several points, count the number of triangles that can be formed using the polygon's vertices as points of the triangle, and where the given point is inside the triangle. \n\n**Input:**\n\n* The first line contains an integer $n$ (3 ≤ $n$ ≤ 100,000), the number of vertices of the polygon.\n* The next $n$ lines each contain two integers, $x$ and $y$, representing the coordinates of a vertex of the polygon. The vertices are listed in clockwise order.\n* The next line contains an integer $t$ (1 ≤ $t$ ≤ 20), the number of points to check.\n* The next $t$ lines each contain two integers, $x$ and $y$, representing the coordinates of a point.\n\n**Output:**\n\n* Output $t$ integers, one per line. The $i$-th integer is the number of triangles containing the $i$-th point. \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem statement."}, {"prompt_md5": "05cce562", "template_md5": "465699a0", "result": "You are given a polygon.  Count how many triangles can be formed using the polygon's corners and a given point inside the polygon.  The point is not on any of the polygon's lines."}]}