{"uid": "550-B", "url": "https://codeforces.com/contest/550/problem/B", "tags": ["bitmasks", " brute force"], "title": "550-B", "statement": "B. Preparing Olympiadtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou havenproblems. You have estimated the difficulty of thei-th one as integerci. Now you want to prepare a problemset for a contest, using some of the problems you've made.A problemset for the contest must consist of at least two problems. You think that the total difficulty of the problems of the contest must be at leastland at mostr. Also, you think that the difference between difficulties of the easiest and the hardest of the chosen problems must be at leastx.Find the number of ways to choose a problemset for the contest.InputThe first line contains four integersn,l,r,x(1 ≤n≤ 15,1 ≤l≤r≤ 109,1 ≤x≤ 106) — the number of problems you have, the minimum and maximum value of total difficulty of the problemset and the minimum difference in difficulty between the hardest problem in the pack and the easiest one, respectively.The second line containsnintegersc1,c2, ...,cn(1 ≤ci≤ 106) — the difficulty of each problem.OutputPrint the number of ways to choose a suitable problemset for the contest.ExamplesInput3 5 6 11 2 3Output2Input4 40 50 1010 20 30 25Output2Input5 25 35 1010 10 20 10 20Output6NoteIn the first example two sets are suitable, one consisting of the second and third problem, another one consisting of all three problems.In the second example, two sets of problems are suitable — the set of problems with difficulties 10 and 30 as well as the set of problems with difficulties 20 and 30.In the third example any set consisting of one problem of difficulty 10 and one problem of difficulty 20 is suitable.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bc3f074b", "template_md5": "35d339e4", "result": "You have $n$ problems with known difficulties $c_1, c_2, ..., c_n$. You want to create a contest with at least 2 problems. The total difficulty of the problems in the contest must be between $l$ and $r$ inclusive.  The difference between the hardest and easiest problem in the contest must be at least $x$.\n\nFind the number of ways to choose a set of problems that meet these criteria."}, {"prompt_md5": "88afc69f", "template_md5": "465699a0", "result": "You have a set of items with assigned difficulty levels. You need to choose a subset of at least two items for a contest. The total difficulty of the chosen items must be between a minimum and maximum value, and the difference in difficulty between the hardest and easiest item must be at least a given value.  Count how many different combinations of items meet these criteria."}]}