{"uid": "550-D", "url": "https://codeforces.com/contest/550/problem/D", "tags": ["constructive algorithms", " graphs", " implementation"], "title": "550-D", "statement": "D. Regular Bridgetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAn undirected graph is calledk-regular, if the degrees of all its vertices are equalk. An edge of a connected graph is called abridge, if after removing it the graph is being split into two connected components.Build a connected undirectedk-regular graph containing at least one bridge, or else state that such graph doesn't exist.InputThe single line of the input contains integerk(1 ≤k≤ 100) — the required degree of the vertices of the regular graph.OutputPrint \"NO\" (without quotes), if such graph doesn't exist.Otherwise, print \"YES\" in the first line and the description of any suitable graph in the next lines.The description of the made graph must start with numbersnandm— the number of vertices and edges respectively.Each of the nextmlines must contain two integers,aandb(1 ≤a,b≤n,a≠b), that mean that there is an edge connecting the verticesaandb. A graph shouldn't contain multiple edges and edges that lead from a vertex to itself. A graph must be connected, the degrees of all vertices of the graph must be equalk. At least one edge of the graph must be a bridge. You can print the edges of the graph in any order. You can print the ends of each edge in any order.The constructed graph must contain at most106vertices and106edges (it is guaranteed that if at least one graph that meets the requirements exists, then there also exists the graph with at most106vertices and at most106edges).ExamplesInput1OutputYES2 11 2NoteIn the sample from the statement there is a suitable graph consisting of two vertices, connected by a single edge.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6cd816cd", "template_md5": "35d339e4", "result": "You are given an integer $k$ (where $1 \\le k \\le 100$).  \n\nA graph is $k$-regular if every vertex has degree $k$. A bridge in a graph is an edge that, when removed, separates the graph into two connected components.\n\nYour task is to determine if a connected $k$-regular graph with at least one bridge exists. If it does, output \"YES\" followed by the description of such a graph. \n\nThe graph description should include:\n\n*  The number of vertices ($n$)\n*  The number of edges ($m$)\n*  $m$ pairs of integers ($a$, $b$) representing an edge between vertices $a$ and $b$.\n\nIf no such graph exists, output \"NO\". \n\n\n\nRemember:\n\n*  The graph cannot have multiple edges between the same two vertices.\n*  The graph must be connected.\n*  The graph must have at most $10^6$ vertices and $10^6$ edges."}, {"prompt_md5": "f67873a4", "template_md5": "465699a0", "result": "You are given a number k. Build a connected network where every point has k connections to other points.  The network must have at least one connection that, if removed, would split the network into two separate parts. If it's impossible to build such a network, say so."}]}