{"uid": "550-C", "url": "https://codeforces.com/contest/550/problem/C", "tags": ["brute force", " dp", " math"], "title": "550-C", "statement": "C. Divisibility by Eighttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a non-negative integern, its decimal representation consists of at most100digits and doesn't contain leading zeroes.Your task is to determine if it is possible in this case to remove some of the digits (possibly not remove any digit at all) so that the result contains at least one digit, forms a non-negative integer, doesn't have leading zeroes and is divisible by 8. After the removing, it is forbidden to rearrange the digits.If a solution exists, you should print it.InputThe single line of the input contains a non-negative integern. The representation of numberndoesn't contain any leading zeroes and its length doesn't exceed100digits.OutputPrint \"NO\" (without quotes), if there is no such way to remove some digits from numbern.Otherwise, print \"YES\" in the first line and the resulting number after removing digits from numbernin the second line. The printed number must be divisible by8.If there are multiple possible answers, you may print any of them.ExamplesInput3454OutputYES344Input10OutputYES0Input111111OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "01e8030d", "template_md5": "35d339e4", "result": "You are given a non-negative integer $n$.  Determine if you can remove some of the digits from $n$ (you can remove none) to create a new non-negative integer that:\n\n* Has at least one digit.\n* Does not have leading zeroes.\n* Is divisible by 8.\n\nIf such a number can be created, print \"YES\" followed by the resulting number. Otherwise, print \"NO\"."}, {"prompt_md5": "75897581", "template_md5": "465699a0", "result": "Given a number, can you remove some of its digits to create a new number that is divisible by 8? If so, print \"YES\" followed by the new number. Otherwise, print \"NO\"."}]}