{"uid": "553-B", "url": "https://codeforces.com/contest/553/problem/B", "tags": ["binary search", " combinatorics", " constructive algorithms", " greedy", " implementation", " math"], "title": "553-B", "statement": "B. Kyoya and Permutationtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's define the permutation of lengthnas an arrayp= [p1,p2, ...,pn]consisting ofndistinct integers from range from1ton. We say that this permutation maps value1into the valuep1, value2into the valuep2and so on.Kyota Ootori has just learned aboutcyclic representationof a permutation. Acycleis a sequence of numbers such that each element of this sequence is being mapped into the next element of this sequence (and the last element of the cycle is being mapped into the first element of the cycle). Thecyclic representationis a representation ofpas a collection of cycles formingp. For example, permutationp= [4, 1, 6, 2, 5, 3]has acyclic representationthat looks like(142)(36)(5)because 1 is replaced by 4, 4 is replaced by 2, 2 is replaced by 1, 3 and 6 are swapped, and 5 remains in place.Permutation may have several cyclic representations, so Kyoya defines thestandard cyclic representationof a permutation as follows. First, reorder the elements within each cycle so the largest element is first. Then, reorder all of the cycles so they are sorted by their first element. For our example above, thestandard cyclic representationof[4, 1, 6, 2, 5, 3]is(421)(5)(63).Now, Kyoya notices that if we drop the parenthesis in the standard cyclic representation, we get another permutation! For instance,[4, 1, 6, 2, 5, 3]will become[4, 2, 1, 5, 6, 3].Kyoya notices that some permutations don't change after applying operation described above at all. He wrote all permutations of lengthnthat do not change in a list in lexicographic order. Unfortunately, his friend Tamaki Suoh lost this list. Kyoya wishes to reproduce the list and he needs your help. Given the integersnandk, print the permutation that wask-th on Kyoya's list.InputThe first line will contain two integersn,k(1 ≤n≤ 50,1 ≤k≤min{1018,l}wherelis the length of the Kyoya's list).OutputPrintnspace-separated integers, representing the permutation that is the answer for the question.ExamplesInput4 3Output1 3 2 4Input10 1Output1 2 3 4 5 6 7 8 9 10NoteThe standard cycle representation is(1)(32)(4), which after removing parenthesis gives us the original permutation. The first permutation on the list would be[1, 2, 3, 4], while the second permutation would be[1, 2, 4, 3].", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d855f766", "template_md5": "35d339e4", "result": "You are given an integer $n$.  Find the $k$-th permutation of length $n$ that remains unchanged after removing the parentheses from its standard cycle representation.\n\nThe standard cycle representation of a permutation is found by:\n\n1. Ordering the elements within each cycle so the largest element is first.\n2. Ordering the cycles so they are sorted by their first element.\n\nFor example, the permutation $[4, 1, 6, 2, 5, 3]$ has the standard cycle representation $(421)(5)(63)$. Removing the parentheses gives us $[4, 2, 1, 5, 6, 3]$."}, {"prompt_md5": "f93dd0ad", "template_md5": "465699a0", "result": "Given a number *n*, find the *k*th permutation of length *n* that remains unchanged after removing parentheses from its standard cycle representation."}]}