{"uid": "554-B", "url": "https://codeforces.com/contest/554/problem/B", "tags": ["brute force", " greedy", " strings"], "title": "554-B", "statement": "B. Ohana Cleans Uptime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOhana Matsumae is trying to clean a room, which is divided up into annbyngrid of squares. Each square is initially either clean or dirty. Ohana can sweep her broom over columns of the grid. Her broom is very strange: if she sweeps over a clean square, it will become dirty, and if she sweeps over a dirty square, it will become clean. She wants to sweep some columns of the room to maximize the number of rows that are completely clean. It is not allowed to sweep over the part of the column, Ohana can only sweep the whole column.Return the maximum number of rows that she can make completely clean.InputThe first line of input will be a single integern(1 ≤n≤ 100).The nextnlines will describe the state of the room. Thei-th line will contain a binary string withncharacters denoting the state of thei-th row of the room. Thej-th character on this line is '1' if thej-th square in thei-th row is clean, and '0' if it is dirty.OutputThe output should be a single line containing an integer equal to a maximum possible number of rows that are completely clean.ExamplesInput40101100011110101Output2Input3111111111Output3NoteIn the first sample, Ohana can sweep the 1st and 3rd columns. This will make the 1st and 4th row be completely clean.In the second sample, everything is already clean, so Ohana doesn't need to do anything.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a7517ddb", "template_md5": "35d339e4", "result": "You are given a grid of squares, where each square is either clean (represented by 1) or dirty (represented by 0). You can sweep a whole column of the grid with a broom.  Sweeping a clean square makes it dirty, and sweeping a dirty square makes it clean. \n\nFind the maximum number of rows you can make completely clean by sweeping some columns. \n\n\nInput:\n\nThe first line contains an integer $n$ (1 ≤ $n$ ≤ 100), representing the number of rows.\n\nThe next $n$ lines each contain a binary string of length $n$ representing the state of each row.\n\nOutput:\n\nOutput a single integer representing the maximum number of rows that can be made completely clean."}, {"prompt_md5": "b2e1db96", "template_md5": "465699a0", "result": "You are given a grid of squares, each either clean or dirty. You can clean or dirty an entire column by sweeping over it.  What is the maximum number of rows you can make completely clean?"}]}