{"uid": "556-B", "url": "https://codeforces.com/contest/556/problem/B", "tags": ["brute force", " implementation"], "title": "556-B", "statement": "B. Case of Fake Numberstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAndrewid the Android is a galaxy-famous detective. He is now investigating a case of frauds who make fake copies of the famous Stolp's gears, puzzles that are as famous as the Rubik's cube once was.Its most important components are a button and a line ofnsimilar gears. Each gear hasnteeth containing all numbers from0ton- 1in the counter-clockwise order. When you push a button, the first gear rotatesclockwise, then the second gear rotatescounter-clockwise, the the third gear rotatesclockwisean so on.Besides, each gear has exactly one active tooth. When a gear turns, a new active tooth is the one following after the current active tooth according to the direction of the rotation. For example, ifn= 5, and the active tooth is the one containing number0, then clockwise rotation makes the tooth with number1active, or the counter-clockwise rotating makes the tooth number4active.Andrewid remembers that the real puzzle has the following property: you can push the button multiple times in such a way that in the end the numbers on the active teeth of the gears from first to last form sequence0, 1, 2, ...,n- 1. Write a program that determines whether the given puzzle is real or fake.InputThe first line contains integern(1 ≤n≤ 1000) — the number of gears.The second line containsndigitsa1,a2, ...,an(0 ≤ai≤n- 1) — the sequence of active teeth: the active tooth of thei-th gear contains numberai.OutputIn a single line print\"Yes\"(without the quotes), if the given Stolp's gears puzzle is real, and\"No\"(without the quotes) otherwise.ExamplesInput31 0 0OutputYesInput54 2 1 4 3OutputYesInput40 2 3 1OutputNoNoteIn the first sample test when you push the button for the first time, the sequence of active teeth will be2 2 1, when you push it for the second time, you get0 1 2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c2b6c554", "template_md5": "35d339e4", "result": "You are given a puzzle with $n$ gears. Each gear has $n$ teeth numbered from 0 to $n-1$.  Each gear has one active tooth. When a button is pressed, the gears rotate in a specific pattern:\n\n* The first gear rotates clockwise.\n* The second gear rotates counter-clockwise.\n* The third gear rotates clockwise, and so on.\n\nThe puzzle is considered \"real\" if you can press the button multiple times to make the active teeth of the gears form the sequence 0, 1, 2, ..., $n-1$.\n\nGiven the initial positions of the active teeth, determine if the puzzle is real or fake. \n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 1000), the number of gears.\n* The second line contains $n$ digits $a_1$, $a_2$, ..., $a_n$ (0 ≤ $a_i$ ≤ $n-1$), representing the initial active teeth of each gear.\n\nOutput:\n\n* Print \"Yes\" if the puzzle is real, and \"No\" otherwise."}, {"prompt_md5": "abba3aaf", "template_md5": "465699a0", "result": "You are given a sequence of numbers representing the active teeth on a set of gears.  The gears rotate in a pattern: clockwise, counter-clockwise, clockwise, etc.  Determine if it's possible to rotate the gears to create a sequence of numbers from 0 to n-1, where n is the number of gears."}]}