{"uid": "557-B", "url": "https://codeforces.com/contest/557/problem/B", "tags": ["constructive algorithms", " implementation", " math", " sortings"], "title": "557-B", "statement": "B. Pasha and Teatime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPasha decided to invite his friends to a tea party. For that occasion, he has a large teapot with the capacity ofwmilliliters and2ntea cups, each cup is for one of Pasha's friends. Thei-th cup can hold at mostaimilliliters of water.It turned out that among Pasha's friends there are exactlynboys and exactlyngirls and all of them are going to come to the tea party. To please everyone, Pasha decided to pour the water for the tea as follows:Pasha can boil the teapot exactly once by pouring there at mostwmilliliters of water;Pasha pours the same amount of water to each girl;Pasha pours the same amount of water to each boy;if each girl getsxmilliliters of water, then each boy gets2xmilliliters of water.In the other words, each boy should get two times more water than each girl does.Pasha is very kind and polite, so he wants to maximize the total amount of the water that he pours to his friends. Your task is to help him and determine the optimum distribution of cups between Pasha's friends.InputThe first line of the input contains two integers,nandw(1 ≤n≤ 105,1 ≤w≤ 109) — the number of Pasha's friends that are boys (equal to the number of Pasha's friends that are girls) and the capacity of Pasha's teapot in milliliters.The second line of the input contains the sequence of integersai(1 ≤ai≤ 109,1 ≤i≤ 2n) — the capacities of Pasha's tea cups in milliliters.OutputPrint a single real number — the maximum total amount of water in milliliters that Pasha can pour to his friends without violating the given conditions. Your answer will be considered correct if its absolute or relative error doesn't exceed10- 6.ExamplesInput2 41 1 1 1Output3Input3 184 4 4 2 2 2Output18Input1 52 3Output4.5NotePasha also has candies that he is going to give to girls but that is another task...", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "81149325", "template_md5": "35d339e4", "result": "You are given a teapot with a capacity of $w$ milliliters and $2n$ tea cups. Each cup has a maximum capacity of $a_i$ milliliters, where $1 \\le i \\le 2n$. \n\nThere are $n$ boys and $n$ girls attending a tea party.  \n\nYou must pour water into the teapot only once, and then distribute the water equally among the girls and boys, with each boy receiving twice the amount of water as each girl.\n\nFind the maximum total amount of water that can be poured to all the guests."}, {"prompt_md5": "5824273b", "template_md5": "465699a0", "result": "You have a container with a fixed capacity and a set of cups with varying capacities. You need to divide the container's capacity among the cups, with each cup receiving a certain amount of water.  The amount of water each cup receives must follow a specific rule: each \"girl\" cup gets a certain amount, and each \"boy\" cup gets twice that amount. Find the maximum total amount of water you can distribute while following this rule."}]}