{"uid": "559-E", "url": "https://codeforces.com/contest/559/problem/E", "tags": ["dp", " sortings"], "title": "559-E", "statement": "E. Gerald and Pathtime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe main walking trail in Geraldion is absolutely straight, and it passes strictly from the north to the south, it is so long that no one has ever reached its ends in either of the two directions. The Geraldionians love to walk on this path at any time, so the mayor of the city asked the Herald to illuminate this path with a few spotlights. The spotlights have already been delivered to certain places and Gerald will not be able to move them. Each spotlight illuminates a specific segment of the path of the given length, one end of the segment is the location of the spotlight, and it can be directed so that it covers the segment to the south or to the north of spotlight.The trail contains a monument to the mayor of the island, and although you can walk in either directions from the monument, no spotlight is south of the monument.You are given the positions of the spotlights and their power. Help Gerald direct all the spotlights so that the total length of the illuminated part of the path is as much as possible.InputThe first line contains integern(1 ≤n≤ 100) — the number of spotlights. Each of thenlines contains two space-separated integers,aiandli(0 ≤ai≤ 108,1 ≤li≤ 108). Numberaishows how much further thei-th spotlight to the north, and numberlishows the length of the segment it illuminates.It is guaranteed that all theai's are distinct.OutputPrint a single integer — the maximum total length of the illuminated part of the path.ExamplesInput31 12 23 3Output5Input41 23 34 36 2Output9", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c23104bf", "template_md5": "35d339e4", "result": "You are given $n$ spotlights placed at distinct points along a straight path. Each spotlight can illuminate a segment of the path to the north or south of its location. The length of the illuminated segment for each spotlight is fixed.  \n\nFind the maximum total length of the path that can be illuminated by all the spotlights.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), the number of spotlights.\n* Each of the next $n$ lines contains two space-separated integers, $a_i$ and $l_i$ (0 ≤ $a_i$ ≤ 10⁸, 1 ≤ $l_i$ ≤ 10⁸). \n    * $a_i$ represents the position of the $i$-th spotlight along the path.\n    * $l_i$ represents the length of the segment the $i$-th spotlight can illuminate.\n\n**Output:**\n\n* Print a single integer, the maximum total length of the illuminated path."}, {"prompt_md5": "f42703cd", "template_md5": "465699a0", "result": "You are given a number of spotlights placed at different points along a straight path. Each spotlight can illuminate a segment of the path to the north or south of its location.  Find the maximum total length of the path that can be illuminated by all the spotlights."}]}