{"uid": "56-D", "url": "https://codeforces.com/contest/56/problem/D", "tags": ["dp"], "title": "56-D", "statement": "D. Changing a Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere is a strings, consisting of capital Latin letters. Let's denote its current length as|s|. During one move it is allowed to apply one of the following operations to it:INSERTposch— insert a letterchin the stringsin the positionpos(1 ≤pos≤ |s| + 1,A≤ch≤Z). The letterchbecomes thepos-th symbol of the strings, at that the letters shift aside and the length of the string increases by 1.DELETEpos— delete a character numberpos(1 ≤pos≤ |s|) from the strings. At that the letters shift together and the length of the string decreases by 1.REPLACEposch— the letter in the positionposof the linesis replaced bych(1 ≤pos≤ |s|,A≤ch≤Z). At that the length of the string does not change.Your task is to find in which minimal number of moves one can get atstring from ansstring. You should also find the sequence of actions leading to the required results.InputThe first line containss, the second line containst. The lines consist only of capital Latin letters, their lengths are positive numbers from1to1000.OutputIn the first line print the number of moveskin the given sequence of operations. The number should be the minimal possible one. Then printklines containing one operation each. Print the operations in the format, described above. If there are several solutions, print any of them.ExamplesInputABAABBBAOutput2INSERT 3 BINSERT 4 BInputACCEPTEDWRONGANSWEROutput10REPLACE 1 WREPLACE 2 RREPLACE 3 OREPLACE 4 NREPLACE 5 GREPLACE 6 AINSERT 7 NINSERT 8 SINSERT 9 WREPLACE 11 R", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "42c951af", "template_md5": "35d339e4", "result": "You are given two strings,  *s* and *t*, each consisting of uppercase English letters.  \n\nYour task is to find the fewest number of operations needed to transform string *s* into string *t*.  \n\nYou can perform the following operations:\n\n* **INSERT pos ch:** Insert the letter 'ch' at position 'pos' in string *s*.  Letters after this position shift to the right.\n* **DELETE pos:** Delete the letter at position 'pos' in string *s*. Letters after this position shift to the left.\n* **REPLACE pos ch:** Replace the letter at position 'pos' in string *s* with the letter 'ch'.\n\nOutput the minimum number of operations required and a sequence of these operations that transforms *s* into *t*. If there are multiple solutions, any one will do."}, {"prompt_md5": "4a2ba6a8", "template_md5": "465699a0", "result": "You are given two strings.  Find the fewest operations needed to transform the first string into the second string.  The allowed operations are:\n\n* Insert a letter at a specific position.\n* Delete a letter at a specific position.\n* Replace a letter at a specific position with a different letter. \n\n\nLet me know if you'd like help with any specific part of the problem or need further clarification!"}]}