{"uid": "56-E", "url": "https://codeforces.com/contest/56/problem/E", "tags": ["binary search", " data structures", " sortings"], "title": "56-E", "statement": "E. Domino Principletime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya is interested in arranging dominoes. He is fed up with common dominoes and he uses the dominoes of different heights. He putndominoes on the table along one axis, going from left to right. Every domino stands perpendicular to that axis so that the axis passes through the center of its base. Thei-th domino has the coordinatexiand the heighthi. Now Vasya wants to learn for every domino, how many dominoes will fall if he pushes it to the right. Help him do that.Consider that a domino falls if it is touched strictly above the base. In other words, the fall of the domino with the initial coordinatexand heighthleads to the fall of all dominoes on the segment[x+ 1,x+h- 1].InputThe first line contains integern(1 ≤n≤ 105) which is the number of dominoes. Then follownlines containing two integersxiandhi(- 108≤xi≤ 108, 2 ≤hi≤ 108) each, which are the coordinate and height of every domino. No two dominoes stand on one point.OutputPrintnspace-separated numberszi— the number of dominoes that will fall if Vasya pushes thei-th domino to the right (including the domino itself).ExamplesInput416 520 510 1018 2Output3 1 4 1Input40 101 59 1015 10Output4 1 2 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3fd1114f", "template_md5": "35d339e4", "result": "You are given $n$ dominoes, each with a coordinate $x_i$ and a height $h_i$.  Dominoes are arranged along a line from left to right.  \n\nIf you push the $i$-th domino to the right, it will cause all dominoes with coordinates from $x_i + 1$ to $x_i + h_i - 1$ to fall.\n\nFor each domino, determine how many dominoes will fall if it is pushed to the right (including the domino itself). \n\n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "38da7c48", "template_md5": "465699a0", "result": "You are given a list of dominoes, each with a position and a height.  If you push a domino to the right, it will cause all dominoes to the right of it up to a certain distance to fall.  Determine how many dominoes will fall for each domino if it is pushed."}]}