{"uid": "560-B", "url": "https://codeforces.com/contest/560/problem/B", "tags": ["constructive algorithms", " implementation"], "title": "560-B", "statement": "B. Gerald is into Arttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputGerald bought two very rare paintings at the Sotheby's auction and he now wants to hang them on the wall. For that he bought a special board to attach it to the wall and place the paintings on the board. The board has shape of ana1×b1rectangle, the paintings have shape of aa2×b2anda3×b3rectangles.Since the paintings are painted in the style of abstract art, it does not matter exactly how they will be rotated, but still, one side of both the board, and each of the paintings must be parallel to the floor. The paintings can touch each other and the edges of the board, but can not overlap or go beyond the edge of the board. Gerald asks whether it is possible to place the paintings on the board, or is the board he bought not large enough?InputThe first line contains two space-separated numbersa1andb1— the sides of the board. Next two lines contain numbersa2,b2,a3andb3— the sides of the paintings. All numbersai,biin the input are integers and fit into the range from1to1000.OutputIf the paintings can be placed on the wall, print \"YES\" (without the quotes), and if they cannot, print \"NO\" (without the quotes).ExamplesInput3 21 32 1OutputYESInput5 53 33 3OutputNOInput4 22 31 2OutputYESNoteThat's how we can place the pictures in the first test:And that's how we can do it in the third one.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bae5499c", "template_md5": "465699a0", "result": "You have a rectangular board and two rectangular paintings. Can you fit both paintings onto the board without overlapping?"}, {"prompt_md5": "2b0f5b59", "template_md5": "35d339e4", "result": "You are given the dimensions of a rectangular board ($a_1 \\times b_1$) and two rectangular paintings ($a_2 \\times b_2$ and $a_3 \\times b_3$). Determine if it is possible to place both paintings on the board without overlapping or extending beyond the board's edges. \n\nThe paintings can be rotated, but one side of each painting and the board must be parallel to the floor. \n\nOutput \"YES\" if the paintings can be placed, and \"NO\" otherwise."}]}