{"uid": "566-E", "url": "https://codeforces.com/contest/566/problem/E", "tags": ["bitmasks", " constructive algorithms", " trees"], "title": "566-E", "statement": "E. Restoring Maptime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputArchaeologists found some information about an ancient land of Treeland. We know for sure that the Treeland consisted ofncities connected by then- 1road, such that you can get from each city to any other one along the roads. However, the information about the specific design of roads in Treeland has been lost. The only thing that the archaeologists can use is the preserved information aboutnearcities.Two cities of Treeland were callednear, if it were possible to move from one city to the other one by moving through at most two roads. Also, a city is considerednearto itself. During the recent excavations archaeologists found a set ofnnotes, each of them represents a list of cities,nearto some of thencities of the country. However, unfortunately, none of the found records lets you understand in what order the cities go in the list and for which city in the list thenearto it cities were listed.Help the archaeologists and restore any variant of the map of Treeland that meets the found information.InputThe first line contains integern(2 ≤n≤ 1000) — the number of cities in the country.Nextnlines describe the found lists ofnearcities. Each list starts from numberk(1 ≤k≤n), representing the number of cities in the list followed bykcity numbers. All numbers in each list are distinct.It is guaranteed that the given information determines at least one possible road map.OutputPrintn- 1pairs of numbers representing the roads of the country. Thei-th line must contain two integersai,bi(1 ≤ai,bi≤n,ai≠bi), showing that there is a road between citiesaiandbi.The answer you print must satisfy the description of close cities from the input. You may print the roads of the countries in any order. The cities that are connected by a road may also be printed in any order.If there are multiple good answers, you may print any of them.ExamplesInput54 3 2 4 15 5 3 2 4 15 4 2 1 5 34 2 1 4 33 1 4 5Output1 41 21 34 5Input65 6 1 3 4 25 2 1 3 4 66 3 6 2 5 4 16 6 1 2 5 3 43 5 2 45 3 1 2 4 6Output2 41 22 32 64 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a5a749e2", "template_md5": "35d339e4", "result": "You are given a list of cities and information about which cities are \"near\" each other. Two cities are considered \"near\" if you can travel between them in at most two steps.  \n\nYour task is to create a map of the cities and roads connecting them, following these rules:\n\n* There are $n$ cities, where $n$ is given in the input.\n* Each city must be connected to every other city by a path.\n* The map you create must satisfy the \"near\" relationships given in the input.\n\nThe input will provide a list of \"near\" city groups. Each group will have a number indicating how many cities are in the group, followed by the list of those cities.\n\nOutput the map as a list of road connections. Each road connection should be represented by a pair of city numbers (e.g., 1 4 means there is a road between city 1 and city 4)."}, {"prompt_md5": "d8bdb66a", "template_md5": "465699a0", "result": "You are given a list of pairs of cities that are \"close\" (reachable in at most two steps). Reconstruct a possible map of roads connecting these cities."}]}