{"uid": "567-C", "url": "https://codeforces.com/contest/567/problem/C", "tags": ["binary search", " data structures", " dp"], "title": "567-C", "statement": "C. Geometric Progressiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp loves geometric progressions very much. Since he was only three years old, he loves only the progressions of length three. He also has a favorite integerkand a sequencea, consisting ofnintegers.He wants to know how many subsequences of length three can be selected froma, so that they form a geometric progression with common ratiok.A subsequence of length three is a combination of three such indexesi1,i2,i3, that1 ≤i1<i2<i3≤n. That is, a subsequence of length three are such groups of three elements that are not necessarily consecutive in the sequence, but their indexes are strictly increasing.A geometric progression with common ratiokis a sequence of numbers of the formb·k0,b·k1, ...,b·kr- 1.Polycarp is only three years old, so he can not calculate this number himself. Help him to do it.InputThe first line of the input contains two integers,nandk(1 ≤n,k≤ 2·105), showing how many numbers Polycarp's sequence has and his favorite number.The second line containsnintegersa1,a2, ...,an(- 109≤ai≤ 109) — elements of the sequence.OutputOutput a single number — the number of ways to choose a subsequence of length three, such that it forms a geometric progression with a common ratiok.ExamplesInput5 21 1 2 2 4Output4Input3 11 1 1Output1Input10 31 2 6 2 3 6 9 18 3 9Output6NoteIn the first sample test the answer is four, as any of the two 1s can be chosen as the first element, the second element can be any of the 2s, and the third element of the subsequence must be equal to 4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4c577109", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers and an integer $k$.  Find the number of subsequences of length 3 that can be selected from the sequence, such that the subsequence forms a geometric progression with common ratio $k$.\n\nA geometric progression is a sequence of numbers where each term is equal to the previous term multiplied by a constant factor (the common ratio). \n\n\nFor example, 2, 6, 18 is a geometric progression with common ratio 3."}, {"prompt_md5": "418962b5", "template_md5": "465699a0", "result": "Given a list of numbers and a number k, count how many groups of three numbers from the list can be arranged so that each number is k times larger than the one before it."}]}