{"uid": "567-F", "url": "https://codeforces.com/contest/567/problem/F", "tags": ["dp"], "title": "567-F", "statement": "F. Mausoleumtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputKing of Berland Berl IV has recently died. Hail Berl V! As a sign of the highest achievements of the deceased king the new king decided to build a mausoleum with Berl IV's body on the main square of the capital.The mausoleum will be constructed from2nblocks, each of them has the shape of a cuboid. Each block has the bottom base of a1 × 1meter square. Among the blocks, exactly two of them have the height of one meter, exactly two have the height of two meters, ..., exactly two have the height ofnmeters.The blocks are arranged in a row without spacing one after the other. Of course, not every arrangement of blocks has the form of a mausoleum. In order to make the given arrangement in the form of the mausoleum, it is necessary that when you pass along the mausoleum, from one end to the other, the heights of the blocks first werenon-decreasing(i.e., increasing or remained the same), and then —non-increasing(decrease or remained unchanged). It is possible that any of these two areas will be omitted. For example, the following sequences of block height meet this requirement:[1, 2, 2, 3, 4, 4, 3, 1];[1, 1];[2, 2, 1, 1];[1, 2, 3, 3, 2, 1].Suddenly,kmore requirements appeared. Each of the requirements has the form: \"h[xi]signih[yi]\", whereh[t]is the height of thet-th block, and asigniis one of the five possible signs: '=' (equals), '<' (less than), '>' (more than), '<=' (less than or equals), '>=' (more than or equals). Thus, each of thekadditional requirements is given by a pair of indexesxi,yi(1 ≤xi,yi≤ 2n) and signsigni.Find the number of possible ways to rearrange the blocks so that both the requirement about the shape of the mausoleum (see paragraph 3) and thekadditional requirements were met.InputThe first line of the input contains integersnandk(1 ≤n≤ 35,0 ≤k≤ 100) — the number of pairs of blocks and the number of additional requirements.Nextklines contain listed additional requirements, one per line in the format \"xisigniyi\" (1 ≤xi,yi≤ 2n), and the sign is on of the list of the five possible signs.OutputPrint the sought number of ways.ExamplesInput3 0Output9Input3 12 > 3Output1Input4 13 = 6Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b026833c", "template_md5": "35d339e4", "result": "You are given $n$ pairs of blocks, each pair having a height of 1 meter, 2 meters, ..., $n$ meters.  You need to arrange these $2n$ blocks in a row to form a mausoleum.  \n\nThe mausoleum must follow these rules:\n\n1. The heights of the blocks must first increase or stay the same, then decrease or stay the same.\n2. You are given $k$ additional rules, each rule is in the form  $h_{x_i} \\text{sign} h_{y_i}$ where:\n    * $h_{x_i}$ and $h_{y_i}$ are the heights of two blocks.\n    * $\\text{sign}$ is one of the following: $=$, $<$, $>$, $\\le$, $\\ge$.\n\nFind the number of ways to arrange the blocks so that they satisfy both the mausoleum rules and the additional rules."}, {"prompt_md5": "76334a04", "template_md5": "465699a0", "result": "You have 2n blocks of equal width, with heights of 1, 2, ..., n meters each. You need to arrange them in a row so that the heights first increase and then decrease. You also have k additional rules, each specifying the relationship (equals, less than, greater than, less than or equal to, greater than or equal to) between the heights of two specific blocks.  Count the number of valid arrangements that satisfy both the shape rule and all the additional rules."}]}