{"uid": "567-A", "url": "https://codeforces.com/contest/567/problem/A", "tags": ["greedy", " implementation"], "title": "567-A", "statement": "A. Lineland Mailtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAll cities of Lineland are located on theOxcoordinate axis. Thus, each city is associated with its positionxi— a coordinate on theOxaxis. No two cities are located at a single point.Lineland residents love to send letters to each other. A person may send a letter only if the recipient lives in another city (because if they live in the same city, then it is easier to drop in).Strange but true, the cost of sending the letter is exactly equal to the distance between the sender's city and the recipient's city.For each city calculate two values ​​miniandmaxi, whereminiis the minimum cost of sending a letter from thei-th city to some other city, andmaxiis the the maximum cost of sending a letter from thei-th city to some other cityInputThe first line of the input contains integern(2 ≤n≤ 105) — the number of cities in Lineland. The second line contains the sequence ofndistinct integersx1,x2, ...,xn(- 109≤xi≤ 109), wherexiis thex-coordinate of thei-th city. All thexi's are distinct and follow inascendingorder.OutputPrintnlines, thei-th line must contain two integersmini,maxi, separated by a space, whereminiis the minimum cost of sending a letter from thei-th city, andmaxiis the maximum cost of sending a letter from thei-th city.ExamplesInput4-5 -2 2 7Output3 123 94 75 12Input2-1 1Output2 22 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c95a798f", "template_md5": "35d339e4", "result": "You are given a list of $n$ distinct cities located on a number line. Each city is represented by its position $x_i$ on the number line. \n\nFor each city $i$, find the minimum and maximum cost of sending a letter to another city. The cost of sending a letter is equal to the absolute difference between the positions of the sender and the recipient cities.\n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 10⁵) representing the number of cities.\n* The second line contains $n$ distinct integers $x_1$, $x_2$, ..., $x_n$ (-10⁹ ≤ $x_i$ ≤ 10⁹) representing the positions of the cities.\n\n**Output:**\n\nPrint $n$ lines, where the $i$-th line contains two integers separated by a space:\n\n* The first integer is the minimum cost of sending a letter from city $i$.\n* The second integer is the maximum cost of sending a letter from city $i$."}, {"prompt_md5": "13c080ca", "template_md5": "465699a0", "result": "You are given a list of distinct numbers representing the locations of cities on a line.  For each city, find the smallest and largest distances to any other city."}]}