{"uid": "568-A", "url": "https://codeforces.com/contest/568/problem/A", "tags": ["brute force", " implementation", " math", " number theory"], "title": "568-A", "statement": "A. Primes or Palindromes?time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRikhail Mubinchik believes that the current definition of prime numbers is obsolete as they are too complex and unpredictable. A palindromic number is another matter. It is aesthetically pleasing, and it has a number of remarkable properties. Help Rikhail to convince the scientific community in this!Let us remind you that a number is calledprimeif it is integer larger than one, and is not divisible by any positive integer other than itself and one.Rikhail calls a number apalindromicif it is integer, positive, and its decimal representation without leading zeros is a palindrome, i.e. reads the same from left to right and right to left.One problem with prime numbers is that there are too many of them. Let's introduce the following notation:π(n)— the number of primes no larger thann,rub(n)— the number of palindromic numbers no larger thann. Rikhail wants to prove that there are a lot more primes than palindromic ones.He asked you to solve the following problem: for a given value of the coefficientAfind the maximumn, such thatπ(n) ≤A·rub(n).InputThe input consists of two positive integersp,q, the numerator and denominator of the fraction that is the value ofA(,).OutputIf such maximum number exists, then print it. Otherwise, print\"Palindromic tree is better than splay tree\"(without the quotes).ExamplesInput1 1Output40Input1 42Output1Input6 4Output172", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "77fb515a", "template_md5": "35d339e4", "result": "Given a fraction $A = \\frac{p}{q}$, find the largest number $n$ such that the number of primes less than or equal to $n$ ($\\pi(n)$) is less than or equal to $A$ times the number of palindromic numbers less than or equal to $n$ ($\\text{rub}(n)$). If no such number exists, print \"Palindromic tree is better than splay tree\"."}, {"prompt_md5": "c1cff218", "template_md5": "465699a0", "result": "Find the largest number where the count of prime numbers less than or equal to that number is less than or equal to a given fraction of the count of palindromic numbers less than or equal to that number. If no such number exists, print a specific phrase."}]}