{"uid": "570-E", "url": "https://codeforces.com/contest/570/problem/E", "tags": ["combinatorics", " dp"], "title": "570-E", "statement": "E. Pig and Palindromestime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPeppa the Pig was walking and walked into the forest. What a strange coincidence! The forest has the shape of a rectangle, consisting ofnrows andmcolumns. We enumerate the rows of the rectangle from top to bottom with numbers from1ton, and the columns — from left to right with numbers from1tom. Let's denote the cell at the intersection of ther-th row and thec-th column as(r,c).Initially the pig stands in cell(1, 1), and in the end she wants to be in cell(n,m). Since the pig is in a hurry to get home, she can go from cell(r,c), only to either cell(r+ 1,c)or(r,c+ 1). She cannot leave the forest.The forest, where the pig is, is very unusual. Some cells of the forest similar to each other, and some look very different. Peppa enjoys taking pictures and at every step she takes a picture of the cell where she is now. The path through the forest is considered to bebeautifulif photographs taken on her way, can be viewed in both forward and in reverse order, showing the same sequence of photos. More formally, the line formed by the cells in order of visiting should be apalindrome(you can read a formal definition of a palindrome in the previous problem).Count the number of beautiful paths from cell(1, 1)to cell(n,m). Since this number can be very large, determine the remainder after dividing it by109+ 7.InputThe first line contains two integersn,m(1 ≤n,m≤ 500) — the height and width of the field.Each of the followingnlines containsmlowercase English letters identifying the types of cells of the forest. Identical cells are represented by identical letters, different cells are represented by different letters.OutputPrint a single integer — the number of beautiful paths modulo109+ 7.ExamplesInput3 4aaabbaaaabbaOutput3NotePicture illustrating possibilities for the sample test.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f4d14e2d", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$.  Each cell in the grid can be one of several different types.  \n\nYou start at the top-left corner of the grid and want to reach the bottom-right corner. You can only move down or right at each step.\n\nA path is considered \"beautiful\" if the sequence of cell types you encounter along the path reads the same forwards and backwards (i.e., it is a palindrome).\n\nCount the number of beautiful paths from the top-left corner to the bottom-right corner.  Since the number of paths can be large, output the remainder when the count is divided by $10^9 + 7$."}, {"prompt_md5": "3300942d", "template_md5": "465699a0", "result": "You have a grid of cells. Each cell has a type. You start at the top left cell and must reach the bottom right cell, moving only down or right.  Count how many paths you can take where the order of cell types you encounter going down and right is the same as going up and left.  The answer should be the remainder when divided by 10^9 + 7."}]}