{"uid": "570-B", "url": "https://codeforces.com/contest/570/problem/B", "tags": ["constructive algorithms", " games", " greedy", " implementation", " math"], "title": "570-B", "statement": "B. Simple Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOne day Misha and Andrew were playing a very simple game. First, each player chooses an integer in the range from1ton. Let's assume that Misha chose numberm, and Andrew chose numbera.Then, by using a random generator they choose a random integercin the range between1andn(any integer from1tonis chosen with the same probability), after which the winner is the player, whose number was closer toc. The boys agreed that ifmandaare located on the same distance fromc, Misha wins.Andrew wants to win very much, so he asks you to help him. You know the number selected by Misha, and numbern. You need to determine which value ofaAndrew must choose, so that the probability of his victory is the highest possible.More formally, you need to find such integera(1 ≤a≤n), that the probability thatis maximal, wherecis the equiprobably chosen integer from1ton(inclusive).InputThe first line contains two integersnandm(1 ≤m≤n≤ 109) — the range of numbers in the game, and the number selected by Misha respectively.OutputPrint a single number — such valuea, that probability that Andrew wins is the highest. If there are multiple such values, print the minimum of them.ExamplesInput3 1Output2Input4 3Output2NoteIn the first sample test: Andrew wins ifcis equal to2or3. The probability that Andrew wins is2 / 3. If Andrew choosesa= 3, the probability of winning will be1 / 3. Ifa= 1, the probability of winning is0.In the second sample test: Andrew wins ifcis equal to1and2. The probability that Andrew wins is1 / 2. For other choices ofathe probability of winning is less.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "298f31ad", "template_md5": "35d339e4", "result": "Two players choose integers between 1 and $n$.  One player chooses $m$, the other chooses $a$. A random integer $c$ is chosen between 1 and $n$. The player whose chosen number is closer to $c$ wins. If the numbers are the same distance from $c$, the player who chose $m$ wins.\n\nGiven $m$ and $n$, find the value of $a$ that maximizes the probability of winning."}, {"prompt_md5": "06e512e8", "template_md5": "465699a0", "result": "Two players choose numbers between 1 and a given limit. A random number is then chosen. The player whose chosen number is closer to the random number wins, unless the numbers are the same distance away, in which case the first player wins.  Given one player's number and the limit, find the number the second player should choose to maximize their chances of winning."}]}