{"uid": "570-D", "url": "https://codeforces.com/contest/570/problem/D", "tags": ["binary search", " bitmasks", " constructive algorithms", " dfs and similar", " graphs", " trees"], "title": "570-D", "statement": "D. Tree Requeststime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRoman planted a tree consisting ofnvertices. Each vertex contains a lowercase English letter. Vertex1is the root of the tree, each of then- 1remaining vertices has aparentin the tree. Vertex is connected with its parent by an edge. The parent of vertexiis vertexpi, the parent index is always less than the index of the vertex (i.e.,pi<i).Thedepthof the vertex is the number of nodes on the path from the root tovalong the edges. In particular, the depth of the root is equal to1.We say that vertexuis in thesubtreeof vertexv, if we can get fromutov, moving from the vertex to the parent. In particular, vertexvis in its subtree.Roma gives youmqueries, thei-th of which consists of two numbersvi,hi. Let's consider the vertices in the subtreevilocated at depthhi. Determine whether you can use the letters written at these vertices to make a string that is apalindrome. The letters that are written in the vertexes, can be rearranged in any order to make a palindrome, but all letters should be used.InputThe first line contains two integersn,m(1 ≤n,m≤ 500 000) — the number of nodes in the tree and queries, respectively.The following line containsn- 1integersp2,p3, ...,pn— the parents of vertices from the second to then-th (1 ≤pi<i).The next line containsnlowercase English letters, thei-th of these letters is written on vertexi.Nextmlines describe the queries, thei-th line contains two numbersvi,hi(1 ≤vi,hi≤n) — the vertex and the depth that appear in thei-th query.OutputPrintmlines. In thei-th line print \"Yes\" (without the quotes), if in thei-th query you can make a palindrome from the letters written on the vertices, otherwise print \"No\" (without the quotes).ExamplesInput6 51 1 1 3 3zacccd1 13 34 16 11 2OutputYesNoYesYesYesNoteStringsis apalindromeif reads the same from left to right and from right to left. In particular, an empty string is a palindrome.Clarification for the sample test.In the first query there exists only a vertex 1 satisfying all the conditions, we can form a palindrome \"z\".In the second query vertices 5 and 6 satisfy condititions, they contain letters \"с\" and \"d\" respectively. It is impossible to form a palindrome of them.In the third query there exist no vertices at depth 1 and in subtree of 4. We may form an empty palindrome.In the fourth query there exist no verticesin subtree of 6 at depth 1. We may form an empty palindrome.In the fifth query there vertices 2, 3 and 4 satisfying all conditions above, they contain letters \"a\", \"c\" and \"c\". We may form a palindrome \"cac\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7ea7ca15", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes. Each node has a lowercase English letter.  The root of the tree is node 1. The depth of a node is the number of edges on the path from the root to that node.\n\nYou are given $m$ queries. Each query consists of two numbers, $v$ and $h$.  For each query, you need to determine if you can make a palindrome using the letters from all the nodes in the subtree of node $v$ that are at depth $h$.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 500,000$), the number of nodes and the number of queries.\n* The second line contains $n-1$ integers, $p_2, p_3, ..., p_n$ ($1 \\le p_i < i$), representing the parent of each node (node $i$ has parent $p_i$).\n* The third line contains $n$ lowercase English letters, one for each node.\n* The next $m$ lines describe the queries, each line containing two integers, $v$ and $h$ ($1 \\le v, h \\le n$).\n\n**Output:**\n\nPrint $m$ lines, one for each query. For each query, print \"Yes\" if you can make a palindrome from the letters in the subtree of node $v$ at depth $h$, and \"No\" otherwise."}, {"prompt_md5": "5298c576", "template_md5": "465699a0", "result": "You are given a tree with labeled nodes.  You need to determine for each query, if you can make a palindrome using the letters from the nodes at a specific depth within a given subtree."}]}