{"uid": "571-C", "url": "https://codeforces.com/contest/571/problem/C", "tags": ["constructive algorithms", " dfs and similar", " graphs", " greedy"], "title": "571-C", "statement": "C. CNF 2time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard output'In Boolean logic, a formula is in conjunctive normal form (CNF) or clausal normal form if it is a conjunction of clauses, where a clause is a disjunction of literals' (cited from https://en.wikipedia.org/wiki/Conjunctive_normal_form)In the other words, CNF is a formula of type, where&represents a logical \"AND\" (conjunction),represents a logical \"OR\" (disjunction), andvijare some boolean variables or their negations. Each statement in brackets is called aclause, andvijare calledliterals.You are given a CNF containing variablesx1, ...,xmand their negations. We know that each variable occurs in at most two clauses (with negation and without negation in total). Your task is to determine whether this CNF issatisfiable, that is, whether there are such values of variables where the CNF value is true. If CNF is satisfiable, then you also need to determine the values of the variables at which the CNF is true.It is guaranteed that each variable occurs at most once in each clause.InputThe first line contains integersnandm(1 ≤n,m≤ 2·105) — the number of clauses and the number variables, correspondingly.Nextnlines contain the descriptions of each clause. Thei-th line first contains first numberki(ki≥ 1) — the number of literals in thei-th clauses. Then follow space-separated literalsvij(1 ≤ |vij| ≤m). A literal that corresponds tovijisx|vij|either with negation, ifvijis negative, or without negation otherwise.OutputIf CNF is not satisfiable, print a single line \"NO\" (without the quotes), otherwise print two strings: string \"YES\" (without the quotes), and then a string ofmnumbers zero or one — the values of variables in satisfying assignment in the order fromx1toxm.ExamplesInput2 22 1 -22 2 -1OutputYES11Input4 31 11 23 -1 -2 31 -3OutputNOInput5 62 1 23 1 -2 34 -3 5 4 62 -6 -41 5OutputYES100010NoteIn the first sample test formula is. One of possible answer isx1=TRUE,x2=TRUE.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cc0df654", "template_md5": "465699a0", "result": "You are given a set of logical statements. Each statement is a combination of \"AND\" and \"OR\" operations on variables (and their opposites).  Determine if there is a way to assign true or false values to the variables so that all the statements are true. If so, list the true/false values for each variable."}, {"prompt_md5": "e8460dc9", "template_md5": "35d339e4", "result": "You are given a set of logical statements. Each statement is a combination of \"AND\" and \"OR\" operations on variables (like x1, x2, etc.) and their opposites (not x1, not x2, etc.).  \n\nYour task is to determine:\n\n1. **Is it possible to find values for the variables that make all the statements true at the same time?**\n\n2. **If it is possible, what are those values?**\n\n**Here's how the statements are written:**\n\n* **AND** is represented by the symbol \"&\"\n* **OR** is represented by the symbol \"|\"\n* A variable (like x1) or its opposite (not x1) is called a \"literal\"\n\n**Example:**\n\nA statement could look like this: (x1 & not x2) | (x3 | x4) \n\n\nYou will be given a list of these statements."}]}