{"uid": "571-D", "url": "https://codeforces.com/contest/571/problem/D", "tags": ["binary search", " data structures", " dsu", " trees"], "title": "571-D", "statement": "D. Campustime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOscolcovo city has a campus consisting ofnstudent dormitories,nuniversities andnmilitary offices. Initially, thei-th dormitory belongs to thei-th university and is assigned to thei-th military office.Life goes on and the campus is continuously going through some changes. The changes can be of four types:Universityajmerges with universitybj. After that all the dormitories that belonged to universitybjare assigned to to universityaj, and universitybjdisappears.Military officecjmerges with military officedj. After that all the dormitories that were assigned to military officedj, are assigned to military officecj, and military officedjdisappears.Students of universityxjmove in dormitories. Letskxjis the number of dormitories that belong to this university at the time when the students move in. Then the number of students in each dormitory of universityxjincreases bykxj(note that the more dormitories belong to the university, the more students move in each dormitory of the university).Military office numberyjconducts raids on all the dormitories assigned to it and takes all students from there.Thus, at each moment of time each dormitory is assigned to exactly one university and one military office. Initially, all the dormitory are empty.Your task is to process the changes that take place in the campus and answer the queries, how many people currently live in dormitoryqj.InputThe first line contains two integers,nandm(1 ≤n,m≤ 5·105)— the number of dormitories and the number of queries, respectively.Nextmlines contain the queries, each of them is given in one of the following formats:«Uajbj» — merging universities;«Mcjdj» — merging military offices;«Axj» — students of universityxjmoving in the dormitories;«Zyj» — a raid in military officeyj;«Qqj» — a query asking the number of people in dormitoryqj.All the numbers in the queries are positive integers and do not exceedn. It is guaranteed that at the moment of the query the universities and military offices, that are present in the query, exist.OutputIn thei-th line print the answer to thei-th query asking the number of people in the dormitory.ExamplesInput2 7A 1Q 1U 1 2A 1Z 1Q 1Q 2Output102Input5 12U 1 2M 4 5A 1Q 1A 3A 4Q 3Q 4Z 4Q 4A 5Q 5Output21101NoteConsider the first sample test:In the first query university 1 owns only dormitory 1, so after the query dormitory 1 will have 1 student.After the third query university 1 owns dormitories 1 and 2.The fourth query increases by 2 the number of students living in dormitories 1 and 2 that belong to university number 1. After that 3 students live in the first dormitory and 2 students live in the second dormitory.At the fifth query the number of students living in dormitory 1, assigned to the military office 1, becomes zero.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97d7d6fe", "template_md5": "35d339e4", "result": "There are $n$ dormitories, $n$ universities, and $m$ military offices.  \n\nInitially, each dormitory belongs to a university and is assigned to a military office.\n\nThere are four types of changes:\n\n1. **University Merge:** University $a$ merges with university $b$. All dormitories belonging to university $b$ are assigned to university $a$, and university $b$ disappears.\n2. **Military Office Merge:** Military office $c$ merges with military office $d$. All dormitories assigned to military office $d$ are assigned to military office $c$, and military office $d$ disappears.\n3. **Student Move-In:** Students from university $x$ move into the dormitories. The number of students in each dormitory of university $x$ increases by $k_x$ (where $k_x$ is the number of dormitories belonging to university $x$ at the time).\n4. **Military Raid:** Military office $y$ conducts a raid on all the dormitories assigned to it, taking all the students from there.\n\nYou are given a sequence of these changes and $m$ queries. Each query asks for the number of students currently living in dormitory $q$.\n\n**Output:** For each query, print the number of students in dormitory $q$."}, {"prompt_md5": "3f399194", "template_md5": "465699a0", "result": "You are given a number of buildings and a number of queries.  \n\nBuildings can be grouped into sets.  \n\nThere are four types of operations:\n\n1. Merge two sets.\n2. Merge two sets.\n3. Add people to buildings in a set.\n4. Remove all people from buildings in a set.\n\nFor each query, you need to find the number of people in a specific building."}]}