{"uid": "573-C", "url": "https://codeforces.com/contest/573/problem/C", "tags": ["constructive algorithms", " dfs and similar", " trees"], "title": "573-C", "statement": "C. Bear and Drawingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLimak is a little bear who learns to draw. People usually start with houses, fences and flowers but why would bears do it? Limak lives in the forest and he decides to draw a tree.Recall thattreeis a connected graph consisting ofnvertices andn- 1edges.Limak chose a tree withnvertices. He has infinite strip of paper with two parallel rows of dots. Little bear wants to assign vertices of a tree to somendistinct dots on a paper so that edges would intersect only at their endpoints — drawn tree must be planar. Below you can see one of correct drawings for the first sample test.Is it possible for Limak to draw chosen tree?InputThe first line contains single integern(1 ≤n≤ 105).Nextn- 1lines contain description of a tree.i-th of them contains two space-separated integersaiandbi(1 ≤ai,bi≤n,ai≠bi) denoting an edge between verticesaiandbi. It's guaranteed that given description forms a tree.OutputPrint \"Yes\" (without the quotes) if Limak can draw chosen tree. Otherwise, print \"No\" (without the quotes).ExamplesInput81 21 31 66 46 76 57 8OutputYesInput131 21 31 42 52 62 73 83 93 104 114 124 13OutputNo", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2bf0f989", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices and $n-1$ edges.  Each edge connects two distinct vertices.  \n\nDetermine if it is possible to draw this tree on a piece of paper with two parallel rows of dots so that the edges intersect only at their endpoints.\n\n**Input:**\n\n* The first line contains a single integer $n$ (1 ≤ $n$ ≤ 10⁵), representing the number of vertices.\n* The next $n-1$ lines each contain two space-separated integers $a_i$ and $b_i$ (1 ≤ $a_i$, $b_i$ ≤ $n$, $a_i$ ≠ $b_i$), representing an edge between vertices $a_i$ and $b_i$.\n\n**Output:**\n\n* Print \"Yes\" if it is possible to draw the tree, otherwise print \"No\"."}, {"prompt_md5": "6fa1de63", "template_md5": "465699a0", "result": "Given a list of connections between points, determine if it's possible to arrange the points on a two-rowed grid so that the connections don't overlap except at their endpoints."}]}