{"uid": "574-B", "url": "https://codeforces.com/contest/574/problem/B", "tags": ["brute force", " dfs and similar", " graphs", " hashing"], "title": "574-B", "statement": "B. Bear and Three Musketeerstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDo you know a story about the three musketeers? Anyway, you will learn about its origins now.Richelimakieu is a cardinal in the city of Bearis. He is tired of dealing with crime by himself. He needs three brave warriors to help him to fight against bad guys.There arenwarriors. Richelimakieu wants to choose three of them to become musketeers but it's not that easy. The most important condition is that musketeers must know each other to cooperate efficiently. And they shouldn't be too well known because they could be betrayed by old friends. For each musketeer hisrecognitionis the number of warriors he knows, excluding other two musketeers.Help Richelimakieu! Find if it is possible to choose three musketeers knowing each other, and what is minimum possible sum of their recognitions.InputThe first line contains two space-separated integers,nandm(3 ≤n≤ 4000,0 ≤m≤ 4000) — respectively number of warriors and number of pairs of warriors knowing each other.i-th of the followingmlines contains two space-separated integersaiandbi(1 ≤ai,bi≤n,ai≠bi). Warriorsaiandbiknow each other. Each pair of warriors will be listed at most once.OutputIf Richelimakieu can choose three musketeers, print the minimum possible sum of their recognitions. Otherwise, print \"-1\" (without the quotes).ExamplesInput5 61 21 32 32 43 44 5Output2Input7 42 13 65 11 7Output-1NoteIn the first sample Richelimakieu should choose a triple1,2,3. The first musketeer doesn't know anyone except other two musketeers so his recognition is0. The second musketeer has recognition1because he knows warrior number4. The third musketeer also has recognition1because he knows warrior4. Sum of recognitions is0 + 1 + 1 = 2.The other possible triple is2, 3, 4but it has greater sum of recognitions, equal to1 + 1 + 1 = 3.In the second sample there is no triple of warriors knowing each other.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8fec73be", "template_md5": "35d339e4", "result": "You are given a list of $n$ warriors and $m$ pairs of warriors who know each other.  Each warrior has a \"recognition\" value which is the number of other warriors they know, excluding the two other warriors chosen to be musketeers.\n\nFind if it is possible to choose three warriors to be musketeers such that they all know each other. If it is possible, output the minimum possible sum of their recognition values. Otherwise, output -1."}, {"prompt_md5": "0976e53b", "template_md5": "465699a0", "result": "You are given a group of people and a list of pairs who know each other.  Find three people from the group who all know each other, and whose combined number of acquaintances (excluding the other two chosen people) is as small as possible. If no such group of three exists, output -1."}]}