{"uid": "575-D", "url": "https://codeforces.com/contest/575/problem/D", "tags": ["constructive algorithms", " implementation"], "title": "575-D", "statement": "D. Tablecitytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere was a big bank robbery in Tablecity. In order to catch the thief, the President called none other than Albert – Tablecity’s Chief of Police. Albert does not know where the thief is located, but he does know how he moves.Tablecity can be represented as1000 × 2grid, where every cell represents one district. Each district has its own unique name “(X,Y)”, whereXandYare the coordinates of the district in the grid. The thief’s movement is asEvery hour the thief will leave the district(X,Y)he is currently hiding in, and move to one of the districts:(X- 1,Y),(X+ 1,Y),(X- 1,Y- 1),(X- 1,Y+ 1),(X+ 1,Y- 1),(X+ 1,Y+ 1)as long as it exists in Tablecity.Below is an example of thief’s possible movements if he is located in district (7,1):Albert has enough people so thatevery hourhe can pick anytwodistricts in Tablecity and fully investigate them, making sure that if the thief is located in one of them, he will get caught. Albert promised the President that the thief will be caught inno morethan 2015 hours and needs your help in order to achieve that.InputThere is no input for this problem.OutputThe first line of output contains integerN– duration of police search in hours. Each of the followingNlines contains exactly 4 integersXi1,Yi1,Xi2,Yi2separated by spaces, that represent 2 districts (Xi1,Yi1), (Xi2,Yi2) which got investigated during i-th hour. Output is given inchronologicalorder (i-th line contains districts investigated during i-th hour) and shouldguaranteethat the thief is caught in no more than 2015 hours,regardless of thief’s initial position and movement.N≤ 20151 ≤X≤ 10001 ≤Y≤ 2ExamplesInputВ этой задаче нет примеров ввода-вывода.This problem doesn't have sample input and output.OutputСмотрите замечание ниже.See the note below.NoteLet's consider the following output:25 1 50 28 1 80 2This output is not guaranteed to catch the thief and is not correct. It is given to you only to show the expected output format. There exists a combination of an initial position and a movement strategy such that the police will not catch the thief.Consider the following initial position and thief’s movement:In the first hour, the thief is located in district (1,1). Police officers will search districts (5,1) and (50,2) and will not find him.At the start of the second hour, the thief moves to district (2,2). Police officers will search districts (8,1) and (80,2) and will not find him.Since there is no further investigation by the police, the thief escaped!", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2db22e2d", "template_md5": "35d339e4", "result": "A thief is hiding in a city that is a 1000 x 2 grid.  The thief can move one square in any of the six directions (up, down, left, right, or diagonals) each hour.  \n\nThe police can investigate any two squares in the city each hour.  \n\nYour task is to determine a sequence of pairs of squares that the police should investigate to guarantee that they catch the thief within 2015 hours, no matter where the thief starts or how they move. \n\n\nOutput the number of hours the police will search ($N$) followed by $N$ lines, each containing four integers representing the two squares investigated during each hour."}, {"prompt_md5": "e2adc365", "template_md5": "465699a0", "result": "A thief is moving in a 1000x2 grid.  Every hour, the thief can move to one of six adjacent cells. You need to determine a sequence of pairs of cells to investigate each hour so that the thief is caught within 2015 hours, no matter where they start or how they move."}]}