{"uid": "576-C", "url": "https://codeforces.com/contest/576/problem/C", "tags": ["constructive algorithms", " divide and conquer", " geometry", " greedy", " sortings"], "title": "576-C", "statement": "C. Points on Planetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn a plane arenpoints (xi,yi) with integer coordinates between0and106. The distance between the two points with numbersaandbis said to be the following value:(the distance calculated by such formula is calledManhattan distance).We call a hamiltonian path to be some permutationpiof numbers from1ton. We say that the length of this path is value.Find some hamiltonian path with a length of no more than25 × 108. Note that you do not have to minimize the path length.InputThe first line contains integern(1 ≤n≤ 106).Thei+ 1-th line contains the coordinates of thei-th point:xiandyi(0 ≤xi,yi≤ 106).It is guaranteed that no two points coincide.OutputPrint the permutation of numberspifrom1ton— the sought Hamiltonian path. The permutation must meet the inequality.If there are multiple possible answers, print any of them.It is guaranteed that the answer exists.ExamplesInput50 78 103 45 09 12Output4 3 1 2 5NoteIn the sample test the total distance is:(|5 - 3| + |0 - 4|) + (|3 - 0| + |4 - 7|) + (|0 - 8| + |7 - 10|) + (|8 - 9| + |10 - 12|) = 2 + 4 + 3 + 3 + 8 + 3 + 1 + 2 = 26", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "55af5a26", "template_md5": "35d339e4", "result": "You are given a set of points on a plane, each with integer coordinates between 0 and 10^6. The distance between two points (x1, y1) and (x2, y2) is calculated as  $|x1 - x2| + |y1 - y2|$.\n\nYour task is to find a path that visits each point exactly once and returns to the starting point. This path is called a Hamiltonian path.  The path length must be no more than 25 * 10^8.\n\nYou need to output the order in which the points should be visited in the Hamiltonian path. \n\n**Input:**\n\n* The first line contains the number of points (n).\n* Each of the following n lines contains the x and y coordinates of a point.\n\n**Output:**\n\n* A sequence of numbers from 1 to n, representing the order of points in the Hamiltonian path.\n\n\n\nLet me know if you'd like me to clarify any part of the problem."}, {"prompt_md5": "cf3971d4", "template_md5": "465699a0", "result": "You are given a set of points on a grid. Find a path that visits each point exactly once and returns to the starting point. The path length is the sum of the distances between consecutive points.  You need to find a path with a length no greater than 25 * 10^8."}]}