{"uid": "578-B", "url": "https://codeforces.com/contest/578/problem/B", "tags": ["brute force", " greedy"], "title": "578-B", "statement": "B. \"Or\" Gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are givennnumbersa1,a2, ...,an. You can perform at mostkoperations. For each operation you can multiply one of the numbers byx. We want to makeas large as possible, wheredenotes the bitwise OR.Find the maximum possible value ofafter performing at mostkoperations optimally.InputThe first line contains three integersn,kandx(1 ≤n≤ 200 000,1 ≤k≤ 10,2 ≤x≤ 8).The second line containsnintegersa1,a2, ...,an(0 ≤ai≤ 109).OutputOutput the maximum value of a bitwise OR of sequence elements after performing operations.ExamplesInput3 1 21 1 1Output3Input4 2 31 2 4 8Output79NoteFor the first sample, any possible choice of doing one operation will result the same three numbers1,1,2so the result is.For the second sample if we multiply8by3two times we'll get72. In this case the numbers will become1,2,4,72so the OR value will be79and is the largest possible result.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "72843907", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ numbers ($a_1$, $a_2$, ..., $a_n$). You can multiply at most $k$ of these numbers by $x$.  The goal is to find the largest possible value of the bitwise OR of all the numbers in the sequence after performing these operations.\n\n**Input:**\n\n* The first line contains three integers: $n$, $k$, and $x$ ($1 \\le n \\le 200,000$, $1 \\le k \\le 10$, $2 \\le x \\le 8$).\n* The second line contains $n$ integers: $a_1$, $a_2$, ..., $a_n$ ($0 \\le a_i \\le 10^9$).\n\n**Output:**\n\n* Output the maximum possible value of the bitwise OR of the sequence elements after performing the operations."}, {"prompt_md5": "f9a67789", "template_md5": "465699a0", "result": "You have a list of numbers. You can multiply one number by a given value a limited number of times. What is the largest possible sum of all the numbers in the list after these multiplications?"}]}