{"uid": "58-C", "url": "https://codeforces.com/contest/58/problem/C", "tags": ["brute force"], "title": "58-C", "statement": "C. Treestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOn Bertown's main streetntrees are growing, the tree numberihas the height ofaimeters (1 ≤i≤n). By the arrival of the President of Berland these trees were decided to be changed so that their heights formed abeautifulsequence. This means that the heights of trees on ends (the1st one and then-th one) should be equal to each other, the heights of the2-nd and the(n- 1)-th tree must also be equal to each other, at that the height of the2-nd tree should be larger than the height of the first tree by1, and so on. In other words, the heights of the trees, standing at equal distance from the edge (of one end of the sequence) must be equal to each other, and with the increasing of the distance from the edge by1the tree height must also increase by1. For example, the sequences \"2 3 4 5 5 4 3 2\" and \"1 2 3 2 1\" are beautiful, and '1 3 3 1\" and \"1 2 3 1\" are not.Changing the height of a tree is a very expensive operation, using advanced technologies invented by Berland scientists. In one operation you can choose any tree and change its height to any number, either increase or decrease. Note that even after the change the height should remain a positive integer, i. e, it can't be less than or equal to zero. Identify the smallest number of changes of the trees' height needed for the sequence of their heights to become beautiful.InputThe first line contains integern(1 ≤n≤ 105) which is the number of trees. The second line contains integersai(1 ≤ai≤ 105) which are the heights of the trees.OutputPrint a single number which is the minimal number of trees whose heights will have to be changed for the sequence to become beautiful.ExamplesInput32 2 2Output1Input41 2 2 1Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2de79dc5", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers ($1 \\le n \\le 10^5$) representing the heights of trees.  A beautiful sequence is one where the heights increase by 1 as you move from the edges towards the center. For example, the sequence [2, 3, 4, 5, 5, 4, 3, 2] is beautiful.\n\nFind the minimum number of trees that need to have their heights changed to make the sequence beautiful. You can increase or decrease the height of a tree to any positive integer."}, {"prompt_md5": "fdb28f6e", "template_md5": "465699a0", "result": "You are given a list of numbers representing the heights of trees.  You need to change some of the heights so that the list forms a specific pattern: the heights increase by 1 as you move from the beginning to the middle of the list.  Find the minimum number of heights you need to change."}]}