{"uid": "58-E", "url": "https://codeforces.com/contest/58/problem/E", "tags": ["dp"], "title": "58-E", "statement": "E. Expressiontime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne day Vasya was solving arithmetical problems. He wrote down an expressiona+b=cin his notebook. When the teacher checked Vasya's work it turned out that Vasya had solved the problem incorrectly. Now Vasya tries to find excuses. He says that he simply forgot to write down several digits in numbersa,bandc, but he can't remember what numbers they actually were. Help Vasya, find such numbersx,yandz, with which the following conditions are met:x+y=z,from the expressionx+y=zseveral digits can be erased in such a way that the result will bea+b=c,the expressionx+y=zshould have the minimal length.InputThe first and only input line contains the expressiona+b=c(1 ≤a,b,c≤ 106,a,bandcdon't contain leading zeroes) which is the expression Vasya wrote down.OutputPrint the correct expressionx+y=z(x,yandzare non-negative numbers without leading zeroes). The expressiona+b=cmust be met inx+y=zas a subsequence. The printed solution should have the minimal possible number of characters. If there are several such solutions, you can print any of them.ExamplesInput2+4=5Output21+4=25Input1+1=3Output1+31=32Input1+1=2Output1+1=2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a03e4635", "template_md5": "35d339e4", "result": "Given an expression $a + b = c$ where $1 \\le a, b, c \\le 10^6$ and $a$, $b$, and $c$ don't contain leading zeroes, find the shortest possible expression $x + y = z$ such that:\n\n* $x$, $y$, and $z$ are non-negative integers without leading zeroes.\n* The expression $a + b = c$ is a subsequence of $x + y = z$. \n\nPrint the found expression. If there are multiple solutions, print any one of them."}, {"prompt_md5": "9a7b3bac", "template_md5": "465699a0", "result": "Given a sum equation (e.g., 2+4=5), find the shortest possible sum equation where the given equation is a subsequence of the result."}]}