{"uid": "580-C", "url": "https://codeforces.com/contest/580/problem/C", "tags": ["dfs and similar", " graphs", " trees"], "title": "580-C", "statement": "C. Kefa and Parktime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputKefa decided to celebrate his first big salary by going to the restaurant.He lives by an unusual park. The park is a rooted tree consisting ofnvertices with the root at vertex1. Vertex1also contains Kefa's house. Unfortunaely for our hero, the park also contains cats. Kefa has already found out what are the vertices with cats in them.The leaf vertices of the park contain restaurants. Kefa wants to choose a restaurant where he will go, but unfortunately he is very afraid of cats, so there is no way he will go to the restaurant if the path from the restaurant to his house contains more thanmconsecutivevertices with cats.Your task is to help Kefa count the number of restaurants where he can go.InputThe first line contains two integers,nandm(2 ≤n≤ 105,1 ≤m≤n) — the number of vertices of the tree and the maximum number of consecutive vertices with cats that is still ok for Kefa.The second line containsnintegersa1,a2, ...,an, where eachaieither equals to0(then vertexihas no cat), or equals to1(then vertexihas a cat).Nextn- 1lines contains the edges of the tree in the format \"xiyi\" (without the quotes) (1 ≤xi,yi≤n,xi≠yi), wherexiandyiare the vertices of the tree, connected by an edge.It is guaranteed that the given set of edges specifies a tree.OutputA single integer — the number of distinct leaves of a tree the path to which from Kefa's home contains at mostmconsecutive vertices with cats.ExamplesInput4 11 1 0 01 21 31 4Output2Input7 11 0 1 1 0 0 01 21 32 42 53 63 7Output2NoteLet us remind you that atreeis a connected graph onnvertices andn- 1edge. Arootedtree is a tree with a special vertex calledroot. In a rooted tree among any two vertices connected by an edge, one vertex is a parent (the one closer to the root), and the other one is a child. A vertex is called aleaf, if it has no children.Note to the first sample test:The vertices containing cats are marked red. The restaurants are at vertices 2, 3, 4. Kefa can't go only to the restaurant located at vertex2.Note to the second sample test:The restaurants are located at vertices 4, 5, 6, 7. Kefa can't go to restaurants 6, 7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f392f972", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices ($2 \\le n \\le 10^5$) and $m$ ($1 \\le m \\le n$) represents the maximum number of consecutive vertices with cats that are allowed. Each vertex can either have a cat (1) or not (0).  \n\nYou need to find the number of leaf vertices (restaurants) that Kefa can go to, where the path from the restaurant to the root (Kefa's house) has at most $m$ consecutive vertices with cats. \n\nThe input will consist of:\n\n* Two integers, $n$ and $m$.\n* A list of $n$ integers representing whether each vertex has a cat (0 or 1).\n* $n-1$ lines, each containing two integers representing an edge in the tree.\n\nOutput a single integer representing the number of valid restaurants."}, {"prompt_md5": "624c0525", "template_md5": "465699a0", "result": "You are given a tree-shaped structure with some nodes containing cats.  You need to find the number of leaf nodes (end points of branches) that can be reached from a specific starting node without passing through more than a certain number of consecutive cat nodes."}]}