{"uid": "580-B", "url": "https://codeforces.com/contest/580/problem/B", "tags": ["binary search", " sortings", " two pointers"], "title": "580-B", "statement": "B. Kefa and Companytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputKefa wants to celebrate his first big salary by going to restaurant. However, he needs company.Kefa hasnfriends, each friend will agree to go to the restaurant if Kefa asks. Each friend is characterized by the amount of money he has and the friendship factor in respect to Kefa. The parrot doesn't want any friend to feel poor compared to somebody else in the company (Kefa doesn't count). A friend feels poor if in the company there is someone who has at leastdunits of money more than he does. Also, Kefa wants the total friendship factor of the members of the company to be maximum. Help him invite an optimal company!InputThe first line of the input contains two space-separated integers,nandd(1 ≤n≤ 105,) — the number of Kefa's friends and the minimum difference between the amount of money in order to feel poor, respectively.Nextnlines contain the descriptions of Kefa's friends, the(i+ 1)-th line contains the description of thei-th friend of typemi,si(0 ≤mi,si≤ 109) — the amount of money and the friendship factor, respectively.OutputPrint the maximum total friendship factir that can be reached.ExamplesInput4 575 50 100150 2075 1Output100Input5 1000 711 3299 1046 887 54Output111NoteIn the first sample test the most profitable strategy is to form a company from only the second friend. At all other variants the total degree of friendship will be worse.In the second sample test we can take all the friends.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "105abebb", "template_md5": "35d339e4", "result": "You are given a list of $n$ people, each with a certain amount of money ($m_i$) and a friendship factor ($s_i$).  You need to choose a subset of these people to form a group, with the following constraints:\n\n* No person in the group can have less than $d$ dollars less than anyone else in the group.\n* The total friendship factor of the group must be maximized.\n\nOutput the maximum possible total friendship factor of the group."}, {"prompt_md5": "ff1ba42a", "template_md5": "465699a0", "result": "You have a group of people, each with a certain amount of money and a friendship value.  You want to choose a subset of these people to form a group, following these rules:\n\n* No one in the group can have significantly less money than anyone else (the \"significant difference\" is given).\n* You want to maximize the total friendship value of the group.\n\nWhat is the highest possible total friendship value you can achieve?"}]}