{"uid": "580-D", "url": "https://codeforces.com/contest/580/problem/D", "tags": ["bitmasks", " dp"], "title": "580-D", "statement": "D. Kefa and Dishestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhen Kefa came to the restaurant and sat at a table, the waiter immediately brought him the menu. There werendishes. Kefa knows that he needs exactlymdishes. But at that, he doesn't want to order the same dish twice to taste as many dishes as possible.Kefa knows that thei-th dish gives himaiunits of satisfaction. But some dishes do not go well together and some dishes go very well together. Kefa set to himselfkrules of eating food of the following type — if he eats dishxexactly before dishy(there should be no other dishes betweenxandy), then his satisfaction level raises byc.Of course, our parrot wants to get some maximal possible satisfaction from going to the restaurant. Help him in this hard task!InputThe first line of the input contains three space-separated numbers,n,mandk(1 ≤m≤n≤ 18,0 ≤k≤n* (n- 1)) — the number of dishes on the menu, the number of portions Kefa needs to eat to get full and the number of eating rules.The second line containsnspace-separated numbersai, (0 ≤ai≤ 109) — the satisfaction he gets from thei-th dish.Nextklines contain the rules. Thei-th rule is described by the three numbersxi,yiandci(1 ≤xi,yi≤n,0 ≤ci≤ 109). That means that if you eat dishxiright before dishyi, then the Kefa's satisfaction increases byci. It is guaranteed that there are no such pairs of indexesiandj(1 ≤i<j≤k), thatxi=xjandyi=yj.OutputIn the single line of the output print the maximum satisfaction that Kefa can get from going to the restaurant.ExamplesInput2 2 11 12 1 1Output3Input4 3 21 2 3 42 1 53 4 2Output12NoteIn the first sample it is best to first eat the second dish, then the first one. Then we get one unit of satisfaction for each dish and plus one more for the rule.In the second test the fitting sequences of choice are 4 2 1 or 2 1 4. In both cases we get satisfaction 7 for dishes and also, if we fulfill rule 1, we get an additional satisfaction 5.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1d65f016", "template_md5": "35d339e4", "result": "There are $n$ dishes, and you need to choose $m$ dishes to eat ($1 \\le m \\le n$). Each dish gives a certain amount of satisfaction ($a_i$).  There are $k$ rules, where if you eat dish $x$ right before dish $y$, you get an additional $c$ units of satisfaction ($1 \\le x, y \\le n$, $0 \\le c \\le 10^9$).  \n\nFind the maximum satisfaction you can achieve. \n\n\nInput:\n\n* The first line contains three space-separated integers: $n$, $m$, and $k$.\n* The second line contains $n$ space-separated integers: $a_1$, $a_2$, ..., $a_n$.\n* The next $k$ lines each contain three space-separated integers: $x_i$, $y_i$, and $c_i$.\n\nOutput:\n\n* Print the maximum satisfaction you can achieve."}, {"prompt_md5": "d1e87c36", "template_md5": "465699a0", "result": "You have a list of items, each with a certain value. You need to choose a subset of items with a total value that meets a specific target.  Some pairs of items, when chosen together, provide an additional bonus value. Find the subset of items that maximizes the total value, including any bonuses."}]}