{"uid": "581-A", "url": "https://codeforces.com/contest/581/problem/A", "tags": ["implementation", " math"], "title": "581-A", "statement": "A. Vasya the Hipstertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOne day Vasya the Hipster decided to count how many socks he had. It turned out that he hadared socks andbblue socks.According to the latest fashion, hipsters should wear the socks of different colors: a red one on the left foot, a blue one on the right foot.Every day Vasya puts on new socks in the morning and throws them away before going to bed as he doesn't want to wash them.Vasya wonders, what is the maximum number of days when he can dress fashionable and wear different socks, and after that, for how many days he can then wear the same socks until he either runs out of socks or cannot make a single pair from the socks he's got.Can you help him?InputThe single line of the input contains two positive integersaandb(1 ≤a,b≤ 100) — the number of red and blue socks that Vasya's got.OutputPrint two space-separated integers — the maximum number of days when Vasya can wear different socks and the number of days when he can wear the same socks until he either runs out of socks or cannot make a single pair from the socks he's got.Keep in mind that at the end of the day Vasya throws away the socks that he's been wearing on that day.ExamplesInput3 1Output1 1Input2 3Output2 0Input7 3Output3 2NoteIn the first sample Vasya can first put on one pair of different socks, after that he has two red socks left to wear on the second day.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4b315099", "template_md5": "35d339e4", "result": "You are given two numbers, $a$ and $b$, representing the number of red and blue socks, respectively.  \n\nDetermine:\n\n1. The maximum number of days a person can wear a different colored sock on each foot (one red, one blue) each day.\n2. The number of days they can wear the same colored socks on both feet after they can no longer wear different colored socks each day. \n\n\nAssume the person throws away the socks they wear each day."}, {"prompt_md5": "cd74f9b6", "template_md5": "465699a0", "result": "You have a certain number of red items and a certain number of blue items.  You can only use one of each color per day. Find the maximum number of days you can use one of each color, and then the maximum number of days you can use the same color after that."}]}