{"uid": "581-D", "url": "https://codeforces.com/contest/581/problem/D", "tags": ["bitmasks", " brute force", " constructive algorithms", " geometry", " implementation", " math"], "title": "581-D", "statement": "D. Three Logostime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThree companies decided to order a billboard with pictures of their logos. A billboard is a bigsquareboard. A logo of each company is a rectangle of a non-zero area.Advertisers will put up the ad only if it is possible to place all three logos on the billboard so that they do not overlap and the billboard has no empty space left. When you put a logo on the billboard, you should rotate it so that the sides were parallel to the sides of the billboard.Your task is to determine if it is possible to put the logos of all the three companies on some square billboard without breaking any of the described rules.InputThe first line of the input contains six positive integersx1,y1,x2,y2,x3,y3(1 ≤x1,y1,x2,y2,x3,y3≤ 100), wherexiandyidetermine the length and width of the logo of thei-th company respectively.OutputIf it is impossible to place all the three logos on a square shield, print a single integer \"-1\" (without the quotes).If it is possible, print in the first line the length of a side of squaren, where you can place all the three logos. Each of the nextnlines should containnuppercase English letters \"A\", \"B\" or \"C\". The sets of the same letters should form solid rectangles, provided that:the sizes of the rectangle composed from letters \"A\" should be equal to the sizes of the logo of the first company,the sizes of the rectangle composed from letters \"B\" should be equal to the sizes of the logo of the second company,the sizes of the rectangle composed from letters \"C\" should be equal to the sizes of the logo of the third company,Note that the logos of the companies can be rotated for printing on the billboard. The billboard mustn't have any empty space. If a square billboard can be filled with the logos in multiple ways, you are allowed to print any of them.See the samples to better understand the statement.ExamplesInput5 1 2 5 5 2Output5AAAAABBBBBBBBBBCCCCCCCCCCInput4 4 2 6 4 2Output6BBBBBBBBBBBBAAAACCAAAACCAAAACCAAAACC", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4feaffb3", "template_md5": "35d339e4", "result": "Three companies have logos of different sizes.  Each logo is a rectangle.  \n\nYou need to determine if it's possible to place all three logos on a square billboard without any overlap and without any empty space on the billboard.  \n\n**Input:**\n\nThe input will be six numbers:\n\n*  $x_1$, $y_1$:  The width and height of the first logo.\n*  $x_2$, $y_2$:  The width and height of the second logo.\n*  $x_3$, $y_3$:  The width and height of the third logo.\n\n**Output:**\n\n* If it's impossible to place all the logos on a square billboard, output \"-1\".\n* If it's possible, output:\n    * The length of a side of the square billboard.\n    * Then, $n$ lines, each with $n$ letters (\"A\", \"B\", or \"C\").  \n    * The letters should form rectangles that represent the logos:\n        * \"A\" represents the first logo.\n        * \"B\" represents the second logo.\n        * \"C\" represents the third logo.\n\n\n\nLet me know if you'd like me to clarify anything else!"}, {"prompt_md5": "dfe88e00", "template_md5": "465699a0", "result": "You are given the dimensions of three rectangles. Determine if it's possible to arrange these rectangles into a square without any gaps or overlaps. If possible, show the size of the square and how the rectangles fit inside."}]}