{"uid": "583-B", "url": "https://codeforces.com/contest/583/problem/B", "tags": ["greedy", " implementation"], "title": "583-B", "statement": "B. Robot's Tasktime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRobot Doc is located in the hall, withncomputers stand in a line, numbered from left to right from1ton. Each computer containsexactly onepiece of information, each of which Doc wants to get eventually. The computers are equipped with a security system, so to crack thei-th of them, the robot needs to collect at leastaiany pieces of information from the other computers. Doc can hack the computer only if he is right next to it.The robot is assembled using modern technologies and can move along the line of computers in either of the two possible directions, but the change of direction requires a large amount of resources from Doc. Tell the minimum number of changes of direction, which the robot will have to make to collect allnparts of information if initially it is next to computer with number1.It is guaranteedthat there exists at least one sequence of the robot's actions, which leads to the collection of all information. Initially Doc doesn't have any pieces of information.InputThe first line contains numbern(1 ≤n≤ 1000). The second line containsnnon-negative integersa1,a2, ...,an(0 ≤ai<n), separated by a space. It is guaranteed that there exists a way for robot to collect all pieces of the information.OutputPrint a single number — the minimum number of changes in direction that the robot will have to make in order to collect allnparts of information.ExamplesInput30 2 0Output1Input54 2 3 0 1Output3Input70 3 1 0 5 2 6Output2NoteIn the first sample you can assemble all the pieces of information in the optimal manner by assembling first the piece of information in the first computer, then in the third one, then change direction and move to the second one, and then, having 2 pieces of information, collect the last piece.In the second sample to collect all the pieces of information in the optimal manner, Doc can go to the fourth computer and get the piece of information, then go to the fifth computer with one piece and get another one, then go to the second computer in the same manner, then to the third one and finally, to the first one. Changes of direction will take place before moving from the fifth to the second computer, then from the second to the third computer, then from the third to the first computer.In the third sample the optimal order of collecting parts from computers can look like that: 1->3->4->6->2->5->7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6070fda5", "template_md5": "35d339e4", "result": "There are $n$ computers in a line numbered from 1 to $n$. Each computer has one piece of information.  To hack a computer, you need at least $a_i$ pieces of information from other computers, where $a_i$ is the value associated with the $i$-th computer. You start at computer 1 and can move left or right. Changing direction costs resources. Find the minimum number of direction changes needed to collect all $n$ pieces of information.\n\nInput:\n\n* The first line contains $n$ (1 ≤ $n$ ≤ 1000).\n* The second line contains $n$ non-negative integers $a_1$, $a_2$, ..., $a_n$ (0 ≤ $a_i$ < $n$), separated by spaces.\n\nOutput:\n\n* Print a single number: the minimum number of direction changes."}, {"prompt_md5": "5a120dd7", "template_md5": "465699a0", "result": "You have a line of computers, each containing a piece of data. To access a computer, you need a certain number of other pieces of data. You start at the first computer and must collect all the data.  You can move left or right, but changing direction costs resources. Find the fewest direction changes needed to collect all the data."}]}