{"uid": "583-A", "url": "https://codeforces.com/contest/583/problem/A", "tags": ["implementation"], "title": "583-A", "statement": "A. Asphalting Roadstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputCity X consists ofnvertical andnhorizontal infinite roads, formingn×nintersections. Roads (both vertical and horizontal) are numbered from1ton, and the intersections are indicated by the numbers of the roads that form them.Sand roads have long been recognized out of date, so the decision was made to asphalt them. To do this, a team of workers was hired and a schedule of work was made, according to which the intersections should be asphalted.Road repairs are planned forn2days. On thei-th day of the team arrives at thei-th intersection in the list and ifnoneof the two roads that form the intersection were already asphalted they asphalt both roads. Otherwise, the team leaves the intersection, without doing anything with the roads.According to the schedule of road works tell in which days at least one road will be asphalted.InputThe first line contains integern(1 ≤n≤ 50) — the number of vertical and horizontal roads in the city.Nextn2lines contain the order of intersections in the schedule. Thei-th of them contains two numbershi,vi(1 ≤hi,vi≤n), separated by a space, and meaning that the intersection that goesi-th in the timetable is at the intersection of thehi-th horizontal andvi-th vertical roads. It is guaranteed that all the intersections in the timetable are distinct.OutputIn the single line print the numbers of the days when road works will be in progress in ascending order. The days are numbered starting from1.ExamplesInput21 11 22 12 2Output1 4Input11 1Output1NoteIn the sample the brigade acts like that:On the first day the brigade comes to the intersection of the 1-st horizontal and the 1-st vertical road. As none of them has been asphalted, the workers asphalt the 1-st vertical and the 1-st horizontal road;On the second day the brigade of the workers comes to the intersection of the 1-st horizontal and the 2-nd vertical road. The 2-nd vertical road hasn't been asphalted, but as the 1-st horizontal road has been asphalted on the first day, the workers leave and do not asphalt anything;On the third day the brigade of the workers come to the intersection of the 2-nd horizontal and the 1-st vertical road. The 2-nd horizontal road hasn't been asphalted but as the 1-st vertical road has been asphalted on the first day, the workers leave and do not asphalt anything;On the fourth day the brigade come to the intersection formed by the intersection of the 2-nd horizontal and 2-nd vertical road. As none of them has been asphalted, the workers asphalt the 2-nd vertical and the 2-nd horizontal road.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e18754ed", "template_md5": "35d339e4", "result": "A city has $n \\times n$ intersections, where $n$ is a positive integer between 1 and 50.  Roads are numbered from 1 to $n$.  \n\nA team of workers will asphalt roads over $n^2$ days. On the $i$-th day, the team will go to the intersection formed by the $h_i$-th horizontal road and the $v_i$-th vertical road. If neither of these roads has been asphalted before, the team will asphalt both. Otherwise, they will leave without doing anything.\n\nGiven a list of intersections in the order the team will visit them, determine the days on which at least one road will be asphalted."}, {"prompt_md5": "971e2126", "template_md5": "465699a0", "result": "A city has a grid of roads.  Workers asphalt roads according to a schedule. Each day, workers visit one intersection. If neither road forming the intersection has been asphalted, they asphalt both. Otherwise, they do nothing.  Determine the days when at least one road is asphalted."}]}