{"uid": "585-A", "url": "https://codeforces.com/contest/585/problem/A", "tags": ["brute force", " implementation"], "title": "585-A", "statement": "A. Gennady the Dentisttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputGennady is one of the best child dentists in Berland. Todaynchildren got an appointment with him, they lined up in front of his office.All children love to cry loudly at the reception at the dentist. We enumerate the children with integers from1tonin the order they go in the line. Every child is associated with the value of hiscofidencepi. The children take turns one after another to come into the office; each time the child that is the first in the line goes to the doctor.While Gennady treats the teeth of thei-th child, the child is crying with the volume ofvi. At that theconfidenceof the first child in the line is reduced by the amount ofvi, the second one — by valuevi- 1, and so on. The children in the queue after thevi-th child almost do not hear the crying, so theirconfidenceremains unchanged.If at any point in time theconfidenceof thej-th child is less than zero, he begins to cry with the volume ofdjand leaves the line, running towards the exit, without going to the doctor's office. At this theconfidenceof all the children after thej-th one in the line is reduced by the amount ofdj.All these events occur immediately one after the other in some order. Some cries may lead to other cries, causing a chain reaction. Once in the hallway it is quiet, the child, who is first in the line, goes into the doctor's office.Help Gennady the Dentist to determine the numbers of kids, whose teeth he will cure. Print their numbers in the chronological order.InputThe first line of the input contains a positive integern(1 ≤n≤ 4000) — the number of kids in the line.Nextnlines contain three integers eachvi,di,pi(1 ≤vi,di,pi≤ 106) — the volume of the cry in the doctor's office, the volume of the cry in the hall and theconfidenceof thei-th child.OutputIn the first line print numberk— the number of children whose teeth Gennady will cure.In the second line printkintegers — the numbers of the children who will make it to the end of the line in the increasing order.ExamplesInput54 2 24 1 25 2 43 3 55 1 2Output21 3Input54 5 15 3 94 1 22 1 84 1 9Output41 2 4 5NoteIn the first example, Gennady first treats the teeth of the first child who will cry with volume4. The confidences of the remaining children will get equal to- 2, 1, 3, 1, respectively. Thus, the second child also cries at the volume of1and run to the exit. The confidence of the remaining children will be equal to0, 2, 0. Then the third child will go to the office, and cry with volume5. The other children won't bear this, and with a loud cry they will run to the exit.In the second sample, first the first child goes into the office, he will cry with volume4. The confidence of the remaining children will be equal to5,  - 1, 6, 8. Thus, the third child will cry with the volume of1and run to the exit. The confidence of the remaining children will be equal to5, 5, 7. After that, the second child goes to the office and cry with the volume of5. The confidences of the remaining children will be equal to0, 3. Then the fourth child will go into the office and cry with the volume of2. Because of this the confidence of the fifth child will be1, and he will go into the office last.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2440bfaf", "template_md5": "35d339e4", "result": "There are $n$ children lined up. Each child has a confidence level $p_i$.  \n\nWhen a child enters the office, they cry with a volume of $v_i$. This reduces the confidence of the children in line:\n\n* The first child's confidence is reduced by $v_i$.\n* The second child's confidence is reduced by $v_{i-1}$.\n* And so on.\n\nIf a child's confidence drops below 0, they cry with a volume of $d_i$ and leave the line. This causes all children behind them to have their confidence reduced by $d_i$.\n\nChildren take turns entering the office. Determine the number of children who will see the dentist (i.e., whose confidence never drops below 0). Print their numbers in the order they see the dentist."}, {"prompt_md5": "fff72dda", "template_md5": "465699a0", "result": "There are children lined up. Each child has a confidence level. When a child is treated, their confidence decreases, and the confidence of children behind them also decreases. If a child's confidence drops below zero, they leave and cause the confidence of children behind them to decrease further.  Determine the order in which children will be treated."}]}