{"uid": "585-D", "url": "https://codeforces.com/contest/585/problem/D", "tags": ["meet-in-the-middle"], "title": "585-D", "statement": "D. Lizard Era: Beginningtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn the game Lizard Era: Beginning the protagonist will travel with three companions: Lynn, Meliana and Worrigan. Overall the game hasnmandatory quests. To perform each of them, you need to takeexactly twocompanions.The attitude of each of the companions to the hero is an integer. Initially, the attitude of each of them to the hero of neutral and equal to 0. As the hero completes quests, he makes actions that change the attitude of the companions, whom he took to perform this task, in positive or negative direction.Tell us what companions the hero needs to choose to make their attitude equal after completing all the quests. If this can be done in several ways, choose the one in which the value of resulting attitude is greatest possible.InputThe first line contains positive integern(1 ≤n≤ 25) — the number of important tasks.Nextnlines contain the descriptions of the tasks — thei-th line contains three integersli,mi,wi— the values by which the attitude of Lynn, Meliana and Worrigan respectively will change towards the hero if the hero takes them on thei-th task. All the numbers in the input are integers and do not exceed107in absolute value.OutputIf there is no solution, print in the first line \"Impossible\".Otherwise, printnlines, two characters is each line — in thei-th line print the first letters of the companions' names that hero should take to complete thei-th task ('L' for Lynn, 'M' for Meliana, 'W' for Worrigan). Print the letters in any order, if there are multiple solutions, print any of them.ExamplesInput31 0 00 1 00 0 1OutputLMMWMWInput70 8 95 9 -26 -8 -79 4 5-4 -9 9-4 5 2-6 8 -7OutputLMMWLMLWMWLMLWInput21 0 01 1 0OutputImpossible", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aa589f63", "template_md5": "35d339e4", "result": "You are given $n$ tasks. Each task requires selecting two people from a group of three.  Each task changes the attitude of the two selected people towards you. The attitude change for each person is given as an integer.\n\nYour goal is to find a sequence of tasks to complete such that after all tasks are finished, the attitude of all three people towards you is equal. If this is not possible, output \"Impossible\". If there are multiple solutions, output any one. \n\nThe input consists of:\n\n* The first line contains an integer $n$ (the number of tasks).\n* Each of the next $n$ lines contains three integers representing the attitude change for each of the three people for that task.\n\nThe output consists of:\n\n* If a solution is impossible, output \"Impossible\".\n* Otherwise, output $n$ lines, each containing two letters ('L', 'M', or 'W') representing the two people selected for each task."}, {"prompt_md5": "d232b0ab", "template_md5": "465699a0", "result": "You have a set of tasks. Each task requires you to choose two people from a group of three.  Each task changes the relationship score of the two chosen people with you.  Find a sequence of tasks that results in all three people having the same relationship score with you at the end, maximizing that score. If it's impossible, say so."}]}