{"uid": "585-C", "url": "https://codeforces.com/contest/585/problem/C", "tags": ["number theory"], "title": "585-C", "statement": "C. Alice, Bob, Oranges and Applestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob decided to eat some fruit. In the kitchen they found a large bag of oranges and apples. Alice immediately took an orange for herself, Bob took an apple. To make the process of sharing the remaining fruit more fun, the friends decided to play a game. They put multiple cards and on each one they wrote a letter, either 'A', or the letter 'B'. Then they began to remove the cards one by one from left to right, every time they removed a card with the letter 'A', Alice gave Bob all the fruits she had at that moment and took out of the bag as many apples and as many oranges as she had before. Thus the number of oranges and apples Alice had, did not change. If the card had written letter 'B', then Bob did the same, that is, he gave Alice all the fruit that he had, and took from the bag the same set of fruit. After the last card way removed, all the fruit in the bag were over.You know how many oranges and apples was in the bag at first. Your task is to find any sequence of cards that Alice and Bob could have played with.InputThe first line of the input contains two integers,x,y(1 ≤x,y≤ 1018,xy> 1) — the number of oranges and apples that were initially in the bag.OutputPrint any sequence of cards that would meet the problem conditions as acompressedstring of characters 'A' and 'B. That means that you need to replace the segments of identical consecutive characters by the number of repetitions of the characters and the actual character. For example, stringAAABAABBBshould be replaced by string3A1B2A3B, but cannot be replaced by2A1A1B2A3Bor by3AB2A3B. See the samples for clarifications of the output format. The string that you print should consist of at most106characters. It is guaranteed that if the answer exists, its compressed representation exists, consisting of at most106characters. If there are several possible answers, you are allowed to print any of them.If the sequence of cards that meet the problem statement does not not exist, print a single wordImpossible.ExamplesInput1 4Output3BInput2 2OutputImpossibleInput3 2Output1A1BNoteIn the first sample, if the row contained three cards with letter 'B', then Bob should give one apple to Alice three times. So, in the end of the game Alice has one orange and three apples, and Bob has one apple, in total it is one orange and four apples.In second sample, there is no answer since one card is not enough for game to finish, and two cards will produce at least three apples or three oranges.In the third sample, cards contain letters 'AB', so after removing the first card Bob has one orange and one apple, and after removal of second card Alice has two oranges and one apple. So, in total it is three oranges and two apples.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a4f4e67f", "template_md5": "35d339e4", "result": "There are $x$ oranges and $y$ apples in a bag. Two players take turns removing cards from a sequence. Each card has either an 'A' or a 'B' on it. \n\n* If a player draws an 'A', they give all their current fruit to the other player and take the same number of oranges and apples from the bag.\n* If a player draws a 'B', they do the same as above, but the other way around.\n\nThe game continues until all the fruit is removed from the bag.\n\nGiven $x$ and $y$, find any possible sequence of 'A' and 'B' cards that could have been played.  \n\nYou can represent the sequence using a compressed string (e.g., \"3A1B2A3B\" means three 'A's, one 'B', two 'A's, and three 'B's). \n\nIf no such sequence exists, print \"Impossible\"."}, {"prompt_md5": "369dad8a", "template_md5": "465699a0", "result": "You are given two numbers, representing the initial number of apples and oranges.  Find a sequence of 'A's and 'B's that represents a game where:\n\n* 'A' means the player takes apples and oranges from the bag.\n* 'B' means the other player takes apples and oranges from the bag.\n\nThe game ends when all the fruit is gone.  The sequence must result in the final count of fruit matching the initial count. If no such sequence exists, say \"Impossible\"."}]}