{"uid": "586-B", "url": "https://codeforces.com/contest/586/problem/B", "tags": ["implementation"], "title": "586-B", "statement": "B. Laurenty and Shoptime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA little boy Laurenty has been playing his favourite gameNotafor quite a while and is now very hungry. The boy wants to make sausage and cheese sandwiches, but first, he needs to buy a sausage and some cheese.The town where Laurenty lives in is not large. The houses in it are located in two rows,nhouses in each row. Laurenty lives in the very last house of the second row. The only shop in town is placed in the first house of the first row.The first and second rows are separated with the main avenue of the city. The adjacent houses of one row are separated by streets.Each crosswalk of a street or an avenue has some traffic lights. In order to cross the street, you need to press a button on the traffic light, wait for a while for the green light and cross the street. Different traffic lights can have different waiting time.The traffic light on the crosswalk from thej-th house of thei-th row to the(j+ 1)-th house of the same row has waiting time equal toaij(1 ≤i≤ 2, 1 ≤j≤n- 1). For the traffic light on the crossing from thej-th house of one row to thej-th house of another row the waiting time equalsbj(1 ≤j≤n). The city doesn't have any other crossings.The boy wants to get to the store, buy the products and go back. The main avenue of the city is wide enough, so the boy wants to cross itexactly onceon the way to the store andexactly onceon the way back home. The boy would get bored if he had to walk the same way again, so he wants the way home to be different from the way to the store in at least one crossing.Figure to the first sample.Help Laurenty determine the minimum total time he needs to wait at the crossroads.InputThe first line of the input contains integern(2 ≤n≤ 50) — the number of houses in each row.Each of the next two lines containsn- 1space-separated integer — valuesaij(1 ≤aij≤ 100).The last line containsnspace-separated integersbj(1 ≤bj≤ 100).OutputPrint a single integer — the least total time Laurenty needs to wait at the crossroads, given that he crosses the avenue only once both on his way to the store and on his way back home.ExamplesInput41 2 33 2 13 2 2 3Output12Input31 23 32 1 3Output11Input2111 1Output4NoteThe first sample is shown on the figure above.In the second sample, Laurenty's path can look as follows:Laurenty crosses the avenue, the waiting time is3;Laurenty uses the second crossing in the first row, the waiting time is2;Laurenty uses the first crossing in the first row, the waiting time is1;Laurenty uses the first crossing in the first row, the waiting time is1;Laurenty crosses the avenue, the waiting time is1;Laurenty uses the second crossing in the second row, the waiting time is3.In total we get that the answer equals11.In the last sample Laurenty visits all the crossings, so the answer is4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e8111fb", "template_md5": "35d339e4", "result": "There are two rows of houses, with $n$ houses in each row.  A person starts at the last house in the second row and needs to go to the first house in the first row (the store).  \n\nThere are traffic lights at each intersection between houses in a row and at each intersection between the two rows. Each traffic light has a waiting time.\n\nThe person wants to cross the main avenue (between the rows) only once on the way to the store and once on the way back home. They also want to take a different path on the way back than on the way to the store.\n\nFind the minimum total waiting time for the person to go to the store, buy something, and return home. \n\nInput:\n\n* The first line contains $n$ (the number of houses in each row).\n* The next two lines each contain $n-1$ numbers, representing the waiting times at the intersections within each row.\n* The last line contains $n$ numbers, representing the waiting times at the intersections between the rows.\n\nOutput:\n\n* A single number representing the minimum total waiting time."}, {"prompt_md5": "18be73ac", "template_md5": "465699a0", "result": "You need to find the shortest time it takes to travel between two points in a grid-like city. You can only cross between the rows once on the way to the destination and once on the way back. Each intersection has a waiting time."}]}