{"uid": "587-E", "url": "https://codeforces.com/contest/587/problem/E", "tags": ["data structures"], "title": "587-E", "statement": "E. Duff as a Queentime limit per test7 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDuff is the queen of her country, Andarz Gu. She's a competitive programming fan. That's why, when he saw her minister, Malek, free, she gave her a sequence consisting ofnnon-negative integers,a1,a2, ...,anand asked him to performqqueries for her on this sequence.There are two types of queries:given numbersl,randk, Malek should performfor eachl≤i≤r(, bitwise exclusive OR of numbersaandb).given numberslandrMalek should tell her the score of sequenceal,al+ 1, ... ,ar.Score of a sequenceb1, ...,bkis the number of its different Kheshtaks. A non-negative integerwis a Kheshtak of this sequence if and only if there exists a subsequence ofb, let's denote it asbi1,bi2, ... ,bix(possibly empty) such that(1 ≤i1<i2< ... <ix≤k). If this subsequence is empty, thenw= 0.Unlike Duff, Malek is not a programmer. That's why he asked for your help. Please help him perform these queries.InputThe first line of input contains two integers,nandq(1 ≤n≤ 2 × 105and1 ≤q≤ 4 × 104).The second line of input containsnintegers,a1,a2, ...,anseparated by spaces (0 ≤ai≤ 109for each1 ≤i≤n).The nextqlines contain the queries. Each line starts with an integert(1 ≤t≤ 2), type of the corresponding query. Ift= 1, then there are three more integers in that line,l,randk. Otherwise there are two more integers,landr. (1 ≤l≤r≤nand0 ≤k≤ 109)OutputPrint the answer of each query of the second type in one line.ExamplesInput5 51 2 3 4 22 1 51 2 2 82 1 51 1 3 102 2 2Output8161NoteIn the first query, we want all Kheshtaks of sequence1, 2, 3, 4, 2which are:0, 1, 2, 3, 4, 5, 6, 7.In the third query, we want all Khestaks of sequence1, 10, 3, 4, 2which are:0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15.In the fifth query, we want all Kheshtaks of sequence0which is0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9c00be6d", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ non-negative integers, $a_1, a_2, ..., a_n$. You need to answer $q$ queries. \n\nThere are two types of queries:\n\n* **Type 1:** Given integers $l$, $r$, and $k$, calculate the bitwise OR of all elements in the sequence from index $l$ to $r$ inclusive ($a_l \\text{ OR } a_{l+1} \\text{ OR } ... \\text{ OR } a_r$).\n* **Type 2:** Given integers $l$ and $r$, calculate the number of distinct Kheshtaks in the sequence from index $l$ to $r$ inclusive.\n\nA Kheshtak of a sequence is a non-negative integer $w$ that can be formed by taking a subsequence of the sequence (possibly empty). \n\n**Input:**\n\n* The first line contains two integers, $n$ and $q$ ($1 \\le n \\le 2 \\times 10^5$, $1 \\le q \\le 4 \\times 10^4$).\n* The second line contains $n$ integers, $a_1, a_2, ..., a_n$ ($0 \\le a_i \\le 10^9$ for each $1 \\le i \\le n$).\n* The next $q$ lines contain the queries. Each line starts with an integer $t$ (1 or 2) indicating the type of query. \n    * If $t = 1$, there are three more integers: $l$, $r$, and $k$.\n    * If $t = 2$, there are two more integers: $l$ and $r$.\n\n**Output:**\n\nFor each query of type 2, print the number of distinct Kheshtaks in the sequence from index $l$ to $r$ inclusive."}, {"prompt_md5": "ec108b3a", "template_md5": "465699a0", "result": "You are given a sequence of numbers.  You need to answer queries of two types:\n\n1. Calculate the bitwise OR of all numbers in a given range of the sequence.\n2. Count the number of unique \"Kheshtaks\" in a given range of the sequence. A Kheshtak is a number that can be formed by summing a subsequence of the numbers in the range (an empty subsequence sums to 0)."}]}