{"uid": "587-F", "url": "https://codeforces.com/contest/587/problem/F", "tags": ["data structures", " strings"], "title": "587-F", "statement": "F. Duff is Madtime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDuff is mad at her friends. That's why she sometimes makes Malek to take candy from one of her friends for no reason!She hasnfriends. Heri-th friend's name issi(their names are not necessarily unique).qtimes, she asks Malek to take candy from her friends. She's angry, but also she acts with rules. When she wants to ask Malek to take candy from one of her friends, likek, she chooses two numberslandrand tells Malek to take exactlycandies from him/her, whereoccur(t,s)is the number of occurrences of stringtins.Malek is not able to calculate how many candies to take in each request from Duff. That's why she asked for your help. Please tell him how many candies to take in each request.InputThe first line of input contains two integersnandq(1 ≤n,q≤ 105).The nextnlines contain the names.i-th of them contains an stringsi, consisting of lowercase English letters   ().The nextqlines contain the requests. Each of them contains three integers,l,randk(says that Malek should takecandies from Duff'sk-th friend).OutputPrint the answer to each request in one line.ExamplesInput5 5aababababababb1 5 43 5 41 5 21 5 31 4 1Output126371", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8e1fa826", "template_md5": "35d339e4", "result": "There are $n$ people. Each person has a unique name.  You are given a list of $n$ names.\n\nYou are then given $q$ requests. Each request consists of three numbers: $l$, $r$, and $k$. For each request, you need to determine the number of candies to take from the $k$-th person. \n\n**Note:** The problem does not provide any information about how the names relate to the number of candies each person has."}, {"prompt_md5": "17868f14", "template_md5": "465699a0", "result": "You are given a list of names and a series of requests. Each request specifies a starting position and a length.  You need to determine the number of items at that position and length in the list of names."}]}