{"uid": "59-A", "url": "https://codeforces.com/contest/59/problem/A", "tags": ["implementation", " strings"], "title": "59-A", "statement": "A. Wordtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya is very upset that many people on the Net mix uppercase and lowercase letters in one word. That's why he decided to invent an extension for his favorite browser that would change the letters' register in every word so that it either only consisted of lowercase letters or, vice versa, only of uppercase ones. At that as little as possible letters should be changed in the word. For example, the wordHoUsemust be replaced withhouse, and the wordViP— withVIP. If a word contains an equal number of uppercase and lowercase letters, you should replace all the letters with lowercase ones. For example,maTRIxshould be replaced bymatrix. Your task is to use the given method on one given word.InputThe first line contains a words— it consists of uppercase and lowercase Latin letters and possesses the length from1to100.OutputPrint the corrected words. If the given wordshas strictly more uppercase letters, make the word written in the uppercase register, otherwise - in the lowercase one.ExamplesInputHoUseOutputhouseInputViPOutputVIPInputmaTRIxOutputmatrix", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ad081a34", "template_md5": "35d339e4", "result": "You are given a word consisting of uppercase and lowercase letters.  Determine if there are more uppercase letters or more lowercase letters in the word. \n\n* If there are more uppercase letters, output the word in all uppercase.\n* If there are more lowercase letters, output the word in all lowercase.\n* If there are an equal number of uppercase and lowercase letters, output the word in all lowercase."}, {"prompt_md5": "fa3acef8", "template_md5": "465699a0", "result": "Given a word, change all the letters to either uppercase or lowercase so that there are as few changes as possible. If there are more uppercase letters, make the word all uppercase. Otherwise, make it all lowercase."}]}