{"uid": "59-B", "url": "https://codeforces.com/contest/59/problem/B", "tags": ["implementation", " number theory"], "title": "59-B", "statement": "B. Fortune Tellingtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutMarina loves Sasha. But she keeps wondering whether Sasha loves her. Of course, the best way to know it is fortune telling. There are many ways of telling fortune, but Marina has picked the easiest one. She takes in her hand one or several camomiles and tears off the petals one by one. After each petal she pronounces alternatively \"Loves\" and \"Doesn't love\", at that Marina always starts with \"Loves\". There arencamomiles growing in the field, possessing the numbers of petals equal toa1,a2, ...an. Marina wants to pick a bouquet with the maximal possible total number of petals so that the result would still be \"Loves\". Help her do that; find the maximal number of petals possible in the bouquet.InputThe first line contains an integern(1 ≤n≤ 100), which is the number of flowers growing in the field. The second line containsnintegersai(1 ≤ai≤ 100) which represent the number of petals on a giveni-th camomile.OutputPrint a single number which is the maximal number of petals in the bouquet, the fortune telling on which would result in \"Loves\". If there are no such bouquet, print0instead. The bouquet may consist of a single flower.ExamplesInput11Output1Input12Output0Input35 6 7Output13", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c5bea4d5", "template_md5": "35d339e4", "result": "You are given a list of integers representing the number of petals on each of $n$ flowers.  You want to choose a subset of these flowers (possibly just one) so that the total number of petals is as large as possible, and the following rule applies:\n\n* If the total number of petals is odd, the answer is \"Loves\".\n* If the total number of petals is even, the answer is \"Doesn't love\".\n\nFind the largest possible total number of petals that results in \"Loves\". If no such subset exists, print 0."}, {"prompt_md5": "3bdd908c", "template_md5": "465699a0", "result": "You are given a list of numbers representing the number of petals on each flower.  Find the largest sum of petals from a selection of flowers such that the sum of petals is odd."}]}