{"uid": "590-C", "url": "https://codeforces.com/contest/590/problem/C", "tags": ["dfs and similar", " graphs", " shortest paths"], "title": "590-C", "statement": "C. Three Statestime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThe famous global economic crisis is approaching rapidly, so the states of Berman, Berance and Bertaly formed an alliance and allowed the residents of all member states to freely pass through the territory of any of them. In addition, it was decided that a road between the states should be built to guarantee so that one could any point of any country can be reached from any point of any other State.Since roads are always expensive, the governments of the states of the newly formed alliance asked you to help them assess the costs. To do this, you have been issued a map that can be represented as a rectangle table consisting ofnrows andmcolumns. Any cell of the map either belongs to one of three states, or is an area where it is allowed to build a road, or is an area where the construction of the road is not allowed. A cell is calledpassable, if it belongs to one of the states, or the road was built in this cell. From any passable cells you can move up, down, right and left, if the cell that corresponds to the movement exists and is passable.Your task is to construct a road inside a minimum number of cells, so that it would be possible to get from any cell of any state to any cell of any other state using only passable cells.It is guaranteed that initially it is possible to reach any cell of any state from any cell of this state, moving only along its cells. It is also guaranteed that for any state there is at least one cell that belongs to it.InputThe first line of the input contains the dimensions of the mapnandm(1 ≤n,m≤ 1000) — the number of rows and columns respectively.Each of the nextnlines containmcharacters, describing the rows of the map. Digits from1to3represent the accessory to the corresponding state. The character '.' corresponds to the cell where it is allowed to build a road and the character '#' means no construction is allowed in this cell.OutputPrint a single integer — the minimum number of cells you need to build a road inside in order to connect all the cells of all states. If such a goal is unachievable, print-1.ExamplesInput4 511..2#..22#.323.#333Output2Input1 51#2#3Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e78d15d", "template_md5": "35d339e4", "result": "You are given a rectangular map of size $n \\times m$. The map is divided into cells, each of which can be:\n\n* A cell belonging to one of three states (represented by the numbers 1, 2, or 3).\n* A cell where a road can be built (represented by \".\").\n* A cell where road construction is not allowed (represented by \"#\").\n\nYou need to build roads in the minimum number of cells to connect all cells of all states.  \n\nYou can move between cells horizontally or vertically if they are passable (belong to a state or have a road).\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of rows and columns of the map.\n* The next $n$ lines contain $m$ characters each, representing the map.\n\n**Output:**\n\n* Print a single integer representing the minimum number of cells you need to build roads in to connect all states. If it's impossible to connect all states, print -1."}, {"prompt_md5": "639f14f8", "template_md5": "465699a0", "result": "You are given a grid representing three regions. Some cells are already part of a region, some are buildable, and some are off-limits.  You need to build roads (in the buildable cells) to connect every cell in each region to every other region. What is the minimum number of roads you need to build? If it's impossible to connect all regions, output -1."}]}