{"uid": "590-B", "url": "https://codeforces.com/contest/590/problem/B", "tags": ["binary search", " geometry", " math"], "title": "590-B", "statement": "B. Chip 'n Dale Rescue Rangerstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA team of furry rescue rangers was sitting idle in their hollow tree when suddenly they received a signal of distress. In a few moments they were ready, and the dirigible of the rescue chipmunks hit the road.We assume that the action takes place on a Cartesian plane. The headquarters of the rescuers is located at point(x1,y1), and the distress signal came from the point(x2,y2).Due to Gadget's engineering talent, the rescuers' dirigible can instantly change its current velocity and direction of movement at any moment and as many times as needed. The only limitation is: the speed of the aircraft relative to the air can not exceedmeters per second.Of course, Gadget is a true rescuer and wants to reach the destination as soon as possible. The matter is complicated by the fact that the wind is blowing in the air and it affects the movement of the dirigible. According to the weather forecast, the wind will be defined by the vector(vx,vy)for the nearesttseconds, and then will change to(wx,wy). These vectors give both the direction and velocity of the wind. Formally, if a dirigible is located at the point(x,y), while its own velocity relative to the air is equal to zero and the wind(ux,uy)is blowing, then afterseconds the new position of the dirigible will be.Gadget is busy piloting the aircraft, so she asked Chip to calculate how long will it take them to reach the destination if they fly optimally. He coped with the task easily, but Dale is convinced that Chip has given the random value, aiming only not to lose the face in front of Gadget. Dale has asked you to find the right answer.It is guaranteed that the speed of the wind at any moment of time is strictly less than the maximum possible speed of the airship relative to the air.InputThe first line of the input contains four integersx1,y1,x2,y2(|x1|,  |y1|,  |x2|,  |y2| ≤ 10 000) — the coordinates of the rescuers' headquarters and the point, where signal of the distress came from, respectively.The second line contains two integersandt(0 <v,t≤ 1000), which are denoting the maximum speed of the chipmunk dirigible relative to the air and the moment of time when the wind changes according to the weather forecast, respectively.Next follow one per line two pairs of integer(vx,vy)and(wx,wy), describing the wind for the firsttseconds and the wind that will blow at all the remaining time, respectively. It is guaranteed thatand.OutputPrint a single real value — the minimum time the rescuers need to get to point(x2,y2). You answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput0 0 5 53 2-1 -1-1 0Output3.729935587093555327Input0 0 0 1000100 1000-50 050 0Output11.547005383792516398", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6bf31c29", "template_md5": "35d339e4", "result": "A rescue team needs to travel from point $(x_1, y_1)$ to point $(x_2, y_2)$. They can travel at a maximum speed of $v$ relative to the air. The wind affects their movement.\n\nFor the first $t$ seconds, the wind is blowing at a speed and direction of $(vx, vy)$. After $t$ seconds, the wind changes to a speed and direction of $(wx, wy)$.\n\nFind the minimum time it takes for the team to reach their destination, considering the wind's effect."}, {"prompt_md5": "e7883ea0", "template_md5": "465699a0", "result": "A vehicle needs to travel from point A to point B. The vehicle can change direction instantly but has a maximum speed. There are two wind conditions: one for the first 't' time units and another for the remaining time.  Find the shortest time to reach point B, considering the wind effects."}]}