{"uid": "590-E", "url": "https://codeforces.com/contest/590/problem/E", "tags": ["graph matchings", " strings"], "title": "590-E", "statement": "E. Birthdaytime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputToday is birthday of a Little Dasha — she is now 8 years old! On this occasion, each of hernfriends and relatives gave her a ribbon with a greeting written on it, and, as it turned out, all the greetings are different. Dasha gathered all the ribbons and decided to throw away some of them in order to make the remaining setstylish. The birthday girl considers a set of ribbons stylish if no greeting written on some ribbon is a substring of another greeting written on some other ribbon. Let us recall that the substring of the stringsis a continuous segment ofs.Help Dasha to keep as many ribbons as possible, so that she could brag about them to all of her friends. Dasha cannot rotate or flip ribbons, that is, each greeting can be read in a single way given in the input.InputThe first line of the input contains integern(1 ≤n≤ 750) — the number of Dasha's relatives and friends.Each of the nextnlines contains exactly one greeting. Each greeting consists of characters 'a' and 'b' only.The total length of all greetings won't exceed10 000 000characters.OutputIn the first line print the maximum size of the stylish set. In the second line print the numbers of ribbons involved in it, assuming that they are numbered from1tonin the order they appear in the input. If there are several stylish sets of the maximum size, print any of them.ExamplesInput5abababaaababababbbabOutput22 5NoteIn the sample, the answer that keeps ribbons 3 and 4 is also considered correct.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "74c9278c", "template_md5": "35d339e4", "result": "You are given $n$ strings, each consisting only of the characters 'a' and 'b'.  Find the largest number of strings you can choose so that no string is a substring of another string in the chosen set. Output the largest number of strings and the indices of those strings."}, {"prompt_md5": "aa587feb", "template_md5": "465699a0", "result": "You are given a list of strings. Find the longest subset of these strings where no string is a substring of any other string in the subset. Output the length of the longest subset and the indices of the strings in that subset."}]}