{"uid": "592-B", "url": "https://codeforces.com/contest/592/problem/B", "tags": ["math"], "title": "592-B", "statement": "B. The Monster and the Squirreltime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAri the monster always wakes up very early with the first ray of the sun and the first thing she does is feeding her squirrel.Ari draws a regular convex polygon on the floor and numbers it's vertices1, 2, ...,nin clockwise order. Then starting from the vertex1she draws a ray in the direction of each other vertex. The ray stops when it reaches a vertex or intersects with another ray drawn before. Ari repeats this process for vertex2, 3, ...,n(in this particular order). And then she puts a walnut in each region inside the polygon.Ada the squirrel wants to collect all the walnuts, but she is not allowed to step on the lines drawn by Ari. That means Ada have to perform a small jump if she wants to go from one region to another. Ada can jump from one region P to another region Q if and only if P and Qshare a side or a corner.Assuming that Ada starts from outside of the picture, what is the minimum number of jumps she has to perform in order to collect all the walnuts?InputThe first and only line of the input contains a single integern(3 ≤n≤ 54321) - the number of vertices of the regular polygon drawn by Ari.OutputPrint the minimum number of jumps Ada should make to collect all the walnuts. Note, that shedoesn't needto leave the polygon after.ExamplesInput5Output9Input3Output1NoteOne of the possible solutions for the first sample is shown on the picture above.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "21da0f86", "template_md5": "35d339e4", "result": "You are given a regular polygon with $n$ sides ($3 \\le n \\le 54321$).  Lines are drawn from each vertex to every other vertex, dividing the polygon into regions.  \n\nStarting from outside the polygon, you must enter the polygon and collect all the items in each region. You can only move from one region to another by sharing a side or a corner. What is the minimum number of moves required to collect all the items?"}, {"prompt_md5": "5bdc97f8", "template_md5": "465699a0", "result": "You are given a polygon with a certain number of sides.  Walnuts are placed in each section of the polygon. You start outside the polygon and must collect all the walnuts. You can only move from one section to another by sharing a side or corner. What is the fewest moves you need to make?"}]}