{"uid": "593-B", "url": "https://codeforces.com/contest/593/problem/B", "tags": ["geometry", " sortings"], "title": "593-B", "statement": "B. Anton and Linestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe teacher gave Anton a large geometry homework, but he didn't do it (as usual) as he participated in a regular round on Codeforces. In the task he was given a set ofnlines defined by the equationsy=ki·x+bi. It was necessary to determine whether there is at least one point of intersection of two of these lines, that lays strictly inside the strip betweenx1<x2. In other words, is it true that there are1 ≤i<j≤nandx',y', such that:y' =ki*x' +bi, that is, point(x',y')belongs to the line numberi;y' =kj*x' +bj, that is, point(x',y')belongs to the line numberj;x1<x' <x2, that is, point(x',y')lies inside the strip bounded byx1<x2.You can't leave Anton in trouble, can you? Write a program that solves the given task.InputThe first line of the input contains an integern(2 ≤n≤ 100 000) — the number of lines in the task given to Anton. The second line contains integersx1andx2(- 1 000 000 ≤x1<x2≤ 1 000 000) defining the strip inside which you need to find a point of intersection of at least two lines.The followingnlines contain integerski,bi(- 1 000 000 ≤ki,bi≤ 1 000 000) — the descriptions of the lines. It is guaranteed that all lines are pairwise distinct, that is, for any twoi≠jit is true that eitherki≠kj, orbi≠bj.OutputPrint \"Yes\" (without quotes), if there is at least one intersection of two distinct lines, located strictly inside the strip. Otherwise print \"No\" (without quotes).ExamplesInput41 21 21 00 10 2OutputNOInput21 31 0-1 3OutputYESInput21 31 00 2OutputYESInput21 31 00 3OutputNONoteIn the first sample there are intersections located on the border of the strip, but there are no intersections located strictly inside it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b79cdf13", "template_md5": "35d339e4", "result": "You are given $n$ lines, each defined by the equation $y = kx + b$.  You are also given two numbers, $x_1$ and $x_2$ ($x_1 < x_2$).  \n\nDetermine if there are two distinct lines, such that their intersection point lies strictly inside the interval $x_1 < x < x_2$. \n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 100,000), the number of lines.\n* The second line contains two integers $x_1$ and $x_2$ (-1,000,000 ≤ $x_1$ < $x_2$ ≤ 1,000,000), defining the interval.\n* The following $n$ lines each contain two integers $k$ and $b$ (-1,000,000 ≤ $k$, $b$ ≤ 1,000,000), representing the equation $y = kx + b$.\n\n**Output:**\n\nPrint \"Yes\" if there is at least one intersection point inside the interval. Otherwise, print \"No\"."}, {"prompt_md5": "c5fdb5ba", "template_md5": "465699a0", "result": "Given a set of lines and a range on the x-axis, determine if any two distinct lines intersect within that range."}]}