{"uid": "593-E", "url": "https://codeforces.com/contest/593/problem/E", "tags": ["dp", " matrices"], "title": "593-E", "statement": "E. Strange Calculation and Catstime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputGosha's universe is a table consisting ofnrows andmcolumns. Both the rows and columns are numbered with consecutive integers starting with1. We will use(r,c)to denote a cell located in the rowrand columnc.Gosha is often invited somewhere. Every time he gets an invitation, he first calculates the number of ways to get to this place, and only then he goes. Gosha's house is located in the cell(1, 1).At any moment of time, Gosha moves from the cell he is currently located in to a cell adjacent to it (two cells are adjacent if they share a common side). Of course, the movement is possible only if such a cell exists, i.e. Gosha will not go beyond the boundaries of the table. Thus, from the cell(r,c)he is able to make a move to one of the cells(r- 1,c),(r,c- 1),(r+ 1,c),(r,c+ 1). Also, Ghosha can skip a move and stay in the current cell(r,c).Besides the love of strange calculations, Gosha is allergic to cats, so he never goes to the cell that has a cat in it. Gosha knows exactly where and when he will be invited and the schedule of cats travelling along the table. Formally, he hasqrecords, thei-th of them has one of the following forms:1,xi,yi,ti— Gosha is invited to come to cell(xi,yi)at the moment of timeti. It is guaranteed that there is no cat inside cell(xi,yi)at this moment of time.2,xi,yi,ti— at the momenttia cat appears in cell(xi,yi). It is guaranteed that no other cat is located in this cell(xi,yi)at that moment of time.3,xi,yi,ti— at the momenttia cat leaves cell(xi,yi). It is guaranteed that there is cat located in the cell(xi,yi).Gosha plans to accept only one invitation, but he has not yet decided, which particular one. In order to make this decision, he asks you to calculate for each of the invitationsithe number of ways to get to the cell(xi,yi)at the momentti. For every invitation, assume that Gosha he starts moving from cell(1, 1)at the moment1.Moving between two neighboring cells takes Gosha exactly one unit of tim. In particular, this means that Gosha can come into the cell only if a cat sitting in it leaves the moment when Gosha begins his movement from the neighboring cell, and if none of the cats comes to the cell at the time when Gosha is in it.Two ways to go from cell(1, 1)to cell(x,y)at timetare considered distinct if for at least one moment of time from1totGosha's positions are distinct for the two ways at this moment. Note, that during this travel Gosha is allowed to visit both(1, 1)and(x,y)multiple times. Since the number of ways can be quite large, print it modulo109+ 7.InputThe first line of the input contains three positive integersn,mandq(1 ≤n·m≤ 20, 1 ≤q≤ 10 000) — the number of rows and columns in the table and the number of events respectively.Nextqlines describe the events, each description contains four integerstpi,xi,yiandti(1 ≤tp≤ 3, 1 ≤x≤n, 1 ≤y≤m, 2 ≤t≤ 109) — the type of the event (1if Gosha gets an invitation,2if a cat comes to the cell and3if a cat leaves the cell), the coordinates of the cell where the action takes place and the moment of time at which the action takes place respectively.It is guaranteed that the queries are given in the chronological order, i.e.ti<ti+ 1.OutputFor each invitationi(that is,tpi= 1) calculate the number of ways to get to cell(xi,yi)at the moment of timeti. Respond to the invitations chronologically, that is, in the order they appear in the input.ExamplesInput1 3 32 1 2 33 1 2 51 1 1 7Output5Input3 3 32 2 2 21 3 3 51 3 3 7Output242Input4 5 52 2 5 32 2 4 63 2 4 91 4 4 131 4 4 15Output49090210598759NoteExplanation of the first sample. Each picture specifies the number of ways to arrive at the cell at the appropriate time. (X stands for a cell blocked at this particular moment of time)Time moment 1.Time moment 2.Time moment 3.Time moment 4.Time moment 5.Time moment 6.Time moment 7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "96526593", "template_md5": "35d339e4", "result": "You are given a table of size $n \\times m$.  There are $q$ events that occur over time. Each event is one of the following types:\n\n* **Type 1:** An invitation to visit a specific cell $(x,y)$ at time $t$.\n* **Type 2:** A cat enters cell $(x,y)$ at time $t$.\n* **Type 3:** A cat leaves cell $(x,y)$ at time $t$.\n\nYou start at cell $(1,1)$. You can move to an adjacent cell (up, down, left, right) in one unit of time. You cannot move through a cell with a cat in it.\n\nFor each invitation (Type 1 event), calculate the number of ways to reach the specified cell at the specified time, considering the cat movements. Two ways are distinct if they differ in position at any point during the journey.\n\nThe number of ways can be very large, so output the answer modulo $10^9 + 7$."}, {"prompt_md5": "c72587ad", "template_md5": "465699a0", "result": "You are given a grid of cells.  At each cell, a cat may or may not be present at a given time. You start at a specific cell and need to determine the number of ways to reach a target cell by a given time, considering that you can only move to adjacent cells and cannot be in a cell with a cat."}]}