{"uid": "594-B", "url": "https://codeforces.com/contest/594/problem/B", "tags": ["binary search", " geometry"], "title": "594-B", "statement": "B. Max and Biketime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputFor months Maxim has been coming to work on his favorite bicycle. And quite recently he decided that he is ready to take part in a cyclists' competitions.He knows that this yearncompetitions will take place. During thei-th competition the participant must as quickly as possible complete a ride along a straight line from pointsito pointfi(si<fi).Measuring time is a complex process related to usage of a special sensor and a time counter. Think of the front wheel of a bicycle as a circle of radiusr. Let's neglect the thickness of a tire, the size of the sensor, and all physical effects. The sensor is placed on the rim of the wheel, that is, on some fixed point on a circle of radiusr. After that the counter moves just like the chosen point of the circle, i.e. moves forward and rotates around the center of the circle.At the beginning each participant can chooseanypointbi, such that his bike is fully behind the starting line, that is,bi<si-r. After that, he starts the movement, instantly accelerates to his maximum speed and at timetsi, when the coordinate of the sensor is equal to the coordinate of the start, the time counter starts. The cyclist makes a complete ride, moving with his maximum speed and at the moment the sensor's coordinate is equal to the coordinate of the finish (moment of timetfi), the time counter deactivates and records the final time. Thus, the counter records that the participant made a complete ride in timetfi-tsi.Maxim is good at math and he suspects that the total result doesn't only depend on his maximum speedv, but also on his choice of the initial pointbi. Now Maxim is asking you to calculate for each ofncompetitions the minimum possible time that can be measured by the time counter. The radius of the wheel of his bike is equal tor.InputThe first line contains three integersn,randv(1 ≤n≤ 100 000, 1 ≤r,v≤ 109) — the number of competitions, the radius of the front wheel of Max's bike and his maximum speed, respectively.Nextnlines contain the descriptions of the contests. Thei-th line contains two integerssiandfi(1 ≤si<fi≤ 109) — the coordinate of the start and the coordinate of the finish on thei-th competition.OutputPrintnreal numbers, thei-th number should be equal to the minimum possible time measured by the time counter. Your answer will be considered correct if its absolute or relative error will not exceed10- 6.Namely: let's assume that your answer equalsa, and the answer of the jury isb. The checker program will consider your answer correct if.ExamplesInput2 1 21 105 9Output3.8496447105021.106060157705", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e73e6db", "template_md5": "35d339e4", "result": "You are given $n$ competitions, each with a starting point $s_i$ and a finish point $f_i$.  A cyclist rides a bike with a wheel of radius $r$ and a maximum speed $v$.  The cyclist can choose any starting point $b_i$ behind the starting line ($b_i < s_i - r$).  \n\nThe cyclist starts at $b_i$, accelerates to their maximum speed, and the timer starts when the sensor on the bike wheel reaches the starting line ($s_i$). The timer stops when the sensor reaches the finish line ($f_i$).\n\nFind the minimum time it takes for the cyclist to complete each competition."}, {"prompt_md5": "fa0e7bd1", "template_md5": "465699a0", "result": "A cyclist races a set number of times. Each race has a starting and ending point. The cyclist's bike has a wheel of a given radius. The cyclist starts before the starting line and accelerates to their maximum speed. The time it takes to complete the race is measured from when the bike's wheel sensor passes the starting line to when it passes the ending line.  Find the minimum time it takes to complete each race, given the cyclist's maximum speed and the wheel radius."}]}