{"uid": "595-B", "url": "https://codeforces.com/contest/595/problem/B", "tags": ["binary search", " math"], "title": "595-B", "statement": "B. Pasha and Phonetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPasha has recently bought a new phonejPagerand started adding his friends' phone numbers there. Each phone number consists of exactlyndigits.Also Pasha has a numberkand two sequences of lengthn/k(nis divisible byk)a1,a2, ...,an/kandb1,b2, ...,bn/k. Let's split the phone number into blocks of lengthk. The first block will be formed by digits from the phone number that are on positions1,2,...,k, the second block will be formed by digits from the phone number that are on positionsk+ 1,k+ 2, ...,2·kand so on. Pasha considers a phone numbergood, if thei-th block doesn't start from the digitbiand is divisible byaiif represented as an integer.To represent the block of lengthkas an integer, let's write it out as a sequencec1,c2,...,ck. Then the integer is calculated as the result of the expressionc1·10k- 1+c2·10k- 2+ ... +ck.Pasha asks you to calculate the number ofgoodphone numbers of lengthn, for the givenk,aiandbi. As this number can be too big, print it modulo109+ 7.InputThe first line of the input contains two integersnandk(1 ≤n≤ 100 000,1 ≤k≤min(n, 9)) — the length of all phone numbers and the length of each block, respectively. It is guaranteed thatnis divisible byk.The second line of the input containsn/kspace-separated positive integers — sequencea1,a2, ...,an/k(1 ≤ai< 10k).The third line of the input containsn/kspace-separated positive integers — sequenceb1,b2, ...,bn/k(0 ≤bi≤ 9).OutputPrint a single integer — the number of good phone numbers of lengthnmodulo109+ 7.ExamplesInput6 238 56 497 3 4Output8Input8 21 22 3 445 4 3 2Output32400NoteIn the first test samplegoodphone numbers are:000000,000098,005600,005698,380000,380098,385600,385698.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8cdbdbc3", "template_md5": "35d339e4", "result": "You are given a number $n$ and a number $k$ where $n$ is divisible by $k$.  You are also given two sequences of length $n/k$: $a_1, a_2, ..., a_{n/k}$ and $b_1, b_2, ..., b_{n/k}$.\n\nA phone number of length $n$ is considered \"good\" if it can be split into $n/k$ blocks of length $k$, and the following conditions are met for each block:\n\n1. The block does not start with the digit $b_i$ (where $i$ is the index of the block).\n2. The integer formed by the digits in the block is divisible by $a_i$.\n\nTo form the integer from a block, concatenate the digits and interpret it as a base-10 number. For example, the block \"123\" represents the integer $1\\cdot10^2 + 2\\cdot10^1 + 3\\cdot10^0 = 123$.\n\nYour task is to find the number of \"good\" phone numbers of length $n$ modulo $10^9 + 7$."}, {"prompt_md5": "4ad93cff", "template_md5": "465699a0", "result": "You are given a number length and a block size.  You are also given two lists of numbers.  \n\nA number is considered \"good\" if it can be split into blocks of the given size, and each block meets these conditions:\n\n1.  It doesn't start with a number from the first list.\n2.  It is divisible by a number from the second list when interpreted as a number.\n\nCount how many \"good\" numbers of the given length exist."}]}