{"uid": "596-A", "url": "https://codeforces.com/contest/596/problem/A", "tags": ["geometry", " implementation"], "title": "596-A", "statement": "A. Wilbur and Swimming Pooltime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter making bad dives into swimming pools, Wilbur wants to build a swimming pool in the shape of a rectangle in his backyard. He has set up coordinate axes, and he wants the sides of the rectangle to be parallel to them. Of course, the area of the rectangle must be positive. Wilbur had all four vertices of the planned pool written on a paper, until his friend came along and erased some of the vertices.Now Wilbur is wondering, if the remainingnvertices of the initial rectangle give enough information to restore the area of the planned swimming pool.InputThe first line of the input contains a single integern(1 ≤n≤ 4) — the number of vertices that werenoterased by Wilbur's friend.Each of the followingnlines contains two integersxiandyi(- 1000 ≤xi,yi≤ 1000) —the coordinates of thei-th vertex that remains. Vertices are given in an arbitrary order.It's guaranteed that these points are distinct vertices of some rectangle, that has positive area and which sides are parallel to the coordinate axes.OutputPrint the area of the initial rectangle if it could be uniquely determined by the points remaining. Otherwise, print- 1.ExamplesInput20 01 1Output1Input11 1Output-1NoteIn the first sample, two opposite corners of the initial rectangle are given, and that gives enough information to say that the rectangle is actually a unit square.In the second sample there is only one vertex left and this is definitely not enough to uniquely define the area.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "43357bdf", "template_md5": "35d339e4", "result": "You are given the coordinates of some vertices of a rectangle. The rectangle's sides are parallel to the x and y axes. Some vertices are missing. Determine if the given vertices are enough to uniquely calculate the area of the original rectangle. If enough information is provided, output the area. Otherwise, output -1.\n\nInput:\n\n* The first line contains an integer *n* (1 ≤ *n* ≤ 4), the number of given vertices.\n* Each of the following *n* lines contains two integers *x* and *y* (-1000 ≤ *x*, *y* ≤ 1000), the coordinates of a vertex.\n\nOutput:\n\n* Output the area of the original rectangle if it can be uniquely determined.\n* Otherwise, output -1."}, {"prompt_md5": "bae0efa8", "template_md5": "465699a0", "result": "You are given some points that represent the corners of a rectangle. Some corners are missing. Can you determine the area of the original rectangle based on the given points? If yes, give the area. If not, say -1."}]}