{"uid": "596-C", "url": "https://codeforces.com/contest/596/problem/C", "tags": ["combinatorics", " greedy", " sortings"], "title": "596-C", "statement": "C. Wilbur and Pointstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWilbur is playing with a set ofnpoints on the coordinate plane. All points have non-negative integer coordinates. Moreover, if some point (x,y) belongs to the set, then all points (x',y'), such that0 ≤x' ≤xand0 ≤y' ≤yalso belong to this set.Now Wilbur wants to number the points in the set he has, that is assign them distinct integer numbers from1ton. In order to make the numberingaesthetically pleasing, Wilbur imposes the condition that if some point (x,y) gets numberi, then all (x',y') from the set, such thatx' ≥xandy' ≥ymust be assigned a number not less thani. For example, for a set of four points (0,0), (0,1), (1,0) and (1,1), there are two aesthetically pleasing numberings. One is1,2,3,4and another one is1,3,2,4.Wilbur's friend comes along and challenges Wilbur. For any point he defines it'sspecial valueass(x,y) =y-x. Now he gives Wilbur somew1,w2,...,wn, and asks him to find an aesthetically pleasing numbering of the points in the set, such that the point that gets numberihas it's special value equal towi, that iss(xi,yi) =yi-xi=wi.Now Wilbur asks you to help him with this challenge.InputThe first line of the input consists of a single integern(1 ≤n≤ 100 000) — the number of points in the set Wilbur is playing with.Next follownlines with points descriptions. Each line contains two integersxandy(0 ≤x,y≤ 100 000), that give one point in Wilbur's set. It's guaranteed that all points are distinct. Also, it is guaranteed that if some point (x,y) is present in the input, then all points (x',y'), such that0 ≤x' ≤xand0 ≤y' ≤y, are also present in the input.The last line of the input containsnintegers. Thei-th of them iswi(- 100 000 ≤wi≤ 100 000) — the required special value of the point that gets numberiin any aesthetically pleasing numbering.OutputIf there exists an aesthetically pleasant numbering of points in the set, such thats(xi,yi) =yi-xi=wi, then print \"YES\" on the first line of the output. Otherwise, print \"NO\".If a solution exists, proceed output withnlines. On thei-th of these lines print the point of the set that gets numberi. If there are multiple solutions, print any of them.ExamplesInput52 00 01 01 10 10 -1 -2 1 0OutputYES0 01 02 00 11 1Input31 00 02 00 1 2OutputNONoteIn the first sample, point (2,0) gets number3, point (0,0) gets number one, point (1,0) gets number2, point (1,1) gets number5and point (0,1) gets number4. One can easily check that this numbering is aesthetically pleasing andyi-xi=wi.In the second sample, the special values of the points in the set are0,- 1, and- 2while the sequence that the friend gives to Wilbur is0,1,2. Therefore, the answer does not exist.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "af4d61d5", "template_md5": "35d339e4", "result": "You are given a set of points on a coordinate plane. Each point has non-negative integer coordinates.  If a point $(x,y)$ is in the set, then all points $(x',y')$ where $0 \\le x' \\le x$ and $0 \\le y' \\le y$ are also in the set.\n\nYou need to assign each point a distinct number from 1 to $n$ (where $n$ is the number of points) following these rules:\n\n* **Rule 1:** If a point $(x,y)$ is assigned the number $i$, then all points $(x',y')$ where $x' \\ge x$ and $y' \\ge y$ must be assigned a number greater than or equal to $i$.\n\nYou are also given a list of $n$ special values, $w_1, w_2, ..., w_n$.  \n\nYour task is to find a way to assign the numbers to the points so that the special value of each point is equal to its corresponding $w_i$ value. The special value of a point $(x,y)$ is defined as $y-x$.\n\nIf such an assignment is possible, print \"YES\" followed by the coordinates of each point and its assigned number. If it's not possible, print \"NO\"."}, {"prompt_md5": "ae5486af", "template_md5": "465699a0", "result": "You are given a set of points on a grid.  Each point has a special value calculated as its y-coordinate minus its x-coordinate. You need to assign each point a unique number from 1 to the number of points.  The rule is that if a point gets a number 'i', then all points with a y-coordinate and x-coordinate greater than or equal to the given point's coordinates must also have a number greater than or equal to 'i'.  \n\nGiven a list of special values, determine if it's possible to assign numbers to the points so that the special value of each point matches the corresponding value in the list. If possible, output the point that gets each number."}]}