{"uid": "596-D", "url": "https://codeforces.com/contest/596/problem/D", "tags": ["dp", " math", " probabilities", " sortings"], "title": "596-D", "statement": "D. Wilbur and Treestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWilbur the pig really wants to be a beaver, so he decided today to pretend he is a beaver and bite at trees to cut them down.There arentrees located at various positions on a line. Treeiis located at positionxi. All the given positions of the trees are distinct.The trees are equal, i.e. each tree has heighth. Due to the wind, when a tree is cut down, it either falls left with probabilityp, or falls right with probability1 -p. If a tree hits another tree while falling, that tree will fall in the same direction as the tree that hit it. A tree can hit another tree only if the distance between them is strictly less thanh.For example, imagine there are4trees located at positions1,3,5and8, whileh= 3and the tree at position1falls right. It hits the tree at position3and it starts to fall too. In it's turn it hits the tree at position5and it also starts to fall. The distance between8and5is exactly3, so the tree at position8will not fall.As long as there are still trees standing, Wilbur will select either the leftmost standing tree with probability0.5or the rightmost standing tree with probability0.5. Selected tree is then cut down. If there is only one tree remaining, Wilbur always selects it. As the ground is covered with grass, Wilbur wants to know the expected total length of the ground covered with fallen trees after he cuts them all down because he is concerned about his grass-eating cow friends. Please help Wilbur.InputThe first line of the input contains two integers,n(1 ≤n≤ 2000)andh(1 ≤h≤ 108)and a real numberp(0 ≤p≤ 1), given with no more than six decimal places.The second line of the input containsnintegers,x1,x2, ...,xn( - 108≤xi≤ 108)in no particular order.OutputPrint a single real number — the expected total length of the ground covered by trees when they have all fallen down. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput2 2 0.5000001 2Output3.250000000Input4 3 0.44 3 1 2Output6.631200000NoteConsider the first example, we have 2 trees with height 2.There are 3 scenarios:1. Both trees falls left. This can either happen with the right tree falling left first, which hasprobability (also knocking down the left tree), or the left tree can fall left and then the right tree can fall left, which hasprobability. Total probability is.2. Both trees fall right. This is analogous to (1), so the probability of this happening is.3. The left tree fall left and the right tree falls right. This is the only remaining scenario so it must haveprobability.Cases 1 and 2 lead to a total of 3 units of ground covered, while case 3 leads to a total of 4 units of ground covered. Thus, the expected value is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "06fd2e79", "template_md5": "35d339e4", "result": "There are $n$ trees of equal height $h$ located at distinct positions $x_1, x_2, ..., x_n$ on a line.  Each tree has a probability $p$ of falling to the left and a probability $(1-p)$ of falling to the right when cut down. If a tree falls and hits another tree within a distance of $h$, the hit tree will fall in the same direction.\n\nThe algorithm works as follows:\n\n1.  While there are multiple trees standing, randomly select either the leftmost or rightmost standing tree with equal probability.\n2.  Cut down the selected tree.\n3.  Repeat steps 1 and 2 until all trees are cut down.\n\nGiven these rules, calculate the expected total length of ground covered by fallen trees."}, {"prompt_md5": "36a8b493", "template_md5": "465699a0", "result": "You are given a number of points on a line. Each point represents a tree of equal height.  A tree, when cut, falls either left or right with a given probability. If a falling tree hits another tree, it causes that tree to fall in the same direction.  You randomly choose a tree to cut down at each step, either the leftmost or rightmost standing tree.  What is the expected total length of ground covered by fallen trees?"}]}