{"uid": "598-B", "url": "https://codeforces.com/contest/598/problem/B", "tags": ["implementation", " strings"], "title": "598-B", "statement": "B. Queries on a Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a stringsand should processmqueries. Each query is described by two 1-based indicesli,riand integerki. It means that you should cyclically shift the substrings[li...ri]kitimes. The queries should be processed one after another in the order they are given.One operation of a cyclic shift (rotation) is equivalent to moving the last character to the position of the first character and shifting all other characters one position to the right.For example, if the stringsisabacabaand the query isl1= 3,r1= 6,k1= 1then the answer isabbacaa. If after that we would process the queryl2= 1,r2= 4,k2= 2then we would get the stringbaabcaa.InputThe first line of the input contains the strings(1 ≤ |s| ≤ 10 000) in its initial state, where|s|stands for the length ofs. It contains only lowercase English letters.Second line contains a single integerm(1 ≤m≤ 300) — the number of queries.Thei-th of the nextmlines contains three integersli,riandki(1 ≤li≤ri≤ |s|, 1 ≤ki≤ 1 000 000) — the description of thei-th query.OutputPrint the resulting stringsafter processing allmqueries.ExamplesInputabacaba23 6 11 4 2OutputbaabcaaNoteThe sample is described in problem statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ed5b8ae7", "template_md5": "35d339e4", "result": "You are given a string $s$. You need to process $m$ queries. Each query is defined by three numbers: $l_i$, $r_i$, and $k_i$.  \n\nFor each query, you need to cyclically shift the substring of $s$ from index $l_i$ to $r_i$  $k_i$ times to the right.  \n\nAfter processing all queries, print the resulting string.\n\n**Example:**\n\n* String: `abacaba`\n* Queries:\n    * $l_1 = 3$, $r_1 = 6$, $k_1 = 1$\n    * $l_2 = 1$, $r_2 = 4$, $k_2 = 2$\n\n* Resulting string: `baabcaa` \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "e744ff2d", "template_md5": "465699a0", "result": "You are given a string. You need to perform multiple operations on the string. Each operation involves rotating a specific part of the string a certain number of times. After each operation, you need to keep the modified string. Finally, output the resulting string."}]}