{"uid": "598-F", "url": "https://codeforces.com/contest/598/problem/F", "tags": ["geometry"], "title": "598-F", "statement": "F. Cut Lengthtime limit per test0.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputGiven simple (without self-intersections)n-gon. It is not necessary convex. Also you are givenmlines. For each line find the length of common part of the line and then-gon.The boundary ofn-gon belongs to polygon. It is possible thatn-gon contains 180-degree angles.InputThe first line contains integersnandm(3 ≤n≤ 1000;1 ≤m≤ 100). The followingnlines contain coordinates of polygon vertices (in clockwise or counterclockwise direction). All vertices are distinct.The followingmlines contain line descriptions. Each of them contains two distict points of a line by their coordinates.All given in the input coordinates are real numbers, given with at most two digits after decimal point. They do not exceed105by absolute values.OutputPrintmlines, thei-th line should contain the length of common part of the givenn-gon and thei-th line. The answer will be considered correct if the absolute or relative error doesn't exceed10- 6.ExamplesInput4 30 01 01 10 10 0 1 10 0 0 10 0 1 -1Output1.414213562373095145471.000000000000000000000.00000000000000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3632a905", "template_md5": "35d339e4", "result": "You are given a polygon with $n$ sides ($3 \\le n \\le 1000$) and $m$ lines ($1 \\le m \\le 100$).  The polygon's vertices are given as coordinates.  \n\nFor each line, find the length of the part of the line that overlaps with the polygon. The polygon's boundary is considered part of the polygon.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$.\n* The next $n$ lines each contain two real numbers, representing the coordinates of a vertex of the polygon.\n* The next $m$ lines each contain two real numbers, representing the coordinates of two points on a line.\n\n**Output:**\n\n* Print $m$ lines, each containing the length of the overlap between the corresponding line and the polygon. The answer should be accurate to at least 6 decimal places."}, {"prompt_md5": "71001dae", "template_md5": "465699a0", "result": "You are given a polygon and a set of lines.  For each line, find the length of the part of the line that overlaps with the polygon."}]}