{"uid": "6-A", "url": "https://codeforces.com/contest/6/problem/A", "tags": ["brute force", " geometry"], "title": "6-A", "statement": "A. Triangletime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutJohnny has a younger sister Anne, who is very clever and smart. As she came home from the kindergarten, she told his brother about the task that her kindergartener asked her to solve. The task was just to construct a triangle out of four sticks of different colours. Naturally, one of the sticks is extra. It is not allowed to break the sticks or use their partial length. Anne has perfectly solved this task, now she is asking Johnny to do the same.The boy answered that he would cope with it without any difficulty. However, after a while he found out that different tricky things can occur. It can happen that it is impossible to construct a triangle of a positive area, but it is possible to construct a degenerate triangle. It can be so, that it is impossible to construct a degenerate triangle even. As Johnny is very lazy, he does not want to consider such a big amount of cases, he asks you to help him.InputThe first line of the input contains four space-separated positive integer numbers not exceeding 100 — lengthes of the sticks.OutputOutputTRIANGLEif it is possible to construct a non-degenerate triangle. OutputSEGMENTif the first case cannot take place and it is possible to construct a degenerate triangle. OutputIMPOSSIBLEif it is impossible to construct any triangle. Remember that you are to use three sticks. It is not allowed to break the sticks or use their partial length.ExamplesInput4 2 1 3OutputTRIANGLEInput7 2 2 4OutputSEGMENTInput3 5 9 1OutputIMPOSSIBLE", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ffd35776", "template_md5": "35d339e4", "result": "You are given four positive integers representing the lengths of four sticks. Determine if it is possible to construct a triangle using exactly three of these sticks. \n\n* If a triangle with a positive area can be formed, output \"TRIANGLE\".\n* If only a degenerate triangle (a triangle with zero area) can be formed, output \"SEGMENT\".\n* If no triangle can be formed, output \"IMPOSSIBLE\". \n\nRemember, you cannot break the sticks or use parts of them."}, {"prompt_md5": "86620f36", "template_md5": "465699a0", "result": "Given four lengths, determine if you can form a triangle using three of them.  If yes, output \"TRIANGLE\". If you can form a degenerate triangle (a straight line) but not a proper triangle, output \"SEGMENT\". If you cannot form any triangle, output \"IMPOSSIBLE\"."}]}