{"uid": "6-C", "url": "https://codeforces.com/contest/6/problem/C", "tags": ["greedy", " two pointers"], "title": "6-C", "statement": "C. Alice, Bob and Chocolatetime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutAlice and Bob like games. And now they are ready to start a new game. They have placednchocolate bars in a line. Alice starts to eat chocolate bars one by one from left to right, and Bob — from right to left. For each chocololate bar the time, needed for the player to consume it, is known (Alice and Bob eat them with equal speed). When the player consumes a chocolate bar, he immediately starts with another. It is not allowed to eat two chocolate bars at the same time, to leave the bar unfinished and to make pauses. If both players start to eat the same bar simultaneously, Bob leaves it to Alice as a true gentleman.How many bars each of the players will consume?InputThe first line contains one integern(1 ≤n≤ 105) — the amount of bars on the table. The second line contains a sequencet1,t2, ...,tn(1 ≤ti≤ 1000), wheretiis the time (in seconds) needed to consume thei-th bar (in the order from left to right).OutputPrint two numbersaandb, whereais the amount of bars consumed by Alice, andbis the amount of bars consumed by Bob.ExamplesInput52 9 8 2 7Output2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "94c96322", "template_md5": "35d339e4", "result": "There are $n$ chocolate bars in a line. Two players take turns eating the bars. Player 1 eats from left to right, and Player 2 eats from right to left. Each bar takes a certain amount of time to eat ($t_i$ seconds for the $i$-th bar). If both players try to eat the same bar at the same time, Player 2 lets Player 1 eat it.  \n\nWhat is the number of bars each player will eat? \n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the number of chocolate bars.\n* The second line contains $n$ integers $t_1$, $t_2$, ..., $t_n$ (1 ≤ $t_i$ ≤ 1000) representing the time it takes to eat each bar.\n\nOutput:\n\n* Print two integers $a$ and $b$, where $a$ is the number of bars Player 1 eats and $b$ is the number of bars Player 2 eats."}, {"prompt_md5": "8da36efe", "template_md5": "465699a0", "result": "Two people eat chocolate bars from opposite ends of a line. They eat at the same speed. If they reach the same bar at the same time, the person on the left gets to eat it.  How many bars does each person eat?"}]}