{"uid": "600-E", "url": "https://codeforces.com/contest/600/problem/E", "tags": ["data structures", " dfs and similar", " dsu", " trees"], "title": "600-E", "statement": "E. Lomsat gelraltime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a rooted tree with root in vertex1. Each vertex is coloured in some colour.Let's call colourcdominating in the subtree of vertexvif there are no other colours that appear in the subtree of vertexvmore times than colourc. So it's possible that two or more colours will be dominating in the subtree of some vertex.The subtree of vertexvis the vertexvand all other vertices that contains vertexvin each path to the root.For each vertexvfind the sum of all dominating colours in the subtree of vertexv.InputThe first line contains integern(1 ≤n≤ 105) — the number of vertices in the tree.The second line containsnintegersci(1 ≤ci≤n),ci— the colour of thei-th vertex.Each of the nextn- 1lines contains two integersxj,yj(1 ≤xj,yj≤n) — the edge of the tree. The first vertex is the root of the tree.OutputPrintnintegers — the sums of dominating colours for each vertex.ExamplesInput41 2 3 41 22 32 4Output10 9 3 4Input151 2 3 1 2 3 3 1 1 3 2 2 1 2 31 21 31 41 141 152 52 62 73 83 93 104 114 124 13Output6 5 4 3 2 3 3 1 1 3 2 2 1 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b32b9ba9", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices, where each vertex has a color from 1 to $n$.  \n\nFor each vertex, find the sum of all colors that are \"dominating\" in its subtree. A color is dominating in a subtree if it appears more times in that subtree than any other color.\n\n**Input:**\n\n* The first line contains $n$.\n* The second line contains $n$ integers, each representing the color of a vertex.\n* The next $n-1$ lines each contain two integers, representing an edge in the tree.\n\n**Output:**\n\n* Print $n$ integers, where each integer is the sum of dominating colors for the corresponding vertex."}, {"prompt_md5": "205a382a", "template_md5": "465699a0", "result": "You are given a tree-like structure with a designated starting point. Each point has a color.  For each point, find the sum of all the colors that appear most frequently within its branch of the tree (including itself)."}]}