{"uid": "600-A", "url": "https://codeforces.com/contest/600/problem/A", "tags": ["implementation", " strings"], "title": "600-A", "statement": "A. Extract Numberstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given strings. Let's callwordany largest sequence of consecutive symbols without symbols ',' (comma) and ';' (semicolon). For example, there are fourwordsin string \"aba,123;1a;0\": \"aba\", \"123\", \"1a\", \"0\". A word can be empty: for example, the strings=\";;\" contains three empty words separated by ';'.You should find allwordsin the given string that are nonnegative INTEGER numbers without leading zeroes and build by them new stringa. Stringashould contain allwordsthat are numbers separating them by ',' (the order of numbers should remain the same as in the strings). By all otherwordsyou should build stringbin the same way (the order of numbers should remain the same as in the strings).Here strings \"101\", \"0\" are INTEGER numbers, but \"01\" and \"1.0\" are not.For example, for the stringaba,123;1a;0the stringawould be equal to \"123,0\" and stringbwould be equal to \"aba,1a\".InputThe only line of input contains the strings(1 ≤ |s| ≤ 105). The string contains only symbols '.' (ASCII 46), ',' (ASCII 44), ';' (ASCII 59), digits, lowercase and uppercase latin letters.OutputPrint the stringato the first line and stringbto the second line. Each string should be surrounded by quotes (ASCII 34).If there are nowordsthat are numbers print dash (ASCII 45) on the first line. If allwordsare numbers print dash on the second line.ExamplesInputaba,123;1a;0Output\"123,0\"\"aba,1a\"Input1;;01,a0,Output\"1\"\",01,a0,\"Input1Output\"1\"-InputaOutput-\"a\"NoteIn the second example the stringscontains five words: \"1\", \"\", \"01\", \"a0\", \"\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ddf0e6cf", "template_md5": "35d339e4", "result": "You are given a string.  A \"word\" is a sequence of consecutive letters or digits without commas or semicolons.  \n\nYour task is to:\n\n1. Identify all the words in the string that are non-negative integers (whole numbers greater than or equal to zero with no leading zeros).\n\n2. Create a new string \"a\" by joining these integer words together with commas.\n\n3. Create a new string \"b\" by joining all the other words together with commas.\n\n**Output:**\n\nPrint \"a\" on the first line and \"b\" on the second line. If there are no integer words, print \"-\" on the first line. If all words are integers, print \"-\" on the second line."}, {"prompt_md5": "d781d519", "template_md5": "465699a0", "result": "You are given a string of characters.  Find all the sequences of digits within the string that form valid whole numbers.  \n\nCreate a new string containing only those numbers, separated by commas.  \n\nCreate a second string containing all the other characters from the original string, separated by commas."}]}