{"uid": "601-E", "url": "https://codeforces.com/contest/601/problem/E", "tags": ["data structures", " dp"], "title": "601-E", "statement": "E. A Museum Robberytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere's a famous museum in the city where Kleofáš lives. In the museum,nexhibits (numbered1throughn) had been displayed for a long time; thei-th of those exhibits has valueviand masswi.Then, the museum was bought by a large financial group and started to vary the exhibits. At about the same time, Kleofáš... gained interest in the museum, so to say.You should processqevents of three types:type1— the museum displays an exhibit with valuevand massw; the exhibit displayed in thei-th event of this type is numberedn+i(see sample explanation for more details)type2— the museum removes the exhibit with numberxand stores it safely in its vaulttype3— Kleofáš visits the museum and wonders (for no important reason at all, of course): if there was a robbery and exhibits with total mass at mostmwere stolen, what would their maximum possible total value be?For each event of type 3, lets(m)be the maximum possible total value of stolen exhibits with total mass≤m.Formally, letDbe the set of numbers of all exhibits that are currently displayed (so initiallyD= {1, ..., n}). LetP(D)be the set of all subsets ofDand letThen,s(m)is defined asComputes(m)for each. Note that the output follows a special format.InputThe first line of the input contains two space-separated integersnandk(1 ≤n≤ 5000,1 ≤k≤ 1000) — the initial number of exhibits in the museum and the maximum interesting mass of stolen exhibits.Then,nlines follow. Thei-th of them contains two space-separated positive integersviandwi(1 ≤vi≤ 1 000 000,1 ≤wi≤ 1000) — the value and mass of thei-th exhibit.The next line contains a single integerq(1 ≤q≤ 30 000) — the number of events.Each of the nextqlines contains the description of one event in the following format:1vw— an event of type 1, a new exhibit with valuevand masswhas been added (1 ≤v≤ 1 000 000,1 ≤w≤ 1000)2x— an event of type 2, the exhibit with numberxhas been removed; it's guaranteed that the removed exhibit had been displayed at that time3— an event of type 3, Kleofáš visits the museum and asks his questionThere will be at most10 000events of type 1 and at least one event of type 3.OutputAs the number of valuess(m)can get large, output the answers to events of type 3 in a special format.For each event of type 3, consider the valuess(m)computed for the question that Kleofáš asked in this event; print one line containing a single numberwherep= 107+ 19andq= 109+ 7.Print the answers to events of type 3 in the order in which they appear in the input.ExamplesInput3 1030 460 65 1931 42 51 20 332 22 431 40 63Output556674384168191145947033915181541912Input3 1000100 42100 47400 1542 22 12 33Output0NoteIn the first sample, the numbers of displayed exhibits and valuess(1), ...,s(10)for individual events of type 3 are, in order:The values of individual exhibits arev1= 30,v2= 60,v3= 5,v4= 42,v5= 20,v6= 40and their masses arew1= 4,w2= 6,w3= 1,w4= 5,w5= 3,w6= 6.In the second sample, the only question is asked after removing all exhibits, sos(m) = 0for anym.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5dc2a145", "template_md5": "35d339e4", "result": "There are $n$ exhibits in a museum, each with a value $v_i$ and a mass $w_i$.  You are given a list of $q$ events:\n\n* **Type 1:** Add a new exhibit with value $v$ and mass $w$ to the museum.\n* **Type 2:** Remove the exhibit with number $x$ from the museum.\n* **Type 3:**  Given a mass $m$, find the maximum total value of exhibits that could be stolen from the museum if the total mass of the stolen exhibits is at most $m$.\n\nFor each event of type 3, output the maximum possible total value.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($1 \\le n \\le 5000$, $1 \\le k \\le 1000$), representing the initial number of exhibits and the maximum interesting mass of stolen exhibits.\n* The next $n$ lines each contain two integers, $v_i$ and $w_i$ ($1 \\le v_i \\le 1000000$, $1 \\le w_i \\le 1000$), representing the value and mass of each exhibit.\n* The next line contains an integer $q$ ($1 \\le q \\le 30000$), representing the number of events.\n* The next $q$ lines each describe an event in the format:\n    * `1 vw`: Add an exhibit with value $v$ and mass $w$.\n    * `2 x`: Remove the exhibit with number $x$.\n    * `3`: Ask for the maximum possible total value of stolen exhibits with a total mass at most $m$.\n\n**Output:**\n\nFor each event of type 3, output a single number representing the maximum possible total value.  The output should follow a special format (see the original problem statement for details)."}, {"prompt_md5": "61560e52", "template_md5": "465699a0", "result": "You are given a list of items, each with a value and a weight.  You can add or remove items.  You need to answer queries asking for the maximum total value of items that can be selected, given a maximum total weight."}]}