{"uid": "603-B", "url": "https://codeforces.com/contest/603/problem/B", "tags": ["combinatorics", " dfs and similar", " dsu", " math", " number theory"], "title": "603-B", "statement": "B. Moodular Arithmetictime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAs behooves any intelligent schoolboy, Kevin Sun is studying psycowlogy, cowculus, and cryptcowgraphy at the Bovinia State University (BGU) under Farmer Ivan. During his Mathematics of Olympiads (MoO) class, Kevin was confronted with a weird functional equation and needs your help. For two fixed integerskandp, wherepis an odd prime number, the functional equation states thatfor some function. (This equation should hold for any integerxin the range0top- 1, inclusive.)It turns out thatfcan actually be many different functions. Instead of finding a solution, Kevin wants you to count the number of distinct functionsfthat satisfy this equation. Since the answer may be very large, you should print your result modulo109+ 7.InputThe input consists of two space-separated integerspandk(3 ≤p≤ 1 000 000,0 ≤k≤p- 1) on a single line. It is guaranteed thatpis an odd prime number.OutputPrint a single integer, the number of distinct functionsfmodulo109+ 7.ExamplesInput3 2Output3Input5 4Output25NoteIn the first sample,p= 3andk= 2. The following functions work:f(0) = 0,f(1) = 1,f(2) = 2.f(0) = 0,f(1) = 2,f(2) = 1.f(0) =f(1) =f(2) = 0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1827916d", "template_md5": "35d339e4", "result": "Given two integers $p$ and $k$ where $p$ is an odd prime number, find the number of distinct functions $f$ that satisfy the following equation for all integers $x$ in the range $0$ to $p-1$ inclusive:\n\n$$f(x+k) \\equiv f(x) \\pmod{p}$$\n\nPrint the result modulo $10^9 + 7$."}, {"prompt_md5": "57e17297", "template_md5": "465699a0", "result": "Given two numbers, *p* and *k*, where *p* is an odd prime number, find the number of different functions that satisfy a specific rule. The rule involves the function's output for values from 0 to *p*-1.  The answer should be the number of unique functions modulo 10^9 + 7."}]}