{"uid": "603-E", "url": "https://codeforces.com/contest/603/problem/E", "tags": ["data structures", " divide and conquer", " dsu", " math", " trees"], "title": "603-E", "statement": "E. Pastoral Odditiestime limit per test4 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn the land of Bovinia there arenpastures, but no paths connecting the pastures. Of course, this is a terrible situation, so Kevin Sun is planning to rectify it by constructingmundirected paths connecting pairs of distinct pastures. To make transportation more efficient, he also plans to pave some of these new paths.Kevin is very particular about certain aspects of path-paving. Since he loves odd numbers, he wants each pasture to have an odd number of paved paths connected to it. Thus we call a pavingsunnyif each pasture is incident to an odd number of paved paths. He also enjoys short paths more than long paths, so he would like the longest paved path to be as short as possible. After adding each path, Kevin wants to know if a sunny paving exists for the paths of Bovinia, and if at least one does, the minimum possible length of the longest path in such a paving. Note that \"longest path\" here means maximum-weight edge.InputThe first line contains two integersn(2 ≤n≤ 100 000) andm(1 ≤m≤ 300 000), denoting the number of pastures and paths, respectively. The nextmlines each contain three integersai,biandli, describing thei-th path. Thei-th path connects pasturesaiandbi(1 ≤ai,bi≤n;ai≠bi) and has lengthli(1 ≤li≤ 109). Paths are given in the order in which they are constructed.OutputOutputmlines. Thei-th line should contain a single integer denoting the minimum possible length of the longest path (maximum-weight edge) in a sunny paving using only the firstipaths. If Kevin cannot pave a set of paths so that each pasture is incident to an odd number of paved paths, output- 1.Note that the paving is only hypothetical—your answer after adding thei-th path should not be affected by any of your previous answers.ExamplesInput4 41 3 42 4 81 2 23 4 3Output-1883Input3 21 2 32 3 4Output-1-1Input4 102 1 9873 2 8294 1 7684 2 6083 4 5933 2 4884 2 3342 1 2041 3 1141 4 39Output-1-1829829768768768488334204NoteFor the first sample, these are the paths that Kevin should pave after building thei-th path:No set of paths works.Paths 1 (length4) and 2 (length8).Paths 1 (length4) and 2 (length8).Paths 3 (length2) and 4 (length3).In the second sample, there never exists a paving that makes Kevin happy.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5d493726", "template_md5": "35d339e4", "result": "You are given $n$ pastures and $m$ paths. Each path connects two distinct pastures and has a length.  \n\nYou need to determine if it's possible to pave a subset of these paths such that:\n\n1. Each pasture has an odd number of paved paths connected to it.\n2. The length of the longest paved path is as short as possible.\n\nFor each path added, you need to output:\n\n* $-1$ if it's impossible to achieve the above conditions.\n* The minimum possible length of the longest paved path if it's possible."}, {"prompt_md5": "407011d0", "template_md5": "465699a0", "result": "You are given a set of connections between points.  You can choose some of these connections to be \"paved\".  The goal is to pave the connections so that each point has an odd number of paved connections, and the length of the longest paved connection is as short as possible.  After adding each new connection, determine if a valid paving is possible and, if so, the length of the longest paved connection."}]}