{"uid": "604-A", "url": "https://codeforces.com/contest/604/problem/A", "tags": ["implementation"], "title": "604-A", "statement": "A. Uncowed Forcestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputKevin Sun has just finished competing in Codeforces Round #334! The round was 120 minutes long and featured five problems with maximum point values of 500, 1000, 1500, 2000, and 2500, respectively. Despite the challenging tasks, Kevin was uncowed and bulldozed through all of them, distinguishing himself from the herd as the best cowmputer scientist in all of Bovinia. Kevin knows his submission time for each problem, the number of wrong submissions that he made on each problem, and his total numbers of successful and unsuccessful hacks. Because Codeforces scoring is complicated, Kevin wants you to write a program to compute his final score.Codeforces scores are computed as follows: If the maximum point value of a problem isx, and Kevin submitted correctly at minutembut madewwrong submissions, then his score on that problem is. His total score is equal to the sum of his scores for each problem. In addition, Kevin's total score gets increased by100points for each successful hack, but gets decreased by50points for each unsuccessful hack.All arithmetic operations are performed with absolute precision and no rounding. It is guaranteed that Kevin's final score is an integer.InputThe first line of the input contains five space-separated integersm1,m2,m3,m4,m5, wheremi(0 ≤mi≤ 119) is the time of Kevin's last submission for problemi. His last submission is always correct and gets accepted.The second line contains five space-separated integersw1,w2,w3,w4,w5, wherewi(0 ≤wi≤ 10) is Kevin's number of wrong submissions on problemi.The last line contains two space-separated integershsandhu(0 ≤hs,hu≤ 20), denoting the Kevin's numbers of successful and unsuccessful hacks, respectively.OutputPrint a single integer, the value of Kevin's final score.ExamplesInput20 40 60 80 1000 1 2 3 41 0Output4900Input119 119 119 119 1190 0 0 0 010 0Output4930NoteIn the second sample, Kevin takes119minutes on all of the problems. Therefore, he getsof the points on each problem. So his score from solving problems is. Adding in10·100 = 1000points from hacks, his total score becomes3930 + 1000 = 4930.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3be4c4e1", "template_md5": "35d339e4", "result": "There are 5 problems with point values of 500, 1000, 1500, 2000, and 2500 respectively. \n\nThe input contains:\n\n* The time (in minutes) of the last submission for each problem.\n* The number of wrong submissions for each problem.\n* The number of successful and unsuccessful hacks.\n\nThe score for each problem is calculated as:\n\n$score = \\frac{max\\_points}{120} * time$\n\nThe total score is the sum of the scores for each problem plus 100 points for each successful hack and minus 50 points for each unsuccessful hack.\n\nOutput the final score."}, {"prompt_md5": "745948e9", "template_md5": "465699a0", "result": "Calculate a person's score based on the time taken to solve five problems, the number of incorrect attempts for each problem, and the number of successful and unsuccessful hacks.  The score for each problem is based on the time taken and incorrect attempts. Successful hacks add 100 points, while unsuccessful hacks subtract 50 points."}]}