{"uid": "605-E", "url": "https://codeforces.com/contest/605/problem/E", "tags": ["probabilities", " shortest paths"], "title": "605-E", "statement": "E. Intergalaxy Tripstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe scientists have recently discovered wormholes — objects in space that allow to travel very long distances between galaxies and star systems.The scientists know that there arengalaxies within reach. You are in the galaxy number1and you need to get to the galaxy numbern. To get from galaxyito galaxyj, you need to fly onto a wormhole(i,j)and in exactly one galaxy day you will find yourself in galaxyj.Unfortunately, the required wormhole is not always available. Every galaxy day they disappear and appear at random. However, the state of wormholes does not change within one galaxy day. A wormhole from galaxyito galaxyjexists during each galaxy day taken separately with probabilitypij. You can always find out what wormholes exist at the given moment. At each moment you can either travel to another galaxy through one of wormholes that exist at this moment or you can simply wait for one galaxy day to see which wormholes will lead from your current position at the next day.Your task is to find the expected value of time needed to travel from galaxy1to galaxyn, if you act in the optimal way. It is guaranteed that this expected value exists.InputThe first line of the input contains a single integern(1 ≤n≤ 1000) — the number of galaxies within reach.Then follows a matrix ofnrows andncolumns. Each elementpijrepresents the probability that there is a wormhole from galaxyito galaxyj. All the probabilities are given in percents and are integers. It is guaranteed that all the elements on the main diagonal are equal to100.OutputPrint a single real value — the expected value of the time needed to travel from galaxy1to galaxynif one acts in an optimal way. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput3100 50 500 100 800 0 100Output1.750000000000000Input2100 3040 100Output3.333333333333333NoteIn the second sample the wormhole from galaxy1to galaxy2appears every day with probability equal to0.3. The expected value of days one needs to wait before this event occurs is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ffb10d1f", "template_md5": "35d339e4", "result": "You are given a graph with $n$ nodes, representing galaxies. Each edge $(i,j)$ has a probability $p_{ij}$ of existing, meaning there is a wormhole connecting galaxy $i$ to galaxy $j$ on a given day.  You start at node 1 and want to reach node $n$.\n\nYou can either:\n\n* Travel to a connected galaxy through an existing wormhole.\n* Wait one day to see which wormholes appear.\n\nFind the expected number of days it takes to reach node $n$ using the optimal strategy. \n\nYou know the probabilities $p_{ij}$ for all pairs of galaxies."}, {"prompt_md5": "c5eda9dd", "template_md5": "465699a0", "result": "You need to travel between cities. Each day, some pairs of cities have a direct connection with a certain probability. You can either stay in your current city or travel to a connected city.  Find the average number of days it takes to travel from the starting city to the destination city, making the best choices each day."}]}