{"uid": "605-D", "url": "https://codeforces.com/contest/605/problem/D", "tags": ["data structures", " dfs and similar"], "title": "605-D", "statement": "D. Board Gametime limit per test2.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are playing a board card game. In this game the player has two characteristics,xandy— the white magic skill and the black magic skill, respectively. There arenspell cards lying on the table, each of them has four characteristics,ai,bi,cianddi. In one move a player can pick one of the cards and cast the spell written on it, but only if first two of it's characteristics meet the requirementai≤xandbi≤y, i.e. if the player has enough magic skill to cast this spell. However, after casting the spell the characteristics of a player change and become equal tox=ciandy=di.At the beginning of the game both characteristics of a player are equal to zero. The goal of the game is to cast then-th spell. Your task is to make it in as few moves as possible. You are allowed to use spell in any order and any number of times (for example, you may not use some spells at all).InputThe first line of the input contains a single integern(1 ≤n≤ 100 000) — the number of cards on the table.Each of the nextnlines contains four integersai,bi,ci,di(0 ≤ai,bi,ci,di≤ 109) — the characteristics of the corresponding card.OutputIn the first line print a single integerk— the minimum number of moves needed to cast then-th spell and in the second line printknumbers — the indices of the cards in the order in which you should cast them. In case there are multiple possible solutions, print any of them.If it is impossible to cast then-th spell, print- 1.ExamplesInput40 0 3 42 2 5 34 1 1 75 3 8 8Output31 2 4Input20 0 4 65 1 1000000000 1000000000Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9d407d39", "template_md5": "35d339e4", "result": "You have a set of $n$ cards, each with four numbers: $a_i$, $b_i$, $c_i$, and $d_i$.  You start with zero magic in both white ($x$) and black ($y$) magic.  \n\nTo play a card, you must have at least $a_i$ white magic and $b_i$ black magic.  After playing a card, your white magic becomes $c_i$ and your black magic becomes $d_i$.\n\nYour goal is to find the fewest number of cards you need to play to reach a specific target card (the $n$th card). You can play cards in any order and any number of times.\n\n**Input:**\n\n* The first line contains $n$ (the number of cards).\n* Each of the next $n$ lines contains four numbers: $a_i$, $b_i$, $c_i$, and $d_i$.\n\n**Output:**\n\n* The first line contains $k$ (the minimum number of cards needed).\n* The second line contains $k$ numbers, representing the indices of the cards to play in order.\n\nIf it's impossible to reach the target card, output -1."}, {"prompt_md5": "32b92861", "template_md5": "465699a0", "result": "You have a set of cards, each with four numbers. To use a card, your current values must be less than or equal to the first two numbers on the card. Using a card changes your values to the last two numbers on the card.  Find the fewest cards needed to reach a target set of values."}]}