{"uid": "607-E", "url": "https://codeforces.com/contest/607/problem/E", "tags": ["binary search", " geometry"], "title": "607-E", "statement": "E. Cross Sumtime limit per test7 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputGenos has been givenndistinct lines on the Cartesian plane. Letbe a list of intersection points of these lines. A single point might appear multiple times in this list if it is the intersection of multiple pairs of lines. The order of the list does not matter.Given a query point(p,q), letbe the corresponding list of distances of all points into the query point. Distance here refers to euclidean distance. As a refresher, the euclidean distance between two points(x1,y1)and(x2,y2)is.Genos is given a point(p,q)and a positive integerm. He is asked to find the sum of themsmallest elements in. Duplicate elements inare treated as separate elements. Genos is intimidated by Div1 E problems so he asked for your help.InputThe first line of the input contains a single integern(2 ≤n≤ 50 000) — the number of lines.The second line contains three integersx,yandm(|x|, |y| ≤ 1 000 000,) — the encoded coordinates of the query point and the integermfrom the statement above. The query point(p,q)is obtained as. In other words, dividexandyby1000to get the actual query point.denotes the length of the listand it is guaranteed that.Each of the nextnlines contains two integersaiandbi(|ai|, |bi| ≤ 1 000 000) — the parameters for a line of the form:. It is guaranteed that no two lines are the same, that is(ai,bi) ≠ (aj,bj)ifi≠j.OutputPrint a single real number, the sum ofmsmallest elements of. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.To clarify, let's assume that your answer isaand the answer of the jury isb. The checker program will consider your answer correct if.ExamplesInput41000 1000 31000 0-1000 00 50000 -5000Output14.282170363Input2-1000000 -1000000 11000000 -1000000999999 1000000Output2000001000.999999500Input3-1000 1000 31000 0-1000 20002000 -1000Output6.000000000Input5-303667 189976 10-638 116487-581 443371231 -7568441427 -440978271 -838417Output12953.274911829NoteIn the first sample, the three closest points have distancesand.In the second sample, the two linesy= 1000x- 1000andintersect at(2000000, 1999999000). This point has a distance offrom( - 1000,  - 1000).In the third sample, the three lines all intersect at the point(1, 1). This intersection point is present three times insince it is the intersection of three pairs of lines. Since the distance between the intersection point and the query point is2, the answer is three times that or6.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d4c0c830", "template_md5": "35d339e4", "result": "You are given $n$ lines on a 2D plane. Each line is defined by its equation $y = ax + b$.  \n\nYou are also given a point $(p, q)$ and an integer $m$.\n\nFor each line, calculate the distance between the line and the point $(p, q)$. The distance between a point and a line is the shortest distance from the point to any point on the line.\n\nFind the sum of the $m$ smallest distances calculated.\n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 50,000) - the number of lines.\n* The second line contains three integers $x$, $y$, and $m$ (|x|, |y| ≤ 1,000,000) - the encoded coordinates of the point $(p, q)$ and the integer $m$. The actual coordinates are obtained by dividing $x$ and $y$ by 1000.\n* Each of the next $n$ lines contains two integers $a$ and $b$ (|a|, |b| ≤ 1,000,000) - the parameters for a line of the form $y = ax + b$.\n\n**Output:**\n\nPrint a single real number, the sum of the $m$ smallest distances."}, {"prompt_md5": "7e5ccfbb", "template_md5": "465699a0", "result": "You are given a set of lines and a point.  Each line is defined by its slope and y-intercept.  Find the sum of the distances from the point to the  'm' closest intersection points of the lines.  Intersection points can repeat if multiple lines intersect at the same point."}]}