{"uid": "607-A", "url": "https://codeforces.com/contest/607/problem/A", "tags": ["binary search", " dp"], "title": "607-A", "statement": "A. Chain Reactiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arenbeacons located at distinct positions on a number line. Thei-th beacon has positionaiand power levelbi. When thei-th beacon is activated, it destroys all beacons to its left (direction of decreasing coordinates) within distancebiinclusive. The beacon itself is not destroyed however. Saitama will activate the beacons one at a time from right to left. If a beacon is destroyed, it cannot be activated.Saitama wants Genos to add a beaconstrictly to the rightof all the existing beacons, with any position and any power level, such that the least possible number of beacons are destroyed. Note that Genos's placement of the beacon means it will be the first beacon activated. Help Genos by finding the minimum number of beacons that could be destroyed.InputThe first line of input contains a single integern(1 ≤n≤ 100 000) — the initial number of beacons.Thei-th of nextnlines contains two integersaiandbi(0 ≤ai≤ 1 000 000,1 ≤bi≤ 1 000 000) — the position and power level of thei-th beacon respectively. No two beacons will have the same position, soai≠ajifi≠j.OutputPrint a single integer — the minimum number of beacons that could be destroyed if exactly one beacon is added.ExamplesInput41 93 16 17 4Output1Input71 12 13 14 15 16 17 1Output3NoteFor the first sample case, the minimum number of beacons destroyed is1. One way to achieve this is to place a beacon at position9with power level2.For the second sample case, the minimum number of beacons destroyed is3. One way to achieve this is to place a beacon at position1337with power level42.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9afb22bf", "template_md5": "465699a0", "result": "You are given a line with several points. Each point has a strength.  When a point is activated, it destroys all points to its left within a certain distance. You need to add a new point to the line to minimize the number of points destroyed when they are activated from right to left."}, {"prompt_md5": "58feab79", "template_md5": "35d339e4", "result": "You are given $n$ beacons located at distinct positions on a number line. The $i$-th beacon has position $a_i$ and power level $b_i$. When the $i$-th beacon is activated, it destroys all beacons to its left (direction of decreasing coordinates) within distance $b_i$ inclusive. The beacon itself is not destroyed.\n\nA new beacon needs to be added strictly to the right of all existing beacons.  Find the minimum number of beacons that will be destroyed if the new beacon is placed in a way that minimizes the number of destroyed beacons. \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100,000) representing the number of beacons.\n* Each of the next $n$ lines contains two integers $a_i$ and $b_i$ (0 ≤ $a_i$ ≤ 1,000,000, 1 ≤ $b_i$ ≤ 1,000,000) representing the position and power level of the $i$-th beacon.\n\n**Output:**\n\n* Print a single integer representing the minimum number of beacons that could be destroyed."}]}