{"uid": "609-A", "url": "https://codeforces.com/contest/609/problem/A", "tags": ["greedy", " implementation", " sortings"], "title": "609-A", "statement": "A. USB Flash Drivestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSean is trying to save a large file to a USB flash drive. He hasnUSB flash drives with capacities equal toa1,a2, ...,anmegabytes. The file size is equal tommegabytes.Find the minimum number of USB flash drives needed to write Sean's file, if he can split the file between drives.InputThe first line contains positive integern(1 ≤n≤ 100) — the number of USB flash drives.The second line contains positive integerm(1 ≤m≤ 105) — the size of Sean's file.Each of the nextnlines contains positive integerai(1 ≤ai≤ 1000) — the sizes of USB flash drives in megabytes.It is guaranteed that the answer exists, i. e. the sum of allaiis not less thanm.OutputPrint the minimum number of USB flash drives to write Sean's file, if he can split the file between drives.ExamplesInput35213Output2Input36232Output3Input25510Output1NoteIn the first example Sean needs only two USB flash drives — the first and the third.In the second example Sean needs all three USB flash drives.In the third example Sean needs only one USB flash drive and he can use any available USB flash drive — the first or the second.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d071636e", "template_md5": "35d339e4", "result": "You are given $n$ USB flash drives with capacities $a_1, a_2, ..., a_n$ megabytes. You also have a file that is $m$ megabytes in size.  \n\nFind the smallest number of USB flash drives needed to store the entire file, allowing you to split the file across multiple drives. \n\n**Input:**\n\n* The first line contains the number of USB flash drives, $n$.\n* The second line contains the size of the file, $m$.\n* The following $n$ lines each contain the capacity of a single USB flash drive.\n\n**Output:**\n\nPrint the minimum number of USB flash drives required to store the file."}, {"prompt_md5": "53e24194", "template_md5": "465699a0", "result": "You have a list of storage device sizes and a file size. Find the fewest storage devices needed to store the entire file, allowing you to split the file across multiple devices."}]}