{"uid": "609-C", "url": "https://codeforces.com/contest/609/problem/C", "tags": ["implementation", " math"], "title": "609-C", "statement": "C. Load Balancingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn the school computer room there arenservers which are responsible for processing several computing tasks. You know the number of scheduled tasks for each server: there aremitasks assigned to thei-th server.In order to balance the load for each server, you want to reassign some tasks to make the difference between the most loaded server and the least loaded server as small as possible. In other words you want to minimize expressionma-mb, whereais the most loaded server andbis the least loaded one.In one second you can reassign a single task. Thus in one second you can choose any pair of servers and move a single task from one server to another.Write a program to find the minimum number of seconds needed to balance the load of servers.InputThe first line contains positive numbern(1 ≤n≤ 105) — the number of the servers.The second line contains the sequence of non-negative integersm1,m2, ...,mn(0 ≤mi≤ 2·104), wheremiis the number of tasks assigned to thei-th server.OutputPrint the minimum number of seconds required to balance the load.ExamplesInput21 6Output2Input710 11 10 11 10 11 11Output0Input51 2 3 4 5Output3NoteIn the first example two seconds are needed. In each second, a single task from server #2 should be moved to server #1. After two seconds there should be 3 tasks on server #1 and 4 tasks on server #2.In the second example the load is already balanced.A possible sequence of task movements for the third example is:move a task from server #4 to server #1 (the sequencembecomes: 2 2 3 3 5);then move task from server #5 to server #1 (the sequencembecomes: 3 2 3 3 4);then move task from server #5 to server #2 (the sequencembecomes: 3 3 3 3 3).The above sequence is one of several possible ways to balance the load of servers in three seconds.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e834f444", "template_md5": "35d339e4", "result": "You have $n$ servers, and each server has a certain number of tasks assigned to it. The number of tasks for each server is given in the input.\n\nYour goal is to redistribute the tasks so that the difference between the server with the most tasks and the server with the fewest tasks is as small as possible.\n\nYou can move one task from one server to another in one second.\n\nFind the minimum number of seconds needed to balance the load on the servers."}, {"prompt_md5": "991c1e81", "template_md5": "465699a0", "result": "You have a number of servers, each with a different number of tasks assigned to it.  You can move one task between servers each second. What is the fewest seconds it takes to make the difference in the number of tasks between the busiest and least busy server as small as possible?"}]}