{"uid": "609-E", "url": "https://codeforces.com/contest/609/problem/E", "tags": ["data structures", " dfs and similar", " dsu", " graphs", " trees"], "title": "609-E", "statement": "E. Minimum spanning tree for each edgetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutConnected undirected weighted graph without self-loops and multiple edges is given. Graph containsnvertices andmedges.For each edge(u,v)find the minimal possible weight of the spanning tree that contains the edge(u,v).The weight of the spanning tree is the sum of weights of all edges included in spanning tree.InputFirst line contains two integersnandm(1 ≤n≤ 2·105,n- 1 ≤m≤ 2·105) — the number of vertices and edges in graph.Each of the nextmlines contains three integersui,vi,wi(1 ≤ui,vi≤n,ui≠vi, 1 ≤wi≤ 109) — the endpoints of thei-th edge and its weight.OutputPrintmlines.i-th line should contain the minimal possible weight of the spanning tree that containsi-th edge.The edges are numbered from1tomin order of their appearing in input.ExamplesInput5 71 2 31 3 11 4 52 3 22 5 33 4 24 5 4Output98118889", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6a954cc3", "template_md5": "35d339e4", "result": "You are given a connected, undirected graph with $n$ vertices and $m$ edges. Each edge has a weight.  \n\nFor each edge $(u,v)$ in the graph, find the minimum possible total weight of a spanning tree that includes that edge. A spanning tree is a subset of the edges that connects all the vertices without any cycles. The weight of a spanning tree is the sum of the weights of its edges.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of vertices and edges, respectively.\n* Each of the next $m$ lines contains three integers, $u$, $v$, and $w$, representing an edge with endpoints $u$ and $v$ and weight $w$.\n\n**Output:**\n\n* Print $m$ lines. The $i$-th line should contain the minimum possible weight of a spanning tree that includes the $i$-th edge (as given in the input)."}, {"prompt_md5": "3a81aa53", "template_md5": "465699a0", "result": "You are given a network of connected points with weighted connections between them.  Find the minimum total weight of connections needed to include each individual connection in a spanning tree (a network that connects all points)."}]}