{"uid": "609-B", "url": "https://codeforces.com/contest/609/problem/B", "tags": ["constructive algorithms", " implementation"], "title": "609-B", "statement": "B. The Best Gifttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEmily's birthday is next week and Jack has decided to buy a present for her. He knows she loves books so he goes to the local bookshop, where there arenbooks on sale from one ofmgenres.In the bookshop, Jack decides to buytwo books of different genres.Based on the genre of books on sale in the shop, find the number of options available to Jack for choosing two books of different genres for Emily. Options are considered different if they differ in at least one book.The books are given by indices of their genres. The genres are numbered from1tom.InputThe first line contains two positive integersnandm(2 ≤n≤ 2·105, 2 ≤m≤ 10) — the number of books in the bookstore and the number of genres.The second line contains a sequencea1,a2, ...,an, whereai(1 ≤ai≤m) equals the genre of thei-th book.It is guaranteed that for each genre there is at least one book of that genre.OutputPrint the only integer — the number of ways in which Jack can choose books.It is guaranteed that the answer doesn't exceed the value2·109.ExamplesInput4 32 1 3 1Output5Input7 44 2 3 1 2 4 3Output18NoteThe answer to the first test sample equals 5 as Sasha can choose:the first and second books,the first and third books,the first and fourth books,the second and third books,the third and fourth books.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7ce54eab", "template_md5": "35d339e4", "result": "There are $n$ books in a bookstore, each belonging to one of $m$ genres.  You need to find the number of ways to choose two books from the bookstore, ensuring that the two books belong to different genres. \n\nThe input consists of two lines:\n\n* The first line contains two integers, $n$ and $m$, representing the number of books and the number of genres, respectively.\n* The second line contains $n$ integers, $a_1, a_2, ..., a_n$, where $a_i$ represents the genre of the $i$-th book.\n\nOutput a single integer representing the number of ways to choose two books of different genres."}, {"prompt_md5": "eb97f940", "template_md5": "465699a0", "result": "You have a list of items, each belonging to one of several categories.  You need to choose two items from the list, making sure they belong to different categories. How many different combinations are possible?"}]}