{"uid": "611-E", "url": "https://codeforces.com/contest/611/problem/E", "tags": ["data structures", " greedy", " sortings"], "title": "611-E", "statement": "E. New Year and Three Musketeerstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDo you know the story about the three musketeers? Anyway, you must help them now.Richelimakieu is a cardinal in the city of Bearis. He found three brave warriors and called them the three musketeers. Athos has strengtha, Borthos strengthb, and Caramis has strengthc.The year 2015 is almost over and there are stillncriminals to be defeated. Thei-th criminal has strengthti. It's hard to defeat strong criminals — maybe musketeers will have to fight together to achieve it.Richelimakieu will coordinate musketeers' actions. In each hour each musketeer can either do nothing or be assigned to one criminal. Two or three musketeers can be assigned to the same criminal and then their strengths are summed up. A criminal can be defeated in exactly one hour (also if two or three musketeers fight him). Richelimakieu can't allow the situation where a criminal has strength bigger than the sum of strengths of musketeers fighting him — a criminal would win then!In other words, there are three ways to defeat a criminal.A musketeer of the strengthxin one hour can defeat a criminal of the strength not greater thanx. So, for example Athos in one hour can defeat criminalionly ifti≤a.Two musketeers can fight together and in one hour defeat a criminal of the strength not greater than the sum of strengths of these two musketeers. So, for example Athos and Caramis in one hour can defeat criminalionly ifti≤a+c. Note that the third remaining musketeer can either do nothing or fight some other criminal.Similarly, all three musketeers can fight together and in one hour defeat a criminal of the strength not greater than the sum of musketeers' strengths, i.e.ti≤a+b+c.Richelimakieu doesn't want musketeers to fight during the New Year's Eve. Thus, he must coordinate their actions in order to minimize the number of hours till all criminals will be defeated.Find the minimum number of hours to defeat all criminals. If musketeers can't defeat them all then print \"-1\" (without the quotes) instead.InputThe first line of the input contains a single integern(1 ≤n≤ 200 000) — the number of criminals.The second line contains three integersa,bandc(1 ≤a,b,c≤ 108) — strengths of musketeers.The third line containsnintegerst1,t2, ...,tn(1 ≤ti≤ 108) — strengths of criminals.OutputPrint one line with the answer.If it's impossible to defeat all criminals, print \"-1\" (without the quotes). Otherwise, print the minimum number of hours the three musketeers will spend on defeating all criminals.ExamplesInput510 20 301 1 1 1 50Output2Input510 20 301 1 1 1 51Output3Input730 20 1034 19 50 33 88 15 20Output-1Input610 5 1010 9 5 25 20 5Output3NoteIn the first sample Athos has strength10, Borthos20, and Caramis30. They can defeat all criminals in two hours:Borthos and Caramis should together fight a criminal with strength50. In the same hour Athos can fight one of four criminals with strength1.There are three criminals left, each with strength1. Each musketeer can fight one criminal in the second hour.In the second sample all three musketeers must together fight a criminal with strength51. It takes one hour. In the second hour they can fight separately, each with one criminal. In the third hour one criminal is left and any of musketeers can fight him.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2540f7e8", "template_md5": "35d339e4", "result": "You are given the strengths of three warriors ($a$, $b$, and $c$) and a list of $n$ criminals, each with a strength ($t_1$, $t_2$, ..., $t_n$). \n\nIn each hour, each warrior can either do nothing or fight one criminal. Two or three warriors can fight the same criminal, and their strengths are added together. A criminal can only be defeated if the combined strength of the warriors fighting it is greater than or equal to the criminal's strength.\n\nFind the minimum number of hours it takes to defeat all the criminals. If it's impossible to defeat all criminals, print \"-1\"."}, {"prompt_md5": "7058a2b7", "template_md5": "465699a0", "result": "You have 3 people with different strengths. There are multiple enemies with different strengths. Each hour, each person can either do nothing or fight one enemy.  Two or three people can fight the same enemy, and their strengths add up.  You need to figure out the minimum number of hours it takes to defeat all enemies, making sure no enemy's strength is greater than the combined strength of the people fighting them. If it's impossible to defeat all enemies, say so."}]}