{"uid": "612-F", "url": "https://codeforces.com/contest/612/problem/F", "tags": ["dp"], "title": "612-F", "statement": "F. Simba on the Circletime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a circular array withnelements. The elements are numbered from some element with values from1tonin clockwise order. Thei-th cell contains the valueai. The robot Simba is in cells.Each moment of time the robot is in some of thencells (at the begin he is ins). In one turn the robot can write out the number written in current cell or move to the adjacent cell in clockwise or counterclockwise direction. To write out the number from the cell Simba doesn't spend any time, but to move to adjacent cell Simba spends one unit of time.Simba wants to write the number from each cell one time, so the numbers will be written in a non decreasing order. Find the least number of time units to write out all numbers.InputThe first line contains two integersnands(1 ≤s≤n≤ 2000) — the number of cells in the circular array and the starting position of Simba.The second line containsnintegersai(- 109≤ai≤ 109) — the number written in thei-th cell. The numbers are given for cells in order from1ton. Some of numbersaican be equal.OutputIn the first line print the numbert— the least number of time units.Each of the nextnlines should contain the direction of robot movement and the number of cells to move in that direction. After that movement the robot writes out the number from the cell in which it turns out. The direction and the number of cells should be printed in the form of+xin case of clockwise movement and-xin case of counterclockwise movement toxcells (0 ≤x≤n- 1).Note that the sum of absolute values ofxshould be equal tot.ExamplesInput9 10 1 2 2 2 1 0 1 1Output12+0-3-1+2+1+2+1+1+1Input8 10 1 0 1 0 1 0 1Output13+0+2+2+2-1+2+2+2Input8 11 2 3 4 5 6 7 8Output7+0+1+1+1+1+1+1+1Input8 10 0 0 0 0 0 0 0Output7+0+1+1+1+1+1+1+1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4476cb47", "template_md5": "35d339e4", "result": "You are given a circular array of $n$ elements. Each element contains a value $a_i$. The robot starts at position $s$.  In one turn, the robot can either:\n\n* Write the number in the current cell (takes no time).\n* Move to the adjacent cell in a clockwise or counterclockwise direction (takes 1 time unit).\n\nThe robot wants to write out each number in the array exactly once in non-decreasing order. Find the minimum number of time units required to achieve this.\n\n**Output:**\n\n* The minimum number of time units.\n* A sequence of instructions, where each instruction is in the form of  \"+x\" (clockwise movement) or \"-x\" (counterclockwise movement), indicating the direction and number of cells to move."}, {"prompt_md5": "71413ba3", "template_md5": "465699a0", "result": "You have a circular list of numbers. You start at a specific position. You need to visit each number in the list exactly once, writing it down each time you visit.  You can move one position clockwise or counterclockwise at a time, which takes one unit of time.  Find the least amount of time it takes to visit all the numbers in non-decreasing order."}]}