{"uid": "612-D", "url": "https://codeforces.com/contest/612/problem/D", "tags": ["greedy", " sortings"], "title": "612-D", "statement": "D. The Union of k-Segmentstime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are givennsegments on the coordinate axisOxand the numberk. The point issatisfiedif it belongs to at leastksegments. Find the smallest (by the number of segments) set of segments on the coordinate axisOxwhich contains allsatisfiedpoints and no others.InputThe first line contains two integersnandk(1 ≤k≤n≤ 106) — the number of segments and the value ofk.The nextnlines contain two integersli,ri(- 109≤li≤ri≤ 109) each — the endpoints of thei-th segment. The segments can degenerate and intersect each other. The segments are given in arbitrary order.OutputFirst line contains integerm— the smallest number of segments.Nextmlines contain two integersaj,bj(aj≤bj) — the ends ofj-th segment in the answer. The segments should be listed in the order from left to right.ExamplesInput3 20 5-3 23 8Output20 23 5Input3 20 5-3 33 8Output10 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "54cbd460", "template_md5": "35d339e4", "result": "You are given $n$ segments on a number line and a number $k$. A point is considered \"satisfied\" if it belongs to at least $k$ segments.  \n\nFind the smallest possible set of segments that contains all the satisfied points and no other points.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($1 \\le k \\le n \\le 10^6$), representing the number of segments and the value of $k$.\n* The next $n$ lines each contain two integers, $l_i$ and $r_i$ (-10⁹ ≤ $l_i$ ≤ $r_i$ ≤ 10⁹), representing the endpoints of the $i$-th segment. Segments can overlap.\n\n**Output:**\n\n* The first line contains an integer $m$, representing the smallest number of segments needed.\n* The next $m$ lines each contain two integers, $a_j$ and $b_j$ ($a_j \\le b_j$), representing the endpoints of the $j$-th segment in the solution. The segments should be listed in order from left to right."}, {"prompt_md5": "cc3d4971", "template_md5": "465699a0", "result": "You are given a list of intervals on a number line and a number k. Find the smallest set of intervals that contains all points that are in at least k of the original intervals, and no other points."}]}