{"uid": "613-E", "url": "https://codeforces.com/contest/613/problem/E", "tags": ["dp", " hashing", " strings"], "title": "613-E", "statement": "E. Puzzle Lovertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOleg Petrov loves crossword puzzles and every Thursday he buys his favorite magazine with crosswords and other word puzzles. In the last magazine Oleg found a curious puzzle, and the magazine promised a valuable prize for it's solution. We give a formal description of the problem below.The puzzle field consists of two rows, each row containsncells. Each cell contains exactly one small English letter. You also are given a wordw, which consists ofksmall English letters. Asolutionof the puzzle is a sequence of field cellsc1,...,ck, such that:For allifrom1tokthe letter written in the cellcimatches the letterwi;All the cells in the sequence are pairwise distinct;For allifrom1tok- 1cellsciandci+ 1have a common side.Oleg Petrov quickly found a solution for the puzzle. Now he wonders, how many distinct solutions are there for this puzzle. Oleg Petrov doesn't like too large numbers, so calculate the answer modulo109+ 7.Two solutionsciandc'iare considered distinct if the sequences of cells do not match in at least one position, that is there is suchjin range from1tok, such thatcj≠c'j.InputThe first two lines contain the state of the field for the puzzle. Each of these non-empty lines contains exactlynsmall English letters.The next line is left empty.The next line is non-empty and contains wordw, consisting of small English letters.The length of each line doesn't exceed2 000.OutputPrint a single integer — the number of distinct solutions for the puzzle modulo109+ 7.ExamplesInputcodeedoccodeOutput4InputaaaaaaaaOutput14", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d0e1a545", "template_md5": "35d339e4", "result": "You are given a 2x$n$ grid of letters. You are also given a word of length $k$.  Find the number of ways to place the letters of the word into the grid such that:\n\n* Each letter in the word is used exactly once.\n* The letters are placed in a sequence of cells that are connected side-by-side (horizontally or vertically).\n\nThe answer should be output modulo $10^9 + 7$."}, {"prompt_md5": "d362b767", "template_md5": "465699a0", "result": "You are given a 2xN grid of letters and a word of length K.  Find the number of ways to place the letters of the word into the grid so that:\n\n* Each letter of the word is used exactly once.\n* The letters are placed in a single, connected path (horizontally or vertically adjacent)."}]}