{"uid": "616-B", "url": "https://codeforces.com/contest/616/problem/B", "tags": ["games", " greedy"], "title": "616-B", "statement": "B. Dinner with Emmatime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputJack decides to invite Emma out for a dinner. Jack is a modest student, he doesn't want to go to an expensive restaurant. Emma is a girl with high taste, she prefers elite places.Munhattan consists ofnstreets andmavenues. There is exactly one restaurant on the intersection of each street and avenue. The streets are numbered with integers from1tonand the avenues are numbered with integers from1tom. The cost of dinner in the restaurant at the intersection of thei-th street and thej-th avenue iscij.Jack and Emma decide to choose the restaurant in the following way. Firstly Emma chooses the street to dinner and then Jack chooses the avenue. Emma and Jack makes their choice optimally: Emma wants to maximize the cost of the dinner, Jack wants to minimize it. Emma takes into account that Jack wants to minimize the cost of the dinner. Find the cost of the dinner for the couple in love.InputThe first line contains two integersn,m(1 ≤n,m≤ 100) — the number of streets and avenues in Munhattan.Each of the nextnlines containsmintegerscij(1 ≤cij≤ 109) — the cost of the dinner in the restaurant on the intersection of thei-th street and thej-th avenue.OutputPrint the only integera— the cost of the dinner for Jack and Emma.ExamplesInput3 44 1 3 52 2 2 25 4 5 1Output2Input3 31 2 32 3 13 1 2Output1NoteIn the first example if Emma chooses the first or the third streets Jack can choose an avenue with the cost of the dinner1. So she chooses the second street and Jack chooses any avenue. The cost of the dinner is2.In the second example regardless of Emma's choice Jack can choose a restaurant with the cost of the dinner1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fd6f03a4", "template_md5": "35d339e4", "result": "There are $n$ streets and $m$ avenues in a city. Each intersection has a restaurant with a given cost $c_{ij}$ for a meal. \n\nA couple wants to choose a restaurant. The woman chooses a street first, and then the man chooses an avenue. The woman wants to maximize the cost of the meal, while the man wants to minimize it.  \n\nWhat is the cost of the meal they will end up choosing?\n\nInput:\n\n* The first line contains two integers $n$ and $m$ (1 ≤ $n$, $m$ ≤ 100).\n* The next $n$ lines each contain $m$ integers $c_{ij}$ (1 ≤ $c_{ij}$ ≤ 10⁹).\n\nOutput:\n\n* Print a single integer, the cost of the meal."}, {"prompt_md5": "dfb8fe56", "template_md5": "465699a0", "result": "You are given a grid of prices.  One person wants to pick the highest price, the other wants to pick the lowest price. They take turns picking a row or column. What is the final price they agree on?"}]}