{"uid": "617-B", "url": "https://codeforces.com/contest/617/problem/B", "tags": ["combinatorics"], "title": "617-B", "statement": "B. Chocolatetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputBob loves everything sweet. His favorite chocolate bar consists of pieces, each piece may contain a nut. Bob wants to break the bar of chocolate into multiple pieces so that each part would containexactlyone nut and any break line goes between two adjacent pieces.You are asked to calculate the number of ways he can do it. Two ways to break chocolate are considered distinct if one of them contains a break between some two adjacent pieces and the other one doesn't.Please note, that if Bob doesn't make any breaks, all the bar will form one piece and it still has to have exactly one nut.InputThe first line of the input contains integern(1 ≤n≤ 100) — the number of pieces in the chocolate bar.The second line containsnintegersai(0 ≤ai≤ 1), where0represents a piece without the nut and1stands for a piece with the nut.OutputPrint the number of ways to break the chocolate into multiple parts so that each part would contain exactly one nut.ExamplesInput30 1 0Output1Input51 0 1 0 1Output4NoteIn the first sample there is exactly one nut, so the number of ways equals1— Bob shouldn't make any breaks.In the second sample you can break the bar in four ways:10|10|11|010|110|1|011|01|01", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "68773017", "template_md5": "35d339e4", "result": "You are given a chocolate bar with $n$ pieces. Each piece can either have a nut ($1$) or not have a nut ($0$).  \n\nFind the number of ways to break the chocolate bar into smaller pieces so that each smaller piece contains exactly one nut.  \n\nYou can break the chocolate between any two adjacent pieces."}, {"prompt_md5": "8dbd0591", "template_md5": "465699a0", "result": "You are given a sequence of 0s and 1s representing a chocolate bar where 1 represents a piece with a nut.  Find the number of ways to divide the bar into pieces, each containing exactly one nut."}]}