{"uid": "617-C", "url": "https://codeforces.com/contest/617/problem/C", "tags": ["implementation"], "title": "617-C", "statement": "C. Watering Flowerstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA flowerbed has many flowers and two fountains.You can adjust the water pressure and set any valuesr1(r1≥ 0)andr2(r2≥ 0), giving the distances at which the water is spread from the first and second fountain respectively. You have to set suchr1andr2that all the flowers are watered, that is, for each flower, the distance between the flower and the first fountain doesn't exceedr1, or the distance to the second fountain doesn't exceedr2. It's OK if some flowers are watered by both fountains.You need to decrease the amount of water you need, that is set suchr1andr2that all the flowers are watered and ther12+r22is minimum possible. Find this minimum value.InputThe first line of the input contains integersn,x1,y1,x2,y2(1 ≤n≤ 2000,- 107≤x1,y1,x2,y2≤ 107) — the number of flowers, the coordinates of the first and the second fountain.Next follownlines. Thei-th of these lines contains integersxiandyi(- 107≤xi,yi≤ 107) — the coordinates of thei-th flower.It is guaranteed that alln+ 2points in the input are distinct.OutputPrint the minimum possible valuer12+r22. Note, that in this problem optimal answer is always integer.ExamplesInput2 -1 0 5 30 25 2Output6Input4 0 0 5 09 48 3-1 01 4Output33NoteThe first sample is (r12= 5,r22= 1):The second sample is (r12= 1,r22= 32):", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "74ef0c29", "template_md5": "35d339e4", "result": "You have two fountains and many flowers. Each fountain can spray water a certain distance. You need to find the minimum total distance that both fountains need to spray water to water all the flowers.  A flower is watered if it is within the spray distance of at least one fountain.\n\n**Input:**\n\n* The first line contains:\n    *  $n$: the number of flowers\n    *  $x_1$, $y_1$: the coordinates of the first fountain\n    *  $x_2$, $y_2$: the coordinates of the second fountain\n* The next $n$ lines each contain:\n    *  $x_i$, $y_i$: the coordinates of a flower\n\n**Output:**\n\n* The minimum possible value of  $r_1^2 + r_2^2$, where $r_1$ is the spray distance of the first fountain and $r_2$ is the spray distance of the second fountain."}, {"prompt_md5": "d40380e6", "template_md5": "465699a0", "result": "You have two fountains and many flowers. You need to determine the minimum distance each fountain needs to spray water to water all the flowers.  The flowers must be within that distance of at least one fountain.  The goal is to minimize the total squared distance the fountains need to spray."}]}