{"uid": "618-G", "url": "https://codeforces.com/contest/618/problem/G", "tags": ["dp", " math", " matrices", " probabilities"], "title": "618-G", "statement": "G. Combining Slimestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYour friend recently gave you some slimes for your birthday. You have a very large amount of slimes with value1and2, and you decide to invent a game using these slimes.You initialize a row withnempty spaces. You also choose a numberpto be used in the game. Then, you will perform the following steps while the last space is empty.With probability, you will choose a slime with value1, and with probability, you will choose a slime with value2. You place the chosen slime on the last space of the board.You will push the slime to the left as far as possible. If it encounters another slime, and they have the same valuev, you will merge the slimes together to create a single slime with valuev+ 1. This continues on until the slime reaches the end of the board, or encounters a slime with a different value than itself.You have played the game a few times, but have gotten bored of it. You are now wondering, what is the expected sum of all values of the slimes on the board after you finish the game.InputThe first line of the input will contain two integersn,p(1 ≤n≤ 109, 1 ≤p< 109).OutputPrint the expected sum of all slimes on the board after the game finishes. Your answer will be considered correct if its absolute or relative error does not exceed10- 4.Namely, let's assume that your answer isaand the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput2 500000000Output3.562500000000000Input10 1Output64.999983360007620Input100 123456789Output269.825611298854770NoteIn the first sample, we have a board with two squares, and there is a0.5probability of a1appearing and a0.5probability of a2appearing.Our final board states can be1 2with probability0.25,2 1with probability0.375,3 2with probability0.1875,3 1with probability0.1875. The expected value is thus(1 + 2)·0.25 + (2 + 1)·0.375 + (3 + 2)·0.1875 + (3 + 1)·0.1875 = 3.5625.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6ab63836", "template_md5": "35d339e4", "result": "You have a row of $n$ empty spaces. You will repeatedly choose a slime with value 1 or 2 with probabilities $p$ and $1-p$ respectively. You place the chosen slime at the end of the row and push it to the left as far as possible. If it encounters a slime with the same value, you merge them into a slime with value one more than the original value. This continues until the slime reaches the beginning of the row or encounters a slime with a different value.\n\nWhat is the expected sum of all the slime values on the board after the game finishes?"}, {"prompt_md5": "26aa9977", "template_md5": "465699a0", "result": "You have a row of empty spaces. You randomly choose between two types of objects with different values. You place the chosen object at the end of the row and it moves left, merging with objects of the same value.  The merge creates a new object with a higher value. What is the average total value of all objects on the row when the process is complete?"}]}