{"uid": "620-E", "url": "https://codeforces.com/contest/620/problem/E", "tags": ["bitmasks", " data structures", " trees"], "title": "620-E", "statement": "E. New Year Treetime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe New Year holidays are over, but Resha doesn't want to throw away the New Year tree. He invited his best friends Kerim and Gural to help him to redecorate the New Year tree.The New Year tree is an undirected tree withnvertices and root in the vertex1.You should process the queries of the two types:Change the colours of all vertices in the subtree of the vertexvto the colourc.Find the number of different colours in the subtree of the vertexv.InputThe first line contains two integersn,m(1 ≤n,m≤ 4·105) — the number of vertices in the tree and the number of the queries.The second line containsnintegersci(1 ≤ci≤ 60) — the colour of thei-th vertex.Each of the nextn- 1lines contains two integersxj,yj(1 ≤xj,yj≤n) — the vertices of thej-th edge. It is guaranteed that you are given correct undirected tree.The lastmlines contains the description of the queries. Each description starts with the integertk(1 ≤tk≤ 2) — the type of thek-th query. For the queries of the first type then follows two integersvk,ck(1 ≤vk≤n, 1 ≤ck≤ 60) — the number of the vertex whose subtree will be recoloured with the colourck. For the queries of the second type then follows integervk(1 ≤vk≤n) — the number of the vertex for which subtree you should find the number of different colours.OutputFor each query of the second type print the integera— the number of different colours in the subtree of the vertex given in the query.Each of the numbers should be printed on a separate line in order of query appearing in the input.ExamplesInput7 101 1 1 1 1 1 11 21 31 43 53 63 71 3 22 11 4 32 11 2 52 11 6 42 12 22 3Output234512Input23 301 2 2 6 5 3 2 1 1 1 2 4 5 3 4 4 3 3 3 3 3 4 61 21 31 42 52 63 73 84 94 104 116 126 137 147 157 168 178 1810 1910 2010 2111 2211 232 12 52 62 72 82 92 102 112 41 12 11 13 11 14 11 15 11 16 11 17 11 18 11 19 11 20 11 21 11 22 11 23 12 12 52 62 72 82 92 102 112 4Output613321235512211123", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ec6d8a9b", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices. Each vertex has a color, initially given in the input. You need to process $m$ queries. \n\nThere are two types of queries:\n\n1. **Change color:** Change the color of all vertices in the subtree of vertex $v$ to color $c$.\n2. **Count colors:** Find the number of different colors in the subtree of vertex $v$.\n\nOutput the answer to each \"Count colors\" query."}, {"prompt_md5": "7feb0231", "template_md5": "465699a0", "result": "You are given a tree with nodes, each having a color. You can perform two types of operations:\n\n1. Change the color of all nodes in a subtree to a new color.\n2. Find the number of unique colors in a subtree. \n\n\nYou need to process a series of these operations and answer the second type of queries."}]}