{"uid": "620-A", "url": "https://codeforces.com/contest/620/problem/A", "tags": ["implementation", " math"], "title": "620-A", "statement": "A. Professor GukiZ's Robottime limit per test0.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputProfessor GukiZ makes a new robot. The robot are in the point with coordinates(x1,y1)and should go to the point(x2,y2). In a single step the robot can change any of its coordinates (maybe both of them) by one (decrease or increase). So the robot can move in one of the8directions. Find the minimal number of steps the robot should make to get the finish position.InputThe first line contains two integersx1,y1(- 109≤x1,y1≤ 109) — the start position of the robot.The second line contains two integersx2,y2(- 109≤x2,y2≤ 109) — the finish position of the robot.OutputPrint the only integerd— the minimal number of steps to get the finish position.ExamplesInput0 04 5Output5Input3 46 1Output3NoteIn the first example robot should increase both of its coordinates by one four times, so it will be in position(4, 4). After that robot should simply increase itsycoordinate and get the finish position.In the second example robot should simultaneously increasexcoordinate and decreaseycoordinate by one three times.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1aa5c6f0", "template_md5": "35d339e4", "result": "A robot starts at position $(x_1, y_1)$ and needs to reach position $(x_2, y_2)$.  The robot can move one unit in any of the eight directions (up, down, left, right, or any diagonal). What is the minimum number of steps the robot needs to take to get to the destination? \n\nInput:\n\n* Two integers, $x_1$ and $y_1$, representing the starting coordinates.\n* Two integers, $x_2$ and $y_2$, representing the destination coordinates.\n\nOutput:\n\n* A single integer, representing the minimum number of steps."}, {"prompt_md5": "7050299a", "template_md5": "465699a0", "result": "A robot starts at a point and needs to reach another point. The robot can move one unit in any of the eight directions (up, down, left, right, and the diagonals). What is the fewest moves needed to reach the destination?"}]}