{"uid": "621-D", "url": "https://codeforces.com/contest/621/problem/D", "tags": ["brute force", " constructive algorithms", " math"], "title": "621-D", "statement": "D. Rat Kwesh and Cheesetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWet Shark asked Rat Kwesh to generate three positive real numbersx,yandz, from0.1to200.0, inclusive. Wet Krash wants to impress Wet Shark, so all generated numbers will haveexactly onedigit after the decimal point.Wet Shark knows Rat Kwesh will want a lot of cheese. So he will give the Rat an opportunity to earn a lot of cheese. He will hand the three numbersx,yandzto Rat Kwesh, and Rat Kwesh will pick one of the these twelve options:a1=xyz;a2=xzy;a3= (xy)z;a4= (xz)y;a5=yxz;a6=yzx;a7= (yx)z;a8= (yz)x;a9=zxy;a10=zyx;a11= (zx)y;a12= (zy)x.Letmbe the maximum of all theai, andcbe the smallest index (from1to12) such thatac=m. Rat's goal is to find thatc, and he asks you to help him. Rat Kwesh wants to see how much cheese he gets, so he you will have to print the expression corresponding to thatac.InputThe only line of the input contains three space-separated real numbersx,yandz(0.1 ≤x,y,z≤ 200.0). Each ofx,yandzis given with exactly one digit after the decimal point.OutputFind the maximum value of expression amongxyz,xzy,(xy)z,(xz)y,yxz,yzx,(yx)z,(yz)x,zxy,zyx,(zx)y,(zy)xand print the corresponding expression. If there are many maximums, print the one that comes first in the list.xyzshould be outputted asx^y^z(without brackets), and(xy)zshould be outputted as(x^y)^z(quotes for clarity).ExamplesInput1.1 3.4 2.5Outputz^y^xInput2.0 2.0 2.0Outputx^y^zInput1.9 1.8 1.7Output(x^y)^z", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "642b8daf", "template_md5": "35d339e4", "result": "Given three real numbers $x$, $y$, and $z$ (where $0.1 \\le x, y, z \\le 200.0$ and each has exactly one digit after the decimal point), find the maximum value among the following twelve expressions:\n\n* $xyz$\n* $xzy$\n* $(xy)z$\n* $(xz)y$\n* $yxz$\n* $yzx$\n* $(yx)z$\n* $(yz)x$\n* $zxy$\n* $zyx$\n* $(zx)y$\n* $(zy)x$\n\nOutput the maximum value and the corresponding expression. If there are multiple maximum values, output the first one encountered."}, {"prompt_md5": "56c82243", "template_md5": "465699a0", "result": "Given three numbers between 0.1 and 200.0, each with one digit after the decimal point, find the largest possible result you can get by using these numbers in one of twelve specific mathematical operations. Output the operation that produces the largest result."}]}