{"uid": "621-E", "url": "https://codeforces.com/contest/621/problem/E", "tags": ["dp", " matrices"], "title": "621-E", "statement": "E. Wet Shark and Blockstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arebblocks of digits. Each one consisting of the samendigits, which are given to you in the input. Wet Shark must chooseexactly onedigit from each block and concatenate all of those digits together to form one large integer. For example, if he chooses digit1from the first block and digit2from the second block, he gets the integer12.Wet Shark then takes this number modulox. Please, tell him how many ways he can choose one digit from each block so that he gets exactlykas the final result. As this number may be too large, print it modulo109+ 7.Note, that the number of ways to choose some digit in the block is equal to the number of it's occurrences. For example, there are3ways to choose digit5from block3 5 6 7 8 9 5 1 1 1 1 5.InputThe first line of the input contains four space-separated integers,n,b,kandx(2 ≤n≤ 50 000, 1 ≤b≤ 109, 0 ≤k<x≤ 100,x≥ 2) — the number of digits in one block, the number of blocks, interesting remainder moduloxand moduloxitself.The next line containsnspace separated integersai(1 ≤ai≤ 9), that give the digits contained in each block.OutputPrint the number of ways to pick exactly one digit from each blocks, such that the resulting integer equalskmodulox.ExamplesInput12 1 5 103 5 6 7 8 9 5 1 1 1 1 5Output3Input3 2 1 26 2 2Output0Input3 2 1 23 1 2Output6NoteIn the second sample possible integers are22,26,62and66. None of them gives the remainder1modulo2.In the third sample integers11,13,21,23,31and33have remainder1modulo2. There is exactly one way to obtain each of these integers, so the total answer is6.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2e475522", "template_md5": "35d339e4", "result": "You are given $b$ blocks of digits. Each block contains the same $n$ digits.  You need to choose one digit from each block and concatenate them to form a single number.  \n\nCalculate how many ways you can choose the digits so that the resulting number is congruent to $k$ modulo $x$.  \n\n**Input:**\n\n* $n$: the number of digits in each block\n* $b$: the number of blocks\n* $k$: the desired remainder modulo $x$\n* $x$: the modulus\n\n* A line containing $n$ space-separated integers representing the digits in each block.\n\n**Output:**\n\nPrint the number of ways to choose the digits, modulo $10^9 + 7$."}, {"prompt_md5": "e442cf1f", "template_md5": "465699a0", "result": "You have multiple groups of identical numbers. You need to pick one number from each group and combine them.  What are the number of ways to do this so that the final combined number leaves a specific remainder when divided by a given number?"}]}