{"uid": "622-A", "url": "https://codeforces.com/contest/622/problem/A", "tags": ["implementation", " math"], "title": "622-A", "statement": "A. Infinite Sequencetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputConsider the infinite sequence of integers:1, 1, 2, 1, 2, 3, 1, 2, 3, 4, 1, 2, 3, 4, 5.... The sequence is built in the following way: at first the number1is written out, then the numbers from1to2, then the numbers from1to3, then the numbers from1to4and so on. Note that the sequence contains numbers, not digits. For example number10first appears in the sequence in position55(the elements are numerated from one).Find the number on then-th position of the sequence.InputThe only line contains integern(1 ≤n≤ 1014) — the position of the number to find.Note that the given number is too large, so you should use64-bit integer type to store it. InC++you can use thelong longinteger type and inJavayou can uselonginteger type.OutputPrint the element in then-th position of the sequence (the elements are numerated from one).ExamplesInput3Output2Input5Output2Input10Output4Input55Output10Input56Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "556fb2f4", "template_md5": "35d339e4", "result": "You are given a sequence of numbers. The sequence is built as follows:\n\n* Start with the number 1.\n* Then write out all the numbers from 1 to 2.\n* Then write out all the numbers from 1 to 3.\n* And so on, increasing the upper limit each time.\n\nFor example, the first few terms of the sequence are: 1, 1, 2, 1, 2, 3, 1, 2, 3, 4, ...\n\nGiven a position $n$ in the sequence, find the number at that position. \n\n**Input:**\n\nA single integer $n$ (1 ≤ $n$ ≤ 10<sup>14</sup>) representing the desired position in the sequence.\n\n**Output:**\n\nPrint the number at the $n$th position in the sequence."}, {"prompt_md5": "82d5b2be", "template_md5": "465699a0", "result": "You are given a number. Find the number that appears at that position in a sequence. The sequence is built by listing the numbers from 1 to n, repeating for each n."}]}