{"uid": "623-B", "url": "https://codeforces.com/contest/623/problem/B", "tags": ["dp", " greedy", " number theory"], "title": "623-B", "statement": "B. Array GCDtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given arrayaiof lengthn. You may consecutively apply two operations to this array:remove some subsegment (continuous subsequence) of lengthm<nand pay for itm·acoins;change some elements of the array by at most1, and paybcoins for each change.Please note that each of operations may be applied at most once (and may be not applied at all) so you can remove only one segment and each number may be changed (increased or decreased) by at most1. Also note, that you are not allowed to delete the whole array.Your goal is to calculate the minimum number of coins that you need to spend in order to make the greatest common divisor of the elements of the resulting array be greater than1.InputThe first line of the input contains integersn,aandb(1 ≤n≤ 1 000 000, 0 ≤a,b≤ 109) — the length of the array, the cost of removing a single element in the first operation and the cost of changing an element, respectively.The second line containsnintegersai(2 ≤ai≤ 109) — elements of the array.OutputPrint a single number — the minimum cost of changes needed to obtain an array, such that the greatest common divisor of all its elements is greater than1.ExamplesInput3 1 44 2 3Output1Input5 3 25 17 13 5 6Output8Input8 3 43 7 5 4 3 12 9 4Output13NoteIn the first sample the optimal way is to remove number3and pay1coin for it.In the second sample you need to remove a segment[17, 13]and then decrease number6. The cost of these changes is equal to2·3 + 2 = 8coins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ff95924c", "template_md5": "35d339e4", "result": "You are given an array of integers. You can perform the following operations at most once each:\n\n1. **Remove a contiguous subsegment of length *m* from the array and pay *m* * a coins.**\n2. **Change at most one element of the array by at most 1, and pay *b* coins for each change.**\n\nYour goal is to find the minimum total cost to make the greatest common divisor (GCD) of the elements in the array greater than 1.\n\n**Input:**\n\n* The first line contains three integers: *n* (the length of the array), *a* (the cost of removing an element), and *b* (the cost of changing an element).\n* The second line contains *n* integers, representing the elements of the array.\n\n**Output:**\n\n* Print a single integer representing the minimum cost to achieve the desired GCD."}, {"prompt_md5": "cc22451b", "template_md5": "465699a0", "result": "You have a list of numbers. You can remove a continuous section of the list and/or change each number by at most 1.  You want to find the cheapest way to make the greatest common divisor of the remaining numbers greater than 1."}]}