{"uid": "623-D", "url": "https://codeforces.com/contest/623/problem/D", "tags": ["greedy", " math", " probabilities"], "title": "623-D", "statement": "D. Birthdaytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA MIPT student named Misha has a birthday today, and he decided to celebrate it in his country house in suburban Moscow.nfriends came by, and after a typical party they decided to play blind man's buff.The birthday boy gets blindfolded and the other players scatter around the house. The game is played in several rounds. In each round, Misha catches exactly one of his friends and has to guess who it is. The probability of catching thei-th friend does not change between rounds and is equal topipercent (as we know, it is directly proportional to the amount of alcohol consumed by thei-th friend) andp1+p2+ ... +pn= 100holds. Misha has no information about who he caught. After Misha makes an attempt to guess the caught person, the round ends. Even then, Misha isn't told whether he guessed correctly, and a new round begins.The game ends when Misha guesses every friend at least once, that is, there exists such set of roundsk1,k2, ...,kn, that during round numberkiMisha caught thei-th friend and guessed him. Misha wants to minimize the expectation of the number of rounds of the game. Despite the fact that at any point in the game Misha has no information about who he has already guessed, his friends are honest, and if they see that the condition for the end of the game is fulfilled, the game ends immediately. Find the expectation of the number of rounds in the game if Misha plays optimally.InputThe first line of the input contains a single integern(1 ≤n≤ 100) — the number of Misha's friends.The second line containsnintegerspi(), giving the probability to catch thei-th friend in one particular round in percent.OutputPrint a single real value — the expectation of the number of rounds provided that Misha plays optimally. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput250 50Output5.0000000000Input450 20 20 10Output39.2846263444NoteThe optimal strategy in the first sample is to guess friends alternately.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bd037c93", "template_md5": "35d339e4", "result": "There are $n$ friends. Each friend has a probability $p_i$ of being caught in a round.  The probability of catching each friend is independent of the other friends.\n\nMisha plays a game where he is blindfolded and tries to guess who he caught. He plays until he has guessed each friend at least once.\n\nWhat is the expected number of rounds Misha will play if he plays optimally?"}, {"prompt_md5": "8af29f22", "template_md5": "465699a0", "result": "A person has to guess the identity of  'n' people, each with a different probability of being chosen in each round. The person doesn't know who they've already guessed. The game ends when the person has guessed everyone at least once. What is the average number of rounds it takes to finish the game if the person plays as well as possible?"}]}