{"uid": "624-B", "url": "https://codeforces.com/contest/624/problem/B", "tags": ["greedy", " sortings"], "title": "624-B", "statement": "B. Making a Stringtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an alphabet consisting ofnletters, your task is to make a string of the maximum possible length so that the following conditions are satisfied:thei-th letter occurs in the string no more thanaitimes;the number of occurrences of each letter in the string must bedistinctfor all the letters that occurred in the string at least once.InputThe first line of the input contains a single integern(2  ≤n≤  26) — the number of letters in the alphabet.The next line containsnintegersai(1 ≤ai≤ 109) —i-th of these integers gives the limitation on the number of occurrences of thei-th character in the string.OutputPrint a single integer — the maximum length of the string that meets all the requirements.ExamplesInput32 5 5Output11Input31 1 2Output3NoteFor convenience let's consider an alphabet consisting of three letters: \"a\", \"b\", \"c\". In the first sample, some of the optimal strings are: \"cccaabbccbb\", \"aabcbcbcbcb\". In the second sample some of the optimal strings are: \"acc\", \"cbc\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "28e4460f", "template_md5": "35d339e4", "result": "You are given an alphabet with $n$ letters. Each letter has a maximum allowed number of occurrences in a string.  \n\nThe task is to find the longest possible string that meets these conditions:\n\n* The $i$-th letter can appear at most $a_i$ times in the string.\n* Each letter that appears in the string must have a unique number of occurrences.\n\nInput:\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 26), the number of letters in the alphabet.\n* The next line contains $n$ integers $a_i$ (1 ≤ $a_i$ ≤ 10⁹), where $a_i$ is the maximum allowed occurrences of the $i$-th letter.\n\nOutput:\n\n* Print a single integer, the maximum length of the string that satisfies the conditions."}, {"prompt_md5": "588720f9", "template_md5": "465699a0", "result": "You have a set of items, each with a maximum allowed quantity. Find the largest number of items you can collect while making sure no item is used more than its limit and each used item has a unique quantity."}]}