{"uid": "625-E", "url": "https://codeforces.com/contest/625/problem/E", "tags": ["data structures", " greedy"], "title": "625-E", "statement": "E. Frog Fightstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOstap Bender recently visited frog farm and was inspired to create his own frog game.Number of frogs are places on a cyclic gameboard, divided intomcells. Cells are numbered from1tom, but the board is cyclic, so cell number1goes right after the cell numbermin the direction of movement.i-th frog during its turn can jump foraicells.Frogs move in turns, game starts with a move by frog1. On its turni-th frog movesaicells forward, knocking out all the frogs on its way. If there is a frog in the last cell of the path of thei-th frog, that frog is also knocked out. After this the valueaiis decreased by the number of frogs that were knocked out during this turn. Ifaiis zero or goes negative, theni-th frog doesn't make moves anymore.After frog number1finishes its turn, frog number2starts to move, then frog number3and so on. After the frog numbernmakes its move, frog1starts to move again, then frog2and so on this process goes forever. If some frog was already knocked out from the board, we consider that it skips all its moves.Help Ostap to identify, what frogs will stay on the board at the end of a game?InputFirst line of the input contains two integersnandm(1 ≤n≤ 100000, 1 ≤m≤ 109,n≤m) — number of frogs and gameboard size, respectively.Followingnlines contains frogs descriptions — two integerspiandai(1 ≤pi,ai≤m) — the number of cell occupied byi-th frog initially and initial jump length. Allpiare guaranteed to be distinct.OutputIn the first line output number of frogs on the final gameboard. In the second line output their numbers in any order.ExamplesInput3 52 15 34 3Output13Input5 61 23 42 55 16 1Output21 4NoteIn the first sample first frog jumps1cell and finishes in cell number3. Second frog jumps for3cells and finishes on cell number3, knocking out frog number1. Current jump length for frog number2is now2. Third frog jumps to cell2, then second frog jumps to cell5. Third frog in turn finishes in cell5and removes frog2from the gameboard. Now, it's the only remaining frog in the game.In the second sample first frog jumps2cells and knocks out frogs in cells2and3. Its valueaiis now0. Then fourth frog jumps and knocks out fifth frog and itsaiis now0too. These two frogs will remains on the gameboard forever.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "19bc1ec2", "template_md5": "35d339e4", "result": "There are $n$ frogs on a circular game board with $m$ cells. Each cell is numbered from 1 to $m$, and cell 1 is next to cell $m$. \n\nEach frog has an initial jump length, $a_i$, and starts in a specific cell, $p_i$.\n\nOn each turn, frogs move in order (frog 1, then frog 2, and so on).  \n\n* A frog moves $a_i$ cells forward.\n* If a frog lands on a cell occupied by another frog, the other frog is knocked out.\n* After a frog moves, its jump length, $a_i$, is reduced by the number of frogs it knocked out.\n* If $a_i$ becomes 0 or negative, the frog stops moving.\n\nThe game continues indefinitely. Determine which frogs will remain on the board after an infinite number of turns.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n \\le 100000$, $1 \\le m \\le 10^9$, $n \\le m$).\n* The next $n$ lines each contain two integers, $p_i$ and $a_i$ ($1 \\le p_i, a_i \\le m$), representing the starting cell and initial jump length of each frog.\n\n**Output:**\n\n* The first line contains the number of frogs remaining on the board.\n* The second line contains the numbers of the remaining frogs in any order."}, {"prompt_md5": "8546931e", "template_md5": "465699a0", "result": "There are multiple creatures on a circular track. Each creature has a jump length. On each turn, a creature jumps forward its jump length, knocking out any creatures in its path. After each jump, the creature's jump length decreases by the number of creatures it knocked out. If the jump length becomes zero or negative, the creature stops moving.  Determine which creatures remain on the track after an infinite number of turns."}]}