{"uid": "625-B", "url": "https://codeforces.com/contest/625/problem/B", "tags": ["constructive algorithms", " greedy", " strings"], "title": "625-B", "statement": "B. War of the Corporationstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA long time ago, in a galaxy far far away two giant IT-corporations Pineapple and Gogol continue their fierce competition. Crucial moment is just around the corner: Gogol is ready to release it's new tablet Lastus 3000.This new device is equipped with specially designed artificial intelligence (AI). Employees of Pineapple did their best to postpone the release of Lastus 3000 as long as possible. Finally, they found out, that the name of the new artificial intelligence is similar to the name of the phone, that Pineapple released 200 years ago. As all rights on its name belong to Pineapple, they stand on changing the name of Gogol's artificial intelligence.Pineapple insists, that the name of their phone occurs in the name of AI as a substring. Because the name of technology was already printed on all devices, the Gogol's director decided to replace some characters in AI name with \"#\". As this operation is pretty expensive, you should find the minimum number of characters to replace with \"#\", such that the name of AI doesn't contain the name of the phone as a substring.Substring is a continuous subsequence of a string.InputThe first line of the input contains the name of AI designed by Gogol, its length doesn't exceed100 000characters. Second line contains the name of the phone released by Pineapple 200 years ago, its length doesn't exceed30. Both string are non-empty and consist of only small English letters.OutputPrint the minimum number of characters that must be replaced with \"#\" in order to obtain that the name of the phone doesn't occur in the name of AI as a substring.ExamplesInputintellecttellOutput1InputgoogleappleOutput0InputsirisirisirOutput2NoteIn the first sample AI's name may be replaced with \"int#llect\".In the second sample Gogol can just keep things as they are.In the third sample one of the new possible names of AI may be \"s#ris#ri\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "eb877d54", "template_md5": "35d339e4", "result": "You are given two strings,  $AI$ and $Phone$.  Find the minimum number of characters in $AI$ that need to be replaced with '#' so that $Phone$ is no longer a substring of $AI$."}, {"prompt_md5": "fb7a5dd9", "template_md5": "465699a0", "result": "You are given two strings. Find the minimum number of characters you need to replace in the first string with \"#\" so that the second string is no longer a substring of the modified first string."}]}