{"uid": "626-G", "url": "https://codeforces.com/contest/626/problem/G", "tags": ["data structures", " dp", " greedy", " math"], "title": "626-G", "statement": "G. Rafflestime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJohnny is at a carnival which hasnraffles. Raffleihas a prize with valuepi. Each participant can put tickets in whichever raffles they choose (they may have more than one ticket in a single raffle). At the end of the carnival, one ticket is selected at random from each raffle, and the owner of the ticket wins the associated prize. A single person can win multiple prizes from different raffles.However, county rules prevent any one participant from owning more than half the tickets in a single raffle, i.e. putting more tickets in the raffle than all the other participants combined. To help combat this (and possibly win some prizes), the organizers started by placing a single ticket in each raffle, which they will never remove.Johnny boughtttickets and is wondering where to place them. Currently, there are a total oflitickets in thei-th raffle. He watches as other participants place tickets and modify their decisions and, at every moment in time, wants to know how much he can possibly earn. Find the maximum possible expected value of Johnny's winnings at each moment if he distributes his tickets optimally. Johnny may redistribute all of his tickets arbitrarily between each update, but he may not place more thanttickets total or have more tickets in a single raffle than all other participants combined.InputThe first line contains two integersn,t, andq(1 ≤n,t,q≤ 200 000) — the number of raffles, the number of tickets Johnny has, and the total number of updates, respectively.The second line containsnspace-separated integerspi(1 ≤pi≤ 1000) — the value of thei-th prize.The third line containsnspace-separated integersli(1 ≤li≤ 1000) — the number of tickets initially in thei-th raffle.The lastqlines contain the descriptions of the updates. Each description contains two integerstk,rk(1 ≤tk≤ 2,1 ≤rk≤n) — the type of the update and the raffle number. An update of type1represents another participant adding a ticket to rafflerk. An update of type2represents another participant removing a ticket from rafflerk.It is guaranteed that, after each update, each raffle has at least1ticket (not including Johnny's) in it.OutputPrintqlines, each containing a single real number — the maximum expected value of Johnny's winnings after thek-th update. Your answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput2 1 34 51 21 11 22 1Output1.6666666671.3333333332.000000000Input3 20 56 8 106 6 61 11 21 32 32 3Output12.00000000012.00000000011.76923076912.00000000012.000000000NoteIn the first case, Johnny only has one ticket to distribute. The prizes are worth4and5, and the raffles initially have1and2tickets, respectively. After the first update, each raffle has2tickets, so Johnny has expected valueof winning by placing his ticket into the second raffle. The second update adds a ticket to the second raffle, so Johnny can winin the first raffle. After the final update, Johnny keeps his ticket in the first raffle and wins.In the second case, Johnny has more tickets than he is allowed to spend. In particular, after the first update, there are7,6, and6tickets in each raffle, respectively, so Johnny can only put in19tickets, winning each prize with probability. Also, note that after the last two updates, Johnny must remove a ticket from the last raffle in order to stay underthe tickets in the third raffle.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4a26fd2f", "template_md5": "35d339e4", "result": "There are $n$ raffles, each with a prize of value $p_i$. Initially, there are $l_i$ tickets in the $i$-th raffle. \n\nYou have $t$ tickets to distribute among the raffles. You can change how you distribute your tickets at any time. However, you cannot put more than $t$ tickets in total, and you cannot put more tickets in a single raffle than all other participants combined.\n\nAt each update, another participant either adds or removes a ticket from a specific raffle. After each update, you want to know the maximum expected value of your winnings.\n\n**Input:**\n\n* The first line contains three integers: $n$, $t$, and $q$ ($1 \\le n, t, q \\le 200000$) — the number of raffles, the number of your tickets, and the number of updates, respectively.\n* The second line contains $n$ space-separated integers $p_i$ ($1 \\le p_i \\le 1000$) — the value of each prize.\n* The third line contains $n$ space-separated integers $l_i$ ($1 \\le l_i \\le 1000$) — the initial number of tickets in each raffle.\n* The last $q$ lines contain the descriptions of the updates. Each description contains two integers $tk$ and $rk$ ($1 \\le tk \\le 2$, $1 \\le rk \\le n$) — the type of the update and the raffle number. An update of type 1 represents adding a ticket, and an update of type 2 represents removing a ticket.\n\n**Output:**\n\nPrint $q$ lines, each containing a single real number — the maximum expected value of your winnings after the $k$-th update."}, {"prompt_md5": "3f338662", "template_md5": "465699a0", "result": "You have a set of prizes with different values. There are multiple containers, each holding a certain number of tickets. People can add or remove tickets from the containers. You have a limited number of tickets to distribute among the containers. After each change, you want to know the maximum possible value of prizes you can win if you distribute your tickets optimally, considering that you can't put more tickets in a container than all other participants combined."}]}