{"uid": "626-E", "url": "https://codeforces.com/contest/626/problem/E", "tags": ["binary search", " math", " ternary search"], "title": "626-E", "statement": "E. Simple Skewnesstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDefine thesimple skewnessof a collection of numbers to be the collection's mean minus its median. You are given a list ofn(not necessarily distinct) integers. Find the non-empty subset (with repetition) with the maximum simple skewness.The mean of a collection is the average of its elements. The median of a collection is its middle element when all of its elements are sorted, or the average of its two middle elements if it has even size.InputThe first line of the input contains a single integern(1 ≤n≤ 200 000) — the number of elements in the list.The second line containsnintegersxi(0 ≤xi≤ 1 000 000) — theith element of the list.OutputIn the first line, print a single integerk— the size of the subset.In the second line, printkintegers — the elements of the subset in any order.If there are multiple optimal subsets, print any.ExamplesInput41 2 3 12Output31 2 12Input41 1 2 2Output31 1 2Input21 2Output21 2NoteIn the first case, the optimal subset is, which has mean5, median2, and simple skewness of5 - 2 = 3.In the second case, the optimal subset is. Note that repetition is allowed.In the last case, any subset has the same median and mean, so all have simple skewness of0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5205cac0", "template_md5": "35d339e4", "result": "You are given a list of integers.  Find the subset of these integers (you can use the same integer multiple times) that has the largest difference between its mean and its median. \n\nOutput the size of the subset and the subset itself. \n\n**Definitions:**\n\n* **Mean:** The average of all the numbers in the subset.\n* **Median:** The middle number in the sorted subset. If there are two middle numbers, their average is the median."}, {"prompt_md5": "11bf55e7", "template_md5": "465699a0", "result": "You are given a list of numbers. Find the largest group of numbers from the list (you can use the same number multiple times) that has the biggest difference between its average and its middle number."}]}