{"uid": "626-A", "url": "https://codeforces.com/contest/626/problem/A", "tags": ["brute force", " implementation"], "title": "626-A", "statement": "A. Robot Sequencetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputCalvin the robot lies in an infinite rectangular grid. Calvin's source code contains a list ofncommands, each either 'U', 'R', 'D', or 'L' — instructions to move a single square up, right, down, or left, respectively. How many ways can Calvin execute a non-empty contiguous substrings of commands and return to the same square he starts in? Two substrings are considered different if they have different starting or ending indices.InputThe first line of the input contains a single positive integer,n(1 ≤n≤ 200) — the number of commands.The next line containsncharacters, each either 'U', 'R', 'D', or 'L' — Calvin's source code.OutputPrint a single integer — the number of contiguous substrings that Calvin can execute and return to his starting square.ExamplesInput6URLLDROutput2Input4DLUUOutput0Input7RLRLRLROutput12NoteIn the first case, the entire source code works, as well as the \"RL\" substring in the second and third characters.Note that, in the third case, the substring \"LR\" appears three times, and is therefore counted three times to the total result.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6121bff3", "template_md5": "35d339e4", "result": "You are given a sequence of commands, each of which is either 'U', 'R', 'D', or 'L'.  'U' means move up, 'R' means move right, 'D' means move down, and 'L' means move left.  \n\nDetermine the number of non-empty contiguous subsequences of these commands that will return you to the starting position. Two subsequences are considered different if they have different starting or ending positions."}, {"prompt_md5": "5d5b586e", "template_md5": "465699a0", "result": "Given a sequence of movements (up, right, down, left), count how many continuous parts of the sequence will return to the starting position."}]}