{"uid": "626-B", "url": "https://codeforces.com/contest/626/problem/B", "tags": ["constructive algorithms", " dp", " math"], "title": "626-B", "statement": "B. Cardstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputCatherine has a deck ofncards, each of which is either red, green, or blue. As long as there are at least two cards left, she can do one of two actions:take any two (not necessarily adjacent) cards with different colors and exchange them for a new card of the third color;take any two (not necessarily adjacent) cards with the same color and exchange them for a new card with that color.She repeats this process until there is only one card left. What are the possible colors for the final card?InputThe first line of the input contains a single integern(1 ≤n≤ 200) — the total number of cards.The next line contains a stringsof lengthn— the colors of the cards.scontains only the characters 'B', 'G', and 'R', representing blue, green, and red, respectively.OutputPrint a single string of up to three characters — the possible colors of the final card (using the same symbols as the input) in alphabetical order.ExamplesInput2RBOutputGInput3GRGOutputBRInput5BBBBBOutputBNoteIn the first sample, Catherine has one red card and one blue card, which she must exchange for a green card.In the second sample, Catherine has two green cards and one red card. She has two options: she can exchange the two green cards for a green card, then exchange the new green card and the red card for a blue card. Alternatively, she can exchange a green and a red card for a blue card, then exchange the blue card and remaining green card for a red card.In the third sample, Catherine only has blue cards, so she can only exchange them for more blue cards.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2dc833dd", "template_md5": "35d339e4", "result": "You are given a deck of $n$ cards, where each card is either red, green, or blue. You can perform the following operations as long as there are at least two cards remaining:\n\n1. Take any two cards of different colors and exchange them for a new card of the third color.\n2. Take any two cards of the same color and exchange them for a new card of that color.\n\nContinue this process until only one card is left. What are the possible colors of the final card?"}, {"prompt_md5": "c5816038", "template_md5": "465699a0", "result": "You have a set of colored objects. You can swap any two objects of different colors for a new object of the third color, or swap any two objects of the same color for a new object of that color.  What are the possible colors of the last remaining object?"}]}