{"uid": "627-C", "url": "https://codeforces.com/contest/627/problem/C", "tags": ["data structures", " divide and conquer", " greedy"], "title": "627-C", "statement": "C. Package Deliverytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJohnny drives a truck and must deliver a package from his hometown to the district center. His hometown is located at point0on a number line, and the district center is located at the pointd.Johnny's truck has a gas tank that holds exactlynliters, and his tank is initially full. As he drives, the truck consumes exactly one liter per unit distance traveled. Moreover, there aremgas stations located at various points along the way to the district center. Thei-th station is located at the pointxion the number line and sells an unlimited amount of fuel at a price ofpidollars per liter. Find the minimum cost Johnny must pay for fuel to successfully complete the delivery.InputThe first line of input contains three space separated integersd,n, andm(1 ≤n≤d≤ 109,1 ≤m≤ 200 000) — the total distance to the district center, the volume of the gas tank, and the number of gas stations, respectively.Each of the nextmlines contains two integersxi,pi(1 ≤xi≤d- 1,1 ≤pi≤ 106) — the position and cost of gas at thei-th gas station. It is guaranteed that the positions of the gas stations are distinct.OutputPrint a single integer — the minimum cost to complete the delivery. If there is no way to complete the delivery, print-1.ExamplesInput10 4 43 55 86 38 4Output22Input16 5 28 25 1Output-1NoteIn the first sample, Johnny's truck holds4liters. He can drive3units to the first gas station, buy2liters of gas there (bringing the tank to3liters total), drive3more units to the third gas station, buy4liters there to fill up his tank, and then drive straight to the district center. His total cost is2·5 + 4·3 = 22dollars.In the second sample, there is no way for Johnny to make it to the district center, as his tank cannot hold enough gas to take him from the latest gas station to the district center.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "83d014af", "template_md5": "35d339e4", "result": "There is a destination $d$ units away. You have a vehicle with a gas tank of size $n$ liters. The vehicle consumes 1 liter of gas per unit distance traveled. There are $m$ gas stations located at positions $x_i$ along the way, each selling gas for $p_i$ dollars per liter. Find the minimum amount of money you need to spend on gas to reach the destination. If it's impossible to reach the destination, output -1. \n\nInput:\n\n* The first line contains three integers: $d$, $n$, and $m$.\n* The next $m$ lines each contain two integers: $x_i$ and $p_i$.\n\nOutput:\n\n* A single integer representing the minimum cost to reach the destination."}, {"prompt_md5": "d849cf64", "template_md5": "465699a0", "result": "You have a limited fuel capacity and need to travel a certain distance. There are gas stations along the way with varying prices. Find the cheapest way to buy enough fuel to reach your destination. If it's impossible to reach the destination, say so."}]}