{"uid": "627-B", "url": "https://codeforces.com/contest/627/problem/B", "tags": ["data structures"], "title": "627-B", "statement": "B. Factory Repairstime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA factory produces thimbles in bulk. Typically, it can produce up toathimbles a day. However, some of the machinery is defective, so it can currently only producebthimbles each day. The factory intends to choose ak-day period to do maintenance and construction; it cannot produce any thimbles during this time, but will be restored to its full production ofathimbles per day after thekdays are complete.Initially, no orders are pending. The factory receives updates of the formdi,ai, indicating thatainew orders have been placed for thedi-th day. Each order requires a single thimble to be produced on precisely the specified day. The factory may opt to fill as many or as few of the orders in a single batch as it likes.As orders come in, the factory owner would like to know the maximum number of orders he will be able to fill if he starts repairs on a given daypi. Help the owner answer his questions.InputThe first line contains five integersn,k,a,b, andq(1 ≤k≤n≤ 200 000,1 ≤b<a≤ 10 000,1 ≤q≤ 200 000) — the number of days, the length of the repair time, the production rates of the factory, and the number of updates, respectively.The nextqlines contain the descriptions of the queries. Each query is of one of the following two forms:1diai(1 ≤di≤n,1 ≤ai≤ 10 000), representing an update ofaiorders on daydi, or2pi(1 ≤pi≤n-k+ 1), representing a question: at the moment, how many orders could be filled if the factory decided to commence repairs on daypi?It's guaranteed that the input will contain at least one query of the second type.OutputFor each query of the second type, print a line containing a single integer — the maximum number of orders that the factory can fill over allndays.ExamplesInput5 2 2 1 81 1 21 5 31 2 12 21 4 21 3 22 12 3Output364Input5 4 10 1 61 1 51 5 51 3 21 5 22 12 2Output71NoteConsider the first sample.We produce up to1thimble a day currently and will produce up to2thimbles a day after repairs. Repairs take2days.For the first question, we are able to fill1order on day1, no orders on days2and3since we are repairing, no orders on day4since no thimbles have been ordered for that day, and2orders for day5since we are limited to our production capacity, for a total of3orders filled.For the third question, we are able to fill1order on day1,1order on day2, and2orders on day5, for a total of4orders.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a69ba959", "template_md5": "35d339e4", "result": "A factory produces thimbles. It can normally produce $a$ thimbles per day, but currently produces only $b$ thimbles per day due to some machinery being broken.  The factory plans to shut down for $k$ days to repair the machinery. After the repairs, it will be able to produce $a$ thimbles per day again.\n\nInitially, there are no orders. Orders arrive throughout the days, with each order requiring one thimble on a specific day. The factory can choose to fulfill as many orders as it wants in a single batch.\n\nThe factory owner wants to know the maximum number of orders that can be fulfilled if repairs start on a given day $p$.\n\n**Input:**\n\n* $n$: The total number of days.\n* $k$: The length of the repair period.\n* $a$: The normal production rate of thimbles per day.\n* $b$: The current production rate of thimbles per day.\n* $q$: The number of updates and queries.\n\nThe next $q$ lines contain updates and queries:\n\n* **Update:** `di ai` -  $ai$ new orders arrive on day $di$.\n* **Query:** `pi` - What is the maximum number of orders that can be fulfilled if repairs start on day $pi$?\n\n**Output:**\n\nFor each query, print the maximum number of orders that can be fulfilled."}, {"prompt_md5": "5c07db33", "template_md5": "465699a0", "result": "A factory produces items at a reduced rate due to repairs.  The factory can choose a time to start repairs, which will last for a set number of days.  Orders for items arrive each day.  You need to determine the maximum number of orders the factory can fulfill given a starting repair day."}]}