{"uid": "627-F", "url": "https://codeforces.com/contest/627/problem/F", "tags": ["dfs and similar", " dsu", " graphs", " trees"], "title": "627-F", "statement": "F. Island Puzzletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA remote island chain containsnislands, with some bidirectional bridges between them. The current bridge network forms a tree. In other words, a total ofn- 1bridges connect pairs of islands in a way that it's possible to reach any island from any other island using the bridge network. The center of each island contains an identical pedestal, and all but one of the islands has a fragile, uniquely colored statue currently held on the pedestal. The remaining island holds only an empty pedestal.The islanders want to rearrange the statues in a new order. To do this, they repeat the following process: first, they choose an island directly adjacent to the island containing an empty pedestal. Then, they painstakingly carry the statue on this island across the adjoining bridge and place it on the empty pedestal.It is often impossible to rearrange statues in the desired order using only the operation described above. The islanders would like to build one additional bridge in order to make this achievable in the fewest number of movements possible. Find the bridge to construct and the minimum number of statue movements necessary to arrange the statues in the desired position.InputThe first line contains a single integern(2 ≤n≤ 200 000) — the total number of islands.The second line containsnspace-separated integersai(0 ≤ai≤n- 1) — the statue currently located on thei-th island. Ifai= 0, then the island has no statue. It is guaranteed that theaiare distinct.The third line containsnspace-separated integersbi(0 ≤bi≤n- 1) — the desired statues of thei-th island. Once again,bi= 0indicates the island desires no statue. It is guaranteed that thebiare distinct.The nextn- 1lines each contain two distinct space-separated integersuiandvi(1 ≤ui,vi≤n) — the endpoints of thei-th bridge. Bridges form a tree, and it is guaranteed that no bridge is listed twice in the input.OutputPrint a single line of integers:If the rearrangement can be done in the existing network, output0t, wheretis the number of moves necessary to perform the rearrangement.Otherwise, printu,v, andt(1 ≤u<v≤n) — the two endpoints of the new bridge, and the minimum number of statue movements needed to perform the rearrangement.If the rearrangement cannot be done no matter how the new bridge is built, print a single line containing- 1.ExamplesInput31 0 22 0 11 22 3Output1 3 3Input21 00 11 2Output0 1Input40 1 2 30 2 3 11 21 31 4Output-1NoteIn the first sample, the islanders can build a bridge connecting islands1and3and then make the following sequence of moves: first move statue1from island1to island2, then move statue2from island3to island1, and finally move statue1from island2to island3for a total of3moves.In the second sample, the islanders can simply move statue1from island1to island2. No new bridges need to be built and only1move needs to be made.In the third sample, no added bridge and subsequent movements result in the desired position.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e6ab8074", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, where each node represents an island.  Each island has a pedestal, and some islands have a statue on their pedestal. You are given the current location of each statue and the desired location of each statue.\n\nYou can move a statue from one island to an adjacent island by crossing a bridge.  You can build one new bridge to help with the statue rearrangement.\n\nFind the location of the new bridge and the minimum number of statue moves needed to rearrange the statues to their desired locations. If it is impossible to rearrange the statues, output -1."}, {"prompt_md5": "e34854f0", "template_md5": "465699a0", "result": "You are given a tree with nodes representing islands. Each island has a number associated with it. You need to rearrange the numbers on the islands to match a target arrangement. You can move a number from one island to an adjacent island. You can build one new bridge between two islands to help with the rearrangement. Find the best bridge to build and the minimum number of moves needed to achieve the target arrangement. If it's impossible to rearrange the numbers, output -1."}]}