{"uid": "627-D", "url": "https://codeforces.com/contest/627/problem/D", "tags": ["binary search", " dfs and similar", " dp", " graphs", " greedy", " trees"], "title": "627-D", "statement": "D. Preorder Testtime limit per test7 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputFor his computer science class, Jacob builds a model tree with sticks and balls containingnnodes in the shape of a tree. Jacob has spentaiminutes building thei-th ball in the tree.Jacob's teacher will evaluate his model and grade Jacob based on the effort he has put in. However, she does not have enough time to search his whole tree to determine this; Jacob knows that she will examine the firstknodes in a DFS-order traversal of the tree. She will then assign Jacob a grade equal to the minimumaishe finds among thoseknodes.Though Jacob does not have enough time to rebuild his model, he can choose the root node that his teacher starts from. Furthermore, he can rearrange the list of neighbors ofeach nodein any order he likes. Help Jacob find the best grade he can get on this assignment.A DFS-order traversal is an ordering of the nodes of a rooted tree, built by a recursive DFS-procedure initially called on the root of the tree. When called on a given nodev, the procedure does the following:Printv.Traverse the list of neighbors of the nodevin order and iteratively call DFS-procedure on each one. Do not call DFS-procedure on nodeuif you came to nodevdirectly fromu.InputThe first line of the input contains two positive integers,nandk(2 ≤n≤ 200 000,1 ≤k≤n) — the number of balls in Jacob's tree and the number of balls the teacher will inspect.The second line containsnintegers,ai(1 ≤ai≤ 1 000 000), the time Jacob used to build thei-th ball.Each of the nextn- 1lines contains two integersui,vi(1 ≤ui,vi≤n,ui≠vi) representing a connection in Jacob's tree between ballsuiandvi.OutputPrint a single integer — the maximum grade Jacob can get by picking the right root of the tree and rearranging the list of neighbors.ExamplesInput5 33 6 1 4 21 22 42 51 3Output3Input4 21 5 5 51 21 31 4Output1NoteIn the first sample, Jacob can root the tree at node2and order2's neighbors in the order4,1,5(all other nodes have at most two neighbors). The resulting preorder traversal is2,4,1,3,5, and the minimumaiof the first3nodes is3.In the second sample, it is clear that any preorder traversal will contain node1as either its first or second node, so Jacob cannot do better than a grade of1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4507715d", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes. Each node has a value representing the time it took to build it.  A teacher will examine the first $k$ nodes in a Depth First Search (DFS) traversal of the tree, starting from a chosen root node. The teacher will assign a grade equal to the minimum value found among those $k$ nodes.\n\nYou can choose the root node and rearrange the order of the neighbors for each node.  Find the maximum grade you can achieve. \n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "37a6bbc4", "template_md5": "465699a0", "result": "You have a tree with numbered nodes. Each node has a value. You can choose any node as the root and rearrange the order of its children.  A person will examine the first *k* nodes visited in a depth-first search starting from the chosen root. What is the smallest value you can guarantee they will see?"}]}