{"uid": "628-E", "url": "https://codeforces.com/contest/628/problem/E", "tags": ["data structures", " implementation"], "title": "628-E", "statement": "E. Zbazi in Zeydabadtime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputA tourist wants to visit country Zeydabad for Zbazi (a local game in Zeydabad).The country Zeydabad is a rectangular table consisting ofnrows andmcolumns. Each cell on the country is either'z'or'.'.The tourist knows this country is named Zeydabad because there are lots of ''Z-pattern\"s in the country. A ''Z-pattern\" is a square which anti-diagonal is completely filled with'z'and its upper and lower rows are also completely filled with'z'. All other cells of a square can be arbitrary.Note that a ''Z-pattern\" can consist of only one cell (see the examples).So he wants to count the number of ''Z-pattern\"s in the country (a necessary skill for Zbazi).Now your task is to help tourist with counting number of ''Z-pattern\"s.As input/output can reach huge size it is recommended to use fast input/output methods: for example, prefer to usegets/scanf/printfinstead ofgetline/cin/coutin C++, prefer to useBufferedReader/PrintWriterinstead ofScanner/System.outinJava.InputThe first line contains two integersn,m(1 ≤n,m≤ 3000) — the number of rows and columns respectively.Each of the nextnlines containsmcharacters'z'or'.'— the description of Zeydabad.OutputPrint the only integera— the number of ''Z-pattern\"s in Zeydabad.ExamplesInput4 4zzzzzzz..z..zzzzOutput16Input1 4z.z.Output2Input2 2zzzzOutput5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac1f977e", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$ filled with characters 'z' and '.'.  A \"Z-pattern\" is a square where:\n\n* The anti-diagonal (from top-left to bottom-right) is filled with 'z'.\n* The top and bottom rows of the square are filled with 'z'.\n* Other cells in the square can be either 'z' or '.'.\n\nCount the number of \"Z-patterns\" in the grid."}, {"prompt_md5": "9b092064", "template_md5": "465699a0", "result": "Count the number of \"Z\" shapes in a grid. A \"Z\" shape is a square where the two diagonals are filled with \"Z\" and the top and bottom rows are also filled with \"Z\".  The rest of the square can be filled with either \"Z\" or \".\"."}]}