{"uid": "63-A", "url": "https://codeforces.com/contest/63/problem/A", "tags": ["implementation", " sortings", " strings"], "title": "63-A", "statement": "A. Sinking Shiptime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe ship crashed into a reef and is sinking. Now the entire crew must be evacuated. Allncrew members have already lined up in a row (for convenience let's label them all from left to right with positive integers from 1 ton) and await further instructions. However, one should evacuate the crew properly, in a strict order. Specifically:The first crew members to leave the ship are rats. Then women and children (both groups have the same priority) leave the ship. After that all men are evacuated from the ship. The captain leaves the sinking ship last.If we cannot determine exactly who should leave the ship first for any two members of the crew by the rules from the previous paragraph, then the one who stands to the left in the line leaves the ship first (or in other words, the one whose number in the line is less).For each crew member we know his status as a crew member, and also his name. All crew members have different names. Determine the order in which to evacuate the crew.InputThe first line contains an integern, which is the number of people in the crew (1 ≤n≤ 100). Then follownlines. Thei-th of those lines contains two words — the name of the crew member who isi-th in line, and his status on the ship. The words are separated by exactly one space. There are no other spaces in the line. The names consist of Latin letters, the first letter is uppercase, the rest are lowercase. The length of any name is from 1 to 10 characters. The status can have the following values:ratfor a rat,womanfor a woman,childfor a child,manfor a man,captainfor the captain. The crew contains exactly one captain.OutputPrintnlines. Thei-th of them should contain the name of the crew member who must be thei-th one to leave the ship.ExamplesInput6Jack captainAlice womanCharlie manTeddy ratBob childJulia womanOutputTeddyAliceBobJuliaCharlieJack", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "af768943", "template_md5": "35d339e4", "result": "You are given a list of $n$ people ($1 \\le n \\le 100$) with their respective roles: rat, woman, child, man, or captain. There is only one captain.  \n\nDetermine the evacuation order based on the following priority:\n\n1. Rats\n2. Women and children (equal priority)\n3. Men\n4. Captain\n\nIf two people have the same priority, the person who is earlier in the list leaves first.\n\nOutput the evacuation order, one person per line."}, {"prompt_md5": "33d57ab7", "template_md5": "465699a0", "result": "You are given a list of people with their roles (rat, woman, child, man, captain).  Order the people in the correct evacuation order based on priority: rats first, then women and children together, then men, and finally the captain last. If two people have the same priority, the one who comes first in the list goes first."}]}