{"uid": "63-D", "url": "https://codeforces.com/contest/63/problem/D", "tags": ["constructive algorithms"], "title": "63-D", "statement": "D. Dividing Islandtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA revolution took place on the Buka Island. New government replaced the old one. The new government includesnparties and each of them is entitled to some part of the island according to their contribution to the revolution. However, they can't divide the island.The island can be conventionally represented as two rectanglesa×bandc×dunit squares in size correspondingly. The rectangles are located close to each other. At that, one of the sides with the length ofaand one of the sides with the length ofclie on one line. You can see this in more details on the picture.Thei-th party is entitled to a part of the island equal toxiunit squares. Every such part should fully cover several squares of the island (it is not allowed to cover the squares partially) and be a connected figure. A \"connected figure\" presupposes that from any square of this party one can move to any other square of the same party moving through edge-adjacent squares also belonging to that party.Your task is to divide the island between parties.InputThe first line contains 5 space-separated integers —a,b,c,dandn(1 ≤a,b,c,d≤ 50,b≠d,1 ≤n≤ 26). The second line containsnspace-separated numbers. Thei-th of them is equal to numberxi(1 ≤xi≤a×b+c×d). It is guaranteed that.OutputIf dividing the island between parties in the required manner is impossible, print \"NO\" (without the quotes). Otherwise, print \"YES\" (also without the quotes) and, starting from the next line, printmax(b,d)lines each containinga+ccharacters. To mark what square should belong to what party, use lowercase Latin letters. For the party that is first in order in the input data, use \"a\", for the second one use \"b\" and so on. Use \".\" for the squares that belong to the sea. The first symbol of the second line of the output data should correspond to the square that belongs to the rectanglea×b. The last symbol of the second line should correspond to the square that belongs to the rectanglec×d.If there are several solutions output any.ExamplesInput3 4 2 2 35 8 3OutputYESaaabbaabbbcbb..ccb..Input3 2 1 4 41 2 3 4OutputYESabbdcccd...d...d", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "201230b0", "template_md5": "35d339e4", "result": "You are given two rectangles, one with dimensions $a \\times b$ and the other with dimensions $c \\times d$. These rectangles are positioned so that one side of length $a$ aligns with one side of length $c$.  \n\nYou have $n$ parties, and each party needs a piece of the combined island area. The $i$-th party needs a piece of land with $x_i$ square units.  \n\nEach party's land must be a connected piece (meaning you can move from any square in the piece to any other square in the piece by moving only to adjacent squares).\n\nDetermine if it is possible to divide the island into pieces that satisfy the requirements of each party. If it is possible, output \"YES\" and a visual representation of the island with each party's land marked with a letter (e.g., 'a', 'b', 'c', etc.) and the sea marked with '.'. If it is not possible, output \"NO\"."}, {"prompt_md5": "4794492d", "template_md5": "465699a0", "result": "You are given two rectangles and a number of integers.  You must divide the area of the two rectangles into sections based on the given integers. Each section must be a connected group of squares and cannot be partially filled.  If this is possible, output \"YES\" and a visual representation of the division. Otherwise, output \"NO\"."}]}