{"uid": "630-I", "url": "https://codeforces.com/contest/630/problem/I", "tags": ["combinatorics", " math"], "title": "630-I", "statement": "I. Parking Lottime limit per test0.5 secondsmemory limit per test64 megabytesinputstandard inputoutputstandard outputTo quickly hire highly skilled specialists one of the new IT City companies made an unprecedented move. Every employee was granted a car, and an employee can choose one of four different car makes.The parking lot before the office consists of one line of(2n- 2)parking spaces. Unfortunately the total number of cars is greater than the parking lot capacity. Furthermore even amount of cars of each make is greater than the amount of parking spaces! That's why there are no free spaces on the parking lot ever.Looking on the straight line of cars the company CEO thought that parking lot would be more beautiful if it contained exactlynsuccessive cars of the same make. Help the CEO determine the number of ways to fill the parking lot this way.InputThe only line of the input contains one integern(3 ≤n≤ 30) — the amount of successive cars of the same make.OutputOutput one integer — the number of ways to fill the parking lot by cars of four makes using the described way.ExamplesInput3Output24NoteLet's denote car makes in the following way: A — Aston Martin, B —   Bentley, M — Mercedes-Maybach, Z — Zaporozhets. Forn= 3there are the following appropriate ways to fill the parking lot: AAAB AAAM AAAZ ABBB AMMM AZZZ BBBA BBBM BBBZ BAAA BMMM BZZZ MMMA MMMB MMMZ MAAA MBBB MZZZ ZZZA ZZZB ZZZM ZAAA ZBBB ZMMMOriginally it was planned to grant sport cars of Ferrari, Lamborghini, Maserati and Bugatti makes but this idea was renounced because it is impossible to drive these cars having small road clearance on the worn-down roads of IT City.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2fbdea5", "template_md5": "35d339e4", "result": "You have a parking lot with $2n-2$ parking spaces.  There are $n$ groups of cars, and each group must have the same make.  There are 4 different car makes.  \n\nFind the number of ways to arrange the cars in the parking lot so that each group of $n$ cars has the same make.\n\n$3 \\le n \\le 30$"}, {"prompt_md5": "76f13861", "template_md5": "465699a0", "result": "You have a line of parking spaces. You need to arrange a certain number of groups of cars, where each group has the same type of car.  Each group must have a specific size.  How many different ways can you arrange the cars?"}]}