{"uid": "630-P", "url": "https://codeforces.com/contest/630/problem/P", "tags": ["geometry"], "title": "630-P", "statement": "P. Area of a Startime limit per test0.5 secondsmemory limit per test64 megabytesinputstandard inputoutputstandard outputIt was decided in IT City to distinguish successes of local IT companies by awards in the form of stars covered with gold from one side. To order the stars it is necessary to estimate order cost that depends on the area of gold-plating. Write a program that can calculate the area of a star.A \"star\" figure havingn≥ 5corners wherenis a prime number is constructed the following way. On the circle of radiusrnpoints are selected so that the distances between the adjacent ones are equal. Then every point is connected by a segment with two maximally distant points. All areas bounded by the segments parts are the figure parts.InputThe only line of the input contains two integersn(5 ≤n< 109,nis prime) andr(1 ≤r≤ 109) — the number of the star corners and the radius of the circumcircle correspondingly.OutputOutput one number — the star area. The relative error of your answer should not be greater than10- 7.ExamplesInput7 10Output108.395919545675", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8a19bdcf", "template_md5": "35d339e4", "result": "Given a prime number $n$ (where $5 \\le n < 10^9$) and a radius $r$ (where $1 \\le r \\le 10^9$), calculate the area of a star shape. \n\nThe star is constructed by:\n\n1. Placing $n$ points evenly around a circle with radius $r$.\n2. Connecting each point to its two furthest neighbors with line segments.\n\nOutput the area of the shape formed by these segments. The answer should be accurate to within $10^{-7}$."}, {"prompt_md5": "f7f488ef", "template_md5": "465699a0", "result": "Calculate the area of a star shape. The star has a specific number of points (n, where n is a prime number greater than or equal to 5) evenly spaced around a circle.  Each point is connected to the two points farthest away from it."}]}