{"uid": "630-R", "url": "https://codeforces.com/contest/630/problem/R", "tags": ["games", " math"], "title": "630-R", "statement": "R. Gametime limit per test0.5 secondsmemory limit per test64 megabytesinputstandard inputoutputstandard outputThere is a legend in the IT City college. A student that failed to answer all questions on the game theory exam is given one more chance by his professor. The student has to play a game with the professor.The game is played on a square field consisting ofn×ncells. Initially all cells are empty. On each turn a player chooses and paint an empty cell that has no common sides with previously painted cells. Adjacent corner of painted cells is allowed. On the next turn another player does the same, then the first one and so on. The player with no cells to paint on his turn loses.The professor have chosen the field sizenand allowed the student to choose to be the first or the second player in the game. What should the student choose to win the game? Both players play optimally.InputThe only line of the input contains one integern(1 ≤n≤ 1018) — the size of the field.OutputOutput number1, if the player making the first turn wins when both players play optimally, otherwise print number2.ExamplesInput1Output1Input2Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3ab8a779", "template_md5": "35d339e4", "result": "You are given a square game board of size $n \\times n$. Two players take turns painting an empty cell on the board.  A cell can be painted if it has no shared sides with any previously painted cells (adjacent corners are allowed). The first player to be unable to paint a cell loses. \n\nPlayer 1 can choose to go first or second.  Determine if Player 1 can guarantee a win if both players play optimally. \n\nInput:\n\nA single integer $n$ (1 ≤ $n$ ≤ 10<sup>18</sup>) representing the size of the board.\n\nOutput:\n\n1 if Player 1 can win, 2 if Player 2 can win."}, {"prompt_md5": "93a0b903", "template_md5": "465699a0", "result": "Two players take turns painting empty squares on a square grid.  A square can only be painted if it doesn't share a side with any previously painted squares. The first player to be unable to paint a square loses.  Given the size of the grid, which player has a winning strategy if both players play perfectly?"}]}