{"uid": "631-C", "url": "https://codeforces.com/contest/631/problem/C", "tags": ["data structures", " sortings"], "title": "631-C", "statement": "C. Reporttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEach month Blake gets the report containing main economic indicators of the company \"Blake Technologies\". There arencommodities produced by the company. For each of them there is exactly one integer in the final report, that denotes corresponding revenue. Before the report gets to Blake, it passes through the hands ofmmanagers. Each of them may reorder the elements in some order. Namely, thei-th manager either sorts firstrinumbers in non-descending or non-ascending order and then passes the report to the manageri+ 1, or directly to Blake (if this manager has numberi=m).Employees of the \"Blake Technologies\" are preparing the report right now. You know the initial sequenceaiof lengthnand the description of each manager, that is valueriand his favourite order. You are asked to speed up the process and determine how the final report will look like.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 200 000) — the number of commodities in the report and the number of managers, respectively.The second line containsnintegersai(|ai| ≤ 109) — the initial report before it gets to the first manager.Then followmlines with the descriptions of the operations managers are going to perform. Thei-th of these lines contains two integerstiandri(,1 ≤ri≤n), meaning that thei-th manager sorts the firstrinumbers either in the non-descending (ifti= 1) or non-ascending (ifti= 2) order.OutputPrintnintegers — the final report, which will be passed to Blake by manager numberm.ExamplesInput3 11 2 32 2Output2 1 3Input4 21 2 4 32 31 2Output2 4 1 3NoteIn the first sample, the initial report looked like:1 2 3. After the first manager the first two numbers were transposed:2 13. The report got to Blake in this form.In the second sample the original report was like this:1 2 4 3. After the first manager the report changed to:4 2 13. After the second manager the report changed to:2 41 3. This report was handed over to Blake.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c81f4359", "template_md5": "35d339e4", "result": "You are given a list of $n$ numbers. This list will be processed by $m$ managers. Each manager will sort the first $r_i$ numbers in the list either in ascending or descending order, depending on the value of $i$.  \n\nYour task is to determine the final list of numbers after all managers have processed it.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 200,000$), representing the number of numbers in the list and the number of managers, respectively.\n* The second line contains $n$ integers, $a_1, a_2, ..., a_n$ ($|a_i| \\le 10^9$), representing the initial list of numbers.\n* The following $m$ lines each contain two integers, $t_i$ and $r_i$ ($1 \\le r_i \\le n$), representing the sorting order (1 for ascending, 2 for descending) and the number of elements to sort for the $i$-th manager.\n\n**Output:**\n\nPrint the final list of $n$ numbers after all managers have processed the list."}, {"prompt_md5": "a6d36768", "template_md5": "465699a0", "result": "You are given a list of numbers and a series of rules. Each rule specifies a portion of the list to be sorted in either ascending or descending order. Determine the final order of the numbers after all the rules are applied."}]}