{"uid": "631-B", "url": "https://codeforces.com/contest/631/problem/B", "tags": ["constructive algorithms", " implementation"], "title": "631-B", "statement": "B. Print Checktime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputKris works in a large company \"Blake Technologies\". As a best engineer of the company he was assigned a task to develop a printer that will be able to print horizontal and vertical strips. First prototype is already built and Kris wants to tests it. He wants you to implement the program that checks the result of the printing.Printer works with a rectangular sheet of paper of sizen×m. Consider the list as a table consisting ofnrows andmcolumns. Rows are numbered from top to bottom with integers from1ton, while columns are numbered from left to right with integers from1tom. Initially, all cells are painted in color0.Your program has to support two operations:Paint all cells in rowriin colorai;Paint all cells in columnciin colorai.If during some operationithere is a cell that have already been painted, the color of this cell also changes toai.Your program has to print the resulting table afterkoperation.InputThe first line of the input contains three integersn,mandk(1  ≤n,m≤ 5000,n·m≤ 100 000,1 ≤k≤ 100 000) — the dimensions of the sheet and the number of operations, respectively.Each of the nextklines contains the description of exactly one query:1riai(1 ≤ri≤n,1 ≤ai≤ 109), means that rowriis painted in colorai;2ciai(1 ≤ci≤m,1 ≤ai≤ 109), means that columnciis painted in colorai.OutputPrintnlines containingmintegers each — the resulting table after all operations are applied.ExamplesInput3 3 31 1 32 2 11 2 2Output3 1 32 2 20 1 0Input5 3 51 1 11 3 11 5 12 1 12 3 1Output1 1 11 0 11 1 11 0 11 1 1NoteThe figure below shows all three operations for the first sample step by step. The cells that were painted on the corresponding step are marked gray.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e651636", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$. Initially, all cells are colored 0. You will be given $k$ operations. Each operation is one of two types:\n\n1. Paint all cells in row $r$ with color $a$.\n2. Paint all cells in column $c$ with color $a$.\n\nAfter each operation, print the resulting grid. \n\n**Input:**\n\n* The first line contains three integers: $n$, $m$, and $k$ ($1 \\le n, m \\le 5000$, $n \\cdot m \\le 100000$, $1 \\le k \\le 100000$).\n* Each of the next $k$ lines contains the description of an operation:\n    * `1 r a` means paint row $r$ with color $a$.\n    * `2 c a` means paint column $c$ with color $a$.\n\n**Output:**\n\nPrint $n$ lines, each containing $m$ integers, representing the final grid after all operations are applied."}, {"prompt_md5": "4fb855a7", "template_md5": "465699a0", "result": "You are given a rectangular grid. You can paint entire rows or entire columns of the grid with a given color.  After a series of these paint operations, output the final state of the grid."}]}