{"uid": "632-D", "url": "https://codeforces.com/contest/632/problem/D", "tags": ["brute force", " math", " number theory"], "title": "632-D", "statement": "D. Longest Subsequencetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given arrayawithnelements and the numberm. Consider some subsequence ofaand the value of least common multiple (LCM) of its elements. Denote LCM asl. Find any longest subsequence ofawith the valuel≤m.A subsequence ofais an array we can get by erasing some elements ofa. It is allowed to erase zero or all elements.The LCM of an empty array equals1.InputThe first line contains two integersnandm(1 ≤n,m≤ 106) — the size of the arrayaand the parameter from the problem statement.The second line containsnintegersai(1 ≤ai≤ 109) — the elements ofa.OutputIn the first line print two integerslandkmax(1 ≤l≤m, 0 ≤kmax≤n) — the value of LCM and the number of elements in optimal subsequence.In the second line printkmaxintegers — the positions of the elements from the optimal subsequence in the ascending order.Note that you can find and print any subsequence with the maximum length.ExamplesInput7 86 2 9 2 7 2 3Output6 51 2 4 6 7Input6 42 2 2 3 3 3Output2 31 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cb247d9b", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers ($a_1, a_2, ..., a_n$) and an integer $m$.  Find the longest subsequence of this array whose least common multiple (LCM) is less than or equal to $m$. \n\nOutput the LCM of the longest subsequence and the number of elements in that subsequence. Then, output the indices of the elements in the subsequence. \n\n**Note:** A subsequence is a sequence of elements from the original array that can be obtained by deleting some or no elements. The LCM of an empty array is 1."}, {"prompt_md5": "20cfb239", "template_md5": "465699a0", "result": "You are given a list of numbers and a target value. Find the longest possible sublist (a sublist can be empty) within the original list where the least common multiple of all the numbers in the sublist is less than or equal to the target value. Output the least common multiple and the number of elements in the longest sublist."}]}