{"uid": "632-E", "url": "https://codeforces.com/contest/632/problem/E", "tags": ["divide and conquer", " dp", " fft", " math"], "title": "632-E", "statement": "E. Thief in a Shoptime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputA thief made his way to a shop.As usual he has his lucky knapsack with him. The knapsack can containkobjects. There arenkinds of products in the shop and an infinite number of products of each kind. The cost of one product of kindiisai.The thief is greedy, so he will take exactlykproducts (it's possible for some kinds to take several products of that kind).Find all the possible total costs of products the thief can nick into his knapsack.InputThe first line contains two integersnandk(1 ≤n,k≤ 1000) — the number of kinds of products and the number of products the thief will take.The second line containsnintegersai(1 ≤ai≤ 1000) — the costs of products for kinds from1ton.OutputPrint the only line with all the possible total costs of stolen products, separated by a space. The numbers should be printed in the ascending order.ExamplesInput3 21 2 3Output2 3 4 5 6Input5 51 1 1 1 1Output5Input3 33 5 11Output9 11 13 15 17 19 21 25 27 33", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "58e4f8b6", "template_md5": "35d339e4", "result": "There are $n$ types of products, each with a different cost. The cost of the $i$-th type of product is $a_i$.  You need to find all the possible total costs that can be achieved by selecting $k$ products from these $n$ types.  \n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($1 \\le n, k \\le 1000$), representing the number of product types and the number of products to be selected.\n* The second line contains $n$ integers, $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le 1000$), representing the cost of each product type.\n\n**Output:**\n\n* Print a single line containing all the possible total costs of the selected products, separated by spaces. The costs should be in ascending order."}, {"prompt_md5": "8f800716", "template_md5": "465699a0", "result": "You have a knapsack with a limited capacity. There are several types of items, each with a different price.  Find all the possible total prices you can get by selecting a specific number of items."}]}