{"uid": "632-B", "url": "https://codeforces.com/contest/632/problem/B", "tags": ["brute force", " constructive algorithms"], "title": "632-B", "statement": "B. Alice, Bob, Two Teamstime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob are playing a game. The game involves splitting up game pieces into two teams. There arenpieces, and thei-th piece has a strengthpi.The way to split up game pieces is split into several steps:First, Alice will split the pieces into two different groupsAandB. This can be seen as writing the assignment of teams of a piece in anncharacter string, where each character isAorB.Bob will then choose an arbitrary prefix or suffix of the string, and flip each character in that suffix (i.e. changeAtoBandBtoA). He can do this step at most once.Alice will get all the pieces markedAand Bob will get all the pieces markedB.The strength of a player is then the sum of strengths of the pieces in the group.Given Alice's initial split into two teams, help Bob determine an optimal strategy. Return the maximum strength he can achieve.InputThe first line contains integern(1 ≤n≤ 5·105) — the number of game pieces.The second line containsnintegerspi(1 ≤pi≤ 109) — the strength of thei-th piece.The third line containsncharactersAorB— the assignment of teams after the first step (after Alice's step).OutputPrint the only integera— the maximum strength Bob can achieve.ExamplesInput51 2 3 4 5ABABAOutput11Input51 2 3 4 5AAAAAOutput15Input11BOutput1NoteIn the first sample Bob should flip the suffix of length one.In the second sample Bob should flip the prefix or the suffix (here it is the same) of length5.In the third sample Bob should do nothing.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9a92f41e", "template_md5": "35d339e4", "result": "You are given $n$ objects, each with a strength value $p_i$.  \n\nYou need to determine the maximum total strength a player can achieve after the following process:\n\n1. **Split:** The objects are initially divided into two groups, A and B. This division is represented by a string of length $n$, where each character is either 'A' or 'B', indicating the group each object belongs to.\n\n2. **Flip:**  One player can choose a prefix or suffix of the string and flip all the characters in that section (change 'A' to 'B' and 'B' to 'A'). This can be done at most once.\n\n3. **Score:** The player with the objects marked 'A' gets the sum of their strengths, and the player with the objects marked 'B' gets the sum of their strengths.\n\nGiven the initial division of objects into groups (the string), find the maximum strength the second player can achieve."}, {"prompt_md5": "42a6a671", "template_md5": "465699a0", "result": "You are given a set of items with different values. You need to split the items into two groups. Then, you can choose to reverse a portion of one group. Your goal is to maximize the total value of the group you get."}]}