{"uid": "633-C", "url": "https://codeforces.com/contest/633/problem/C", "tags": ["data structures", " dp", " hashing", " implementation", " sortings", " string suffix structures", " strings"], "title": "633-C", "statement": "C. Spy Syndrome 2time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter observing the results of Spy Syndrome, Yash realised the errors of his ways. He now believes that a super spy such as Siddhant can't use a cipher as basic and ancient as Caesar cipher. After many weeks of observation of Siddhant’s sentences, Yash determined a new cipher technique.For a given sentence, the cipher is processed as:Convert all letters of the sentence to lowercase.Reverse each of the words of the sentence individually.Remove all the spaces in the sentence.For example, when this cipher is applied to the sentenceKira is childish and he hates losingthe resulting string isariksihsidlihcdnaehsetahgnisolNow Yash is given some ciphered string and a list of words. Help him to find out any original sentence composed using only words from the list. Note, that any of the given words could be used in the sentence multiple times.InputThe first line of the input contains a single integern(1 ≤n≤ 10 000) — the length of the ciphered text. The second line consists ofnlowercase English letters — the ciphered textt.The third line contains a single integerm(1 ≤m≤ 100 000) — the number of words which will be considered while deciphering the text. Each of the nextmlines contains a non-empty wordwi(|wi| ≤ 1 000) consisting of uppercase and lowercase English letters only. It's guaranteed that the total length of all words doesn't exceed1 000 000.OutputPrint one line — the original sentence. It is guaranteed that at least one solution exists. If there are multiple solutions, you may output any of those.ExamplesInput30ariksihsidlihcdnaehsetahgnisol10KirahatesishelosingdeathchildishLandNoteOutputKira is childish and he hates losingInput12iherehtolleh5HIHothereHeLLohelloOutputHI there HeLLoNoteIn sample case 2 there may be multiple accepted outputs, \"HI there HeLLo\" and \"HI there hello\" you may output any of them.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "73b48cfe", "template_md5": "35d339e4", "result": "You are given a string of lowercase letters that has been encrypted using a specific method.  The method involves:\n\n1. Converting the original sentence to lowercase.\n2. Reversing each word in the sentence individually.\n3. Removing all spaces from the sentence.\n\nYou are also given a list of words. Your task is to find a sentence composed of these words that, after being encrypted using the same method, matches the given encrypted string. \n\n**Input:**\n\n* The first line contains the length of the encrypted string ($n$).\n* The second line contains the encrypted string ($t$).\n* The third line contains the number of words in the list ($m$).\n* The following $m$ lines each contain a word from the list.\n\n**Output:**\n\nPrint a sentence composed of the given words that, when encrypted, matches the input string."}, {"prompt_md5": "2e84aa50", "template_md5": "465699a0", "result": "You are given a scrambled string and a list of words.  The string was made by reversing each word, removing spaces, and converting everything to lowercase.  Find a sentence using only the words from the list that could have produced the scrambled string."}]}