{"uid": "633-D", "url": "https://codeforces.com/contest/633/problem/D", "tags": ["brute force", " dp", " hashing", " implementation", " math"], "title": "633-D", "statement": "D. Fibonacci-ishtime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYash has recently learnt about the Fibonacci sequence and is very excited about it. He calls a sequence Fibonacci-ish ifthe sequence consists of at least two elementsf0andf1are arbitraryfn+ 2=fn+ 1+fnfor alln≥ 0.You are given some sequence of integersa1,a2, ...,an. Your task is rearrange elements of this sequence in such a way that its longest possible prefix is Fibonacci-ish sequence.InputThe first line of the input contains a single integern(2 ≤n≤ 1000) — the length of the sequenceai.The second line containsnintegersa1,a2, ...,an(|ai| ≤ 109).OutputPrint the length of the longest possible Fibonacci-ish prefix of the given sequence after rearrangement.ExamplesInput31 2 -1Output3Input528 35 7 14 21Output4NoteIn the first sample, if we rearrange elements of the sequence as- 1,2,1, the whole sequenceaiwould be Fibonacci-ish.In the second sample, the optimal way to rearrange elements is,,,,28.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "314e0642", "template_md5": "35d339e4", "result": "You are given a sequence of integers.  Rearrange the elements of the sequence.  Find the length of the longest possible prefix of the rearranged sequence that follows the Fibonacci rule:\n\n*  $f_2 = f_1 + f_0$ \n*  $f_n = f_{n-1} + f_{n-2}$ for all $n \\ge 2$\n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 1000), the length of the sequence.\n* The second line contains $n$ integers, the elements of the sequence.\n\n**Output:**\n\n* Print the length of the longest possible Fibonacci-ish prefix of the sequence after rearrangement."}, {"prompt_md5": "45e22a51", "template_md5": "465699a0", "result": "Given a list of numbers, rearrange them to make the longest possible beginning sequence where each number is the sum of the two numbers before it. Output the length of this longest sequence."}]}