{"uid": "634-A", "url": "https://codeforces.com/contest/634/problem/A", "tags": ["constructive algorithms", " implementation"], "title": "634-A", "statement": "A. Island Puzzletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA remote island chain containsnislands, labeled1throughn. Bidirectional bridges connect the islands to form a simple cycle — a bridge connects islands1and2, islands2and3, and so on, and additionally a bridge connects islandsnand1. The center of each island contains an identical pedestal, and all but one of the islands has a fragile, uniquely colored statue currently held on the pedestal. The remaining island holds only an empty pedestal.The islanders want to rearrange the statues in a new order. To do this, they repeat the following process: First, they choose an island directly adjacent to the island containing an empty pedestal. Then, they painstakingly carry the statue on this island across the adjoining bridge and place it on the empty pedestal.Determine if it is possible for the islanders to arrange the statues in the desired order.InputThe first line contains a single integern(2 ≤n≤ 200 000) — the total number of islands.The second line containsnspace-separated integersai(0 ≤ai≤n- 1) — the statue currently placed on thei-th island. Ifai= 0, then the island has no statue. It is guaranteed that theaiare distinct.The third line containsnspace-separated integersbi(0 ≤bi≤n- 1) — the desired statues of theith island. Once again,bi= 0indicates the island desires no statue. It is guaranteed that thebiare distinct.OutputPrint \"YES\" (without quotes) if the rearrangement can be done in the existing network, and \"NO\" otherwise.ExamplesInput31 0 22 0 1OutputYESInput21 00 1OutputYESInput41 2 3 00 3 2 1OutputNONoteIn the first sample, the islanders can first move statue1from island1to island2, then move statue2from island3to island1, and finally move statue1from island2to island3.In the second sample, the islanders can simply move statue1from island1to island2.In the third sample, no sequence of movements results in the desired position.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "37de5f88", "template_md5": "35d339e4", "result": "You are given a cycle of $n$ islands ($2 \\le n \\le 200,000$). Each island has a pedestal, and all but one island has a statue of a unique color on its pedestal. The remaining island has an empty pedestal. \n\nYou are given two arrays:\n\n*  $a_i$ represents the color of the statue on the $i$-th island.  $a_i = 0$ means there is no statue on the $i$-th island.\n* $b_i$ represents the desired color of the statue on the $i$-th island. $b_i = 0$ means the $i$-th island should have no statue.\n\nThe islanders can move a statue from one island to an adjacent island (across a bridge) and place it on the empty pedestal. \n\nDetermine if it is possible to rearrange the statues so that the $i$-th island has the statue of color $b_i$. \n\n\nIf it is possible, print \"YES\". Otherwise, print \"NO\"."}, {"prompt_md5": "173deff5", "template_md5": "465699a0", "result": "You are given a circular arrangement of items. Each item can be moved to an adjacent item. Determine if you can rearrange the items into a specific target order."}]}