{"uid": "637-D", "url": "https://codeforces.com/contest/637/problem/D", "tags": ["*special", " data structures", " dp", " greedy"], "title": "637-D", "statement": "D. Running with Obstaclestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA sportsman starts from pointxstart= 0and runs to point with coordinatexfinish=m(on a straight line). Also, the sportsman can jump — to jump, he should first take a run of length of not less thansmeters (in this case for thesesmeters his path should have no obstacles), and after that he can jump over a length of not more thandmeters. Running and jumping is permitted only in the direction from left to right. He canstartandfinisha jump only at the points with integer coordinates in which there areno obstacles. To overcome some obstacle, it is necessary to land at a point which is strictly to the right of this obstacle.On the way of an athlete arenobstacles at coordinatesx1,x2, ...,xn. He cannot go over the obstacles, he can only jump over them. Your task is to determine whether the athlete will be able to get to the finish point.InputThe first line of the input containsd four integersn,m,sandd(1 ≤n≤ 200 000,2 ≤m≤ 109,1 ≤s,d≤ 109) — the number of obstacles on the runner's way, the coordinate of the finishing point, the length of running before the jump and the maximum length of the jump, correspondingly.The second line contains a sequence ofnintegersa1,a2, ...,an(1 ≤ai≤m- 1) — the coordinates of the obstacles. It is guaranteed that the starting and finishing point have no obstacles, also no point can have more than one obstacle, The coordinates of the obstacles are given in an arbitrary order.OutputIf the runner cannot reach the finishing point, print in the first line of the output \"IMPOSSIBLE\" (without the quotes).If the athlete can get from start to finish, print any way to do this in the following format:print a line of form \"RUN X>\" (where \"X\" should be a positive integer), if the athlete should run for \"X\" more meters;print a line of form \"JUMP Y\" (where \"Y\" should be a positive integer), if the sportsman starts a jump and should remain in air for \"Y\" more meters.All commands \"RUN\" and \"JUMP\" should strictly alternate, starting with \"RUN\", besides, they should be printed chronologically. It is not allowed to jump over the finishing point but it is allowed to land there after a jump. The athlete should stop as soon as he reaches finish.ExamplesInput3 10 1 33 4 7OutputRUN 2JUMP 3RUN 1JUMP 2RUN 2Input2 9 2 36 4OutputIMPOSSIBLE", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0eeeb458", "template_md5": "35d339e4", "result": "A runner starts at position 0 and wants to reach position $m$. The runner can run for a minimum distance of $s$ meters before jumping. Each jump can cover a maximum distance of $d$ meters.  There are $n$ obstacles placed at positions $x_1$, $x_2$, ..., $x_n$. The runner cannot run through obstacles, only jump over them.  \n\nDetermine if the runner can reach position $m$. If possible, provide a sequence of instructions:\n\n* **RUN X:** Run for $X$ meters.\n* **JUMP Y:** Jump for $Y$ meters.\n\nThe instructions should alternate between running and jumping, starting with a run. The runner should stop as soon as they reach position $m$."}, {"prompt_md5": "73abefb2", "template_md5": "465699a0", "result": "A person needs to travel a certain distance and can only move by running or jumping. Running requires a minimum distance and jumping has a maximum distance. There are obstacles along the way that the person must jump over. Determine if the person can reach the end and, if so, provide a sequence of running and jumping instructions."}]}