{"uid": "637-A", "url": "https://codeforces.com/contest/637/problem/A", "tags": ["*special", " constructive algorithms", " implementation"], "title": "637-A", "statement": "A. Voting for Photostime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter celebrating the midcourse the students of one of the faculties of the Berland State University decided to conduct a vote for the best photo. They published the photos in the social network and agreed on the rules to choose a winner: the photo which gets most likes wins. If multiple photoes get most likes, the winner is the photo that gets this number first.Help guys determine the winner photo by the records of likes.InputThe first line of the input contains a single integern(1 ≤n≤ 1000) — the total likes to the published photoes.The second line containsnpositive integersa1,a2, ...,an(1 ≤ai≤ 1 000 000), whereaiis the identifier of the photo which got thei-th like.OutputPrint the identifier of the photo which won the elections.ExamplesInput51 3 2 2 1Output2Input9100 200 300 200 100 300 300 100 200Output300NoteIn the first test sample the photo with id1got two likes (first and fifth), photo with id2got two likes (third and fourth), and photo with id3got one like (second).Thus, the winner is the photo with identifier2, as it got:more likes than the photo with id3;as many likes as the photo with id1, but the photo with the identifier2got its second like earlier.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b32d88f4", "template_md5": "35d339e4", "result": "You are given a list of integers representing the order in which photos received likes.  Each integer represents a unique photo ID. Determine which photo ID received the most likes and output that ID. If multiple photos have the same highest number of likes, output the ID of the photo that received its last like first.\n\nFor example:\n\nInput: \n5\n1 3 2 2 1\n\nOutput:\n2 \n\nInput:\n9\n100 200 300 200 100 300 300 100 200\n\nOutput:\n300"}, {"prompt_md5": "55ea5982", "template_md5": "465699a0", "result": "Determine the photo that received the most likes first, given a list of photo identifiers and the order in which they received likes."}]}