{"uid": "64-D", "url": "https://codeforces.com/contest/64/problem/D", "tags": ["*special", " greedy"], "title": "64-D", "statement": "D. Presentstime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutYou are given the prices of three presents. Also there are three sisters. It is known that the most valuable present is for the eldest sister. The second (by price) is for the second sister. And the less valuable present is for the youngest sister. If two (or three) presents have the same price, corresponding sisters may get the in a random way.InputThe only line contains three integer numbersa1,a2,a3(1 ≤a1,a2,a3≤ 100) — the prices of the presents.OutputPrint three numbersi1,i2,i3(1 ≤i1,i2,i3≤ 3), all of them should be distinct. The first number stands for the seniority of the sister which will get the first present (1 stands for the eldest, 3 for the youngest). The second and third numbers mean the seniority of the sisters which get the second and the third present respectively.If there are multiple answers, print any of them.ExamplesInput11 13 1Output2 1 3Input30 10 30Output1 3 2NoteIn the second sample another possible answer is \"2 3 1\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ce714b90", "template_md5": "35d339e4", "result": "You are given three prices representing the cost of three presents.  You need to determine which of the three sisters (numbered 1, 2, and 3, with 1 being the eldest and 3 being the youngest) receives each present. \n\nThe most expensive present goes to the eldest sister, the second most expensive goes to the middle sister, and the least expensive goes to the youngest sister. If two or three presents have the same price, the sisters can receive them in any order.\n\nInput: Three integers representing the prices of the presents.\n\nOutput: Three distinct integers representing the sister numbers (1, 2, or 3) who receive each present."}, {"prompt_md5": "3ac8882e", "template_md5": "465699a0", "result": "You are given three prices. Determine an order of three people (1, 2, 3) where the highest price goes to person 1, the second highest to person 2, and the lowest to person 3."}]}