{"uid": "64-G", "url": "https://codeforces.com/contest/64/problem/G", "tags": ["*special"], "title": "64-G", "statement": "G. Path Canonizationtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutA path in some Unix-similar file system is given. The path consists of elements separated with characters \"/\". For example: \"/usr/share/mysql/../tomcat6/conf/server.xml\". The path starts with the root directory (i.e. starts with the character \"/\"). Each element means a name of file or directory, or it is one of two special elements: \".\" или \"..\". First of them stands for the current directory (for example, path \"/./usr/././share\" is equal to \"/usr/share\"). The second element \"..\" stands for the moving to the parent directory (for example, path \"/usr/share/../lib\" is equal to \"/usr/lib\").You task is to convert the given path to such a path, which doesn't contain special elements \".\" and/or \"..\". If it is impossible, print \"-1\". The only reason for it is an attempt to move to the parent directory from the root.InputThe only line contains the given path. The path starts with \"/\" and consists of elements separated with \"/\". No two \"/\" follow one after another (consecutively). The only path which can end with \"/\" is the root directory path equal to \"/\".Each element may contain \"a\"-\"z\", \"0\"-\"9\" and dots. Any element different from specials \".\" and \"..\" contains at least one character different from the dots.The path length is between 1 and 1000 inclusively.OutputPrint the required path or \"-1\".ExamplesInput/usr/share/mysql/../tomcat6/conf/server.xmlOutput/usr/share/tomcat6/conf/server.xmlInput/a/./././..Output/", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "539ea1c1", "template_md5": "35d339e4", "result": "You are given a file path. The path consists of directories separated by \"/\".  Some directories can be represented by \".\" (current directory) or \"..\" (parent directory). \n\nYour task is to simplify the path by removing \".\" and \"..\". If it's impossible to simplify the path (for example, if it tries to go to the parent directory from the root), print \"-1\".\n\n**Input:**\n\nA single line containing the file path.\n\n**Output:**\n\nThe simplified path or \"-1\" if simplification is impossible."}, {"prompt_md5": "db3d1c9a", "template_md5": "465699a0", "result": "Given a file path with special elements \".\" (current directory) and \"..\" (parent directory), simplify the path to remove these elements. If the simplification results in an invalid path (e.g., going up from the root directory), output \"-1\"."}]}