{"uid": "64-H", "url": "https://codeforces.com/contest/64/problem/H", "tags": ["*special", " sortings"], "title": "64-H", "statement": "H. Table Bowlingtime limit per test2 secondsmemory limit per test64 megabytesinputstdinoutputstdoutTable bowling tournament participant completed the competition according to the given final standings table. The table is given as a sequence of lines, each line has a format \"name score\". Your task is to prepare another table consisting of lines in the form \"place name\". Sort participant by score (desc.) and by the name lexicographically in the case of a tie. Places are numerated from 1. If more than one participant has some score, all of them share the places and you should output something like \"12-14 john\".Please, look into the samples for clarification.InputThe first line containsn(1 ≤n≤ 100) — the number of rows in the table. Followingnlines contain the given table. Each line has the form \"name score\", where \"name\" is a sequence of lowercase Latin letters, and \"score\" — is an integer number between 0 and 1000, inclusive. All the names are distinct. The length of each name is between 1 and 10 characters, inclusive. There is single space between the name and the score in each line.OutputPrint the required table. Look at the sample outputs for clarifications.ExamplesInput5vasya 10ted 11petya 10katya 33mike 44Output1 mike2 katya3 ted4-5 petya4-5 vasyaInput3a 1b 13c 1Output1 b2-3 a2-3 c", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "692fab30", "template_md5": "35d339e4", "result": "You are given a table of participants and their scores in a bowling tournament. The table is sorted by score in descending order and by name lexicographically in case of a tie.  \n\nYour task is to output a new table that shows the ranking of the participants. \n\n**Input:**\n\n* The first line contains the number of participants ($n$, where $1 \\le n \\le 100$).\n* The following $n$ lines each contain a participant's name and their score, separated by a space. \n\n**Output:**\n\n* Print a table with each line showing the place number, a hyphen (\"-\") if there are ties, and the participant's name. \n\n\n\nLet me know if you'd like help with the code to solve this problem!"}, {"prompt_md5": "e981bad4", "template_md5": "465699a0", "result": "You are given a list of people and their scores.  Sort the people by score (highest score first) and then alphabetically. If people have the same score, they share the same ranking. Output a list of people with their ranking."}]}