{"uid": "641-G", "url": "https://codeforces.com/contest/641/problem/G", "tags": [], "title": "641-G", "statement": "G. Little Artem and Graphtime limit per test12 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Artem is given a graph, constructed as follows: start with somek-clique, then add new vertices one by one, connecting them tokalready existing vertices that form ak-clique.Artem wants to count the number of spanning trees in this graph modulo109+ 7.InputFirst line of the input contains two integersnandk(1 ≤n≤ 10 000,1 ≤k≤min(n, 5)) — the total size of the graph and the size of the initial clique, respectively.Nextn-klines describek+ 1-th,k+ 2-th, ...,i-th, ...,n-th vertices by listingkdistinct vertex indices1 ≤aij<iit is connected to. It is guaranteed that those vertices form a k-clique.OutputOutput a single integer — the number of spanning trees in the given graph modulo109+ 7.ExamplesInput3 21 2Output3Input4 31 2 3Output16", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f30936f5", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices. The graph is constructed as follows:\n\n1. Start with a clique of $k$ vertices.\n2. Add one new vertex at a time.\n3. Each new vertex is connected to $k$ existing vertices that form a clique.\n\nFind the number of spanning trees in this graph modulo $10^9 + 7$.\n\n**Input:**\n\n* The first line contains two integers $n$ and $k$ ($1 \\le n \\le 10000$, $1 \\le k \\le \\min(n, 5)$).\n* The next $n-k$ lines describe the connections of the vertices. Each line contains $k$ distinct integers representing the vertices that a specific vertex is connected to.\n\n**Output:**\n\n* Output a single integer representing the number of spanning trees modulo $10^9 + 7$."}, {"prompt_md5": "2412ecc1", "template_md5": "465699a0", "result": "You are given a graph built in a specific way: it starts with a group of connected nodes (a clique), and then new nodes are added, each connected to a specific number of nodes from the original clique.  Count the number of ways to choose a set of nodes that connect all the nodes in the graph (a spanning tree) and output the result modulo 10^9 + 7."}]}