{"uid": "641-A", "url": "https://codeforces.com/contest/641/problem/A", "tags": ["implementation"], "title": "641-A", "statement": "A. Little Artem and Grasshoppertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Artem found a grasshopper. He brought it to his house and constructed a jumping area for him.The area looks like a strip of cells1 ×n. Each cell contains the direction for the next jump and the length of that jump. Grasshopper starts in the first cell and follows the instructions written on the cells. Grasshopper stops immediately if it jumps out of the strip. Now Artem wants to find out if this will ever happen.InputThe first line of the input contains a single integern(1 ≤n≤ 100 000) — length of the strip.Next line contains a string of lengthnwhich consists of characters \"<\" and \">\" only, that provide the direction of the jump from the corresponding cell. Next line containsnintegersdi(1 ≤di≤ 109) — the length of the jump from thei-th cell.OutputPrint \"INFINITE\" (without quotes) if grasshopper will continue his jumps forever. Otherwise print \"FINITE\" (without quotes).ExamplesInput2><1 2OutputFINITEInput3>><2 1 1OutputINFINITENoteIn the first sample grasshopper starts from the first cell and jumps to the right on the next cell. When he is in the second cell he needs to jump two cells left so he will jump out of the strip.Second sample grasshopper path is1-3-2-3-2-3and so on. The path is infinite.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "eb31a193", "template_md5": "35d339e4", "result": "Given a strip of cells with length $n$, each cell contains a direction (\"<\" for left, \">\" for right) and a jump length. The grasshopper starts at the first cell and follows the instructions. Determine if the grasshopper will jump forever or eventually jump out of the strip. \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100,000) representing the length of the strip.\n* The second line contains a string of length $n$ consisting of \"<\" and \">\" representing the direction of each jump.\n* The third line contains $n$ integers $d_i$ (1 ≤ $d_i$ ≤ 10⁹) representing the length of each jump.\n\nOutput:\n\n* Print \"INFINITE\" if the grasshopper will jump forever.\n* Print \"FINITE\" if the grasshopper will eventually jump out of the strip."}, {"prompt_md5": "23217dbd", "template_md5": "465699a0", "result": "A line of cells each have a direction (left or right) and a distance to jump. Starting at the first cell, follow the directions and distances. Will the jumping continue forever or will it eventually go out of bounds?"}]}