{"uid": "643-B", "url": "https://codeforces.com/contest/643/problem/B", "tags": ["constructive algorithms", " graphs"], "title": "643-B", "statement": "B. Bear and Two Pathstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBearland hasncities, numbered1throughn. Cities are connected via bidirectional roads. Each road connects two distinct cities. No two roads connect the same pair of cities.Bear Limak was once in a cityaand he wanted to go to a cityb. There was no direct connection so he decided to take a long walk, visiting each cityexactly once. Formally:There is no road betweenaandb.There exists a sequence (path) ofndistinct citiesv1,v2, ...,vnthatv1=a,vn=band there is a road betweenviandvi+ 1for.On the other day, the similar thing happened. Limak wanted to travel between a citycand a cityd. There is no road between them but there exists a sequence ofndistinct citiesu1,u2, ...,unthatu1=c,un=dand there is a road betweenuiandui+ 1for.Also, Limak thinks that there are at mostkroads in Bearland. He wonders whether he remembers everything correctly.Givenn,kand four distinct citiesa,b,c,d, can you find possible paths(v1, ...,vn)and(u1, ...,un)to satisfy all the given conditions? Find any solution or print-1if it's impossible.InputThe first line of the input contains two integersnandk(4 ≤n≤ 1000,n- 1 ≤k≤ 2n- 2) — the number of cities and the maximum allowed number of roads, respectively.The second line contains fourdistinctintegersa,b,candd(1 ≤a,b,c,d≤n).OutputPrint-1if it's impossible to satisfy all the given conditions. Otherwise, print two lines with paths descriptions. The first of these two lines should containndistinct integersv1,v2, ...,vnwherev1=aandvn=b. The second line should containndistinct integersu1,u2, ...,unwhereu1=candun=d.Two paths generate at most2n- 2roads:(v1,v2), (v2,v3), ..., (vn- 1,vn), (u1,u2), (u2,u3), ..., (un- 1,un). Your answer will be considered wrong if contains more thankdistinct roads or any other condition breaks. Note that(x,y)and(y,x)are the same road.ExamplesInput7 112 4 7 3Output2 7 1 3 6 5 47 1 5 4 6 2 3Input1000 99910 20 30 40Output-1NoteIn the first sample test, there should be7cities and at most11roads. The provided sample solution generates10roads, as in the drawing. You can also see a simple path of lengthnbetween2and4, and a path between7and3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0bf74cf6", "template_md5": "35d339e4", "result": "You are given a number of cities, $n$, and a maximum number of roads, $k$.  You are also given four distinct cities, $a$, $b$, $c$, and $d$.\n\nThere are no direct roads between any of these pairs of cities.\n\nYou need to find two paths:\n\n1. A path of $n$ cities starting at $a$ and ending at $b$, where each city is visited exactly once.\n2. A path of $n$ cities starting at $c$ and ending at $d$, where each city is visited exactly once.\n\nThe total number of roads in both paths combined cannot exceed $2n-2$.\n\nIf it is impossible to find such paths, output -1. Otherwise, output the two paths."}, {"prompt_md5": "248d1bcb", "template_md5": "465699a0", "result": "Given a number of cities and a maximum number of roads allowed, determine if it's possible to find two paths between distinct pairs of cities, ensuring each city is visited exactly once in each path. If possible, output the two paths. If not, output -1."}]}