{"uid": "643-A", "url": "https://codeforces.com/contest/643/problem/A", "tags": ["implementation"], "title": "643-A", "statement": "A. Bear and Colorstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBear Limak hasncolored balls, arranged in one long row. Balls are numbered1throughn, from left to right. There arenpossible colors, also numbered1throughn. Thei-th ball has colorti.For a fixed interval (set of consecutive elements) of balls we can define adominantcolor. It's a color occurring the biggest number of times in the interval. In case of a tie between some colors, the one with the smallest number (index) is chosen as dominant.There arenon-empty intervals in total. For each color, your task is to count the number of intervals in which this color is dominant.InputThe first line of the input contains a single integern(1 ≤n≤ 5000) — the number of balls.The second line containsnintegerst1,t2, ...,tn(1 ≤ti≤n) wheretiis the color of thei-th ball.OutputPrintnintegers. Thei-th of them should be equal to the number of intervals whereiis a dominant color.ExamplesInput41 2 1 2Output7 3 0 0Input31 1 1Output6 0 0NoteIn the first sample, color2is dominant in three intervals:An interval[2, 2]contains one ball. This ball's color is2so it's clearly a dominant color.An interval[4, 4]contains one ball, with color2again.An interval[2, 4]contains two balls of color2and one ball of color1.There are7more intervals and color1is dominant in all of them.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "90264c00", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, where each integer represents the color of a ball. The colors are numbered from 1 to $n$.  \n\nFor each color $i$, count the number of subarrays (intervals) where color $i$ is the most frequent color. If there is a tie, the color with the smallest number is considered dominant.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 5000), the number of balls.\n* The second line contains $n$ integers $t_1, t_2, ..., t_n$ (1 ≤ $t_i$ ≤ $n$), representing the colors of the balls.\n\n**Output:**\n\nPrint $n$ integers. The $i$-th integer should be the number of intervals where color $i$ is dominant."}, {"prompt_md5": "b257e83d", "template_md5": "465699a0", "result": "You are given a sequence of numbers. For each number, count how many times it is the most frequent number within a consecutive sub-sequence of the original sequence."}]}