{"uid": "643-C", "url": "https://codeforces.com/contest/643/problem/C", "tags": ["dp"], "title": "643-C", "statement": "C. Levels and Regionstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRadewoosh is playing a computer game. There arenlevels, numbered1throughn. Levels are divided intokregions (groups). Each region contains some positive number of consecutive levels.The game repeats the the following process:If all regions are beaten then the game ends immediately. Otherwise, the system finds the first region with at least one non-beaten level. LetXdenote this region.The system creates an empty bag for tokens. Each token will represent one level and there may be many tokens representing the same level.For each already beaten leveliin the regionX, the system addstitokens to the bag (tokens representing thei-th level).Letjdenote the first non-beaten level in the regionX. The system addstjtokens to the bag.Finally, the system takes a uniformly random token from the bag and a player starts the level represented by the token. A player spends one hour and beats the level, even if he has already beaten it in the past.Givenn,kand valuest1,t2, ...,tn, your task is to split levels into regions. Each level must belong to exactly one region, and each region must contain non-empty consecutive set of levels. What is the minimum possible expected number of hours required to finish the game?InputThe first line of the input contains two integersnandk(1 ≤n≤ 200 000,1 ≤k≤min(50,n)) — the number of levels and the number of regions, respectively.The second line containsnintegerst1,t2, ...,tn(1 ≤ti≤ 100 000).OutputPrint one real number — the minimum possible expected value of the number of hours spent to finish the game if levels are distributed between regions in the optimal way. Your answer will be considered correct if its absolute or relative error does not exceed10- 4.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct if.ExamplesInput4 2100 3 5 7Output5.7428571429Input6 21 2 4 8 16 32Output8.5000000000NoteIn the first sample, we are supposed to split4levels into2regions. It's optimal to create the first region with only one level (it must be the first level). Then, the second region must contain other three levels.In the second sample, it's optimal to split levels into two regions with3levels each.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a06a31f2", "template_md5": "35d339e4", "result": "You are given $n$ levels numbered 1 through $n$ and need to divide them into $k$ non-empty consecutive groups (regions).  Each region contains a set of consecutive levels.\n\nHere's how the game works:\n\n1. **Check for completion:** If all regions have been beaten, the game ends.\n2. **Find the first uncompleted region:**  Identify the first region with at least one unbeaten level. Let's call this region $X$.\n3. **Token distribution:**\n   - For each beaten level $i$ in region $X$, add $t_i$ tokens to a bag.\n   - Add $t_j$ tokens to the bag, where $j$ is the first unbeaten level in region $X$.\n4. **Random level selection:** A token is randomly chosen from the bag, and the player starts the level represented by that token.  The player always beats the level, even if they've beaten it before.\n\n**Your task:**\n\nFind the minimum possible expected number of hours required to finish the game, given $n$, $k$, and the values $t_1$, $t_2$, ..., $t_n$. \n\n\n\nLet me know if you'd like help with any specific part of the problem or need further clarification!"}, {"prompt_md5": "d8758e71", "template_md5": "465699a0", "result": "You have a set of tasks and need to divide them into groups. Each group must be consecutive.  You want to minimize the expected time to complete all tasks.  The time to complete a task depends on which group it belongs to."}]}