{"uid": "644-C", "url": "https://codeforces.com/contest/644/problem/C", "tags": ["*special", " binary search", " data structures", " implementation", " sortings", " strings"], "title": "644-C", "statement": "C. Hostname Aliasestime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are some websites that are accessible through several different addresses. For example, for a long time Codeforces was accessible with two hostnamescodeforces.comandcodeforces.ru.You are given a list of page addresses being queried. For simplicity we consider all addresses to have the formhttp://<hostname>[/<path>], where:<hostname>— server name (consists of words and maybe some dots separating them),/<path>— optional part, where <path> consists of words separated by slashes.We consider two<hostname>to correspond to one website if for each query to the first<hostname>there will be exactly the same query to the second one and vice versa — for each query to the second<hostname>there will be the same query to the first one. Take a look at the samples for further clarifications.Your goal is to determine the groups of server names that correspond to one website. Ignore groups consisting of the only server name.Please note, that according to the above definition querieshttp://<hostname>andhttp://<hostname>/are different.InputThe first line of the input contains a single integern(1 ≤n≤ 100 000) — the number of page queries. Then follownlines each containing exactly one address. Each address is of the formhttp://<hostname>[/<path>], where:<hostname>consists of lowercase English letters and dots, there are no two consecutive dots,<hostname>doesn't start or finish with a dot. The length of<hostname>is positive and doesn't exceed20.<path>consists of lowercase English letters, dots and slashes. There are no two consecutive slashes,<path>doesn't start with a slash and its length doesn't exceed20.Addresses are not guaranteed to be distinct.OutputFirst printk— the number of groups of server names that correspond to one website. You should count only groups of size greater than one.Nextklines should contain the description of groups, one group per line. For each group print all server names separated by a single space. You are allowed to print both groups and names inside any group in arbitrary order.ExamplesInput10http://abacaba.ru/testhttp://abacaba.ru/http://abacaba.comhttp://abacaba.com/testhttp://abacaba.de/http://abacaba.ru/testhttp://abacaba.de/testhttp://abacaba.com/http://abacaba.com/thttp://abacaba.com/testOutput1http://abacaba.de http://abacaba.ruInput14http://chttp://ccc.bbbb/aba..bhttp://cba.comhttp://a.c/aba..b/ahttp://abc/http://a.c/http://ccc.bbbbhttp://ab.ac.bc.aa/http://a.a.a/http://ccc.bbbb/http://cba.com/http://cba.com/aba..bhttp://a.a.a/aba..b/ahttp://abc/aba..b/aOutput2http://cba.com http://ccc.bbbbhttp://a.a.a http://a.c http://abc", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "58a07fd7", "template_md5": "35d339e4", "result": "You are given a list of website addresses.  Some websites have multiple addresses.  \n\nTwo addresses belong to the same website if for every request to the first address, there is a corresponding request to the second address, and vice versa.\n\nFor example:\n\n* `http://abacaba.ru/test` and `http://abacaba.com/test` belong to the same website.\n* `http://abacaba.ru/test` and `http://abacaba.ru` belong to different websites.\n\nYour task is to group the addresses that belong to the same website.  \n\n**Input:**\n\n* The first line contains the number of addresses.\n* The following lines each contain a single website address in the format `http://<hostname>[/<path>]`.\n\n**Output:**\n\n* The first line contains the number of website groups.\n* Each of the following lines contains a group of website addresses, separated by spaces."}, {"prompt_md5": "a0713b22", "template_md5": "465699a0", "result": "You are given a list of website addresses.  Determine which addresses belong to the same website, even if they have different names.  Two addresses belong to the same website if for every visit to one address, there is a corresponding visit to the other address, and vice versa.  Output the groups of websites."}]}