{"uid": "645-A", "url": "https://codeforces.com/contest/645/problem/A", "tags": ["brute force", " constructive algorithms", " implementation"], "title": "645-A", "statement": "A. Amity Assessmenttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBessie the cow and her best friend Elsie each received a sliding puzzle on Pi Day. Their puzzles consist of a2 × 2grid and three tiles labeled 'A', 'B', and 'C'. The three tiles sit on top of the grid, leaving one grid cell empty. To make a move, Bessie or Elsie can slide a tile adjacent to the empty cell into the empty cell as shown below:In order to determine if they are truly Best Friends For Life (BFFLs), Bessie and Elsie would like to know if there exists a sequence of moves that takes their puzzles to the same configuration (moves can be performed in both puzzles). Two puzzles are considered to be in the same configuration if each tile is on top of the same grid cell in both puzzles. Since the tiles are labeled with letters, rotations and reflections are not allowed.InputThe first two lines of the input consist of a2 × 2grid describing the initial configuration of Bessie's puzzle. The next two lines contain a2 × 2grid describing the initial configuration of Elsie's puzzle. The positions of the tiles are labeled 'A', 'B', and 'C', while the empty cell is labeled 'X'. It's guaranteed that both puzzles contain exactly one tile with each letter and exactly one empty position.OutputOutput \"YES\"(without quotes) if the puzzles can reach the same configuration (and Bessie and Elsie are truly BFFLs). Otherwise, print \"NO\" (without quotes).ExamplesInputABXCXBACOutputYESInputABXCACBXOutputNONoteThe solution to the first sample is described by the image. All Bessie needs to do is slide her 'A' tile down.In the second sample, the two puzzles can never be in the same configuration. Perhaps Bessie and Elsie are not meant to be friends after all...", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3245c304", "template_md5": "35d339e4", "result": "You are given two $2 \\times 2$ grids. Each grid has three tiles labeled 'A', 'B', and 'C', and one empty cell. The tiles can be moved one at a time into the empty cell if they are adjacent to it. \n\nDetermine if it is possible to move the tiles in both grids to the same configuration. Rotations and reflections are not allowed. \n\nOutput \"YES\" if it is possible, and \"NO\" otherwise."}, {"prompt_md5": "10990a5e", "template_md5": "465699a0", "result": "Two 2x2 grids each contain three unique letters and one empty space. Determine if it's possible to rearrange the letters in one grid to match the other grid by sliding letters into the empty space."}]}