{"uid": "649-A", "url": "https://codeforces.com/contest/649/problem/A", "tags": ["constructive algorithms", " implementation"], "title": "649-A", "statement": "A. Любимые числа Поликарпаограничение по времени на тест2 секундыограничение по памяти на тест256 мегабайтвводстандартный вводвыводстандартный выводПоликарп мечтает стать программистом и фанатеет от степеней двойки. Среди двух чисел ему больше нравится то, которое делится на большую степень числа2.По заданной последовательности целых положительных чиселa1,a2, ...,anтребуется найтиr— максимальную степень числа2, на которую делится хотя бы одно из чисел последовательности. Кроме того, требуется вывести количество чиселai, которые делятся наr.Входные данныеВ первой строке записано целое числоn(1 ≤n≤ 100) — длина последовательностиa.Во второй строке записана последовательность целых чиселa1,a2, ...,an(1 ≤ai≤ 109).Выходные данныеВыведите два числа:r— максимальную степень двойки, на которую делится хотя бы одно из чисел заданной последовательности,количество элементов последовательности, которые делятся наr.ПримерыВходные данные580 7 16 4 48Выходные данные16 3Входные данные421 5 3 33Выходные данные1 4ПримечаниеВ первом тестовом примере максимальная степень двойки, на которую делится хотя бы одно число, равна16 = 24, на неё делятся числа80,16и48.Во втором тестовом примере все четыре числа нечётные, поэтому делятся только на1 = 20. Это и будет максимальной степенью двойки для данного примера.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b97d39e3", "template_md5": "35d339e4", "result": "You are given a sequence of positive integers. Find the largest power of 2 that divides at least one of the numbers in the sequence. Also, count how many numbers in the sequence are divisible by this power of 2.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), the length of the sequence.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (1 ≤ $a_i$ ≤ 10⁹), the sequence.\n\n**Output:**\n\n* Print two integers:\n    * $r$, the largest power of 2 that divides at least one number in the sequence.\n    * The count of numbers in the sequence divisible by $r$."}, {"prompt_md5": "f5640810", "template_md5": "465699a0", "result": "Given a list of positive integers, find the highest power of 2 that divides at least one of the numbers in the list. Also, count how many numbers in the list are divisible by that power of 2."}]}