{"uid": "649-D", "url": "https://codeforces.com/contest/649/problem/D", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "649-D", "statement": "D. Дефрагментация памятиограничение по времени на тест2 секундыограничение по памяти на тест256 мегабайтвводстандартный вводвыводстандартный выводПамять компьютера состоит изnячеек, которые выстроены в ряд. Пронумеруем ячейки от1доnслева направо. Про каждую ячейку известно, свободна она или принадлежит какому-либо процессу (в таком случае известен процесс, которому она принадлежит).Для каждого процесса известно, что принадлежащие ему ячейки занимают в памяти непрерывный участок. С помощью операций вида «переписать данные из занятой ячейки в свободную, а занятую теперь считать свободной» требуется расположить все принадлежащие процессам ячейки в начале памяти компьютера. Другими словами, любая свободная ячейка должна располагаться правее (иметь больший номер) любой занятой.Вам необходимо найти минимальное количество операций переписывания данных из одной ячейки в другую, с помощью которых можно достичь описанных условий. Допустимо, что относительный порядок ячеек в памяти для каждого из процессов изменится после дефрагментации, но относительный порядок самих процессов должен остаться без изменений. Это значит, что если все ячейки, принадлежащие процессуi, находились в памяти раньше всех ячеек процессаj, то и после перемещений это условие должно выполняться.Считайте, что номера всех процессов уникальны, хотя бы одна ячейка памяти занята каким-либо процессом.Входные данныеВ первой строке входных данных записано числоn(1 ≤n≤ 200 000) — количество ячеек в памяти компьютера.Во второй строке входных данных следуютnцелых чиселa1,a2, ...,an(1 ≤ai≤n), гдеaiравно либо0(это означает, чтоi-я ячейка памяти свободна), либо номеру процесса, которому принадлежитi-я ячейка памяти. Гарантируется, что хотя бы одно значениеaiне равно0.Процессы пронумерованы целыми числами от1доnв произвольном порядке. При этом процессы не обязательно пронумерованы последовательными числами.Выходные данныеВыведите одно целое число — минимальное количество операций, которое нужно сделать для дефрагментации памяти.ПримерыВходные данные40 2 2 1Выходные данные2Входные данные80 8 8 8 0 4 4 2Выходные данные4ПримечаниеВ первом тестовом примере достаточно двух операций:Переписать данные из третьей ячейки в первую. После этого память компьютера примет вид:2 2 0 1.Переписать данные из четвертой ячейки в третью. После этого память компьютера примет вид:2 2 1 0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "919c222d", "template_md5": "35d339e4", "result": "You are given a memory with $n$ cells numbered from 1 to $n$. Each cell is either free (0) or belongs to a process (a positive integer).  Processes have contiguous blocks of memory.\n\nYour task is to rearrange the memory so that all free cells are to the right of all occupied cells. The relative order of cells within each process's block can change, but the overall order of processes must remain the same.\n\nFind the minimum number of operations required to achieve this. Each operation involves copying data from one occupied cell to a free cell, making the original occupied cell free."}, {"prompt_md5": "774e4448", "template_md5": "465699a0", "result": "You have a memory with a certain number of slots. Each slot is either empty or occupied by a process.  Processes occupy consecutive slots.  You can move data from one occupied slot to an empty slot.  Find the minimum number of moves needed to arrange all occupied slots in the beginning of the memory, with empty slots following them. The order of processes within their own blocks can change, but the overall order of processes must remain the same."}]}