{"uid": "650-A", "url": "https://codeforces.com/contest/650/problem/A", "tags": ["data structures", " geometry", " math"], "title": "650-A", "statement": "A. Watchmentime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWatchmen are in a danger and Doctor Manhattan together with his friend Daniel Dreiberg should warn them as soon as possible. There arenwatchmen on a plane, thei-th watchman is located at point(xi,yi).They need to arrange a plan, but there are some difficulties on their way. As you know, Doctor Manhattan considers the distance between watchmeniandjto be|xi-xj| + |yi-yj|. Daniel, as an ordinary person, calculates the distance using the formula.The success of the operation relies on the number of pairs(i,j)(1 ≤i<j≤n), such that the distance between watchmaniand watchmenjcalculated by Doctor Manhattan is equal to the distance between them calculated by Daniel. You were asked to compute the number of such pairs.InputThe first line of the input contains the single integern(1 ≤n≤ 200 000) — the number of watchmen.Each of the followingnlines contains two integersxiandyi(|xi|, |yi| ≤ 109).Some positions may coincide.OutputPrint the number of pairs of watchmen such that the distance between them calculated by Doctor Manhattan is equal to the distance calculated by Daniel.ExamplesInput31 17 51 5Output2Input60 00 10 2-1 10 11 1Output11NoteIn the first sample, the distance between watchman1and watchman2is equal to|1 - 7| + |1 - 5| = 10for Doctor Manhattan andfor Daniel. For pairs(1, 1),(1, 5)and(7, 5),(1, 5)Doctor Manhattan and Daniel will calculate the same distances.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7d0324da", "template_md5": "35d339e4", "result": "You are given the coordinates of $n$ points on a 2D plane.  Each point represents a watchman.  \n\nYou need to find the number of pairs of watchmen $(i, j)$ where $1 \\le i < j \\le n$ such that the distance between watchman $i$ and watchman $j$ calculated using the Manhattan distance formula is equal to the distance calculated using the Euclidean distance formula.\n\n**Manhattan Distance:** $|x_i - x_j| + |y_i - y_j|$\n\n**Euclidean Distance:** $\\sqrt{(x_i - x_j)^2 + (y_i - y_j)^2}$ \n\n\n\nLet me know if you'd like help with any part of solving this problem!"}, {"prompt_md5": "23152772", "template_md5": "465699a0", "result": "You are given a list of points.  Count how many pairs of points have the same distance between them when measured in two different ways."}]}