{"uid": "650-E", "url": "https://codeforces.com/contest/650/problem/E", "tags": ["data structures", " dfs and similar", " dsu", " greedy", " trees"], "title": "650-E", "statement": "E. Clockwork Bombtime limit per test6 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMy name is James diGriz, I'm the most clever robber and treasure hunter in the whole galaxy. There are books written about my adventures and songs about my operations, though you were able to catch me up in a pretty awkward moment.I was able to hide from cameras, outsmart all the guards and pass numerous traps, but when I finally reached the treasure box and opened it, I have accidentally started the clockwork bomb! Luckily, I have met such kind of bombs before and I know that the clockwork mechanism can be stopped by connecting contacts with wires on the control panel of the bomb in a certain manner.I seencontacts connected byn- 1wires. Contacts are numbered with integers from1ton. Bomb has a security mechanism that ensures the following condition: if there existk≥ 2contactsc1,c2, ...,ckforming a circuit, i. e. there existkdistinctwires between contactsc1andc2,c2andc3,...,ckandc1, then the bomb immediately explodes and my story ends here. In particular, if two contacts are connected by more than one wire they form a circuit of length2. It is also prohibited to connect a contact with itself.On the other hand, if I disconnect more than one wire (i. e. at some moment there will be no more thann- 2wires in the scheme) then the other security check fails and the bomb also explodes. So, the only thing I can do is to unplug some wire and plug it into a new place ensuring the fact that no circuits appear.I know how I should put the wires in order to stop the clockwork. But my time is running out! Help me get out of this alive: find the sequence of operations each of which consists of unplugging some wire and putting it into another place so that the bomb is defused.InputThe first line of the input containsn(2 ≤n≤ 500 000), the number of contacts.Each of the followingn- 1lines contains two of integersxiandyi(1 ≤xi,yi≤n,xi≠yi) denoting the contacts currently connected by thei-th wire.The remainingn- 1lines contain the description of the sought scheme in the same format.It is guaranteed that the starting and the ending schemes are correct (i. e. do not contain cicuits nor wires connecting contact with itself).OutputThe first line should containk(k≥ 0) — the minimum number of moves of unplugging and plugging back some wire required to defuse the bomb.In each of the followingklines output four integersai,bi,ci,dimeaning that on thei-th step it is neccesary to unplug the wire connecting the contactsaiandbiand plug it to the contactscianddi. Of course the wire connecting contactsaiandbishould be present in the scheme.If there is no correct sequence transforming the existing scheme into the sought one, output-1.ExamplesInput31 22 31 33 2Output11 2 1 3Input41 22 33 42 44 11 3Output31 2 1 34 3 4 12 3 2 4NotePicture with the clarification for the sample tests:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2e80cc67", "template_md5": "35d339e4", "result": "You are given a network of $n$ contacts connected by $n-1$ wires.  Each wire connects two distinct contacts.  \n\nThe network has a safety mechanism:\n\n* **Explode Condition 1:** If there are $k \\ge 2$ contacts forming a circuit (meaning there are $k$ wires connecting them in a loop), the bomb explodes.\n* **Explode Condition 2:** If you disconnect more than one wire at a time, the bomb explodes.\n\nYou are also given a target network with $n$ contacts connected by $n-1$ wires. This target network is safe.\n\nYour task is to find the minimum number of operations required to transform the initial network into the target network. Each operation consists of:\n\n1. Unplugging a wire connecting two contacts.\n2. Plugging that same wire into a different pair of contacts.\n\nIf it's impossible to transform the initial network into the target network safely, output -1. \n\n\n\nLet me know if you'd like me to clarify any part of the problem!"}, {"prompt_md5": "4578306d", "template_md5": "465699a0", "result": "You are given a network of connections.  You need to transform the network from one configuration to another by moving connections between points.  You can only move one connection at a time.  \n\nThe rules are:\n\n* You cannot create loops in the network.\n* You cannot disconnect more than one connection at a time.\n\nFind the minimum number of moves required to transform the network and list the sequence of moves. If it's impossible, output -1."}]}