{"uid": "650-D", "url": "https://codeforces.com/contest/650/problem/D", "tags": ["binary search", " data structures", " dp", " hashing"], "title": "650-D", "statement": "D. Zip-linetime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya has decided to build a zip-line on trees of a nearby forest. He wants the line to be as long as possible but he doesn't remember exactly the heights of all trees in the forest. He is sure that he remembers correct heights of all trees except, possibly, one of them.It is known that the forest consists ofntrees staying in a row numbered from left to right with integers from1ton. According to Vasya, the height of thei-th tree is equal tohi. The zip-line of lengthkshould hang overk(1 ≤k≤n) treesi1,i2, ...,ik(i1<i2< ... <ik) such that their heights form an increasing sequence, that ishi1<hi2< ... <hik.Petya had been in this forest together with Vasya, and he now hasqassumptions about the mistake in Vasya's sequenceh. Hisi-th assumption consists of two integersaiandbiindicating that, according to Petya, the height of the tree numberedaiis actually equal tobi. Note that Petya's assumptions areindependentfrom each other.Your task is to find the maximum length of a zip-line that can be built over the trees under each of theqassumptions.In this problem the length of a zip line is considered equal to the number of trees that form this zip-line.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 400 000) — the number of the trees in the forest and the number of Petya's assumptions, respectively.The following line containsnintegershi(1 ≤hi≤ 109) — the heights of trees according to Vasya.Each of the followingmlines contains two integersaiandbi(1 ≤ai≤n,1 ≤bi≤ 109).OutputFor each of the Petya's assumptions output one integer, indicating the maximum length of a zip-line that can be built under this assumption.ExamplesInput4 41 2 3 41 11 44 34 5Output4334Input4 21 3 2 63 52 4Output43NoteConsider the first sample. The first assumption actually coincides with the height remembered by Vasya. In the second assumption the heights of the trees are(4, 2, 3, 4), in the third one they are(1, 2, 3, 3)and in the fourth one they are(1, 2, 3, 5).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2011029c", "template_md5": "35d339e4", "result": "There are $n$ trees in a row, numbered from 1 to $n$.  You are given a sequence of $n$ heights, $h_1, h_2, ..., h_n$, representing the heights of the trees according to one person.  \n\nAnother person has $m$ assumptions about possible errors in the given heights. Each assumption is a pair of numbers $(a_i, b_i)$, meaning that the height of the $a_i$-th tree might actually be $b_i$.\n\nFor each of the $m$ assumptions, find the maximum length of a zip-line that can be built over the trees. A zip-line must:\n\n*  Hang over a consecutive sequence of trees.\n*  Have the heights of the trees in the sequence in increasing order.\n\nThe length of a zip-line is the number of trees it covers."}, {"prompt_md5": "7a47bf08", "template_md5": "465699a0", "result": "You are given a list of numbers representing the heights of trees. Someone might have made a mistake in the list. You are given a set of possible corrections to the list. For each correction, find the longest sequence of increasing heights in the corrected list."}]}