{"uid": "651-B", "url": "https://codeforces.com/contest/651/problem/B", "tags": ["greedy", " sortings"], "title": "651-B", "statement": "B. Beautiful Paintingstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arenpictures delivered for the new exhibition. Thei-th painting has beautyai. We know that a visitor becomes happy every time he passes from a painting to a more beautiful one.We are allowed to arranged pictures in any order. What is the maximum possible number of times the visitor may become happy while passing all pictures from first to last? In other words, we are allowed to rearrange elements ofain any order. What is the maximum possible number of indicesi(1 ≤i≤n- 1), such thatai+ 1>ai.InputThe first line of the input contains integern(1 ≤n≤ 1000) — the number of painting.The second line contains the sequencea1,a2, ...,an(1 ≤ai≤ 1000), whereaimeans the beauty of thei-th painting.OutputPrint one integer — the maximum possible number of neighbouring pairs, such thatai+ 1>ai, after the optimal rearrangement.ExamplesInput520 30 10 50 40Output4Input4200 100 100 200Output2NoteIn the first sample, the optimal order is:10, 20, 30, 40, 50.In the second sample, the optimal order is:100, 200, 100, 200.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8a4527c6", "template_md5": "35d339e4", "result": "You are given a list of $n$ numbers ($a_1, a_2, ..., a_n$) representing the beauty of $n$ paintings. You can arrange these paintings in any order.  \n\nFind the maximum number of times a visitor will feel happy while looking at the paintings, where the visitor feels happy if they move from a less beautiful painting to a more beautiful painting. \n\n\nOutput this maximum number."}, {"prompt_md5": "e369f7c4", "template_md5": "465699a0", "result": "You have a list of numbers representing the beauty of paintings. You can rearrange the paintings in any order.  What is the maximum number of times you can arrange the paintings so that each painting is more beautiful than the one before it?"}]}