{"uid": "653-B", "url": "https://codeforces.com/contest/653/problem/B", "tags": ["brute force", " dfs and similar", " dp", " strings"], "title": "653-B", "statement": "B. Bear and Compressingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLimak is a little polar bear. Polar bears hate long strings and thus they like to compress them. You should also know that Limak is so young that he knows only first six letters of the English alphabet: 'a', 'b', 'c', 'd', 'e' and 'f'.You are given a set ofqpossible operations. Limak can perform them in any order, any operation may be applied any number of times. Thei-th operation is described by a stringaiof length two and a stringbiof length one. No two ofqpossible operations have the same stringai.When Limak has a stringshe can perform thei-th operation onsif the first two letters ofsmatch a two-letter stringai. Performing thei-th operation removes first two letters ofsand inserts there a stringbi. See the notes section for further clarification.You may note that performing an operation decreases the length of a stringsexactly by1. Also, for some sets of operations there may be a string that cannot be compressed any further, because the first two letters don't match anyai.Limak wants to start with a string of lengthnand performn- 1operations to finally get a one-letter string \"a\". In how many ways can he choose the starting string to be able to get \"a\"? Remember that Limak can use only letters he knows.InputThe first line contains two integersnandq(2 ≤n≤ 6,1 ≤q≤ 36) — the length of the initial string and the number of available operations.The nextqlines describe the possible operations. Thei-th of them contains two stringsaiandbi(|ai| = 2, |bi| = 1). It's guaranteed thatai≠ajfori≠jand that allaiandbiconsist of only first six lowercase English letters.OutputPrint the number of strings of lengthnthat Limak will be able to transform to string \"a\" by applying only operations given in the input.ExamplesInput3 5ab acc cca aee cff dOutput4Input2 8af edc dcc fbc bda beb abb bff cOutput1Input6 2bb aba aOutput0NoteIn the first sample, we count initial strings of length3from which Limak can get a required string \"a\". There are4such strings: \"abb\", \"cab\", \"cca\", \"eea\". The first one Limak can compress using operation1two times (changing \"ab\" to a single \"a\"). The first operation would change \"abb\" to \"ab\" and the second operation would change \"ab\" to \"a\".Other three strings may be compressed as follows:\"cab\"\"ab\"\"a\"\"cca\"\"ca\"\"a\"\"eea\"\"ca\"\"a\"In the second sample, the only correct initial string is \"eb\" because it can be immediately compressed to \"a\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "62115f68", "template_md5": "465699a0", "result": "You are given a set of rules for transforming a string. Each rule has a two-letter pattern and a one-letter replacement.  You need to find how many strings of a specific length can be transformed into a single letter \"a\" using these rules."}, {"prompt_md5": "e566beed", "template_md5": "35d339e4", "result": "You are given a set of operations. Each operation is defined by a two-letter string ($a_i$) and a one-letter string ($b_i$).  \n\nYou can apply these operations to a string. To apply the $i$-th operation, the string must start with the two-letter string $a_i$.  Applying the operation removes the first two letters of the string and replaces them with the one-letter string $b_i$.\n\nGiven a target string length ($n$) and a set of operations, find the number of strings of length $n$ that can be transformed into the string \"a\" by applying the given operations."}]}