{"uid": "653-C", "url": "https://codeforces.com/contest/653/problem/C", "tags": ["brute force", " implementation"], "title": "653-C", "statement": "C. Bear and Up-Downtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe life goes up and down, just like nice sequences. Sequencet1,t2, ...,tnis calledniceif the following two conditions are satisfied:ti<ti+ 1for each oddi<n;ti>ti+ 1for each eveni<n.For example, sequences(2, 8),(1, 5, 1)and(2, 5, 1, 100, 99, 120)are nice, while(1, 1),(1, 2, 3)and(2, 5, 3, 2)are not.Bear Limak has a sequence of positive integerst1,t2, ...,tn. This sequenceis not nicenow and Limak wants to fix it by a single swap. He is going to choose two indicesi<jand swap elementstiandtjin order to get a nice sequence. Count the number of ways to do so. Two ways are considered different if indices of elements chosen for a swap are different.InputThe first line of the input contains one integern(2 ≤n≤ 150 000) — the length of the sequence.The second line containsnintegerst1,t2, ...,tn(1 ≤ti≤ 150 000) — the initial sequence. It's guaranteed that the given sequence is not nice.OutputPrint the number of ways to swap two elements exactly once in order to get a nice sequence.ExamplesInput52 8 4 7 7Output2Input4200 150 100 50Output1Input103 2 1 4 1 4 1 4 1 4Output8Input91 2 3 4 5 6 7 8 9Output0NoteIn the first sample, there are two ways to get a nice sequence with one swap:Swapt2= 8witht4= 7.Swapt1= 2witht5= 7.In the second sample, there is only one way — Limak should swapt1= 200witht4= 50.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0b7e5c41", "template_md5": "35d339e4", "result": "You are given a sequence of positive integers $t_1, t_2, ..., t_n$.  A sequence is considered \"nice\" if the following conditions are met:\n\n*  $t_i < t_{i+1}$ for all odd $i < n$\n*  $t_i > t_{i+1}$ for all even $i < n$\n\nYou can perform one swap of two elements in the sequence.  Find the number of ways to swap two elements so that the resulting sequence is \"nice\"."}, {"prompt_md5": "c142977f", "template_md5": "465699a0", "result": "You are given a sequence of numbers.  You can swap any two numbers in the sequence exactly once.  Determine how many ways you can swap the numbers to make the sequence follow a specific pattern:  odd-indexed numbers must be increasing, and even-indexed numbers must be decreasing."}]}