{"uid": "656-G", "url": "https://codeforces.com/contest/656/problem/G", "tags": ["*special"], "title": "656-G", "statement": "G. You're a Professionaltime limit per test2 secondsmemory limit per test64 megabytesinputstandard inputoutputstandard outputA simple recommendation system would recommend a user things liked by a certain number of their friends. In this problem you will implement part of such a system.You are given user's friends' opinions about a list of items. You are also given a thresholdT— the minimal number of \"likes\" necessary for an item to be recommended to the user.Output the number of items in the list liked by at leastTof user's friends.InputThe first line of the input will contain three space-separated integers: the number of friendsF(1 ≤F≤ 10), the number of itemsI(1 ≤I≤ 10) and the thresholdT(1 ≤T≤F).The followingFlines of input contain user's friends' opinions.j-th character ofi-th line is 'Y' ifi-th friend likesj-th item, and 'N' otherwise.OutputOutput an integer — the number of items liked by at leastTof user's friends.ExamplesInput3 3 2YYYNNNYNYOutput2Input4 4 1NNNYNNYNNYNNYNNNOutput4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2a1e8463", "template_md5": "35d339e4", "result": "You are given a list of items and information about how many of a user's friends like each item.  You also have a minimum threshold, $T$.  \n\nOutput the number of items on the list that are liked by at least $T$ of the user's friends. \n\n\n**Input:**\n\n* The first line contains three numbers: the number of friends ($F$), the number of items ($I$), and the threshold ($T$).\n* The next $F$ lines each describe the likes of one friend. Each character in a line represents an item, with 'Y' meaning the friend likes the item and 'N' meaning they don't.\n\n**Output:**\n\n* A single number representing the count of items liked by at least $T$ friends."}, {"prompt_md5": "4d6fdc77", "template_md5": "465699a0", "result": "You are given a list of items and a list of people's opinions on those items.  You also have a minimum number of \"likes\" required for an item to be recommended. Count how many items have at least that many \"likes\"."}]}