{"uid": "656-B", "url": "https://codeforces.com/contest/656/problem/B", "tags": ["*special", " implementation"], "title": "656-B", "statement": "B. Scrambledtime limit per test2 secondsmemory limit per test64 megabytesinputstandard inputoutputstandard outputBtoh yuo adn yuor roomatme lhoate wianshg disehs, btu stlil sdmoeboy msut peorrfm tihs cohre dialy. Oen dya yuo decdie to idourtcne smoe syestm. Yuor rmmotaoe sstgegus teh fooniwllg dael. Yuo argee on tow arayrs of ientgres M adn R, nmebur upmicnog dyas (induiclng teh cunrret oen) wtih sicsescuve irnegets (teh ceurrnt dya is zreo), adn yuo wsah teh diehss on dya D if adn olny if terhe etsixs an iednx i scuh tahtDmodM[i] =R[i], otwsehrie yuor rmootmae deos it. Yuo lkie teh cncepot, btu yuor rmotaome's cuinnng simle meaks yuo ssecupt sthnoemig, so yuo itennd to vefriy teh fnerisas of teh aemnrgeet.Yuo aer geivn ayarrs M adn R. Cuaclatle teh pceanregte of dyas on wchih yuo edn up dnoig teh wisahng. Amsuse taht yuo hvae iiiftlneny mnay dyas aehad of yuo.InputThe first line of input contains a single integer N (1 ≤N≤ 16).The second and third lines of input contain N integers each, all between 0 and 16, inclusive, and represent arrays M and R, respectively. AllM[i]are positive, for eachiR[i] <M[i].OutputOutput a single real number. The answer is considered to be correct if its absolute or relative error does not exceed10- 4.ExamplesInput120Output0.500000Input22 31 0Output0.666667", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "95f0699d", "template_md5": "35d339e4", "result": "You are given two arrays, $M$ and $R$, both of size $N$.  \n\n* Each element in $M$ is a positive integer.\n* Each element in $R$ is an integer less than the corresponding element in $M$.\n\nYou need to determine the percentage of days from 0 to $N-1$ (inclusive) on which you will be responsible for doing the dishes. \n\nYou are responsible for doing the dishes on day $D$ if and only if there exists an index $i$ such that $D \\mod M[i] = R[i]$. Otherwise, your roommate does the dishes. \n\nCalculate the percentage of days you will be doing the dishes."}, {"prompt_md5": "9e00cf0d", "template_md5": "465699a0", "result": "You have two lists of numbers, M and R.  You need to determine the percentage of days where you can perform a task based on the following rule:\n\n* On a given day D, you can perform the task if there is an index i such that M[i] = R[i].\n\nYou are given the lists M and R. Calculate the percentage of days you can perform the task."}]}