{"uid": "659-A", "url": "https://codeforces.com/contest/659/problem/A", "tags": ["implementation", " math"], "title": "659-A", "statement": "A. Round Housetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya lives in a round building, whose entrances are numbered sequentially by integers from1ton. Entrancenand entrance1are adjacent.Today Vasya got bored and decided to take a walk in the yard. Vasya lives in entranceaand he decided that during his walk he will move around the housebentrances in the direction of increasing numbers (in this order entrancenshould be followed by entrance1). The negative value ofbcorresponds to moving|b|entrances in the order of decreasing numbers (in this order entrance1is followed by entrancen). Ifb= 0, then Vasya prefers to walk beside his entrance.Illustration forn= 6,a= 2,b=  - 5.Help Vasya to determine the number of the entrance, near which he will be at the end of his walk.InputThe single line of the input contains three space-separated integersn,aandb(1 ≤n≤ 100, 1 ≤a≤n,  - 100 ≤b≤ 100) — the number of entrances at Vasya's place, the number of his entrance and the length of his walk, respectively.OutputPrint a single integerk(1 ≤k≤n) — the number of the entrance where Vasya will be at the end of his walk.ExamplesInput6 2 -5Output3Input5 1 3Output4Input3 2 7Output3NoteThe first example is illustrated by the picture in the statements.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6a1f2c1c", "template_md5": "35d339e4", "result": "There are $n$ entrances in a round building.  Entrance $1$ is adjacent to entrance $n$.  You start at entrance $a$. You walk $b$ entrances. If $b$ is positive, you walk in the direction of increasing numbers. If $b$ is negative, you walk in the direction of decreasing numbers.  \n\nGiven $n$, $a$, and $b$, find the number of the entrance you will be at after your walk."}, {"prompt_md5": "656a7385", "template_md5": "465699a0", "result": "You are given a number of locations arranged in a circle.  You start at a specific location and move a certain number of locations forward or backward. Determine the location you will end up at."}]}