{"uid": "660-F", "url": "https://codeforces.com/contest/660/problem/F", "tags": ["binary search", " data structures", " divide and conquer", " geometry", " ternary search"], "title": "660-F", "statement": "F. Bear and Bowling 4time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLimak is an old brown bear. He often goes bowling with his friends. Today he feels really good and tries to beat his own record!For rolling a ball one gets a score — an integer (maybe negative) number of points. Score for thei-th roll is multiplied byiand scores are summed up. So, forkrolls with scoress1,s2, ...,sk, the total score is. The total score is0if there were no rolls.Limak madenrolls and got scoreaifor thei-th of them. He wants to maximize his total score and he came up with an interesting idea. He can say that some first rolls were only a warm-up, and that he wasn't focused during the last rolls. More formally, he can cancel any prefix and any suffix of the sequencea1,a2, ...,an. It is allowed to cancel all rolls, or to cancel none of them.The total score is calculated as if there were only non-canceled rolls. So, the first non-canceled roll has score multiplied by1, the second one has score multiplied by2, and so on, till the last non-canceled roll.What maximum total score can Limak get?InputThe first line contains a single integern(1 ≤n≤ 2·105) — the total number of rolls made by Limak.The second line containsnintegersa1,a2, ...,an(|ai| ≤ 107)— scores for Limak's rolls.OutputPrint the maximum possible total score after cancelling rolls.ExamplesInput65 -1000 1 -3 7 -8Output16Input51000 1000 1001 1000 1000Output15003Input3-60 -70 -80Output0NoteIn the first sample test, Limak should cancel the first two rolls, and one last roll. He will be left with rolls1,  - 3, 7what gives him the total score1·1 + 2·( - 3) + 3·7 = 1 - 6 + 21 = 16.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3fd565c3", "template_md5": "35d339e4", "result": "You are given a sequence of integers, representing the scores of $n$ bowling rolls.  The total score for the sequence is calculated as follows:\n\n* The score of the $i$-th roll is multiplied by $i$.\n* The scores of all rolls are added together.\n\nYou can choose to remove any prefix and any suffix of the sequence.  The remaining rolls are then used to calculate the total score.\n\nWhat is the maximum possible total score you can achieve?"}, {"prompt_md5": "b89c2a3a", "template_md5": "465699a0", "result": "You are given a list of numbers.  You can remove any number of numbers from the beginning and end of the list.  The score is calculated by multiplying each remaining number by its position in the list and adding the results. What is the highest possible score you can achieve?"}]}