{"uid": "660-A", "url": "https://codeforces.com/contest/660/problem/A", "tags": ["greedy", " implementation", " math", " number theory"], "title": "660-A", "statement": "A. Co-prime Arraytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array ofnelements, you must make it a co-prime array in as few moves as possible.In each move you can insert any positive integral number you want not greater than109in any place in the array.An array is co-prime if any two adjacent numbers of it are co-prime.In the number theory, two integersaandbare said to be co-prime if the only positive integer that divides both of them is1.InputThe first line contains integern(1 ≤n≤ 1000) — the number of elements in the given array.The second line containsnintegersai(1 ≤ai≤ 109) — the elements of the arraya.OutputPrint integerkon the first line — the least number of elements needed to add to the arrayato make it co-prime.The second line should containn+kintegersaj— the elements of the arrayaafter addingkelements to it. Note that the new array should be co-prime, so any two adjacent values should be co-prime. Also the new array should be got from the original arrayaby addingkelements to it.If there are multiple answers you can print any one of them.ExampleInput32 7 28Output12 7 9 28", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cc803b1a", "template_md5": "35d339e4", "result": "You are given an array of $n$ numbers.  You can add any positive integer less than or equal to $10^9$ to the array at any position.  The goal is to find the minimum number of additions needed to make the array co-prime.  An array is co-prime if no two adjacent numbers share any common divisors other than 1.\n\nOutput the minimum number of additions and the resulting co-prime array."}, {"prompt_md5": "e32b1026", "template_md5": "465699a0", "result": "You are given a list of numbers. You can add any number less than or equal to 10^9 to the list. The goal is to make the list so that no two adjacent numbers share any common divisors other than 1.  Output the minimum number of additions needed and the resulting list."}]}