{"uid": "662-D", "url": "https://codeforces.com/contest/662/problem/D", "tags": ["constructive algorithms", " greedy", " implementation", " math"], "title": "662-D", "statement": "D. International Olympiadtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputInternational Abbreviation Olympiad takes place annually starting from 1989. Each year the competition receives an abbreviation of formIAO'y, whereystands for some number of consequent last digits of the current year. Organizers always pick an abbreviation with non-empty stringythat has never been used before. Among all such valid abbreviations they choose the shortest one and announce it to be the abbreviation of this year's competition.For example, the first three Olympiads (years 1989, 1990 and 1991, respectively) received the abbreviationsIAO'9,IAO'0andIAO'1, while the competition in 2015 received an abbreviationIAO'15, asIAO'5has been already used in 1995.You are given a list of abbreviations. For each of them determine the year it stands for.InputThe first line of the input contains a single integern(1 ≤n≤ 1000) — the number of abbreviations to process.Thennlines follow, each containing a single abbreviation. It's guaranteed that each abbreviation contains at most nine digits.OutputFor each abbreviation given in the input, find the year of the corresponding Olympiad.ExamplesInput5IAO'15IAO'2015IAO'1IAO'9IAO'0Output201512015199119891990Input4IAO'9IAO'99IAO'999IAO'9999Output1989199929999999", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "de6b28a3", "template_md5": "35d339e4", "result": "You are given a list of abbreviations in the format \"IAO'yy\" where 'yy' represents the last two digits of a year.  \n\nDetermine the year each abbreviation corresponds to, given that:\n\n* The International Abbreviation Olympiad takes place annually starting in 1989.\n* Each year's abbreviation uses a unique, non-empty string 'yy'.\n* The organizers choose the shortest valid abbreviation. \n\n\n\nFor example:\n\n* IAO'15 represents the year 2015.\n* IAO'09 represents the year 1989."}, {"prompt_md5": "0dcd09b2", "template_md5": "465699a0", "result": "Given a list of abbreviations in the format \"IAOyy\" where yy represents the last two digits of a year, determine the corresponding year for each abbreviation.  Abbreviations can only be used once and the shortest valid abbreviation is chosen each year."}]}