{"uid": "666-B", "url": "https://codeforces.com/contest/666/problem/B", "tags": ["graphs", " shortest paths"], "title": "666-B", "statement": "B. World Tourtime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputA famous sculptor Cicasso goes to a world tour!Well, it is not actually a world-wide. But not everyone should have the opportunity to see works of sculptor, shouldn't he? Otherwise there will be no any exclusivity. So Cicasso will entirely hold the world tour in his native country — Berland.Cicasso is very devoted to his work and he wants to be distracted as little as possible. Therefore he will visit only four cities. These cities will be different, so no one could think that he has \"favourites\". Of course, to save money, he will chose the shortest paths between these cities. But as you have probably guessed, Cicasso is a weird person. Although he doesn't like to organize exhibitions, he likes to travel around the country and enjoy its scenery. So he wants the total distance which he will travel to be as large as possible. However, the sculptor is bad in planning, so he asks you for help.There arencities andmone-way roads in Berland. You have to choose four different cities, which Cicasso will visit and also determine the order in which he will visit them. So that the total distance he will travel, if he visits cities in your order, starting from the first city in your list, and ending in the last, choosing each time the shortest route between a pair of cities — will be the largest.Note that intermediate routes may pass through the cities, which are assigned to the tour, as well as pass twice through the same city. For example, the tour can look like that:. Four cities in the order of visiting marked as overlines:[1, 5, 2, 4].Note that Berland is a high-tech country. So using nanotechnologies all roads were altered so that they have the same length. For the same reason moving using regular cars is not very popular in the country, and it can happen that there are such pairs of cities, one of which generally can not be reached by car from the other one. However, Cicasso is very conservative and cannot travel without the car. Choose cities so that the sculptor can make the tour using only the automobile. It is guaranteed that it is always possible to do.InputIn the first line there is a pair of integersnandm(4 ≤n≤ 3000, 3 ≤m≤ 5000) — a number of cities and one-way roads in Berland.Each of the nextmlines contains a pair of integersui,vi(1 ≤ui,vi≤n) — a one-way road from the cityuito the cityvi. Note thatuiandviare not required to be distinct. Moreover, it can be several one-way roads between the same pair of cities.OutputPrint four integers — numbers of cities which Cicasso will visit according to optimal choice of the route. Numbers of cities should be printed in the order that Cicasso will visit them. If there are multiple solutions, print any of them.ExampleInput8 91 22 33 44 14 55 66 77 88 5Output2 1 8 7NoteLetd(x,y)be the shortest distance between citiesxandy. Then in the exampled(2, 1) = 3,d(1, 8) = 7,d(8, 7) = 3. The total distance equals13.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "28a2a648", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ one-way roads in Berland. Each road connects two cities. You need to choose 4 different cities and find the order to visit them to maximize the total distance traveled.  \n\nThe distance between any two cities is the same.  \n\nYou can visit a city multiple times and roads can be used in both directions.\n\nOutput the 4 cities in the order they should be visited."}, {"prompt_md5": "bf463570", "template_md5": "465699a0", "result": "Given a list of cities and one-way roads between them, find four distinct cities to visit in a specific order that maximizes the total distance traveled.  Roads have equal length."}]}