{"uid": "667-A", "url": "https://codeforces.com/contest/667/problem/A", "tags": ["geometry", " math"], "title": "667-A", "statement": "A. Pouring Raintime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA lot of people in Berland hates rain, but you do not. Rain pacifies, puts your thoughts in order. By these years you have developed a good tradition — when it rains, you go on the street and stay silent for a moment, contemplate all around you, enjoy freshness, think about big deeds you have to do.Today everything had changed quietly. You went on the street with a cup contained water, your favorite drink. In a moment when you were drinking a water you noticed that the process became quite long: the cup still contained water because of rain. You decided to make a formal model of what was happening and to find if it was possible to drink all water in that situation.Thus, your cup is a cylinder with diameter equalsdcentimeters. Initial level of water in cup equalshcentimeters from the bottom.You drink a water with a speed equalsvmilliliters per second. But rain goes with such speed that if you do not drink a water from the cup, the level of water increases onecentimeters per second. The process of drinking water from the cup and the addition of rain to the cup goes evenly and continuously.Find the time needed to make the cup empty or find that it will never happen. It is guaranteed that if it is possible to drink all water, it will happen not later than after104seconds.Note one milliliter equals to one cubic centimeter.InputThe only line of the input contains four integer numbersd,h,v,e(1 ≤d,h,v,e≤ 104), where:d— the diameter of your cylindrical cup,h— the initial level of water in the cup,v— the speed of drinking process from the cup in milliliters per second,e— the growth of water because of rain if you do not drink from the cup.OutputIf it is impossible to make the cup empty, print \"NO\" (without quotes).Otherwise print \"YES\" (without quotes) in the first line. In the second line print a real number — time in seconds needed the cup will be empty. The answer will be considered correct if its relative or absolute error doesn't exceed10- 4. It is guaranteed that if the answer exists, it doesn't exceed104.ExamplesInput1 2 3 100OutputNOInput1 1 1 1OutputYES3.659792366325NoteIn the first example the water fills the cup faster than you can drink from it.In the second example area of the cup's bottom equals to, thus we can conclude that you decrease the level of water bycentimeters per second. At the same time water level increases by1centimeter per second due to rain. Thus, cup will be empty inseconds.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c1bf8774", "template_md5": "35d339e4", "result": "You have a cylindrical cup with a diameter of $d$ centimeters and an initial water level of $h$ centimeters. You drink water from the cup at a rate of $v$ milliliters per second. Rain fills the cup at a rate of $e$ centimeters per second. \n\nDetermine the time it takes to empty the cup, or if it's impossible to empty the cup. \n\nAssume that 1 milliliter equals 1 cubic centimeter.  It is guaranteed that if the cup can be emptied, it will happen within 10^4 seconds."}, {"prompt_md5": "43248778", "template_md5": "465699a0", "result": "You have a cylindrical cup with a certain diameter and initial water level. You drink water from the cup at a constant rate, while rain simultaneously fills the cup at a constant rate. Determine if you can completely empty the cup and, if so, the time it takes."}]}