{"uid": "67-A", "url": "https://codeforces.com/contest/67/problem/A", "tags": ["dp", " graphs", " greedy", " implementation"], "title": "67-A", "statement": "A. Partial Teachertime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutA teacher decides to give toffees to his students. He asksnstudents to stand in a queue. Since the teacher is very partial, he follows the following rule to distribute toffees.He looks at the first two students and gives more toffees to the student having higher marks than the other one. If they have the same marks they get the same number of toffees. The same procedure is followed for each pair of adjacent students starting from the first one to the last one.It is given that each student receives at least one toffee. You have to find the number of toffees given to each student by the teacher such that the total number of toffees is minimum.InputThe first line of input contains the number of studentsn(2 ≤n≤ 1000). The second line gives (n- 1) characters consisting of \"L\", \"R\" and \"=\". For each pair of adjacent students \"L\" means that the left student has higher marks, \"R\" means that the right student has higher marks and \"=\" means that both have equal marks.OutputOutput consists ofnintegers separated by a space representing the number of toffees each student receives in the queue starting from the first one to the last one.ExamplesInput5LRLROutput2 1 2 1 2Input5=RRROutput1 1 2 3 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a5d50abd", "template_md5": "35d339e4", "result": "There are $n$ students lined up.  We know the relative marks of each pair of adjacent students:\n\n* \"L\" means the left student has higher marks.\n* \"R\" means the right student has higher marks.\n* \"=\" means both students have the same marks.\n\nThe teacher gives out toffees to each student, following these rules:\n\n* Each student gets at least one toffee.\n* For each pair of adjacent students, the student with the higher marks gets more toffees.\n\nFind the minimum total number of toffees needed to satisfy these rules, and list how many toffees each student receives."}, {"prompt_md5": "fc0a233e", "template_md5": "465699a0", "result": "You are given a line of people.  Each person has a score.  You need to give each person a number of candies, with the following rules:\n\n*  The person with the higher score gets more candies than the person next to them.\n*  If the scores are equal, they get the same number of candies.\n*  Each person gets at least one candy.\n\nFind the minimum total number of candies needed to satisfy these rules."}]}