{"uid": "671-D", "url": "https://codeforces.com/contest/671/problem/D", "tags": ["data structures", " dp", " greedy"], "title": "671-D", "statement": "D. Roads in Yuslandtime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMayor of Yusland just won the lottery and decided to spent money on something good for town. For example, repair all the roads in the town.Yusland consists ofnintersections connected byn- 1bidirectional roads. One can travel from any intersection to any other intersection using only these roads.There is only one road repairing company in town, named \"RC company\". Company's center is located at the intersection1. RC company doesn't repair roads you tell them. Instead, they have workers at some intersections, who can repair only some specific paths. Thei-th worker can be paidcicoins and then he repairsall roadson a path fromuito somevithatlies on the pathfromuito intersection1.Mayor asks you to choose the cheapest way to hire some subset of workers in order to repair all the roads in Yusland. It's allowed that some roads will be repaired more than once.If it's impossible to repair all roads print- 1.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 300 000) — the number of cities in Yusland and the number of workers respectively.Then follown−1line, each of them contains two integersxiandyi(1 ≤xi,yi≤n) — indices of intersections connected by thei-th road.Lastmlines provide the description of workers, each line containing three integersui,viandci(1 ≤ui,vi≤n,1 ≤ci≤ 109). This means that thei-th worker can repair all roads on the path fromvitouiforcicoins. It's guaranteed thatvilies on the path fromuito1. Note thatvianduimay coincide.OutputIf it's impossible to repair all roads then print- 1. Otherwise print a single integer — minimum cost required to repair all roads using \"RC company\" workers.ExampleInput6 51 21 33 44 54 62 1 23 1 44 1 35 3 16 3 2Output8NoteIn the first sample, we should choose workers with indices1,3,4and5, some roads will be repaired more than once but it is OK. The cost will be equal to2 + 3 + 1 + 2 = 8coins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2c74333a", "template_md5": "35d339e4", "result": "There are $n$ cities connected by $n-1$ roads.  Each road connects two cities.  There is a company with $m$ workers. Each worker can repair all roads between two cities for a certain cost.  The $i$-th worker can repair all roads between city $u_i$ and city $v_i$ for $c_i$ coins.  City 1 is the company's headquarters.\n\nFind the cheapest way to hire some workers so that all roads are repaired.  It is okay if some roads are repaired more than once. If it is impossible to repair all roads, output -1. Otherwise, output the minimum cost."}, {"prompt_md5": "c1bdbfdb", "template_md5": "465699a0", "result": "You have a network of cities connected by roads.  There are workers who can repair roads between specific pairs of cities for a given cost.  Find the cheapest way to hire workers so that all roads in the network are repaired.  If it's impossible to repair all roads, say so."}]}