{"uid": "671-C", "url": "https://codeforces.com/contest/671/problem/C", "tags": ["data structures", " number theory"], "title": "671-C", "statement": "C. Ultimate Weirdness of an Arraytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYasin has an arrayacontainingnintegers. Yasin is a 5 year old, so he loves ultimate weird things.Yasin denotesweirdnessof an array as maximumgcd(ai,aj)value among all1 ≤i<j≤n. Forn≤ 1weirdness is equal to0,gcd(x,y)is the greatest common divisor of integersxandy.He also defines theultimate weirdnessof an array. Ultimate weirdness iswheref(i,j)is weirdness of the new arrayaobtained by removing all elements betweeniandjinclusive, so new array is[a1...ai- 1,aj+ 1...an].Since 5 year old boys can't code, Yasin asks for your help to find the value of ultimate weirdness of the given arraya!InputThe first line of the input contains a single integern(1 ≤n≤ 200 000) — the number of elements ina.The next line containsnintegersai(1 ≤ai≤ 200 000), where thei-th number is equal to thei-th element of the arraya. It is guaranteed that allaiare distinct.OutputPrint a single line containing the value of ultimate weirdness of the arraya.ExampleInput32 6 3Output6NoteConsider the first sample.f(1,  1)is equal to3.f(2,  2)is equal to1.f(3,  3)is equal to2.f(1,  2),f(1,  3)andf(2,  3)are equal to0.Thus the answer is3 + 0 + 0 + 1 + 0 + 2 = 6.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f0162394", "template_md5": "35d339e4", "result": "You are given an array of $n$ distinct integers.  The \"weirdness\" of a subarray is the largest greatest common divisor ($gcd$) of any two elements in that subarray.  \n\nThe \"ultimate weirdness\" of the array is the sum of the weirdness values of all possible subarrays you can create by removing elements from the original array.  \n\nFor example, if the array is $[2, 6, 3]$, the ultimate weirdness is calculated as follows:\n\n* Weirdness of the whole array: $gcd(2,6,3) = 1$\n* Weirdness of $[2, 6]$: $gcd(2,6) = 2$\n* Weirdness of $[2, 3]$: $gcd(2,3) = 1$\n* Weirdness of $[6, 3]$: $gcd(6,3) = 3$\n* Weirdness of $[2]$: $gcd(2) = 2$\n* Weirdness of $[6]$: $gcd(6) = 6$\n* Weirdness of $[3]$: $gcd(3) = 3$\n\nUltimate weirdness = $1 + 2 + 1 + 3 + 2 + 6 + 3 = 18$\n\nFind the ultimate weirdness of the given array."}, {"prompt_md5": "45914032", "template_md5": "465699a0", "result": "You are given a list of numbers.  Find the maximum value you can get by repeatedly removing a section of the list and finding the largest common divisor of the remaining numbers."}]}