{"uid": "671-B", "url": "https://codeforces.com/contest/671/problem/B", "tags": ["binary search", " greedy"], "title": "671-B", "statement": "B. Robin Hoodtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWe all know the impressive story of Robin Hood. Robin Hood uses his archery skills and his wits to steal the money from rich, and return it to the poor.There arencitizens in Kekoland, each person hascicoins. Each day, Robin Hood will take exactly1coin from the richest person in the city and he will give it to the poorest person (poorest person right after taking richest's1coin). In case the choice is not unique, he will select one among them at random. Sadly, Robin Hood is old and want to retire inkdays. He decided to spend these last days with helping poor people.After taking his money are taken by Robin Hood richest person may become poorest person as well, and it might even happen that Robin Hood will give his money back. For example if all people have same number of coins, then next day they will have same number of coins too.Your task is to find the difference between richest and poorest persons wealth afterkdays. Note that the choosing at random among richest and poorest doesn't affect the answer.InputThe first line of the input contains two integersnandk(1 ≤n≤ 500 000, 0 ≤k≤ 109) — the number of citizens in Kekoland and the number of days left till Robin Hood's retirement.The second line containsnintegers, thei-th of them isci(1 ≤ci≤ 109) — initial wealth of thei-th person.OutputPrint a single line containing the difference between richest and poorest peoples wealth.ExamplesInput4 11 1 4 2Output2Input3 12 2 2Output0NoteLets look at how wealth changes through day in the first sample.[1, 1, 4, 2][2, 1, 3, 2]or[1, 2, 3, 2]So the answer is3 - 1 = 2In second sample wealth will remain the same for each person.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0a391293", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, where each integer represents the wealth of a person.  \n\nYou need to simulate a process that happens for $k$ days.  Each day, the richest person loses 1 coin, and the poorest person gains 1 coin. If there are multiple people with the same highest or lowest wealth, choose one of them randomly.\n\nAfter $k$ days, find the difference between the wealth of the richest person and the poorest person."}, {"prompt_md5": "d040f57c", "template_md5": "465699a0", "result": "You are given a list of integers representing the wealth of people. Each day, the richest person loses one unit of wealth, which is given to the poorest person.  Find the difference between the richest and poorest person's wealth after a given number of days."}]}