{"uid": "672-B", "url": "https://codeforces.com/contest/672/problem/B", "tags": ["constructive algorithms", " implementation", " strings"], "title": "672-B", "statement": "B. Different is Goodtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA wise man told Kerem \"Different is good\" once, so Kerem wants all things in his life to be different.Kerem recently got a stringsconsisting of lowercase English letters. Since Kerem likes it when things are different, he wants allsubstringsof his stringsto be distinct. Substring is a string formed by some number of consecutive characters of the string. For example, string \"aba\" has substrings \"\" (empty substring), \"a\", \"b\", \"a\", \"ab\", \"ba\", \"aba\".If stringshas at least two equal substrings then Kerem will change characters at some positions to some other lowercase English letters. Changing characters is a very tiring job, so Kerem want to perform as few changes as possible.Your task is to find the minimum number of changes needed to make all the substrings of the given string distinct, or determine that it is impossible.InputThe first line of the input contains an integern(1 ≤n≤ 100 000) — the length of the strings.The second line contains the stringsof lengthnconsisting of only lowercase English letters.OutputIf it's impossible to change the stringssuch that all its substring are distinct print-1. Otherwise print the minimum required number of changes.ExamplesInput2aaOutput1Input4kokoOutput2Input5muratOutput0NoteIn the first sample one of the possible solutions is to change the first character to 'b'.In the second sample, one may change the first character to 'a' and second character to 'b', so the string becomes \"abko\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "38ecce41", "template_md5": "35d339e4", "result": "You are given a string of lowercase English letters.  You want to change some characters in the string so that all of its substrings are unique.  A substring is a sequence of consecutive characters within the string. \n\nFind the minimum number of character changes needed to make all substrings unique. If it's impossible to make all substrings unique, output -1."}, {"prompt_md5": "a89ed431", "template_md5": "465699a0", "result": "You are given a string.  Find the fewest changes needed to make sure every possible combination of letters within the string is unique. If it's impossible to make all combinations unique, output -1."}]}