{"uid": "673-A", "url": "https://codeforces.com/contest/673/problem/A", "tags": ["implementation"], "title": "673-A", "statement": "A. Bear and Gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBear Limak likes watching sports on TV. He is going to watch a game today. The game lasts90minutes and there are no breaks.Each minute can be either interesting or boring. If15consecutive minutes are boring then Limak immediately turns TV off.You know that there will beninteresting minutest1,t2, ...,tn. Your task is to calculate for how many minutes Limak will watch the game.InputThe first line of the input contains one integern(1 ≤n≤ 90) — the number of interesting minutes.The second line containsnintegerst1,t2, ...,tn(1 ≤t1<t2< ...tn≤ 90), given in the increasing order.OutputPrint the number of minutes Limak will watch the game.ExamplesInput37 20 88Output35Input916 20 30 40 50 60 70 80 90Output15Input915 20 30 40 50 60 70 80 90Output90NoteIn the first sample, minutes21, 22, ..., 35are all boring and thus Limak will turn TV off immediately after the35-th minute. So, he would watch the game for35minutes.In the second sample, the first15minutes are boring.In the third sample, there are no consecutive15boring minutes. So, Limak will watch the whole game.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6b7b2542", "template_md5": "35d339e4", "result": "A game lasts 90 minutes and can have either interesting or boring minutes. If 15 consecutive minutes are boring, the viewer stops watching. You are given a list of $n$ interesting minutes ($1 \\le n \\le 90$)  in increasing order.  Determine how many minutes the viewer will watch the game."}, {"prompt_md5": "f86446e8", "template_md5": "465699a0", "result": "A game lasts 90 minutes. There are a given number of interesting minutes spread throughout the game. If 15 consecutive minutes are not interesting, the game is stopped.  Determine how many minutes the game will be watched."}]}