{"uid": "675-C", "url": "https://codeforces.com/contest/675/problem/C", "tags": ["constructive algorithms", " data structures", " greedy", " sortings"], "title": "675-C", "statement": "C. Money Transferstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arenbanks in the city where Vasya lives, they are located in a circle, such that any two banks are neighbouring if their indices differ by no more than1. Also, bank1and banknare neighbours ifn> 1. No bank is a neighbour of itself.Vasya has an account in each bank. Its balance may be negative, meaning Vasya owes some money to this bank.There is only one type of operations available: transfer some amount of money from any bank to account in anyneighbouringbank. There are no restrictions on the size of the sum being transferred or balance requirements to perform this operation.Vasya doesn't like to deal with large numbers, so he asks you to determine the minimum number of operations required to change the balance of each bank account to zero. It's guaranteed, that this is possible to achieve, that is, the total balance of Vasya in all banks is equal to zero.InputThe first line of the input contains a single integern(1 ≤n≤ 100 000) — the number of banks.The second line containsnintegersai(- 109≤ai≤ 109), thei-th of them is equal to the initial balance of the account in thei-th bank. It's guaranteed that the sum of allaiis equal to0.OutputPrint the minimum number of operations required to change balance in each bank to zero.ExamplesInput35 0 -5Output1Input4-1 0 1 0Output2Input41 2 3 -6Output3NoteIn the first sample, Vasya may transfer5from the first bank to the third.In the second sample, Vasya may first transfer1from the third bank to the second, and then1from the second to the first.In the third sample, the following sequence provides the optimal answer:transfer1from the first bank to the second bank;transfer3from the second bank to the third;transfer6from the third bank to the fourth.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "837b9139", "template_md5": "35d339e4", "result": "There are $n$ banks arranged in a circle. Each bank has an initial balance. You can transfer money from one bank to its neighboring bank (banks are considered neighbors if their indices differ by 1).  The goal is to find the minimum number of transfers needed to make the balance of each bank zero.  The total balance across all banks is always zero. \n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100,000), the number of banks.\n* The second line contains $n$ integers, $a_1$, $a_2$, ..., $a_n$ (-10⁹ ≤ $a_i$ ≤ 10⁹), representing the initial balance of each bank.\n\nOutput:\n\n* Print the minimum number of transfers required to make all bank balances zero."}, {"prompt_md5": "73e3e6f7", "template_md5": "465699a0", "result": "You are given a list of numbers representing the balance of accounts in a circular arrangement.  Find the minimum number of transfers needed to make all the balances zero. You can transfer money between adjacent accounts. The total sum of all balances is always zero."}]}