{"uid": "675-E", "url": "https://codeforces.com/contest/675/problem/E", "tags": ["data structures", " dp", " greedy"], "title": "675-E", "statement": "E. Trains and Statistictime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya commutes by train every day. There arentrain stations in the city, and at thei-th station it's possible to buy only tickets to stations fromi+ 1toaiinclusive. No tickets are sold at the last station.Letρi,jbe the minimum number of tickets one needs to buy in order to get from stationsito stationj. As Vasya is fond of different useless statistic he asks you to compute the sum of all valuesρi,jamong all pairs1 ≤i<j≤n.InputThe first line of the input contains a single integern(2 ≤n≤ 100 000) — the number of stations.The second line containsn- 1integerai(i+ 1 ≤ai≤n), thei-th of them means that at thei-th station one may buy tickets to each station fromi+ 1toaiinclusive.OutputPrint the sum ofρi,jamong all pairs of1 ≤i<j≤n.ExamplesInput44 4 4Output6Input52 3 5 5Output17NoteIn the first sample it's possible to get from any station to any other (with greater index) using only one ticket. The total number of pairs is6, so the answer is also6.Consider the second sample:ρ1, 2= 1ρ1, 3= 2ρ1, 4= 3ρ1, 5= 3ρ2, 3= 1ρ2, 4= 2ρ2, 5= 2ρ3, 4= 1ρ3, 5= 1ρ4, 5= 1Thus the answer equals1 + 2 + 3 + 3 + 1 + 2 + 2 + 1 + 1 + 1 = 17.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "79a6d778", "template_md5": "35d339e4", "result": "There are $n$ train stations.  At station $i$, you can buy tickets to stations from $i+1$ to $a_i$ inclusive.  You cannot buy tickets at the last station.\n\nFind the sum of the minimum number of tickets needed to travel from station $i$ to station $j$ for all pairs of stations $1 \\le i < j \\le n$. \n\nInput:\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 100,000), the number of stations.\n* The second line contains $n-1$ integers $a_i$ (i+1 ≤ $a_i$ ≤ $n$), where $a_i$ represents the highest numbered station reachable from station $i$.\n\nOutput:\n\n* Print the sum of the minimum number of tickets needed to travel from station $i$ to station $j$ for all pairs of stations $1 \\le i < j \\le n$."}, {"prompt_md5": "33fe4818", "template_md5": "465699a0", "result": "You are given a list of numbers representing the possible destinations reachable from each station.  Find the total number of minimum tickets needed to travel between all unique pairs of stations."}]}