{"uid": "675-D", "url": "https://codeforces.com/contest/675/problem/D", "tags": ["data structures", " trees"], "title": "675-D", "statement": "D. Tree Constructiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDuring the programming classes Vasya was assigned a difficult problem. However, he doesn't know how to code and was unable to find the solution in the Internet, so he asks you to help.You are given a sequence $$$a$$$, consisting of $$$n$$$distinctintegers, that is used to construct the binary search tree. Below is the formal description of the construction process.First element $$$a_1$$$ becomes the root of the tree.Elements $$$a_2, a_3, \\\\ldots, a_n$$$ are added one by one. To add element $$$a_i$$$ one needs to traverse the tree starting from the root and using the following rules:The pointer to the current node is set to the root.If $$$a_i$$$ is greater than the value in the current node, then its right child becomes the current node. Otherwise, the left child of the current node becomes the new current node.If at some point there is no required child, the new node is created, it is assigned value $$$a_i$$$ and becomes the corresponding child of the current node.InputThe first line of the input contains a single integer $$$n$$$ ($$$2 \\\\leq n \\\\leq 100\\\\,000$$$) — the length of the sequence $$$a$$$.The second line contains $$$n$$$ distinct integers $$$a_i$$$ ($$$1 \\\\leq a_i \\\\leq 10^9$$$) — the sequence $$$a$$$ itself.OutputOutput $$$n - 1$$$ integers. For all $$$i > 1$$$ print the value written in the node that is the parent of the node with value $$$a_i$$$ in it.ExamplesInput31 2 3Output1 2Input54 2 3 1 6Output4 2 2 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1bc55d19", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ distinct integers.  These integers will be used to construct a binary search tree. \n\nHere's how the tree is built:\n\n1. The first integer in the sequence ($a_1$) becomes the root of the tree.\n\n2.  For each subsequent integer ($a_2$, $a_3$, ..., $a_n$):\n    * Start at the root of the tree.\n    * If the current integer ($a_i$) is greater than the value in the current node, move to the right child of that node.\n    * If the current integer ($a_i$) is less than or equal to the value in the current node, move to the left child of that node.\n    * If you reach a node with no child on the appropriate side (either left or right), create a new node with the value $a_i$ and make it the corresponding child of the current node.\n\nYour task is to output $n-1$ integers. For each integer $a_i$ (where $i > 1$), output the value of the node that is the parent of the node containing $a_i$. \n\n\n\nLet me know if you'd like help with the code!"}, {"prompt_md5": "322bdc4f", "template_md5": "465699a0", "result": "You are given a list of distinct numbers.  Build a tree where the first number is the root.  Add each subsequent number to the tree, always placing it as a child of the appropriate node based on its value (smaller values go left, larger values go right).  Output the parent of each number in the tree."}]}