{"uid": "675-B", "url": "https://codeforces.com/contest/675/problem/B", "tags": ["brute force", " constructive algorithms", " math"], "title": "675-B", "statement": "B. Restoring Paintingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya works as a watchman in the gallery. Unfortunately, one of the most expensive paintings was stolen while he was on duty. He doesn't want to be fired, so he has to quickly restore the painting. He remembers some facts about it.The painting is a square3 × 3, each cell contains a single integer from1ton, and different cells may contain either different or equal integers.The sum of integers in each of four squares2 × 2is equal to the sum of integers in the top left square2 × 2.Four elementsa,b,canddare known and are located as shown on the picture below.Help Vasya find out the number of distinct squares the satisfy all the conditions above. Note, that this number may be equal to0, meaning Vasya remembers something wrong.Two squares are considered to be different, if there exists a cell that contains two different integers in different squares.InputThe first line of the input contains five integersn,a,b,candd(1 ≤n≤ 100 000,1 ≤a,b,c,d≤n) — maximum possible value of an integer in the cell and four integers that Vasya remembers.OutputPrint one integer — the number of distinct valid squares.ExamplesInput2 1 1 1 2Output2Input3 3 1 2 3Output6NoteBelow are all the possible paintings for the first sample.In the second sample, only paintings displayed below satisfy all the rules.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f48992a7", "template_md5": "35d339e4", "result": "You are given a maximum value $n$ and four numbers $a$, $b$, $c$, and $d$.  These numbers represent the values in a $3 \\times 3$ square grid where each cell contains an integer from 1 to $n$.  You know the following:\n\n* The sum of the numbers in each $2 \\times 2$ square is equal to the sum of the numbers in the top left $2 \\times 2$ square.\n\nFind the number of unique $3 \\times 3$ squares that satisfy these conditions."}, {"prompt_md5": "5fe2b0ab", "template_md5": "465699a0", "result": "You are given a 3x3 grid of numbers.  You know the values of four specific numbers in the grid.  The sum of numbers in each 2x2 square must be equal to the sum of numbers in the top left 2x2 square.  Find how many different possible grids fit these rules."}]}