{"uid": "677-E", "url": "https://codeforces.com/contest/677/problem/E", "tags": ["binary search", " brute force", " dp", " implementation"], "title": "677-E", "statement": "E. Vanya and Balloonstime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputVanya plays a game of balloons on the field of sizen×n, where each cell contains a balloon with one of the values0,1,2or3. The goal is to destroy a cross, such that the product of all values of balloons in the cross is maximum possible. There are two types of crosses: normal and rotated. For example:**o****o**ooooo**o****o**oro***o*o*o***o***o*o*o***oFormally, the cross is given by three integersr,candd, such thatd≤r,c≤n-d+ 1. The normal cross consists of balloons located in cells(x,y)(wherexstay for the number of the row andyfor the number of the column), such that|x-r|·|y-c| = 0and|x-r| + |y-c| <d. Rotated cross consists of balloons located in cells(x,y), such that|x-r| = |y-c|and|x-r| <d.Vanya wants to know the maximum possible product of the values of balls forming one cross. As this value can be large, output it modulo109+ 7.InputThe first line of the input contains a single integern(1 ≤n≤ 1000) — the number of rows and columns in the table with balloons.The each of the followingnlines containsncharacters '0', '1', '2' or '3' — the description of the values in balloons.OutputPrint the maximum possible product modulo109+ 7. Note, that you are not asked to maximize the remainder modulo109+ 7, but to find the maximum value and print it this modulo.ExamplesInput41233021320200303Output108Input50030000300333330030000300Output19683Input50000302030003000302030000Output108Input52131210003100021000323231Output3Input51213112111121122131121212Output24NoteIn the first sample, the maximum product is achieved for a rotated cross with a center in the cell(3, 3)and radius1:2·2·3·3·3 = 108.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a0758dd5", "template_md5": "35d339e4", "result": "You are given a grid of size $n \\times n$ filled with numbers 0, 1, 2, or 3.  \n\nYou need to find the maximum product of the numbers in a cross-shaped pattern within the grid. \n\nThere are two types of crosses:\n\n* **Normal Cross:**  The cross is defined by three integers $r$, $c$, and $d$, where $d \\le r, c \\le n-d$. The cross consists of cells $(x, y)$ such that  $|x-r| \\cdot |y-c| = 0$ and $|x-r| + |y-c| < d$.\n\n* **Rotated Cross:** The cross is defined by three integers $r$, $c$, and $d$, where $d \\le r, c \\le n-d$. The cross consists of cells $(x, y)$ such that $|x-r| = |y-c|$ and $|x-r| < d$.\n\nThe maximum product you find should be outputted modulo $10^9 + 7$."}, {"prompt_md5": "77e056fc", "template_md5": "465699a0", "result": "You are given a grid of numbers. Find the largest product of numbers that can be obtained by selecting numbers that form a cross shape in the grid. The cross can be oriented in two ways: a standard cross or a rotated cross."}]}