{"uid": "677-C", "url": "https://codeforces.com/contest/677/problem/C", "tags": ["bitmasks", " combinatorics", " implementation", " strings"], "title": "677-C", "statement": "C. Vanya and Labeltime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhile walking down the street Vanya saw a label \"Hide&Seek\". Because he is a programmer, he used&as a bitwise AND for these two words represented as a integers in base64and got new word. Now Vanya thinks of some stringsand wants to know the number of pairs of words of length|s|(length ofs), such that their bitwise AND is equal tos. As this number can be large, output it modulo109+ 7.To represent the string as a number in numeral system with base64Vanya uses the following rules:digits from '0' to '9' correspond to integers from0to9;letters from 'A' to 'Z' correspond to integers from10to35;letters from 'a' to 'z' correspond to integers from36to61;letter '-' correspond to integer62;letter '_' correspond to integer63.InputThe only line of the input contains a single words(1 ≤ |s| ≤ 100 000), consisting of digits, lowercase and uppercase English letters, characters '-' and '_'.OutputPrint a single integer — the number of possible pairs of words, such that their bitwise AND is equal to stringsmodulo109+ 7.ExamplesInputzOutput3InputV_VOutput9InputCodeforcesOutput130653412NoteFor a detailed definition of bitwise AND we recommend to take a look in the corresponding article in Wikipedia.In the first sample, there are3possible solutions:z&_ = 61&63 = 61 =z_&z= 63&61 = 61 =zz&z= 61&61 = 61 =z", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "98d43d85", "template_md5": "35d339e4", "result": "You are given a string $s$ consisting of digits, lowercase and uppercase English letters, characters '-' and '_'.  \n\nDefine a function that converts a string to an integer:\n\n* Digits from '0' to '9' correspond to integers from 0 to 9.\n* Letters from 'A' to 'Z' correspond to integers from 10 to 35.\n* Letters from 'a' to 'z' correspond to integers from 36 to 61.\n* '-' corresponds to integer 62.\n* '_' corresponds to integer 63.\n\nFind the number of pairs of strings of length $|s|$ such that the bitwise AND of their integer representations is equal to the integer representation of $s$.  The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "bdd771f6", "template_md5": "465699a0", "result": "Given a string, find the number of pairs of strings that, when combined using a special bitwise operation, result in the original string.  The operation is similar to a logical AND, but uses a custom mapping of characters to numbers. The answer should be the number of pairs modulo 10^9 + 7."}]}