{"uid": "678-C", "url": "https://codeforces.com/contest/678/problem/C", "tags": ["implementation", " math", " number theory"], "title": "678-C", "statement": "C. Joty and Chocolatetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Joty has got a task to do. She has a line ofntiles indexed from1ton. She has to paint them in a strange pattern.An unpainted tile should be painted Red if it's index is divisible byaand an unpainted tile should be painted Blue if it's index is divisible byb. So the tile with the number divisible byaandbcan be either painted Red or Blue.After her painting is done, she will getpchocolates for each tile that is painted Red andqchocolates for each tile that is painted Blue.Note that she can paint tiles in any order she wants.Given the required information, find the maximum number of chocolates Joty can get.InputThe only line contains five integersn,a,b,pandq(1 ≤n,a,b,p,q≤ 109).OutputPrint the only integers— the maximum number of chocolates Joty can get.Note that the answer can be too large, so you should use64-bit integer type to store it. InC++you can use thelong longinteger type and inJavayou can uselonginteger type.ExamplesInput5 2 3 12 15Output39Input20 2 3 3 5Output51", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5c50ece0", "template_md5": "35d339e4", "result": "You are given a line of $n$ tiles numbered from 1 to $n$. You need to paint each tile either red or blue according to the following rules:\n\n* A tile is painted red if its number is divisible by $a$.\n* A tile is painted blue if its number is divisible by $b$.\n* A tile with a number divisible by both $a$ and $b$ can be painted either red or blue.\n\nYou earn $p$ chocolates for each red tile and $q$ chocolates for each blue tile.\n\nFind the maximum number of chocolates you can earn by painting the tiles."}, {"prompt_md5": "12afa8fd", "template_md5": "465699a0", "result": "You have a line of items. Some items should be colored red if their number is divisible by a, and some should be colored blue if their number is divisible by b.  You get points for each red item and points for each blue item. What is the maximum number of points you can get?"}]}