{"uid": "68-D", "url": "https://codeforces.com/contest/68/problem/D", "tags": ["data structures", " divide and conquer", " dp", " math", " probabilities"], "title": "68-D", "statement": "D. Half-decay treetime limit per test3 secondsmemory limit per test256 megabytesinputstdinoutputstdoutRecently Petya has become keen on physics. Anna V., his teacher noticed Petya's interest and gave him a fascinating physical puzzle — a half-decay tree.A half-decay tree is a complete binary tree with the heighth. The height of a tree is the length of the path (in edges) from the root to a leaf in the tree. While studying the tree Petya can add electrons to vertices or induce random decay with synchrophasotron. Random decay is a process during which the edges of some path from the root to the random leaf of the tree are deleted. All the leaves are equiprobable. As the half-decay tree is the school property, Petya will return back the deleted edges into the tree after each decay.After being desintegrated, the tree decomposes into connected components. Charge of each component is the total quantity of electrons placed in vertices of the component. Potential of desintegerated tree is the maximum from the charges of its connected components. Each time before inducing random decay Petya is curious about the mathematical expectation of potential of the tree after being desintegrated.InputFirst line will contain two integershandq(1 ≤h≤ 30, 1 ≤q≤ 105). Nextqlines will contain a query of one of two types:addvePetya addseelectrons to vertex numberv(1 ≤v≤ 2h+ 1- 1, 0 ≤e≤ 104).vandeare integers.The vertices of the tree are numbered in the following way: the root is numbered with 1, the children of the vertex with numberxare numbered with2xand2x+ 1.decayPetya induces tree decay.OutputFor each querydecaysolution you should output the mathematical expectation of potential of the tree after being desintegrated. The absolute or relative error in the answer should not exceed10- 4.ExamplesInput1 4add 1 3add 2 10add 3 11decayOutput13.50000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d470daa5", "template_md5": "35d339e4", "result": "You are given a complete binary tree with a height of $h$.  \n\nThere are two types of operations:\n\n* **add v e**: Add $e$ electrons to vertex $v$.\n* **decay**: Randomly delete edges along a path from the root to a random leaf. After the decay, return the deleted edges to the tree.\n\nAfter each decay, the tree decomposes into connected components. The charge of a component is the sum of electrons in its vertices. The potential of the tree is the maximum charge of any component.\n\nFor each `decay` operation, calculate the expected value of the potential of the tree after the decay. The expected value should be accurate to within $10^{-4}$. \n\n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "1fddca87", "template_md5": "465699a0", "result": "You are given a tree-like structure with a specific shape. You can add a certain value to some nodes in the tree.  You can also randomly remove parts of the tree, and then put those parts back. After each removal, you need to calculate the expected maximum value among the separate parts of the tree."}]}