{"uid": "681-E", "url": "https://codeforces.com/contest/681/problem/E", "tags": ["geometry", " sortings"], "title": "681-E", "statement": "E. Runaway to a Shadowtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputDima is living in a dormitory, as well as some cockroaches.At the moment0Dima saw a cockroach running on a table and decided to kill it. Dima needs exactlyTseconds for aiming, and after that he will precisely strike the cockroach and finish it.To survive the cockroach has to run into a shadow, cast by round plates standing on the table, inTseconds. Shadow casted by any of the plates has the shape of a circle. Shadow circles may intersect, nest or overlap arbitrarily.The cockroach uses the following strategy: first he equiprobably picks a direction to run towards and then runs towards it with the constant speedv. If at some momentt≤Tit reaches any shadow circle, it immediately stops in the shadow and thus will stay alive. Otherwise the cockroach is killed by the Dima's precise strike. Consider that the Dima's precise strike is instant.Determine the probability of that the cockroach will stay alive.InputIn the first line of the input the four integersx0,y0,v,T(|x0|, |y0| ≤ 109,0 ≤v,T≤ 109) are given — the cockroach initial position on the table in the Cartesian system at the moment0, the cockroach's constant speed and the time in seconds Dima needs for aiming respectively.In the next line the only numbern(1 ≤n≤ 100 000) is given — the number of shadow circles casted by plates.In the nextnlines shadow circle description is given: theithof them consists of three integersxi,yi,ri(|xi|, |yi| ≤ 109,0 ≤r≤ 109) — theithshadow circle on-table position in the Cartesian system and its radius respectively.Consider that the table is big enough for the cockroach not to run to the table edges and avoid Dima's precise strike.OutputPrint the only real numberp— the probability of that the cockroach will stay alive.Your answer will be considered correct if its absolute or relative error does not exceed10- 4.ExamplesInput0 0 1 131 1 1-1 -1 1-2 2 1Output0.50000000000Input0 0 1 011 0 1Output1.00000000000NoteThe picture for the first sample is given below.Red color stands for points which being chosen as the cockroach's running direction will cause him being killed, green color for those standing for survival directions. Please note that despite containing a circle centered in( - 2, 2)a part of zone is colored red because the cockroach is not able to reach it in one second.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bf12cf78", "template_md5": "35d339e4", "result": "A cockroach is at position $(x_0, y_0)$ on a table. It needs to reach a shadow within $T$ seconds to survive. The cockroach runs at a constant speed $v$ in a randomly chosen direction. There are $n$ circular shadows on the table, each with center $(x_i, y_i)$ and radius $r_i$. \n\nDetermine the probability that the cockroach will survive."}, {"prompt_md5": "9c219044", "template_md5": "465699a0", "result": "A bug starts at a point and runs in a straight line at a constant speed. It needs to reach a safe zone (a circle) within a given time.  The safe zones can overlap.  What is the probability the bug reaches a safe zone before a timer runs out?"}]}