{"uid": "681-B", "url": "https://codeforces.com/contest/681/problem/B", "tags": ["brute force"], "title": "681-B", "statement": "B. Economy Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputKolya is developing an economy simulator game. His most favourite part of the development process is in-game testing. Once he was entertained by the testing so much, that he found out his game-coin score become equal to0.Kolya remembers that at the beginning of the game his game-coin score was equal tonand that he have bought only some houses (for1 234 567game-coins each), cars (for123 456game-coins each) and computers (for1 234game-coins each).Kolya is now interested, whether he could have spent all of his initialngame-coins buying only houses, cars and computers or there is a bug in the game. Formally, is there a triple of non-negative integersa,bandcsuch thata× 1 234 567 +b× 123 456 +c× 1 234 =n?Please help Kolya answer this question.InputThe first line of the input contains a single integern(1 ≤n≤ 109) — Kolya's initial game-coin score.OutputPrint \"YES\" (without quotes) if it's possible that Kolya spent all of his initialncoins buying only houses, cars and computers. Otherwise print \"NO\" (without quotes).ExamplesInput1359257OutputYESInput17851817OutputNONoteIn the first sample, one of the possible solutions is to buy one house, one car and one computer, spending1 234 567 + 123 456 + 1234 = 1 359 257game-coins in total.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "10597f1c", "template_md5": "35d339e4", "result": "Given a positive integer $n$, determine if it is possible to express $n$ as a sum of multiples of 1234567, 123456, and 1234, where the coefficients are non-negative integers. \n\nIn other words, find if there exist non-negative integers $a$, $b$, and $c$ such that:\n\n $$1234567a + 123456b + 1234c = n$$ \n\nIf such integers exist, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "67aef8e9", "template_md5": "465699a0", "result": "Given a number, determine if it can be expressed as a sum of multiples of three distinct positive integers."}]}