{"uid": "681-A", "url": "https://codeforces.com/contest/681/problem/A", "tags": ["implementation"], "title": "681-A", "statement": "A. A Good Contesttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputCodeforces user' handle color depends on his rating — it is red if his rating is greater or equal to2400; it is orange if his rating is less than2400but greater or equal to2200, etc. Each time participant takes part in a rated contest, his rating is changed depending on his performance.Anton wants the color of his handle to become red. He considers his performance in the rated contest to begoodif he outscored some participant, whose handle was colored red before the contest and his rating has increased after it.Anton has written a program that analyses contest results and determines whether he performed good or not. Are you able to do the same?InputThe first line of the input contains a single integern(1 ≤n≤ 100) — the number of participants Anton has outscored in this contest .The nextnlines describe participants results: thei-th of them consists of a participant handlenameiand two integersbeforeiandafteri(- 4000 ≤beforei,afteri≤ 4000) — participant's rating before and after the contest, respectively. Each handle is a non-empty string, consisting of no more than10characters, which might be lowercase and uppercase English letters, digits, characters «_» and «-» characters.It is guaranteed that all handles are distinct.OutputPrint «YES» (quotes for clarity), if Anton has performed good in the contest and «NO» (quotes for clarity) otherwise.ExamplesInput3Burunduk1 2526 2537BudAlNik 2084 2214subscriber 2833 2749OutputYESInput3Applejack 2400 2400Fluttershy 2390 2431Pinkie_Pie -2500 -2450OutputNONoteIn the first sample, Anton has outscored user with handleBurunduk1, whose handle was colored red before the contest and his rating has increased after the contest.In the second sample,Applejack's rating has not increased after the contest, while bothFluttershy's andPinkie_Pie's handles were not colored red before the contest.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3ca096cc", "template_md5": "35d339e4", "result": "You are given a list of participants in a contest and their ratings before and after the contest.  \n\nDetermine if a participant performed \"good\" based on the following criteria:\n\n*  The participant outscored at least one other participant whose rating was at least 2400 before the contest and increased after the contest.\n\nOutput \"YES\" if the participant performed \"good\", otherwise output \"NO\"."}, {"prompt_md5": "cbbf5541", "template_md5": "465699a0", "result": "Determine if a person performed well in a competition based on the ratings of other participants.  They performed well if they outscored someone whose rating was higher before the competition and increased after the competition."}]}