{"uid": "682-B", "url": "https://codeforces.com/contest/682/problem/B", "tags": ["sortings"], "title": "682-B", "statement": "B. Alyona and Mextime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSomeone gave Alyona an array containingnpositive integersa1,a2, ...,an. In one operation, Alyona can choose any element of the array and decrease it, i.e. replace with any positive integer that is smaller than the current one. Alyona can repeat this operation as many times as she wants. In particular, she may not apply any operation to the array at all.Formally, after applying some operations Alyona will get an array ofnpositive integersb1,b2, ...,bnsuch that1 ≤bi≤aifor every1 ≤i≤n. Your task is to determine the maximum possible value of mex of this array.Mexof an array in this problem is theminimum positiveinteger that doesn't appear in this array. For example, mex of the array containing1,3and4is equal to2, while mex of the array containing2,3and2is equal to1.InputThe first line of the input contains a single integern(1 ≤n≤ 100 000) — the number of elements in the Alyona's array.The second line of the input containsnintegersa1,a2, ...,an(1 ≤ai≤ 109) — the elements of the array.OutputPrint one positive integer — the maximum possible value of mex of the array after Alyona applies some (possibly none) operations.ExamplesInput51 3 3 3 6Output5Input22 1Output3NoteIn the first sample case if one will decrease the second element value to2and the fifth element value to4then themexvalue of resulting array12334will be equal to5.To reach the answer to the second sample case one must not decrease any of the array elements.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c680b084", "template_md5": "35d339e4", "result": "You are given an array of $n$ positive integers. You can decrease any element in the array to a smaller positive integer. What is the largest possible minimum missing positive integer (mex) that you can achieve after performing these operations?\n\n**mex** of an array is the smallest positive integer that does not appear in the array. \n\n\nFor example:\n\n* The mex of the array [1, 3, 4] is 2.\n* The mex of the array [2, 3, 2] is 1."}, {"prompt_md5": "3670e87c", "template_md5": "465699a0", "result": "You are given a list of positive numbers. You can reduce any number in the list to a smaller positive number. What is the largest possible smallest missing number you can make in the list?"}]}