{"uid": "682-D", "url": "https://codeforces.com/contest/682/problem/D", "tags": ["dp", " strings"], "title": "682-D", "statement": "D. Alyona and Stringstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter returned from forest, Alyona started reading a book. She noticed stringssandt, lengths of which arenandmrespectively. As usual, reading bored Alyona and she decided to pay her attention to stringssandt, which she considered very similar.Alyona has her favourite positive integerkand because she is too small,kdoes not exceed10. The girl wants now to choosekdisjoint non-empty substrings of stringssuch that these strings appear as disjoint substrings of stringtand in the same order as they do in strings. She is also interested in that their length is maximum possible among all variants.Formally, Alyona wants to find a sequence ofknon-empty stringsp1,p2,p3, ...,pksatisfying following conditions:scan be represented as concatenationa1p1a2p2...akpkak+ 1, wherea1,a2, ...,ak+ 1is a sequence of arbitrary strings (some of them may be possibly empty);tcan be represented as concatenationb1p1b2p2...bkpkbk+ 1, whereb1,b2, ...,bk+ 1is a sequence of arbitrary strings (some of them may be possibly empty);sum of the lengths of strings in sequence is maximum possible.Please help Alyona solve this complicated problem and find at least the sum of the lengths of the strings in a desired sequence.Asubstringof a string is a subsequence of consecutive characters of the string.InputIn the first line of the input three integersn,m,k(1 ≤n,m≤ 1000,1 ≤k≤ 10) are given — the length of the strings, the length of the stringtand Alyona's favourite number respectively.The second line of the input contains strings, consisting of lowercase English letters.The third line of the input contains stringt, consisting of lowercase English letters.OutputIn the only line print the only non-negative integer — the sum of the lengths of the strings in a desired sequence.It is guaranteed, that at least one desired sequence exists.ExamplesInput3 2 2abcabOutput2Input9 12 4bbaaababbabbbabbaaabaOutput7NoteThe following image describes the answer for the second sample case:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "28912eba", "template_md5": "35d339e4", "result": "You are given two strings, $s$ of length $n$ and $t$ of length $m$, and an integer $k$ ($1 \\le k \\le 10$).  \n\nFind the maximum possible total length of $k$ substrings of $s$ that can be found as consecutive substrings within $t$ in the same order. \n\nOutput the maximum total length. \n\nIt is guaranteed that at least one such set of substrings exists."}, {"prompt_md5": "9d63dbcb", "template_md5": "465699a0", "result": "Given two strings, find the maximum total length of  'k' non-overlapping substrings from the first string that also appear in the second string, in the same order."}]}