{"uid": "683-E", "url": "https://codeforces.com/contest/683/problem/E", "tags": ["*special"], "title": "683-E", "statement": "E. Hammer throwingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputnathletes take part in the hammer throw. Each of them has his own unique identifier — the integer from 1 ton(all athletes have distinct identifiers). After the draw, the order in which the athletes will throw the hammer has been determined (they will do it one by one).Unfortunately, a not very attentive judge lost the list with the order of athletes, but each of the athletes has remembered how many competitors with identifiers larger than his own will throw the hammer before him.Your task is to help the organizers as quickly as possible to restore the order of the athletes.InputThe first line contains the positive integern(1 ≤n≤ 1000) — the number of athletes.The next line contains the sequence of integersa1,a2, ...,an(0 ≤ai<n), whereaiis equal to the number of the athletes with identifiers larger thani, who should throw the hammer before the athlete with identifieri.OutputPrintndistinct numbers — the sequence of athletes' identifiers in the order in which they will throw the hammer. If there are several answers it is allowed to print any of them.ExamplesInput42 0 1 0Output2 4 1 3Input62 2 0 1 1 0Output3 6 1 2 4 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b1ca1970", "template_md5": "35d339e4", "result": "There are $n$ athletes participating in a hammer throw competition.  Each athlete has a unique ID from 1 to $n$.  You are given a list of $n$ numbers, where the $i$-th number represents the number of athletes with IDs larger than $i$ who will throw before athlete $i$.  \n\nYour task is to determine the order in which the athletes will throw the hammer. \n\n**Input:**\n\n* The first line contains the integer $n$ (1 ≤ $n$ ≤ 1000), the number of athletes.\n* The second line contains $n$ integers $a_1$, $a_2$, ..., $a_n$ (0 ≤ $a_i$ < $n$), where $a_i$ is the number of athletes with IDs larger than $i$ who will throw before athlete $i$.\n\n**Output:**\n\n* Print $n$ distinct numbers representing the order in which the athletes will throw the hammer."}, {"prompt_md5": "8047df72", "template_md5": "465699a0", "result": "You are given a list of numbers representing how many people with higher IDs will throw before each person.  Your task is to determine the order of the people based on these numbers."}]}