{"uid": "685-A", "url": "https://codeforces.com/contest/685/problem/A", "tags": ["brute force", " combinatorics", " dp", " math"], "title": "685-A", "statement": "A. Robbers' watchtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRobbers, who attacked the Gerda's cab, are very successful in covering from the kingdom police. To make the goal of catching them even harder, they use their own watches.First, as they know that kingdom police is bad at math, robbers use the positional numeral systemwith base7. Second, they divide one day innhours, and each hour inmminutes. Personal watches of each robber are divided in two parts: first of them has the smallest possible number of places that is necessary to display any integer from0ton- 1, while the second has the smallest possible number of places that is necessary to display any integer from0tom- 1. Finally, if some value of hours or minutes can be displayed using less number of places in base7than this watches have, the required number of zeroes is added at the beginning of notation.Note that to display number0section of the watches is required to have at least one place.Little robber wants to know the number of moments of time (particular values of hours and minutes), such that all digits displayed on the watches aredistinct. Help her calculate this number.InputThe first line of the input contains two integers, given in the decimal notation,nandm(1 ≤n,m≤ 109) — the number of hours in one day and the number of minutes in one hour, respectively.OutputPrint one integer in decimal notation — the number of different pairs of hour and minute, such that all digits displayed on the watches are distinct.ExamplesInput2 3Output4Input8 2Output5NoteIn the first sample, possible pairs are:(0: 1),(0: 2),(1: 0),(1: 2).In the second sample, possible pairs are:(02: 1),(03: 1),(04: 1),(05: 1),(06: 1).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e4ac7912", "template_md5": "35d339e4", "result": "Given two integers $n$ and $m$ representing the number of hours in a day and the number of minutes in an hour, respectively, find the number of unique pairs of hours and minutes where the base-7 representation of the hours and minutes on two separate watches (one for hours and one for minutes) have all distinct digits. \n\nThe watches are designed to display numbers in base-7 with the minimum number of digits required. Leading zeroes are added to ensure the representation is valid."}, {"prompt_md5": "ceaa764e", "template_md5": "465699a0", "result": "Given the number of hours in a day and the number of minutes in an hour, count how many unique combinations of hours and minutes exist where the digits displayed on two watches (one for hours and one for minutes) are all different."}]}