{"uid": "685-E", "url": "https://codeforces.com/contest/685/problem/E", "tags": ["bitmasks", " brute force", " divide and conquer", " graphs"], "title": "685-E", "statement": "E. Travelling Through the Snow Queen's Kingdomtime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputGerda is travelling to the palace of the Snow Queen.The road network consists ofnintersections andmbidirectional roads. Roads are numbered from1tom. Snow Queen put a powerful spell on the roads to change the weather conditions there. Now, if Gerda steps on the roadiat the moment of time less or equal toi, she will leave the road exactly at the momenti. In case she steps on the roadiat the moment of time greater thani, she stays there forever.Gerda starts at the moment of timelat the intersection numbersand goes to the palace of the Snow Queen, located at the intersection numbert. Moreover, she has to be there at the momentr(or earlier), before the arrival of the Queen.Given the description of the road network, determine forqqueriesli,ri,siandtiif it's possible for Gerda to get to the palace on time.InputThe first line of the input contains integersn,mandq(2 ≤n≤ 1000,1 ≤m,q≤ 200 000) — the number of intersections in the road network of Snow Queen's Kingdom, the number of roads and the number of queries you have to answer.Thei-th of the followingmlines contains the description of the road numberi. The description consists of two integersviandui(1 ≤vi,ui≤n,vi≠ui) — the indices of the intersections connected by thei-th road. It's possible to get both fromvitouiand fromuitoviusing only this road. Each pair of intersection may appear several times, meaning there are several roads connecting this pair.Lastqlines contain the queries descriptions. Each of them consists of four integersli,ri,siandti(1 ≤li≤ri≤m,1 ≤si,ti≤n,si≠ti) — the moment of time Gerda starts her journey, the last moment of time she is allowed to arrive to the palace, the index of the starting intersection and the index of the intersection where palace is located.OutputFor each query print \"Yes\" (without quotes) if Gerda can be at the Snow Queen palace on time (not later thanri) or \"No\" (without quotes) otherwise.ExampleInput5 4 61 22 33 43 51 3 1 41 3 2 41 4 4 51 4 4 12 3 1 42 2 2 3OutputYesYesYesNoNoYes", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9d47fee4", "template_md5": "35d339e4", "result": "There is a network of $n$ intersections connected by $m$ bidirectional roads. Each road $i$ has a special property: if you enter the road at time $i$ or earlier, you will leave the road at time $i$. If you enter the road at time $i+1$ or later, you will stay on the road forever.\n\nYou are given $q$ queries. Each query consists of four integers:\n\n* $l$: the starting time\n* $r$: the latest allowed arrival time at the destination\n* $s$: the starting intersection\n* $t$: the destination intersection\n\nFor each query, determine if it is possible to travel from intersection $s$ to intersection $t$ within the given time constraints."}, {"prompt_md5": "51495f86", "template_md5": "465699a0", "result": "You are given a network of connected points. Each connection has a time limit for travel. You need to determine if you can travel from a starting point to a destination point within a given time limit, considering the time limits on each connection."}]}