{"uid": "685-B", "url": "https://codeforces.com/contest/685/problem/B", "tags": ["data structures", " dfs and similar", " dp", " trees"], "title": "685-B", "statement": "B. Kay and Snowflaketime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter the piece of a devilish mirror hit the Kay's eye, he is no longer interested in the beauty of the roses. Now he likes to watch snowflakes.Once upon a time, he found a huge snowflake that has a form of the tree (connected acyclic graph) consisting ofnnodes. The root of tree has index1. Kay is very interested in the structure of this tree.After doing some research he formedqqueries he is interested in. Thei-th query asks to find a centroid of the subtree of the nodevi. Your goal is to answer all queries.Subtreeof a node is a part of tree consisting of this node and all it's descendants (direct or not). In other words, subtree of nodevis formed by nodesu, such that nodevis present on the path fromuto root.Centroidof a tree (or a subtree) is a node, such that if we erase it from the tree, the maximum size of the connected component will be at least two times smaller than the size of the initial tree (or a subtree).InputThe first line of the input contains two integersnandq(2 ≤n≤ 300 000,1 ≤q≤ 300 000) — the size of the initial tree and the number of queries respectively.The second line containsn- 1integerp2,p3, ...,pn(1 ≤pi≤n) — the indices of the parents of the nodes from2ton. Node1is a root of the tree. It's guaranteed thatpidefine a correct tree.Each of the followingqlines contain a single integervi(1 ≤vi≤n) — the index of the node, that define the subtree, for which we want to find a centroid.OutputFor each query print the index of a centroid of the corresponding subtree. If there are many suitable nodes, print any of them. It's guaranteed, that each subtree has at least one centroid.ExampleInput7 41 1 3 3 5 31235Output3236NoteThe first query asks for a centroid of the whole tree — this is node3. If we delete node3the tree will split in four components, two of size1and two of size2.The subtree of the second node consists of this node only, so the answer is2.Node3is centroid of its own subtree.The centroids of the subtree of the node5are nodes5and6— both answers are considered correct.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2ca2419", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, where node 1 is the root.  You are also given $q$ queries. Each query asks you to find the centroid of the subtree rooted at a given node $v$.\n\nThe centroid of a tree (or subtree) is a node such that if you remove it, the size of the largest remaining connected component is at most half the size of the original tree (or subtree).\n\n**Input:**\n\n* The first line contains two integers $n$ and $q$ ($2 \\le n \\le 300000$, $1 \\le q \\le 300000$), representing the number of nodes and the number of queries.\n* The second line contains $n-1$ integers $p_2, p_3, ..., p_n$ ($1 \\le p_i \\le n$), representing the parent of each node (node 1 is the root).\n* Each of the following $q$ lines contains a single integer $v$ ($1 \\le v \\le n$), representing the node for which you need to find the centroid of its subtree.\n\n**Output:**\n\nFor each query, print the index of a centroid of the corresponding subtree. If there are multiple valid centroids, you can print any one of them."}, {"prompt_md5": "f15f2b31", "template_md5": "465699a0", "result": "You are given a tree with $n$ nodes.  Find the centroid of the subtree rooted at each of $q$ given nodes.  The centroid of a subtree is a node such that removing it results in subtrees that are at most half the size of the original subtree."}]}