{"uid": "686-B", "url": "https://codeforces.com/contest/686/problem/B", "tags": ["constructive algorithms", " implementation", " sortings"], "title": "686-B", "statement": "B. Little Robber Girl's Zootime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Robber Girl likes to scare animals in her zoo for fun. She decided to arrange the animals in a row in the order of non-decreasing height. However, the animals were so scared that they couldn't stay in the right places.The robber girl was angry at first, but then she decided to arrange the animals herself. She repeatedly names numberslandrsuch thatr-l+ 1is even. After that animals that occupy positions betweenlandrinclusively are rearranged as follows: the animal at positionlswaps places with the animal at positionl+ 1, the animall+ 2swaps with the animall+ 3, ..., finally, the animal at positionr- 1swaps with the animalr.Help the robber girl to arrange the animals in the order of non-decreasing height. You should name at most20 000segments, since otherwise the robber girl will become bored and will start scaring the animals again.InputThe first line contains a single integern(1 ≤n≤ 100) — number of animals in the robber girl's zoo.The second line containsnspace-separated integersa1,a2, ...,an(1 ≤ai≤ 109), whereaiis the height of the animal occupying thei-th place.OutputPrint the sequence of operations that will rearrange the animals by non-decreasing height.The output should contain several lines,i-th of the lines should contain two space-separated integersliandri(1 ≤li<ri≤n) — descriptions of segments the robber girl should name. The segments should be described in the order the operations are performed.The number of operations should not exceed20 000.If the animals are arranged correctly from the start, you are allowed to output nothing.ExamplesInput42 1 4 3Output1 4Input736 28 57 39 66 69 68Output1 46 7Input51 2 1 2 1Output2 53 41 41 4NoteNote that you don't have to minimize the number of operations. Any solution that performs at most20 000operations is allowed.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4c7b5407", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers ($1 \\le n \\le 100$) representing the heights of animals. The animals are initially arranged in a row. You can perform the following operation at most 20,000 times:\n\n* Choose two integers $l$ and $r$ ($1 \\le l < r \\le n$) such that $r-l+1$ is even.\n* Swap the animals at positions $l$ and $l+1$, $l+2$ and $l+3$, ..., $r-1$ and $r$.\n\nYour goal is to arrange the animals in non-decreasing order of height using these operations. Output a sequence of $l$ and $r$ pairs representing the operations you performed. \n\n\nIf the animals are already in non-decreasing order, you can output nothing."}, {"prompt_md5": "1626bde3", "template_md5": "465699a0", "result": "You are given a list of numbers representing the heights of animals.  Rearrange the animals so they are in non-decreasing order by swapping groups of consecutive animals. You can swap groups of any size as long as the number of animals in the group is odd.  Output the groups of animals to be swapped."}]}