{"uid": "687-A", "url": "https://codeforces.com/contest/687/problem/A", "tags": ["dfs and similar", " graphs"], "title": "687-A", "statement": "A. NP-Hard Problemtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently, Pari and Arya did some research about NP-Hard problems and they found theminimum vertex coverproblem very interesting.Suppose the graphGis given. SubsetAof its vertices is called avertex coverof this graph, if for each edgeuvthere is at least one endpoint of it in this set, i.e.or(or both).Pari and Arya have won a great undirected graph as an award in a team contest. Now they have to split it in two parts, but both of them want their parts of the graph to be a vertex cover.They have agreed to give you their graph and you need to find twodisjointsubsets of its verticesAandB, such that bothAandBare vertex cover or claim it's impossible. Each vertex should be given to no more than one of the friends (or you can even keep it for yourself).InputThe first line of the input contains two integersnandm(2 ≤n≤ 100 000,1 ≤m≤ 100 000) — the number of vertices and the number of edges in the prize graph, respectively.Each of the nextmlines contains a pair of integersuiandvi(1  ≤ui,vi≤n), denoting an undirected edge betweenuiandvi. It's guaranteed the graph won't contain any self-loops or multiple edges.OutputIf it's impossible to split the graph between Pari and Arya as they expect, print \"-1\" (without quotes).If there are two disjoint sets of vertices, such that both sets are vertex cover, print their descriptions. Each description must contain two lines. The first line contains a single integerkdenoting the number of vertices in that vertex cover, and the second line containskintegers — the indices of vertices. Note that because ofm≥ 1, vertex cover cannot be empty.ExamplesInput4 21 22 3Output1221 3Input3 31 22 31 3Output-1NoteIn the first sample, you can give the vertex number2to Arya and vertices numbered1and3to Pari and keep vertex number4for yourself (or give it someone, if you wish).In the second sample, there is no way to satisfy both Pari and Arya.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "49d7bf2f", "template_md5": "35d339e4", "result": "You are given an undirected graph with $n$ vertices and $m$ edges ($2 \\le n \\le 100000$, $1 \\le m \\le 100000$).  \n\nA subset of vertices is called a *vertex cover* if every edge in the graph has at least one endpoint in the subset.\n\nYour task is to divide the vertices into two disjoint sets, $A$ and $B$, such that both $A$ and $B$ are vertex covers. If it's impossible to do this, output \"-1\".\n\nIf a solution exists, output the size of each vertex cover and the list of vertices in each set. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$.\n* Each of the next $m$ lines contains two integers, $u$ and $v$, representing an edge between vertices $u$ and $v$.\n\n**Output:**\n\n* If a solution is not possible, output \"-1\".\n* If a solution exists, output two sets of vertices, each described by:\n    * The number of vertices in the set.\n    * A list of the vertices in the set."}, {"prompt_md5": "3b4e94f7", "template_md5": "465699a0", "result": "You are given a graph with nodes and edges.  Find two groups of nodes that divide the graph so that each group covers all the edges in the graph. If this is impossible, output -1.  Each node can only be in one group."}]}