{"uid": "687-B", "url": "https://codeforces.com/contest/687/problem/B", "tags": ["chinese remainder theorem", " math", " number theory"], "title": "687-B", "statement": "B. Remainders Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputToday Pari and Arya are playing a game called Remainders.Pari chooses two positive integerxandk, and tells Aryakbut notx. Arya have to find the value. There arenancient numbersc1,c2, ...,cnand Pari has to tell Aryaif Arya wants. Givenkand the ancient values, tell us if Arya has a winning strategy independent of value ofxor not. Formally, is it true that Arya can understand the valuefor any positive integerx?Note, thatmeans the remainder ofxafter dividing it byy.InputThe first line of the input contains two integersnandk(1 ≤n,k≤ 1 000 000) — the number of ancient integers and valuekthat is chosen by Pari.The second line containsnintegersc1,c2, ...,cn(1 ≤ci≤ 1 000 000).OutputPrint \"Yes\" (without quotes) if Arya has a winning strategy independent of value ofx, or \"No\" (without quotes) otherwise.ExamplesInput4 52 3 5 12OutputYesInput2 72 3OutputNoNoteIn the first sample, Arya can understandbecause5is one of the ancient numbers.In the second sample, Arya can't be sure whatis. For example1and7have the same remainders after dividing by2and3, but they differ in remainders after dividing by7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7a726057", "template_md5": "35d339e4", "result": "Given a positive integer $k$ and a set of $n$ positive integers $c_1, c_2, ..., c_n$, determine if a player can always determine a specific positive integer $x$ based solely on the remainders of $x$ when divided by each of the $c_i$ values. \n\nIn other words, if the remainder of $x$ divided by $c_i$ is known for all $i$, can the player always deduce the original value of $x$? \n\n\nIf the answer is yes, output \"Yes\". Otherwise, output \"No\"."}, {"prompt_md5": "e2075cf9", "template_md5": "465699a0", "result": "Given a number *k* and a list of numbers, determine if it's possible to figure out a specific target number based only on the remainders it leaves when divided by each number in the list."}]}