{"uid": "688-A", "url": "https://codeforces.com/contest/688/problem/A", "tags": ["implementation"], "title": "688-A", "statement": "A. Opponentstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputArya hasnopponents in the school. Each day he will fight with all opponents who are present this day. His opponents have some fighting plan that guarantees they will win, but implementing this plan requires presence of them all. That means if one day at least one of Arya's opponents is absent at the school, then Arya will beat all present opponents. Otherwise, if all opponents are present, then they will beat Arya.For each opponent Arya knows his schedule — whether or not he is going to present on each particular day. Tell him the maximum number ofconsecutivedays that he will beat all present opponents.Note, that if some day there are no opponents present, Arya still considers he beats all the present opponents.InputThe first line of the input contains two integersnandd(1 ≤n,d≤ 100) — the number of opponents and the number of days, respectively.Thei-th of the followingdlines contains a string of lengthnconsisting of characters '0' and '1'. Thej-th character of this string is '0' if thej-th opponent is going to be absent on thei-th day.OutputPrint the only integer — the maximum number of consecutive days that Arya will beat all present opponents.ExamplesInput2 21000Output2Input4 10100Output1Input4 511011111011010111111Output2NoteIn the first and the second samples, Arya will beat all present opponents each of theddays.In the third sample, Arya will beat his opponents on days1,3and4and his opponents will beat him on days2and5. Thus, the maximum number of consecutive winning days is2, which happens on days3and4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a4dd720d", "template_md5": "35d339e4", "result": "There are $n$ opponents and $d$ days.  For each day, we know which opponents are present (1) or absent (0).  \n\nFind the longest sequence of consecutive days where all present opponents are defeated."}, {"prompt_md5": "be337ffd", "template_md5": "465699a0", "result": "You are given a list of days and a list of people for each day. Some people will be present on some days and absent on others. If at least one person is absent on a day, you win. Otherwise, you lose. Find the longest sequence of consecutive days where you win."}]}