{"uid": "689-A", "url": "https://codeforces.com/contest/689/problem/A", "tags": ["brute force", " constructive algorithms", " implementation"], "title": "689-A", "statement": "A. Mike and Cellphonetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhile swimming at the beach, Mike has accidentally dropped his cellphone into the water. There was no worry as he bought a cheap replacement phone with an old-fashioned keyboard. The keyboard has only ten digital equal-sized keys, located in the following way:Together with his old phone, he lost all his contacts and now he can only remember the way his fingers moved when he put some number in. One can formally considerfinger movementsas a sequence of vectors connecting centers of keys pressed consecutively to put in a number. For example, the finger movements for number \"586\" are the same as finger movements for number \"253\":Mike has already put in a number by his \"finger memory\" and started calling it, so he is now worrying, can he be sure that he is calling the correct number? In other words, is there any other number, that has the same finger movements?InputThe first line of the input contains the only integern(1 ≤n≤ 9) — the number of digits in the phone number that Mike put in.The second line contains the string consisting ofndigits (characters from '0' to '9') representing the number that Mike put in.OutputIf there is no other phone number with the same finger movements and Mike can be sure he is calling the correct number, print \"YES\" (without quotes) in the only line.Otherwise print \"NO\" (without quotes) in the first line.ExamplesInput3586OutputNOInput209OutputNOInput9123456789OutputYESInput3911OutputYESNoteYou can find the picture clarifying the first sample case in the statement above.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e0db1ae6", "template_md5": "35d339e4", "result": "Given a number with $n$ digits, determine if there exists another number with the same finger movements on a phone keypad with the following layout:\n\n```\n  7 8 9\n  4 5 6\n  1 2 3\n  0\n```\n\nwhere each key press is represented by a straight line connecting the centers of the keys.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 9) representing the number of digits.\n* The second line contains a string of $n$ digits (0-9) representing the input number.\n\n**Output:**\n\n* Print \"YES\" if there is no other number with the same finger movements.\n* Print \"NO\" if there is another number with the same finger movements."}, {"prompt_md5": "50c54f0f", "template_md5": "465699a0", "result": "Given a number, determine if there is another number with the same sequence of key presses on a special 10-key phone keypad."}]}