{"uid": "689-E", "url": "https://codeforces.com/contest/689/problem/E", "tags": ["combinatorics", " data structures", " dp", " geometry", " implementation"], "title": "689-E", "statement": "E. Mike and Geometry Problemtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMike wants to prepare for IMO but he doesn't know geometry, so his teacher gave him an interesting geometry problem. Let's definef([l,r]) =r-l+ 1to be the number of integer points in the segment[l,r]withl≤r(say that). You are given two integersnandkandnclosed intervals[li,ri]onOXaxis and you have to find:In other words, you should find the sum of the number of integer points in the intersection of anykof the segments.As the answer may be very large, output it modulo1000000007(109+ 7).Mike can't solve this problem so he needs your help. You will help him, won't you?InputThe first line contains two integersnandk(1 ≤k≤n≤ 200 000) — the number of segments and the number of segments in intersection groups respectively.Thennlines follow, thei-th line contains two integersli,ri( - 109≤li≤ri≤ 109), describingi-th segment bounds.OutputPrint one integer number — the answer to Mike's problem modulo1000000007(109+ 7) in the only line.ExamplesInput3 21 21 32 3Output5Input3 31 31 31 3Output3Input3 11 22 33 4Output6NoteIn the first example:;;.So the answer is2 + 1 + 2 = 5.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b4938225", "template_md5": "35d339e4", "result": "You are given $n$ closed intervals on the number line, where each interval is defined by its start point ($l_i$) and end point ($r_i$).  You need to find the sum of the number of integer points that are present in the intersection of any $k$ of these intervals.\n\nThe output should be the sum modulo 1000000007 ($10^9 + 7$).\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($1 \\le k \\le n \\le 200000$), representing the number of intervals and the number of intervals to consider for intersection, respectively.\n* The next $n$ lines each contain two integers, $l_i$ and $r_i$ ($-10^9 \\le l_i \\le r_i \\le 10^9$), representing the start and end points of each interval.\n\n**Output:**\n\n* Print a single integer representing the sum modulo 1000000007."}, {"prompt_md5": "b41a053b", "template_md5": "465699a0", "result": "You are given a list of intervals on a number line.  Find the total number of times any group of a given size of these intervals overlap.  The answer should be the sum of the number of overlapping points for all possible groups of the given size.  The result should be given modulo 1000000007."}]}