{"uid": "690-C3", "url": "https://codeforces.com/contest/690/problem/C3", "tags": ["trees"], "title": "690-C3", "statement": "C3. Brain Network (hard)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBreaking news from zombie neurology! It turns out that – contrary to previous beliefs – every zombie isbornwith a single brain, and only later it evolves into a complicated brain structure. In fact, whenever a zombie consumes a brain, a new brain appears in its nervous system and gets immediately connected to one of the already existing brains using a single brain connector. Researchers are now interested in monitoring the brain latency of a zombie. Your task is to write a program which, given a history of evolution of a zombie's nervous system, computes its brain latency at every stage.InputThe first line of the input contains one numbern– the number of brains in the final nervous system (2 ≤n≤ 200000). In the second line a history of zombie's nervous system evolution is given. For convenience, we number all the brains by1, 2, ...,nin the same order as they appear in the nervous system (the zombie is born with a single brain, number1, and subsequently brains2, 3, ...,nare added). The second line containsn- 1space-separated numbersp2,p3, ...,pn, meaning that after a new brainkis added to the system, it gets connected to a parent-brain.OutputOutputn- 1space-separated numbers – the brain latencies after the brain numberkis added, fork= 2, 3, ...,n.ExampleInput612215Output1 2 2 3 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "12555905", "template_md5": "35d339e4", "result": "You are given a number $n$ representing the total number of brains in a system.  Then you are given a list of $n-1$ numbers, where the $i$-th number represents the parent brain of the $i+1$-th brain.  \n\nYour task is to calculate the latency of each brain after each new brain is added to the system.  The latency of a brain is the number of connections it has to other brains. \n\n**Example:**\n\n* $n = 6$\n* Parent brain list: $1 2 1 5$\n\nOutput: $1 2 2 3 4$"}, {"prompt_md5": "944fbbb0", "template_md5": "465699a0", "result": "You are given a list of numbers representing how a system grows. Each number indicates which existing part of the system a new part is connected to.  Determine the latency (delay) of each part after each new part is added."}]}