{"uid": "690-B2", "url": "https://codeforces.com/contest/690/problem/B2", "tags": ["geometry"], "title": "690-B2", "statement": "B2. Recover Polygon (medium)time limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputNow that Heidi has made sure her Zombie Contamination level checker works, it's time to strike! This time, the zombie lair is a strictly convex polygon on the lattice. Each vertex of the polygon occupies a point on the lattice. For each cell of the lattice, Heidi knows the level of Zombie Contamination – the number of corners of the cell that are inside or on the border of the lair.Given this information, Heidi wants to know the exact shape of the lair to rain destruction on the zombies. Help her!InputThe input contains multiple test cases.The first line of each test case contains one integerN, the size of the lattice grid (5 ≤N≤ 500). The nextNlines each containNcharacters, describing the level of Zombie Contamination of each cell in the lattice. Every character of every line is a digit between 0 and 4.Cells are given in the same order as they are shown in the picture above: rows go in the decreasing value ofycoordinate, and in one row cells go in the order of increasingxcoordinate. This means that the first row corresponds to cells with coordinates(1,N), ..., (N,N)and the last row corresponds to cells with coordinates(1, 1), ..., (N, 1).The last line of the file contains a zero. This line should not be treated as a test case. The sum of theNvalues for all tests in one file will not exceed5000.OutputFor each test case, give the following output:The first line of the output should contain one integerV, the number of vertices of the polygon that is the secret lair. The nextVlines each should contain two integers, denoting the vertices of the polygon in the clockwise order, starting from the lexicographically smallest vertex.ExamplesInput8000000000000011000012210012342000244420001223200000011000000000050000001210024200121000000700000000122100013420000132000002200000110000000000Output42 32 46 65 242 22 33 33 232 54 54 2NoteIt is guaranteed that the solution always exists and is unique. It is guaranteed that in the correct solution the coordinates of the polygon vertices are between2andN- 2. A vertex(x1,y1)is lexicographically smaller than vertex(x2,y2)ifx1<x2or.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "65753f8e", "template_md5": "35d339e4", "result": "You are given a square grid of size $N \\times N$. Each cell in the grid has a value between 0 and 4, representing the number of corners of the cell that are inside or on the border of a convex polygon. \n\nYour task is to determine the shape of the polygon by finding its vertices. The vertices are given as pairs of integers $(x, y)$.\n\n**Input:**\n\n* The first line of each test case contains an integer $N$ (5 ≤ $N$ ≤ 500), the size of the grid.\n* The next $N$ lines each contain $N$ digits between 0 and 4, representing the grid.\n\n**Output:**\n\n* For each test case, output the number of vertices $V$ of the polygon.\n* Then, output $V$ lines, each containing two integers, representing the coordinates of a vertex in clockwise order, starting with the lexicographically smallest vertex.\n\n**Constraints:**\n\n* The solution always exists and is unique.\n* The coordinates of the polygon vertices are between 2 and $N-2$."}, {"prompt_md5": "ffc92287", "template_md5": "465699a0", "result": "You are given a grid of numbers. Each number represents how many sides of a shape are touching that grid cell.  Find the shape."}]}