{"uid": "690-F2", "url": "https://codeforces.com/contest/690/problem/F2", "tags": ["constructive algorithms", " hashing", " trees"], "title": "690-F2", "statement": "F2. Tree of Life (medium)time limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputHeidi got tired of deciphering the prophecy hidden in the Tree of Life and decided to go back to her headquarters, rest a little and try there. Of course, she cannot uproot the Tree and take it with her, so she made a drawing of the Tree on a piece of paper. On second thought, she made more identical drawings so as to havenin total (wherenis the number of vertices of the Tree of Life) – who knows what might happen?Indeed, on her way back Heidi was ambushed by a group of zombies. While she managed to fend them off, they have damaged her drawings in a peculiar way: from thei-th copy, the vertex numberediwas removed, along with all adjacent edges. In each picture, the zombies have also erased all the vertex numbers and relabeled the remainingn- 1vertices arbitrarily using numbers1ton(fortunately, each vertex still has a distinct number).What's more, the drawings have been arbitrarily shuffled/reordered.Now Heidi wants to recover the Tree of Life from her descriptions of all the drawings (as lists of edges).InputThe first line of the input containsZ≤ 20– the number of test cases.Zdescriptions of single test cases follow.In each test case, the first line of input contains numbersn(2 ≤n≤ 100) andk(wherekis the number of drawings; we havek=n). In the following lines, the descriptions of thekdrawings are given. The description of thei-th drawing is a line containingmi– the number of edges in this drawing, followed bymilines describing edges, each of which contains two space-separated integers –- the numbers of the two vertices connected by the edge.OutputIf Heidi's drawings cannot possibly come from a single tree, you should output the wordNO. Otherwise, output one line containing the wordYESandn- 1lines describing any tree that Heidi's drawings could have come from. For every edge you should output the numbers of the vertices that it connects, separated with a single space. If there are many solutions, print any of them.ExampleInput15 524 12 113 134 14 32 133 13 24 132 13 24 2OutputYES2 54 23 25 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1c7e9a5f", "template_md5": "35d339e4", "result": "You are given $Z$ sets of data. Each set represents a problem.\n\nEach problem has the following:\n\n* $n$: The number of vertices in a tree.\n* $k$: The number of drawings of the tree ($k=n$).\n\nEach drawing is described by:\n\n* $m_i$: The number of edges in the $i$-th drawing.\n* $m_i$ lines, each containing two integers representing the vertices connected by an edge in that drawing.\n\nThe drawings are incomplete and have been relabeled.  \n\n**Task:**\n\nDetermine if it is possible to reconstruct a single tree from the given drawings. If yes, output \"YES\" and provide a valid tree structure (a list of edges). If not, output \"NO\"."}, {"prompt_md5": "7107533d", "template_md5": "465699a0", "result": "You are given a set of incomplete descriptions of a tree. Each description is a list of edges, but some vertices and edges are missing from each description.  Determine if it's possible to reconstruct a single tree from these incomplete descriptions. If so, provide one possible reconstruction."}]}