{"uid": "690-F1", "url": "https://codeforces.com/contest/690/problem/F1", "tags": [], "title": "690-F1", "statement": "F1. Tree of Life (easy)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputHeidi has finally found the mythical Tree of Life – a legendary combinatorial structure which is said to contain a prophecy crucially needed to defeat the undead armies.On the surface, the Tree of Life is just a regular undirected tree well-known from computer science. This means that it is a collection ofnpoints (called vertices), some of which are connected usingn- 1line segments (edges) so that each pair of vertices is connected by apath(a sequence of one or more edges).To decipher the prophecy, Heidi needs to perform a number of steps. The first is counting the number oflifelinesin the tree – these are paths of length2, i.e., consisting of two edges. Help her!InputThe first line of the input contains a single integern– the number of vertices in the tree (1 ≤n≤ 10000). The vertices are labeled with the numbers from 1 ton. Thenn- 1lines follow, each describing one edge using two space-separated numbersab– the labels of the vertices connected by the edge (1 ≤a<b≤n). It is guaranteed that the input represents a tree.OutputPrint one integer – the number of lifelines in the tree.ExamplesInput41 21 31 4Output3Input51 22 33 43 5Output4NoteIn the second sample, there are four lifelines: paths between vertices1and3,2and4,2and5, and4and5.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6a266687", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes.  Each node is labeled with a number from 1 to $n$.  There are $n-1$ edges connecting the nodes.  An edge connects two nodes.  A lifeline is a path of length 2 in the tree, meaning a path that consists of exactly two edges.  \n\nYour task is to count the number of lifelines in the tree.\n\nInput:\n\n* The first line contains an integer $n$ representing the number of nodes in the tree.\n* The next $n-1$ lines each contain two integers $a$ and $b$ representing an edge between nodes $a$ and $b$.\n\nOutput:\n\n* Print a single integer representing the number of lifelines in the tree."}, {"prompt_md5": "04bd9926", "template_md5": "465699a0", "result": "You are given a connected graph with a specific structure.  Count the number of pairs of nodes that are connected by exactly two edges."}]}