{"uid": "690-E2", "url": "https://codeforces.com/contest/690/problem/E2", "tags": [], "title": "690-E2", "statement": "E2. Photographs (II)time limit per test15 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputZombies seem to have become much more intelligent lately – a few have somehow wandered into the base through the automatic gate. Heidi has had to beef up security, and a new gate has been installed. Unfortunately, now the questions being asked are more complicated, and even humans have trouble answering them. Can you still program the robot army to do this reliably?The new questions are of the following form: a grayscale photograph has been divided into several horizontal pieces, which have been arbitrarily rearranged. The task is to assemble the original image back from these pieces (somewhat like in a jigsaw puzzle). To further delay the zombies, significant Gaussian-distributed noise has been added to the image.InputThe input format is the same as in the previous version, except that the first line of every question now contains three space-separated numbersh,wandk(1 ≤h,w≤ 600,2 ≤k≤ 16) – the height (number of rows) and width (number of columns) of the photograph and the number of pieces, respectively. The number of pieces evenly divides the height, and each piece is of the same heighth/k.Again, there is only one input file to be processed, and the same resources are provided to you as in the previous version (except that now you are givenallinput images in.bmpformat, rather than the first 50).OutputYour program should printqlines. Thei-th line should contain your answer for thei-th question: a space-separated sequence ofknumbersπ1, π2, ..., πksuch that:πis a permutation of{1, 2, ...,k}, that is, each number from1tokappears exactly once inπ,for eachj= 1, ...,k,πjis the position (index), in the original image, of the piece which is at positionjin the input image. (See the illustration below for clarity.)The second image from the test set. If the three pieces in the original image are numbered1,2,3from top to bottom, then the numbering in the image on the right should be2,3,1. The correct answer for this image is thus2 3 1.Again, your answers will be accepted if they conform to this format and if at least75%of them are correct.Again, you may process the input locally and submit just your precomputed answers (i.e., a program which just prints your output for the input fileall.in).NoteThe link to download all the necessary materials is http://assets.codeforces.com/files/690/medium_contestant_package.zip", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6a1186ed", "template_md5": "35d339e4", "result": "You are given a grayscale image that has been divided into $k$ horizontal pieces. These pieces have been rearranged randomly.  The image also has Gaussian noise added to it. Your task is to determine the original order of the $k$ pieces.\n\nThe input will consist of:\n\n*  $h$, $w$, and $k$: the height, width, and number of pieces of the image.\n*  A representation of the rearranged image.\n\nYour output should be a sequence of $k$ numbers, where each number represents the original position of a piece in the image.  For example, if the original order of the pieces was 1, 2, 3, and the input image shows them in the order 2, 3, 1, your output would be 2 3 1."}, {"prompt_md5": "1d6df265", "template_md5": "465699a0", "result": "You are given a set of image pieces that are a rearranged and noisy version of a larger image.  You need to determine the correct order to assemble the pieces back into the original image."}]}