{"uid": "690-D3", "url": "https://codeforces.com/contest/690/problem/D3", "tags": ["dp"], "title": "690-D3", "statement": "D3. The Wall (hard)time limit per test15 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSo many wall designs to choose from! Even modulo106+ 3, it's an enormous number. Given that recently Heidi acquired an unlimited supply of bricks, her choices are endless! She really needs to do something to narrow them down.Heidi is quick to come up with criteria for ausefulwall:In a useful wall, at least one segment is wider thanWbricks. This should give the zombies something to hit their heads against. Or,in a useful wall, at least one column is higher thanHbricks. This provides a lookout from which zombies can be spotted at a distance.This should rule out a fair amount of possibilities, right? Help Heidi compute the number ofuselesswalls that do not confirm to either of these criteria. In other words, a wall is useless if every segment has width at mostWand height at mostH.ParameterC, the total width of the wall, has the same meaning as in the easy version. However, note that the number of bricks is now unlimited.Output the number of useless walls modulo106+ 3.InputThe first and the only line of the input contains three space-separated integersC,WandH(1 ≤C≤ 108,1 ≤W,H≤ 100).OutputOutput the number of different walls, modulo106+ 3, which are useless according to Heidi's criteria.ExamplesInput1 1 1Output2Input1 2 2Output3Input1 2 3Output4Input3 2 2Output19Input5 4 9Output40951Input40 37 65Output933869NoteIf there is no brick in any of the columns, the structure is considered as a useless wall.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e5aa1fa1", "template_md5": "35d339e4", "result": "Given three integers $C$, $W$, and $H$ (where $1 \\le C \\le 10^8$ and $1 \\le W, H \\le 100$), find the number of ways to build a wall with total width $C$ such that:\n\n* Every segment of the wall has a width of at most $W$ bricks.\n* Every column of the wall has a height of at most $H$ bricks.\n\nOutput the number of such walls modulo $10^9 + 3$."}, {"prompt_md5": "a6a0acfd", "template_md5": "465699a0", "result": "Given a total width C, and maximum width W and height H for segments, count the number of walls that have all segments with width less than or equal to W and height less than or equal to H."}]}