{"uid": "691-D", "url": "https://codeforces.com/contest/691/problem/D", "tags": ["dfs and similar", " dsu", " math"], "title": "691-D", "statement": "D. Swaps in Permutationtime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a permutation of the numbers1, 2, ...,nandmpairs of positions(aj,bj).At each step you can choose a pair from the given positions and swap the numbers in that positions. What is the lexicographically maximal permutation one can get?Letpandqbe two permutations of the numbers1, 2, ...,n.pis lexicographically smaller than theqif a number1 ≤i≤nexists, sopk=qkfor1 ≤k<iandpi<qi.InputThe first line contains two integersnandm(1 ≤n,m≤ 106) — the length of the permutationpand the number of pairs of positions.The second line containsndistinct integerspi(1 ≤pi≤n) — the elements of the permutationp.Each of the lastmlines contains two integers(aj,bj)(1 ≤aj,bj≤n) — the pairs of positions to swap. Note that you are given apositions, not the values to swap.OutputPrint the only line withndistinct integersp'i(1 ≤p'i≤n) — the lexicographically maximal permutation one can get.ExampleInput9 61 2 3 4 5 6 7 8 91 44 72 55 83 66 9Output7 8 9 4 5 6 1 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "72dcb011", "template_md5": "35d339e4", "result": "You are given a permutation of numbers from 1 to $n$ and $m$ pairs of positions. You can swap the numbers at any of these pairs. What is the largest possible permutation you can create by doing swaps?\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 10^6$), representing the length of the permutation and the number of pairs to swap.\n* The second line contains $n$ distinct integers, $p_1, p_2, ..., p_n$ ($1 \\le p_i \\le n$), representing the initial permutation.\n* Each of the next $m$ lines contains two integers, $a_j$ and $b_j$ ($1 \\le a_j, b_j \\le n$), representing a pair of positions to swap.\n\n**Output:**\n\n* Print a line containing $n$ distinct integers, $p'_1, p'_2, ..., p'_n$, representing the lexicographically largest permutation you can create."}, {"prompt_md5": "d756dbe4", "template_md5": "465699a0", "result": "You are given a list of numbers and a set of pairs of positions in the list. You can swap the numbers at any of these pairs. What is the largest possible order you can arrange the numbers in after making these swaps?"}]}