{"uid": "691-A", "url": "https://codeforces.com/contest/691/problem/A", "tags": ["implementation"], "title": "691-A", "statement": "A. Fashion in Berlandtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAccording to rules of the Berland fashion, a jacket should be fastened byall the buttons except only one, but not necessarily it should be the last one. Also if the jacket has only one button, it should be fastened, so the jacket will not swinging open.You are given a jacket withnbuttons. Determine if it is fastened in a right way.InputThe first line contains integern(1 ≤n≤ 1000) — the number of buttons on the jacket.The second line containsnintegersai(0 ≤ai≤ 1). The numberai= 0if thei-th button is not fastened. Otherwiseai= 1.OutputIn the only line print the word \"YES\" if the jacket is fastened in a right way. Otherwise print the word \"NO\".ExamplesInput31 0 1OutputYESInput31 0 0OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0d243cb4", "template_md5": "35d339e4", "result": "You are given a jacket with $n$ buttons.  Determine if the jacket is fastened correctly. \n\nA jacket is fastened correctly if:\n\n* All buttons are fastened except for one.\n* If the jacket has only one button, it must be fastened.\n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 1000) representing the number of buttons on the jacket.\n* The second line contains $n$ integers $a_i$ (0 ≤ $a_i$ ≤ 1).  $a_i$ = 0 means the $i$-th button is not fastened. $a_i$ = 1 means the $i$-th button is fastened.\n\nOutput:\n\n* Print \"YES\" if the jacket is fastened correctly. Otherwise, print \"NO\"."}, {"prompt_md5": "bdabbcfd", "template_md5": "465699a0", "result": "You are given a sequence of 0s and 1s representing buttons on a jacket. A button with a 1 is fastened, and a button with a 0 is not fastened.  Determine if the jacket is fastened correctly according to the rule: all buttons except one must be fastened."}]}