{"uid": "696-E", "url": "https://codeforces.com/contest/696/problem/E", "tags": ["data structures", " dsu", " trees"], "title": "696-E", "statement": "E. ...Wait for it...time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBarney is searching for his dream girl. He lives in NYC. NYC hasnjunctions numbered from1tonandn- 1roads connecting them. We will consider the NYC as a rooted tree with root being junction1.mgirls live in NYC,i-th of them lives along junctionciand her weight initially equalsipounds.Barney consider a girlxto bebetterthan a girlyif and only if: girlxhas weight strictly less than girlyor girlxand girlyhave equal weights and index of girlxliving junction index is strictly less than girlyliving junction index, i.e.cx<cy. Thus for any two girls one of them is always better than another one.For the nextqdays, one event happens each day. There are two types of events:Barney goes from junctionvto junctionu. As a result he picks at mostkbest girls he still have not invitedfrom junctions on his way and invites them to his house to test if one of them is his dream girl. If there are less thanknot invited girls on his path, he invites all of them.Girls living along junctions in subtree of junctionv(includingvitself) put on some weight. As result, their weights increase bykpounds.Your task is for each event of first type tell Barney the indices of girls he will invite to his home in this event.InputThe first line of input contains three integersn,mandq(1 ≤n,m,q≤ 105) — the number of junctions in NYC, the number of girls living in NYC and the number of events respectively.The nextn- 1lines describes the roads. Each line contains two integersvandu(1 ≤v,u≤n,v≠u) meaning that there is a road connecting junctionsvandu.The next line containsmintegersc1,c2, ...,cm(1 ≤ci≤n) — the girl's living junctions.The nextqlines describe the events in chronological order. Each line starts with an integert(1 ≤t≤ 2) — type of the event .Ift= 1then the line describes event of first type three integersv,uandk(1 ≤v,u,k≤n) follow — the endpoints of Barney's path and the number of girls that he will invite at most.Otherwise the line describes event of second type and two integersvandk(1 ≤v≤n, 1 ≤k≤ 109) follow — the root of the subtree and value by which all the girls' weights in the subtree should increase.OutputFor each event of the first type, print numbertand thentintegersg1,g2, ...,gtin one line, meaning that in this event Barney will invitetgirls whose indices areg1, ...,gtin the order from the best to the worstaccording to Barney's considerations.ExampleInput5 7 113 52 34 31 44 1 4 5 4 1 42 4 31 2 1 21 4 2 12 2 102 1 101 2 4 11 2 3 42 5 22 4 91 3 5 21 1 2 3Output2 2 11 31 501 42 6 7NoteFor the first sample case:Description of events:Weights of girls in subtree of junction4increase by3. These girls have IDs:1, 3, 5, 4, 7.Barney goes from junction2to1. Girls on his way have IDs1, 2, 3, 5, 6, 7with weights4, 2, 6, 8, 6, 10respectively. So, he invites girls2and1.Barney goes from junction4to junction2. Girls on his way has IDs3, 5, 7with weights6, 8, 10respectively. So he invites girl3.Weight of girls in subtree of junction2increase by10. There are no not invited girls, so nothing happens.Weight of girls in subtree of junction1increase by10. These girls (all girls left) have IDs:4, 5, 6, 7.Barney goes from junction2to junction4. Girls on his way has IDs5, 7with weights18, 20respectively. So he invites girl5.Barney goes from junction2to junction3. There is no girl on his way.Weight of girls in subtree of junction5increase by2. The only girl there is girl with ID4.Weight of girls in subtree of junction4increase by9. These girls have IDs:4, 6, 7.Barney goes from junction3to junction5. Only girl on his way is girl with ID4.Barney goes from junction1to junction2. Girls on his way has IDs6, 7with weights16, 29respectively.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d6e45d80", "template_md5": "35d339e4", "result": "There is a tree with $n$ junctions.  Each junction has a girl living there with a weight.  \n\nThere are $q$ events.  \n\n* **Event Type 1:**  A person travels from junction $v$ to junction $u$.  They can invite up to $k$ girls they haven't invited yet along the path.  A girl is considered \"better\" than another if she has a lower weight, or if they have the same weight but lives at a lower numbered junction.  Output the indices of the girls the person invites.\n\n* **Event Type 2:**  All girls in the subtree rooted at junction $v$ have their weights increased by $k$.\n\nFor each Event Type 1, output the indices of the girls invited. \n\n\n\nInput:\n\n* $n$, $m$, $q$ (number of junctions, number of girls, number of events)\n* $n-1$ lines describing the tree (each line has two integers $v$ and $u$ representing an edge between junctions $v$ and $u$)\n* $m$ integers $c_1, c_2, ..., c_m$ (the junction where each girl lives)\n* $q$ lines describing the events (each line starts with a 1 or 2 indicating the event type, followed by the necessary parameters)\n\nOutput:\n\nFor each Event Type 1, output the indices of the girls invited."}, {"prompt_md5": "bfd99410", "template_md5": "465699a0", "result": "There is a tree with cities. Each city has a girl with a weight.  You have to process events. Some events involve traveling between cities and picking the best girls along the way. Other events increase the weight of girls in a subtree. For each travel event, list the indices of the best girls picked."}]}