{"uid": "696-D", "url": "https://codeforces.com/contest/696/problem/D", "tags": ["data structures", " dp", " matrices", " strings"], "title": "696-D", "statement": "D. Legen...time limit per test6 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBarney was hanging out with Nora for a while and now he thinks he may have feelings for her. Barney wants to send her a cheesy text message and wants to make her as happy as possible.Initially, happiness level of Nora is0. Nora loves some pickup lines like \"I'm falling for you\" and stuff. Totally, she knowsnpickup lines, each consisting only of lowercase English letters, also some of them may be equal (in writing, but different in pronouncing or meaning though). Every time Nora seesi-th pickup line as aconsecutive subsequenceof Barney's text message her happiness level increases byai. These substrings may overlap, for example, Nora will see the pickup lineaatwice and the pickup lineabonce in text messageaaab.Due to texting app limits, Barney's text may have up tolcharacters.Barney asked you to help him make Nora as much happy as possible, it's gonna be legen...InputThe first line of input contains two integersnandl(1 ≤n≤ 200, 1 ≤l≤ 1014) — the number of pickup lines and the maximum length of Barney's text.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 100), meaning that Nora's happiness level increases byaiafter every time seeingi-th pickup line.The nextnlines contain the pickup lines.i-th of them contains a single stringsiconsisting of only English lowercase letter. Summary length of all pickup lines does not exceed200.All strings are not empty.OutputPrint the only integer — the maximum possible value of Nora's happiness level after reading Barney's text.ExamplesInput3 63 2 1heartearthartOutput6Input3 63 2 8heartearthartOutput16NoteAn optimal answer for the first sample case ishearthcontaining each pickup line exactly once.An optimal answer for the second sample case isartart.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5333f3c5", "template_md5": "35d339e4", "result": "You are given a list of $n$ pickup lines and a maximum length $l$ for a text message. Each pickup line has a corresponding happiness value $a_i$.  \n\nThe goal is to determine the maximum happiness level achievable by arranging the pickup lines within a text message of length up to $l$.  Pickup lines can overlap within the text message.\n\n**Input:**\n\n* $n$: the number of pickup lines\n* $l$: the maximum length of the text message\n* $a_1, a_2, ..., a_n$: the happiness values for each pickup line\n* $n$ lines, each containing a pickup line (string of lowercase English letters)\n\n**Output:**\n\n* The maximum possible happiness level achievable."}, {"prompt_md5": "076091de", "template_md5": "465699a0", "result": "You are given a list of phrases and their corresponding happiness values.  You need to find the longest combination of phrases from the list that can be formed using a given number of characters, and output the total happiness value of that combination."}]}