{"uid": "697-B", "url": "https://codeforces.com/contest/697/problem/B", "tags": ["brute force", " implementation", " math", " strings"], "title": "697-B", "statement": "B. Barnicletime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputBarney is standing in a bar and starring at a pretty girl. He wants to shoot her with his heart arrow but he needs to know the distance between him and the girl to make his shot accurate.Barney asked the bar tender Carl about this distance value, but Carl was so busy talking to the customers so he wrote the distance value (it's a real number) on a napkin. The problem is that he wrote it in scientific notation. The scientific notation of some real numberxis the notation of formAeB, whereAis a real number andBis an integer andx=A× 10Bis true. In our caseAis between0and9andBis non-negative.Barney doesn't know anything about scientific notation (as well as anything scientific at all). So he asked you to tell him the distance value in usual decimal representation with minimal number of digits after the decimal point (and no decimal point if it is an integer). See the output format for better understanding.InputThe first and only line of input contains a single string of forma.debwherea,dandbare integers andeis usual character 'e' (0 ≤a≤ 9, 0 ≤d< 10100, 0 ≤b≤ 100) — the scientific notation of the desired distance value.aandbcontain no leading zeros anddcontains no trailing zeros (but may be equal to0). Also,bcan not be non-zero ifais zero.OutputPrint the only real numberx(the desired distance value) in the only line in its decimal notation.Thus ifxis an integer, print it's integer value without decimal part and decimal point and without leading zeroes.Otherwise printxin a form ofp.qsuch thatpis an integer that have no leading zeroes (but may be equal to zero), andqis an integer that have no trailing zeroes (and may not be equal to zero).ExamplesInput8.549e2Output854.9Input8.549e3Output8549Input0.33e0Output0.33", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "80fac077", "template_md5": "35d339e4", "result": "You are given a number in scientific notation, in the form $a.de b$, where $a$, $d$, and $b$ are integers.  \n\nConvert this number to standard decimal notation, using the fewest decimal places possible. If the number is an integer, output it without any decimal point. \n\n**Input:**\n\nA single line containing a number in scientific notation.\n\n**Output:**\n\nA single line containing the number in standard decimal notation."}, {"prompt_md5": "dfce827b", "template_md5": "465699a0", "result": "You are given a number written in scientific notation (e.g., 8.549e2). Convert this number to standard decimal notation with the fewest digits after the decimal point possible."}]}