{"uid": "698-A", "url": "https://codeforces.com/contest/698/problem/A", "tags": ["dp"], "title": "698-A", "statement": "A. Vacationstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya hasndays of vacations! So he decided to improve his IT skills and do sport. Vasya knows the following information about each of thisndays: whether that gym opened and whether a contest was carried out in the Internet on that day. For thei-th day there are four options:on this day the gym is closed and the contest is not carried out;on this day the gym is closed and the contest is carried out;on this day the gym is open and the contest is not carried out;on this day the gym is open and the contest is carried out.On each of days Vasya can either have a rest or write the contest (if it is carried out on this day), or do sport (if the gym is open on this day).Find the minimum number of days on which Vasya will have a rest (it means, he will not do sport and write the contest at the same time). The only limitation that Vasya has —he does not want to do the same activity on two consecutive days: it means, he will not do sport on two consecutive days, and write the contest on two consecutive days.InputThe first line contains a positive integern(1 ≤n≤ 100) — the number of days of Vasya's vacations.The second line contains the sequence of integersa1,a2, ...,an(0 ≤ai≤ 3) separated by space, where:aiequals 0, if on thei-th day of vacations the gym is closed and the contest is not carried out;aiequals 1, if on thei-th day of vacations the gym is closed, but the contest is carried out;aiequals 2, if on thei-th day of vacations the gym is open and the contest is not carried out;aiequals 3, if on thei-th day of vacations the gym is open and the contest is carried out.OutputPrint the minimum possible number of days on which Vasya will have a rest. Remember that Vasya refuses:to do sport on any two consecutive days,to write the contest on any two consecutive days.ExamplesInput41 3 2 0Output2Input71 3 3 2 1 2 3Output0Input22 2Output1NoteIn the first test Vasya can write the contest on the day number 1 and do sport on the day number 3. Thus, he will have a rest for only 2 days.In the second test Vasya should write contests on days number 1, 3, 5 and 7, in other days do sport. Thus, he will not have a rest for a single day.In the third test Vasya can do sport either on a day number 1 or number 2. He can not do sport in two days, because it will be contrary to the his limitation. Thus, he will have a rest for only one day.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "00b78fec", "template_md5": "35d339e4", "result": "You are given $n$ days ($1 \\le n \\le 100$). For each day, you are given information about whether a gym is open or closed and whether a contest is held or not. There are four possible scenarios for each day:\n\n* Gym closed, no contest\n* Gym closed, contest held\n* Gym open, no contest\n* Gym open, contest held\n\nYou can choose to rest, write the contest (if it's held), or do sport (if the gym is open) on each day. You cannot do the same activity on two consecutive days.\n\nFind the minimum number of days you must rest."}, {"prompt_md5": "5d929b2b", "template_md5": "465699a0", "result": "You are given a sequence of days, each with one of four possible states: gym closed, no contest, gym open, no contest, gym closed, contest, gym open, contest.  You need to find the minimum number of days where you can do neither activity (rest) given the rule that you cannot do the same activity on two consecutive days."}]}