{"uid": "699-B", "url": "https://codeforces.com/contest/699/problem/B", "tags": ["implementation"], "title": "699-B", "statement": "B. One Bombtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a description of a depot. It is a rectangular checkered field ofn×msize. Each cell in a field can be empty (\".\") or it can be occupied by a wall (\"*\").You have one bomb. If you lay the bomb at the cell(x,y), then after triggering it will wipe out all walls in the rowxand all walls in the columny.You are to determine if it is possible to wipe out all walls in the depot by placing and triggeringexactly one bomb. The bomb can be laid both in an empty cell or in a cell occupied by a wall.InputThe first line contains two positive integersnandm(1 ≤n,m≤ 1000) — the number of rows and columns in the depot field.The nextnlines containmsymbols \".\" and \"*\" each — the description of the field.j-th symbol ini-th of them stands for cell(i,j). If the symbol is equal to \".\", then the corresponding cell is empty, otherwise it equals \"*\" and the corresponding cell is occupied by a wall.OutputIf it is impossible to wipe out all walls by placing and triggering exactly one bomb, then print \"NO\" in the first line (without quotes).Otherwise print \"YES\" (without quotes) in the first line and two integers in the second line — the coordinates of the cell at which the bomb should be laid. If there are multiple answers, print any of them.ExamplesInput3 4.*.......*..OutputYES1 2Input3 3..*.*.*..OutputNOInput6 5..*....*..*****..*....*....*..OutputYES3 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b756d04e", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$. Each cell in the grid can be either empty (\".\") or occupied by a wall (\"*\"). You have one bomb. If you place the bomb in a cell $(x, y)$, it will destroy all walls in the $x$-th row and the $y$-th column. \n\nDetermine if it is possible to destroy all the walls in the grid by placing and detonating exactly one bomb. If it is possible, output \"YES\" followed by the coordinates $(x, y)$ of the cell where the bomb should be placed. If it is not possible, output \"NO\"."}, {"prompt_md5": "b9f3292e", "template_md5": "465699a0", "result": "You have a grid of squares. Some squares are empty and some are blocked. You have one bomb that, when placed, will clear out its entire row and column. Can you clear all the blocked squares by placing the bomb only once? If so, tell where to place it."}]}