{"uid": "70-C", "url": "https://codeforces.com/contest/70/problem/C", "tags": ["binary search", " data structures", " sortings", " two pointers"], "title": "70-C", "statement": "C. Lucky Ticketstime limit per test1.5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn Walrusland public transport tickets are characterized by two integers: by the number of the series and by the number of the ticket in the series. Let the series number be represented byaand the ticket number — byb, then a ticket is described by the ordered pair of numbers(a,b).The walruses believe that a ticket is lucky ifa*b=rev(a) *rev(b). The functionrev(x)reverses a number written in the decimal system, at that the leading zeroes disappear. For example,rev(12343) = 34321,rev(1200) = 21.The Public Transport Management Committee wants to releasexseries, each containingytickets, so thatatleastwlucky tickets were released and the total number of released tickets (x*y) were minimum. The series are numbered from1toxinclusive. The tickets in each series are numbered from1toyinclusive. The Transport Committee cannot release more thanmaxxseries and more thanmaxytickets in one series.InputThe first line contains three integersmaxx,maxy,w(1 ≤maxx,maxy≤ 105,1 ≤w≤ 107).OutputPrint on a single line two space-separated numbers, thexand they. If there are several possible variants, print any of them. If suchxandydo not exist, print a single number- 1.ExamplesInput2 2 1Output1 1Input132 10 35Output7 5Input5 18 1000Output-1Input48 132 235Output22 111", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5e600251", "template_md5": "35d339e4", "result": "You are given three integers: $max_x$, $max_y$, and $w$.  \n\nThe goal is to find the smallest possible values for $x$ and $y$ that satisfy the following conditions:\n\n*  $1 \\le x \\le max_x$\n*  $1 \\le y \\le max_y$\n*  There are at least $w$ lucky tickets.\n\nA lucky ticket is defined as a pair $(a, b)$ where $a * b = rev(a) * rev(b)$.  The function $rev(x)$ reverses the digits of a number $x$ (removing any leading zeros).\n\nIf no such $x$ and $y$ exist, output -1."}, {"prompt_md5": "3d8a3740", "template_md5": "465699a0", "result": "You need to find the smallest number of series and tickets to release, where each series has a maximum number of tickets and each ticket has a unique number.  A ticket is lucky if the product of its series number and ticket number equals the product of the reversed series number and reversed ticket number. You must release at least a given number of lucky tickets. If it's impossible to meet these conditions, output -1."}]}