{"uid": "70-D", "url": "https://codeforces.com/contest/70/problem/D", "tags": ["data structures", " geometry"], "title": "70-D", "statement": "D. Professor's tasktime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOnce a walrus professor Plato asked his programming students to perform the following practical task.The students had to implement such a data structure that would support a convex hull on some set of pointsS. The input to the program hadqqueries of two types:1. Add a point with coordinates(x,y)into the setS. Note that in this case the convex hull ofScould have changed, and could have remained the same.2. Say whether a point with coordinates(x,y)belongs to an area limited by the convex hull, including the border.All the students coped with the task. What about you?InputThe first line contains an integerq(4 ≤q≤ 105).Then followqlines in the following way: \"txy\", wheretis the query type (1 or 2), and(x,y)are the coordinates of the point (- 106≤x,y≤ 106,xandyare integers).There is at least one query of type 2.It is guaranteed that the three queries of the first type follow first and the points given in the queries form a non-degenerative triangle. Also all the points added inSare distinct.OutputFor each query of the second type print one string containing \"YES\", if the point lies inside the convex hull or on its border. Otherwise, print \"NO\".ExamplesInput81 0 01 2 01 2 22 1 01 0 22 1 12 2 12 20 -1OutputYESYESYESNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "07a1b9ea", "template_md5": "35d339e4", "result": "You are given a set of points.  You need to implement a data structure that can:\n\n1. **Add a point:**  Add a new point with coordinates ($x$, $y$) to the set. The convex hull of the set may change.\n2. **Check if a point is inside the convex hull:** Given a point with coordinates ($x$, $y$), determine if it lies inside the convex hull formed by the points in the set, including the boundary.\n\n**Input:**\n\n* The first line contains an integer $q$ (4 ≤ $q$ ≤ 10⁵) representing the number of queries.\n* The following $q$ lines each contain a query in the format \"t xy\", where:\n    * $t$ is 1 to add a point or 2 to check if a point is inside the hull.\n    * $x$ and $y$ are the coordinates of the point (-10⁶ ≤ $x$, $y$ ≤ 10⁶, and $x$ and $y$ are integers).\n\nThere is at least one query of type 2.\n\nThe first three queries of type 1 form a non-degenerate triangle. All points added to the set are distinct.\n\n**Output:**\n\nFor each query of type 2, print \"YES\" if the point is inside the convex hull or on its boundary, and \"NO\" otherwise."}, {"prompt_md5": "8b856b68", "template_md5": "465699a0", "result": "You are given a set of points.  You can add new points to the set.  For each point given, determine if it is inside or on the boundary of the shape formed by all the points."}]}