{"uid": "70-E", "url": "https://codeforces.com/contest/70/problem/E", "tags": ["dp", " implementation", " trees"], "title": "70-E", "statement": "E. Information Reformtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThought it is already the XXI century, the Mass Media isn't very popular in Walrusland. The cities get news from messengers who can only travel along roads. The network of roads in Walrusland is built so that it is possible to get to any city from any other one in exactly one way, and the roads' lengths are equal.The North Pole governor decided to carry out an information reform. Several cities were decided to be chosen and made regional centers. Maintaining a region center takeskfishlars (which is a local currency) per year. It is assumed that a regional center always has information on the latest news.For every city which is not a regional center, it was decided to appoint a regional center which will be responsible for keeping this city informed. In that case the maintenance costs will be equal todlenfishlars per year, wherelenis the distance from a city to the corresponding regional center, measured in the number of roads along which one needs to go.Your task is to minimize the costs to carry out the reform.InputThe first line contains two given numbersnandk(1 ≤n≤ 180, 1 ≤k≤ 105).The second line containsn- 1integersdi, numbered starting with 1 (di≤di+ 1, 0 ≤di≤ 105).Nextn- 1lines contain the pairs of cities connected by a road.OutputOn the first line print the minimum number of fishlars needed for a year's maintenance. On the second line printnnumbers, where thei-th number will represent the number of the regional center, appointed to thei-th city. If thei-th city is a regional center itself, then you should print numberi.If there are several solutions to that problem, print any of them.ExamplesInput8 102 5 9 11 15 19 201 41 31 74 62 82 33 5Output383 3 3 4 3 4 3 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d075d3b0", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ cities.  Each city is connected to exactly one other city by a road of equal length.  \n\nYou need to choose $k$ cities to be regional centers. Each regional center costs $k$ fishlars per year to maintain.  \n\nEach city not chosen as a regional center must be assigned to a regional center. The cost to assign a city to a regional center is equal to the number of roads between the city and its assigned regional center.\n\nFind the minimum total cost to maintain the regional centers and assign cities to them.\n\nOutput the minimum cost and a list of which city is assigned to which regional center."}, {"prompt_md5": "d62a7f10", "template_md5": "465699a0", "result": "You have a number of cities connected by roads.  You need to choose some cities to be regional centers, and each city not a center must be assigned to a center. The cost to maintain a center is a fixed amount, and the cost to connect a city to a center is based on the distance between them. Find the minimum total cost to set up the centers and connections."}]}