{"uid": "700-D", "url": "https://codeforces.com/contest/700/problem/D", "tags": ["data structures", " greedy"], "title": "700-D", "statement": "D. Huffman Coding on Segmenttime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice wants to send an important message to Bob. Messagea= (a1, ...,an)is a sequence of positive integers (characters).To compress the message Alice wants to use binary Huffman coding. We recall thatbinary Huffman code, orbinary prefix codeis a functionf, that maps each letter that appears in the string to some binary string (that is, string consisting of characters '0' and '1' only) such that for each pair of different charactersaiandajstringf(ai)is not a prefix off(aj)(and vice versa). The result of the encoding of the messagea1,a2, ...,anis the concatenation of the encoding of each character, that is the stringf(a1)f(a2)...f(an). Huffman codes are very useful, as the compressed message can be easily and uniquely decompressed, if the functionfis given. Code is usually chosen in order to minimize the total length of the compressed message, i.e. the length of the stringf(a1)f(a2)...f(an).Because of security issues Alice doesn't want to send the whole message. Instead, she picks some substrings of the message and wants to send them separately. For each of the given substringsali...arishe wants to know the minimum possible length of the Huffman coding. Help her solve this problem.InputThe first line of the input contains the single integern(1 ≤n≤ 100 000) — the length of the initial message. The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 100 000) — characters of the message.Next line contains the single integerq(1 ≤q≤ 100 000) — the number of queries.Then followqlines with queries descriptions. Thei-th of these lines contains two integersliandri(1 ≤li≤ri≤n) — the position of the left and right ends of thei-th substring respectively. Positions are numbered from1. Substrings may overlap in any way. The same substring may appear in the input more than once.OutputPrintqlines. Each line should contain a single integer — the minimum possible length of the Huffman encoding of the substringali...ari.ExampleInput71 2 1 3 1 2 151 71 33 52 44 4Output103350NoteIn the first query, one of the optimal ways to encode the substring is to map1to \"0\",2to \"10\" and3to \"11\".Note that it is correct to map the letter to the empty substring (as in the fifth query from the sample).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a238d23e", "template_md5": "35d339e4", "result": "You are given a sequence of positive integers.  You need to find the minimum length of a binary Huffman code for each given substring of this sequence.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100,000) representing the length of the sequence.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (1 ≤ $a_i$ ≤ 100,000) representing the sequence.\n* The third line contains an integer $q$ (1 ≤ $q$ ≤ 100,000) representing the number of queries.\n* Each of the following $q$ lines contains two integers $l_i$ and $r_i$ (1 ≤ $l_i$ ≤ $r_i$ ≤ $n$) representing the start and end positions of a substring.\n\n**Output:**\n\nPrint $q$ lines, each containing an integer representing the minimum length of the Huffman code for the corresponding substring."}, {"prompt_md5": "46b17cd2", "template_md5": "465699a0", "result": "Given a sequence of numbers, find the minimum length of a compressed version of each specified sub-sequence using a special code where each number is represented by a unique binary string."}]}