{"uid": "700-C", "url": "https://codeforces.com/contest/700/problem/C", "tags": ["dfs and similar", " graphs"], "title": "700-C", "statement": "C. Break Uptime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAgain, there are hard times in Berland! Many towns have such tensions that even civil war is possible.There arentowns in Reberland, some pairs of which connected by two-way roads. It is not guaranteed that it is possible to reach one town from any other town using these roads.Townssandtannounce the final break of any relationship and intend to rule out the possibility of moving between them by the roads. Now possibly it is needed to close several roads so that moving fromstotusing roads becomes impossible. Each town agrees to spend money on closing no more than one road, therefore, the total number of closed roads will beno more than two.Help them find set of no more than two roads such that there will be no way betweensandtafter closing these roads. For each road the budget required for its closure was estimated. Among all sets find such that the total budget for the closure of a set of roads is minimum.InputThe first line of the input contains two integersnandm(2 ≤n≤ 1000,0 ≤m≤ 30 000) — the number of towns in Berland and the number of roads.The second line contains integerssandt(1 ≤s,t≤n,s≠t) — indices of towns which break up the relationships.Then followmlines, each of them contains three integersxi,yiandwi(1 ≤xi,yi≤n,1 ≤wi≤ 109) — indices of towns connected by thei-th road, and the budget on its closure.All roads are bidirectional. It is allowed that the pair of towns is connected by more than one road. Roads that connect the city to itself are allowed.OutputIn the first line print the minimum budget required to break up the relations betweensandt, if it is allowed to close no more than two roads.In the second line print the valuec(0 ≤c≤ 2) — the number of roads to be closed in the found solution.In the third line print in any ordercdiverse integers from1tom— indices of closed roads. Consider that the roads are numbered from1tomin the order they appear in the input.If it is impossible to make townssandtdisconnected by removing no more than2roads, the output should contain a single line-1.If there are several possible answers, you may print any of them.ExamplesInput6 71 62 1 62 3 53 4 94 6 44 6 54 5 13 1 3Output822 7Input6 71 62 3 11 2 21 3 34 5 43 6 54 6 61 5 7Output924 5Input5 41 52 1 33 2 13 4 44 5 2Output112Input2 31 21 2 7344588401 2 8173800271 2 304764803Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ccf9ff45", "template_md5": "35d339e4", "result": "There are $n$ towns and $m$ roads connecting them. Some pairs of towns want to cut off all connections between them.  They can each choose to close at most one road.  \n\nFind the minimum total cost to close roads so that it's impossible to travel between the two specified towns.\n\nThe input will list:\n\n* $n$ and $m$ (the number of towns and roads)\n* The two towns that want to be disconnected\n* For each road:\n    * The two towns the road connects\n    * The cost to close that road\n\nThe output should be:\n\n* The minimum total cost to disconnect the two towns\n* The number of roads that need to be closed\n* The indices of the roads to be closed \n\nIf it's impossible to disconnect the towns by closing two or fewer roads, output -1."}, {"prompt_md5": "ce5296ec", "template_md5": "465699a0", "result": "You are given a network of cities connected by roads. Some pairs of cities want to cut off all connections between them. They can each choose to close at most one road. Find the minimum total cost to close roads so that the chosen cities are completely disconnected."}]}