{"uid": "700-E", "url": "https://codeforces.com/contest/700/problem/E", "tags": ["string suffix structures", " strings"], "title": "700-E", "statement": "E. Cool Sloganstime limit per test4 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputBomboslav set up a branding agency and now helps companies to create new logos and advertising slogans. In term of this problems,sloganof the company should be a non-empty substring of its name. For example, if the company name is \"hornsandhoofs\", then substrings \"sand\" and \"hor\" could be its slogans, while strings \"e\" and \"hornss\" can not.Sometimes the company performs rebranding and changes its slogan. SloganAis considered to becoolerthan sloganBifBappears inAas a substringat least twice(this occurrences are allowed to overlap). For example, sloganA=\"abacaba\" is cooler than sloganB=\"ba\", sloganA=\"abcbcbe\" is cooler than sloganB=\"bcb\", but sloganA=\"aaaaaa\" is not cooler than sloganB=\"aba\".You are given the company namewand your task is to help Bomboslav determine the length of the longest sequence of sloganss1,s2, ...,sk, such that any slogan in the sequence is cooler than the previous one.InputThe first line of the input contains a single integern(1 ≤n≤ 200 000) — the length of the company name that asks Bomboslav to help. The second line contains the stringwof lengthn, that consists of lowercase English letters.OutputPrint a single integer — the maximum possible length of the sequence of slogans of the company namedw, such that any slogan in the sequence (except the first one) is cooler than the previousExamplesInput3abcOutput1Input5dddddOutput5Input11abracadabraOutput3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "10078448", "template_md5": "35d339e4", "result": "Given a string $w$ of length $n$, find the maximum length of a sequence of substrings of $w$ (called slogans) such that:\n\n* Each slogan is a non-empty substring of $w$.\n* Each slogan in the sequence (except the first one) is a substring of the previous slogan at least twice. \n\n\nFor example:\n\n* If $w = \"abacaba\"$, the longest possible sequence is of length 1 (e.g., \"abacaba\").\n* If $w = \"ddddd\"$, the longest possible sequence is of length 5 (e.g., \"ddddd\"). \n* If $w = \"abracadabra\"$, the longest possible sequence is of length 3 (e.g., \"abra\", \"bra\", \"ra\")."}, {"prompt_md5": "8288056e", "template_md5": "465699a0", "result": "Given a string, find the longest sequence of substrings (slogans) where each slogan is a substring of the original string and each slogan is \"cooler\" than the one before it. A slogan is cooler if it appears at least twice within the previous slogan."}]}