{"uid": "702-C", "url": "https://codeforces.com/contest/702/problem/C", "tags": ["binary search", " implementation", " two pointers"], "title": "702-C", "statement": "C. Cellular Networktime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are givennpoints on the straight line — the positions (x-coordinates) of the cities andmpoints on the same line — the positions (x-coordinates) of the cellular towers. All towers work in the same way — they provide cellular network for all cities, which are located at the distance which is no more thanrfrom this tower.Your task is to find minimalrthat each city has been provided by cellular network, i.e. for each city there is at least one cellular tower at the distance which is no more thanr.Ifr= 0then a tower provides cellular network only for the point where it is located. One tower can provide cellular network for any number of cities, but all these cities must be at the distance which is no more thanrfrom this tower.InputThe first line contains two positive integersnandm(1 ≤n,m≤ 105) — the number of cities and the number of cellular towers.The second line contains a sequence ofnintegersa1,a2, ...,an(- 109≤ai≤ 109) — the coordinates of cities. It is allowed that there are any number of cities in the same point. All coordinatesaiare given in non-decreasing order.The third line contains a sequence ofmintegersb1,b2, ...,bm(- 109≤bj≤ 109) — the coordinates of cellular towers. It is allowed that there are any number of towers in the same point. All coordinatesbjare given in non-decreasing order.OutputPrint minimalrso that each city will be covered by cellular network.ExamplesInput3 2-2 2 4-3 0Output4Input5 31 5 10 14 174 11 15Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "05c637fe", "template_md5": "35d339e4", "result": "You are given $n$ points on a line representing the locations of cities and $m$ points on the same line representing the locations of cellular towers. Each tower provides cellular service to all cities within a distance of $r$ from the tower. \n\nFind the smallest possible value of $r$ so that every city has at least one tower within a distance of $r$.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 10^5$), representing the number of cities and towers, respectively.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (-10⁹ ≤ $a_i$ ≤ 10⁹), representing the coordinates of the cities.\n* The third line contains $m$ integers $b_1, b_2, ..., b_m$ (-10⁹ ≤ $b_j$ ≤ 10⁹), representing the coordinates of the towers.\n\n**Output:**\n\nPrint the smallest possible value of $r$."}, {"prompt_md5": "560cd41c", "template_md5": "465699a0", "result": "You have a list of city locations and a list of tower locations along a line.  Each tower provides service to cities within a certain radius. Find the smallest radius that ensures every city has at least one tower within its range."}]}