{"uid": "702-D", "url": "https://codeforces.com/contest/702/problem/D", "tags": ["math"], "title": "702-D", "statement": "D. Road to Post Officetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasiliy has a car and he wants to get from home to the post office. The distance which he needs to pass equals todkilometers.Vasiliy's car is not new — it breaks after driven everykkilometers and Vasiliy needstseconds to repair it. After repairing his car Vasiliy can drive again (but afterkkilometers it will break again, and so on). In the beginning of the trip the car is just from repair station.To drive one kilometer on car Vasiliy spendsaseconds, to walk one kilometer on foot he needsbseconds (a<b).Your task is to find minimal time after which Vasiliy will be able to reach the post office. Consider that in every moment of time Vasiliy can left his car and start to go on foot.InputThe first line contains 5 positive integersd,k,a,b,t(1 ≤d≤ 1012;1 ≤k,a,b,t≤ 106;a<b), where:d— the distance from home to the post office;k— the distance, which car is able to drive before breaking;a— the time, which Vasiliy spends to drive 1 kilometer on his car;b— the time, which Vasiliy spends to walk 1 kilometer on foot;t— the time, which Vasiliy spends to repair his car.OutputPrint the minimal time after which Vasiliy will be able to reach the post office.ExamplesInput5 2 1 4 10Output14Input5 2 1 4 5Output13NoteIn the first example Vasiliy needs to drive the first 2 kilometers on the car (in 2 seconds) and then to walk on foot 3 kilometers (in 12 seconds). So the answer equals to 14 seconds.In the second example Vasiliy needs to drive the first 2 kilometers on the car (in 2 seconds), then repair his car (in 5 seconds) and drive 2 kilometers more on the car (in 2 seconds). After that he needs to walk on foot 1 kilometer (in 4 seconds). So the answer equals to 13 seconds.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8606df47", "template_md5": "35d339e4", "result": "You are given a distance $d$ to travel. You have a car that can travel $k$ kilometers before breaking down. It takes $t$ seconds to repair the car.  Driving 1 kilometer in the car takes $a$ seconds, while walking 1 kilometer takes $b$ seconds ($a < b$).\n\nYou can choose to walk or drive at any point. Find the minimum time it takes to reach the destination."}, {"prompt_md5": "cb116144", "template_md5": "465699a0", "result": "You have a distance to travel. You can travel in a car that breaks every certain distance, requiring a repair time. You can also walk.  Find the fastest way to reach your destination, considering the time it takes to drive, walk, and repair the car."}]}