{"uid": "702-E", "url": "https://codeforces.com/contest/702/problem/E", "tags": ["data structures", " graphs"], "title": "702-E", "statement": "E. Analysis of Pathes in Functional Graphtime limit per test2 secondsmemory limit per test512 megabytesinputstdinoutputstdoutYou are given afunctional graph. It is a directed graph, in which from each vertex goes exactly one arc. The vertices are numerated from0ton- 1.Graph is given as the arrayf0,f1, ...,fn- 1, wherefi— the number of vertex to which goes the only arc from the vertexi. Besides you are given array with weights of the arcsw0,w1, ...,wn- 1, wherewi— the arc weight fromitofi.The graph from the first sample test.Also you are given the integerk(the length of the path) and you need to find for each vertex two numberssiandmi, where:si— the sum of the weights of all arcs of the path with length equals tokwhich starts from the vertexi;mi— the minimal weight from all arcs on the path with lengthkwhich starts from the vertexi.The length of the path is the number of arcs on this path.InputThe first line contains two integersn,k(1 ≤n≤ 105, 1 ≤k≤ 1010). The second line contains the sequencef0,f1, ...,fn- 1(0 ≤fi<n) and the third — the sequencew0,w1, ...,wn- 1(0 ≤wi≤ 108).OutputPrintnlines, the pair of integerssi,miin each line.ExamplesInput7 31 2 3 4 3 2 66 3 1 4 2 2 3Output10 18 17 110 28 27 19 3Input4 40 1 2 30 1 2 3Output0 04 18 212 3Input5 31 2 3 4 04 1 2 14 3Output7 117 119 221 38 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a2729546", "template_md5": "35d339e4", "result": "You are given a directed graph with $n$ vertices numbered from 0 to $n-1$.  Each vertex has exactly one outgoing edge. The graph is represented by two arrays:\n\n*  $f_0, f_1, ..., f_{n-1}$:  where $f_i$ is the destination vertex of the edge coming out of vertex $i$.\n* $w_0, w_1, ..., w_{n-1}$: where $w_i$ is the weight of the edge from vertex $i$ to vertex $f_i$.\n\nYou are also given an integer $k$ (the length of the path).\n\nFor each vertex $i$, find:\n\n* $s_i$: the sum of the weights of all paths of length $k$ starting at vertex $i$.\n* $m_i$: the minimum weight of all paths of length $k$ starting at vertex $i$.\n\n\n\nOutput $n$ lines, one for each vertex, containing the pair $(s_i, m_i)$."}, {"prompt_md5": "45181cb3", "template_md5": "465699a0", "result": "You are given a directed graph where each node has exactly one outgoing edge.  You are also given weights for each edge.  Find for each node the sum of the weights of all paths of a given length and the minimum weight of any path of that length starting at that node."}]}