{"uid": "702-F", "url": "https://codeforces.com/contest/702/problem/F", "tags": ["data structures"], "title": "702-F", "statement": "F. T-Shirtstime limit per test4 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputThe big consignment of t-shirts goes on sale in the shop before the beginning of the spring. In allntypes of t-shirts go on sale. The t-shirt of thei-th type has two integer parameters —ciandqi, whereci— is the price of thei-th type t-shirt,qi— is the quality of thei-th type t-shirt. It should be assumed that the unlimited number of t-shirts of each type goes on sale in the shop, but in general the quality is not concerned with the price.As predicted,kcustomers will come to the shop within the next month, thej-th customer will get ready to spend up tobjon buying t-shirts.All customers have the same strategy. First of all, the customer wants to buy the maximum possible number of the highest quality t-shirts, then to buy the maximum possible number of the highest quality t-shirts from residuary t-shirts and so on. At the same time among several same quality t-shirts the customer will buy one that is cheaper. The customers don't like the same t-shirts, so each customer will not buy more than one t-shirt of one type.Determine the number of t-shirts which each customer will buy, if they use the described strategy. All customers act independently from each other, and the purchase of one does not affect the purchase of another.InputThe first line contains the positive integern(1 ≤n≤ 2·105) — the number of t-shirt types.Each of the followingnlines contains two integersciandqi(1 ≤ci,qi≤ 109) — the price and the quality of thei-th type t-shirt.The next line contains the positive integerk(1 ≤k≤ 2·105) — the number of the customers.The next line containskpositive integersb1,b2, ...,bk(1 ≤bj≤ 109), where thej-th number is equal to the sum, which thej-th customer gets ready to spend on t-shirts.OutputThe first line of the input data should contain the sequence ofkintegers, where thei-th number should be equal to the number of t-shirts, which thei-th customer will buy.ExamplesInput37 53 54 3213 14Output2 3Input2100 50050 499450 200 150 100Output1 2 2 1NoteIn the first example the first customer will buy the t-shirt of the second type, then the t-shirt of the first type. He will spend 10 and will not be able to buy the t-shirt of the third type because it costs 4, and the customer will owe only 3. The second customer will buy all three t-shirts (at first, the t-shirt of the second type, then the t-shirt of the first type, and then the t-shirt of the third type). He will spend all money on it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8ad2f098", "template_md5": "35d339e4", "result": "There are $n$ types of t-shirts, each with a price $c_i$ and a quality $q_i$.  There are $k$ customers, each with a budget $b_j$.  \n\nCustomers buy t-shirts in the following way:\n\n1. They buy as many of the highest quality t-shirts as they can afford.\n2. If there are ties in quality, they buy the cheapest t-shirt of that quality.\n3. They only buy one t-shirt of each type.\n\nDetermine how many t-shirts each customer will buy. \n\n\nInput:\n\n* The first line contains $n$ (the number of t-shirt types).\n* The next $n$ lines each contain two integers, $c_i$ and $q_i$ (the price and quality of the $i$-th t-shirt).\n* The next line contains $k$ (the number of customers).\n* The next line contains $k$ integers, $b_1, b_2, ..., b_k$ (the budget of each customer).\n\nOutput:\n\n* The first line contains $k$ integers, where the $i$-th integer is the number of t-shirts the $i$-th customer will buy."}, {"prompt_md5": "b1af0a6e", "template_md5": "465699a0", "result": "There are many types of items for sale, each with a price and a quality rating. Customers have a limited budget and want to buy the highest quality items they can afford, prioritizing higher quality over lower quality.  Determine how many items each customer will buy given their budget and the prices and qualities of the items."}]}