{"uid": "703-E", "url": "https://codeforces.com/contest/703/problem/E", "tags": ["dp", " number theory"], "title": "703-E", "statement": "E. Mishka and Divisorstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter playing with her beautiful array, Mishka decided to learn some math. After learning how to multiply, divide and what is divisibility, she is now interested in solving the following problem.You are given integerkand arraya1,a2, ...,anofnintegers. You are to findnon-emptysubsequence of array elements such that the product of its elements is divisible bykand it contains minimum possible number of elements.Formally, you are to find a sequence of indices1 ≤i1<i2< ... <im≤nsuch thatis divisible bykwhilemis minimum possible among all such variants.If there are more than one such subsequences, you should choose one among them, such that sum of its elements isminimum possible.Mishka quickly solved this problem. Will you do so?InputThe first line of the input contains two integersnandk(1 ≤n≤ 1 000,1 ≤k≤ 1012).The second line of the input containsnintegersa1,a2, ...,an(1 ≤ai≤ 1012) — array elements.OutputPrint single positive integermin the first line — the number of elements in desired sequence.In the second line printmdistinct integers — the sequence of indices of given array elements, which should be taken into the desired sequence.If there are more than one such subsequence (e.g. subsequence of minimum possible number of elements and with minimum possible sum of elements), you can print any of them.If there are no such subsequences, print- 1in the only line.ExampleInput5 602 4 6 5 2Output34 3 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "102ee47b", "template_md5": "35d339e4", "result": "You are given an integer $k$ and an array of $n$ integers.  Find the shortest subsequence of the array whose product is divisible by $k$. If there are multiple shortest subsequences, choose the one with the smallest sum of elements. If no such subsequence exists, output -1.\n\nOutput the length of the shortest subsequence and the indices of the elements in that subsequence."}, {"prompt_md5": "05aca49b", "template_md5": "465699a0", "result": "Given a list of numbers and a target number, find the shortest list of numbers from the original list that multiplies to a number divisible by the target number. If there are multiple shortest lists, choose the one with the smallest sum. If no such list exists, output -1."}]}