{"uid": "704-D", "url": "https://codeforces.com/contest/704/problem/D", "tags": ["flows", " greedy"], "title": "704-D", "statement": "D. Captain Americatime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSteve Rogers is fascinated with new vibranium shields S.H.I.E.L.D gave him. They're all uncolored. There arenshields in total, thei-th shield is located at point(xi,yi)of the coordinate plane. It's possible that two or more shields share the same location.Steve wants to paint all these shields. He paints each shield in either red or blue. Painting a shield in red costsrdollars while painting it in blue costsbdollars.Additionally, there aremconstraints Steve wants to be satisfied. Thei-th constraint is provided by three integersti,lianddi:Ifti= 1, then the absolute difference between the number of red and blue shields on linex=lishould not exceeddi.Ifti= 2, then the absolute difference between the number of red and blue shields on liney=lishould not exceeddi.Steve gave you the task of finding the painting that satisfies all the condition and the total cost is minimum.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 100 000) — the number of shields and the number of constraints respectively.The second line contains two integersrandb(1 ≤r,b≤ 109).The nextnlines contain the shields coordinates. Thei-th of these lines contains two integersxiandyi(1 ≤xi,yi≤ 109).The nextmlines contain the constrains. Thej-th of these lines contains three integerstj,ljanddj(1 ≤tj≤ 2, 1 ≤lj≤ 109, 0 ≤dj≤n).OutputIf satisfying all the constraints is impossible print-1in first and only line of the output.Otherwise, print the minimum total cost in the first line of output. In the second line print a string of lengthnconsisting of letters 'r' and 'b' only. Thei-th character should be 'r' if thei-th shield should be painted red in the optimal answer and 'b' if it should be painted blue. The cost of painting shields in these colors should be equal the minimum cost you printed on the first line.If there exist more than one optimal solution, print any of them.ExamplesInput5 68 32 101 59 109 102 81 9 11 2 12 10 32 10 21 1 12 5 2Output25rbrbbInput4 47 310 39 810 32 82 8 02 8 01 2 01 9 0Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2bf8c039", "template_md5": "35d339e4", "result": "There are $n$ objects located at points $(x_i, y_i)$ on a 2D plane.  You need to color each object either red or blue.  \n\n* Red coloring costs $r$ dollars.\n* Blue coloring costs $b$ dollars.\n\nThere are $m$ constraints. Each constraint is defined by three numbers:\n\n* $t_j$:  Indicates the type of constraint.\n    * If $t_j = 1$, the constraint is on a vertical line ($x = l_j$). The absolute difference between the number of red and blue objects on this line must not exceed $d_j$.\n    * If $t_j = 2$, the constraint is on a horizontal line ($y = l_j$). The absolute difference between the number of red and blue objects on this line must not exceed $d_j$.\n\nFind the coloring that satisfies all the constraints and minimizes the total cost. If it's impossible to satisfy all constraints, output -1. Otherwise, output the minimum cost and the coloring scheme (a string of 'r's and 'b's representing the color of each object)."}, {"prompt_md5": "f2130f71", "template_md5": "465699a0", "result": "You have a set of items and need to assign them to two categories (red or blue) while minimizing the cost. Each item has a cost to assign to each category. There are also rules that limit the difference in the number of items in each category within certain groups. Find the minimum cost assignment that satisfies all the rules. If it's impossible to satisfy all the rules, output -1."}]}