{"uid": "704-E", "url": "https://codeforces.com/contest/704/problem/E", "tags": ["data structures", " geometry", " trees"], "title": "704-E", "statement": "E. Iron Mantime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTony Stark is playing a game with his suits (they have auto-pilot now). He lives in Malibu. Malibu hasnjunctions numbered from1ton, connected withn- 1roads. One can get from a junction to any other junction using these roads (graph of Malibu forms a tree).Tony hasmsuits. There's a special plan for each suit. Thei-th suit will appear at the moment of timetiin the junctionvi, and will move to junctionuiusing the shortest path betweenvianduiwith the speedciroads per second (passing a junctions takes no time), and vanishing immediately when arriving atui(if it reachesuiin timeq, it's available there at momentq, but not in further moments). Also, suits move continuously (for example ifvi≠ui, at timeit's in the middle of a road. Please note that ifvi=uiit means the suit will be at junction numbervionly at momenttiand then it vanishes.An explosion happens if at any moment of time two suits share the same exact location (it may be in a junction or somewhere on a road; while appearing, vanishing or moving).Your task is to tell Tony the moment of the the first explosion (if there will be any).InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 100 000) — the number of junctions and the number of suits respectively.The nextn- 1lines contain the roads descriptions. Each line contains two integersaiandbi— endpoints of thei-th road (1 ≤ai,bi≤n,ai≠bi).The nextmlines contain the suit descriptions. Thei-th of them contains four integersti,ci,viandui(0 ≤ti≤ 10 000, 1 ≤ci≤ 10 000,1 ≤vi,ui≤n), meaning thei-th suit will appear at moment of timetiat the junctionviand will move to the junctionuiwith a speedciroads per second.OutputIf there would be no explosions at all, print-1in the first and only line of output.Otherwise print the moment of the first explosion.Your answer will be considered correct if its relative or absolute error doesn't exceed10- 6.ExamplesInput6 42 56 53 64 64 127 6 1 39 5 1 627 4 3 411 29 2 6Output27.3Input6 43 14 56 46 12 616 4 4 513 20 6 23 16 4 528 5 3 5Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0c6a9615", "template_md5": "35d339e4", "result": "There are $n$ junctions connected by $n-1$ roads, forming a tree.  \n\n$m$ suits will appear at different times ($t_i$) at different junctions ($v_i$) and travel to other junctions ($u_i$) at a constant speed ($c_i$).  \n\nEach suit travels along the shortest path between its starting and ending junctions.  \n\nDetermine the first time two suits occupy the same location (junction or on a road) simultaneously. If this never happens, output -1."}, {"prompt_md5": "d9ce9502", "template_md5": "465699a0", "result": "You are given a tree with nodes and edges. Each edge has a weight.  There are also objects that move along the edges at different speeds. Each object starts at a node at a specific time and travels to another node along the shortest path. If two objects occupy the same node at the same time, an explosion occurs. Find the time of the first explosion, or -1 if there are no explosions."}]}