{"uid": "706-A", "url": "https://codeforces.com/contest/706/problem/A", "tags": ["brute force", " geometry", " implementation"], "title": "706-A", "statement": "A. Beru-taxitime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasiliy lives at point(a,b)of the coordinate plane. He is hurrying up to work so he wants to get out of his house as soon as possible. New app suggestednavailable Beru-taxi nearby. Thei-th taxi is located at point(xi,yi)and moves with a speedvi.Consider that each ofndrivers will move directly to Vasiliy and with a maximum possible speed. Compute the minimum time when Vasiliy will get in any of Beru-taxi cars.InputThe first line of the input contains two integersaandb(- 100 ≤a,b≤ 100) — coordinates of Vasiliy's home.The second line contains a single integern(1 ≤n≤ 1000) — the number of available Beru-taxi cars nearby.Thei-th of the followingnlines contains three integersxi,yiandvi(- 100 ≤xi,yi≤ 100,1 ≤vi≤ 100) — the coordinates of thei-th car and its speed.It's allowed that several cars are located at the same point. Also, cars may be located at exactly the same point where Vasiliy lives.OutputPrint a single real value — the minimum time Vasiliy needs to get in any of the Beru-taxi cars. You answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput0 022 0 10 2 2Output1.00000000000000000000Input1 333 3 2-2 3 6-2 7 10Output0.50000000000000000000NoteIn the first sample, first taxi will get to Vasiliy in time2, and second will do this in time1, therefore1is the answer.In the second sample, cars2and3will arrive simultaneously.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7336bc98", "template_md5": "35d339e4", "result": "You are given a point $(a, b)$ representing a location. There are $n$ taxis, each located at a point $(x_i, y_i)$ and moving with a speed $v_i$.  Each taxi will move directly to the given point $(a, b)$ at its maximum speed.\n\nFind the minimum time it takes for any of the taxis to reach the point $(a, b)$."}, {"prompt_md5": "e3283e9f", "template_md5": "465699a0", "result": "You are given a location and the locations and speeds of multiple moving objects. Find the shortest time it takes for one of the objects to reach the given location."}]}