{"uid": "706-C", "url": "https://codeforces.com/contest/706/problem/C", "tags": ["dp", " strings"], "title": "706-C", "statement": "C. Hard problemtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasiliy is fond of solving different tasks. Today he found one he wasn't able to solve himself, so he asks you to help.Vasiliy is givennstrings consisting of lowercase English letters. He wants them to be sorted in lexicographical order (as in the dictionary), but he is not allowed to swap any of them. The only operation he is allowed to do is to reverse any of them (first character becomes last, second becomes one before last and so on).To reverse thei-th string Vasiliy has to spentciunits of energy. He is interested in the minimum amount of energy he has to spent in order to have strings sorted in lexicographical order.StringAis lexicographically smaller than stringBif it is shorter thanB(|A| < |B|) and is its prefix, or if none of them is a prefix of the other and at the first position where they differ character inAis smaller than the character inB.For the purpose of this problem, two equal strings nearby do not break the condition of sequence being sorted lexicographically.InputThe first line of the input contains a single integern(2 ≤n≤ 100 000) — the number of strings.The second line containsnintegersci(0 ≤ci≤ 109), thei-th of them is equal to the amount of energy Vasiliy has to spent in order to reverse thei-th string.Then follownlines, each containing a string consisting of lowercase English letters. The total length of these strings doesn't exceed100 000.OutputIf it is impossible to reverse some of the strings such that they will be located in lexicographical order, print- 1. Otherwise, print the minimum total amount of energy Vasiliy has to spent.ExamplesInput21 2baacOutput1Input31 3 1aabaacOutput1Input25 5bbbaaaOutput-1Input23 3aaaaaOutput-1NoteIn the second sample one has to reverse string2or string3. To amount of energy required to reverse the string3is smaller.In the third sample, both strings do not change after reverse and they go in the wrong order, so the answer is- 1.In the fourth sample, both strings consists of characters 'a' only, but in the sorted order string \"aa\" should go before string \"aaa\", thus the answer is- 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b70c25ae", "template_md5": "35d339e4", "result": "You are given $n$ strings consisting of lowercase English letters. You can reverse any string by swapping its first and last characters, second and second-to-last characters, and so on.  The cost of reversing the $i$-th string is $c_i$.\n\nYour goal is to find the minimum total cost to reverse the strings so that they are sorted in lexicographical order (dictionary order).\n\nIf it is impossible to sort the strings using only reversals, output $-1$.\n\n**Input:**\n\n* The first line contains an integer $n$ ($2 \\le n \\le 100,000$) - the number of strings.\n* The second line contains $n$ integers $c_i$ ($0 \\le c_i \\le 10^9$) - the cost of reversing the $i$-th string.\n* The following $n$ lines each contain a string of lowercase English letters.\n\n**Output:**\n\n* The minimum total cost to sort the strings lexicographically, or $-1$ if it is impossible."}, {"prompt_md5": "d5b9bffe", "template_md5": "465699a0", "result": "You are given a list of words. You can reverse each word individually, but you cannot swap the order of the words.  Find the minimum total energy cost to reverse the words so they are in alphabetical order. If it's impossible to sort them this way, output -1."}]}