{"uid": "707-D", "url": "https://codeforces.com/contest/707/problem/D", "tags": ["bitmasks", " data structures", " dfs and similar", " implementation"], "title": "707-D", "statement": "D. Persistent Bookcasetime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputRecently in school Alina has learned what are thepersistent data structures: they are data structures that always preserves the previous version of itself and access to it when it is modified.After reaching home Alina decided to invent her own persistent data structure. Inventing didn't take long: there is a bookcase right behind her bed. Alina thinks that the bookcase is a good choice for a persistent data structure. Initially the bookcase is empty, thus there is no book at any position at any shelf.The bookcase consists ofnshelves, and each shelf has exactlympositions for books at it. Alina enumerates shelves by integers from1tonand positions at shelves — from1tom. Initially the bookcase is empty, thus there is no book at any position at any shelf in it.Alina wrote downqoperations, which will be consecutively applied to the bookcase. Each of the operations has one of four types:1ij— Place a book at positionjat shelfiif there is no book at it.2ij— Remove the book from positionjat shelfiif there is a book at it.3i— Invert book placing at shelfi. This means that from every position at shelfiwhich has a book at it, the book should be removed, and at every position at shelfiwhich has not book at it, a book should be placed.4k— Return the books in the bookcase in a state they were after applyingk-th operation. In particular,k= 0means that the bookcase should be in initial state, thus every book in the bookcase should be removed from its position.After applying each of operation Alina is interested in the number of books in the bookcase. Alina got 'A' in the school and had no problem finding this values. Will you do so?InputThe first line of the input contains three integersn,mandq(1 ≤n,m≤ 103,1 ≤q≤ 105) — the bookcase dimensions and the number of operations respectively.The nextqlines describes operations in chronological order —i-th of them describesi-th operation in one of the four formats described in the statement.It is guaranteed that shelf indices and position indices are correct, and in each of fourth-type operation the numberkcorresponds to some operation before it or equals to0.OutputFor each operation, print the number of books in the bookcase after applying it in a separate line. The answers should be printed in chronological order.ExamplesInput2 3 31 1 13 24 0Output140Input4 2 63 22 2 23 33 22 2 23 2Output213324Input2 2 23 22 2 1Output21NoteThis image illustrates the second sample case.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8640e05d", "template_md5": "35d339e4", "result": "You are given a bookcase with $n$ shelves and $m$ positions on each shelf. Initially, the bookcase is empty.\n\nThere are $q$ operations to be performed on the bookcase. Each operation can be one of the following types:\n\n1. **Place a book:** Place a book at position $j$ on shelf $i$ if there is no book there already.\n2. **Remove a book:** Remove the book from position $j$ on shelf $i$ if there is a book there.\n3. **Invert shelf:** For shelf $i$, remove all books from positions that have books and place a book in all positions that are empty.\n4. **Query:** Return the number of books in the bookcase after applying the $k$-th operation. $k=0$ means the initial state (empty bookcase).\n\nAfter each operation, output the number of books in the bookcase."}, {"prompt_md5": "f51c2e36", "template_md5": "465699a0", "result": "You are given a grid of shelves and positions. You can perform the following operations:\n\n1. Place a book at a position if it's empty.\n2. Remove a book from a position if it's occupied.\n3. Flip the state of all books on a shelf (empty becomes occupied, occupied becomes empty).\n4. Return the grid to the state it was in after a specific previous operation.\n\nAfter each operation, count the total number of books on the grid."}]}