{"uid": "707-A", "url": "https://codeforces.com/contest/707/problem/A", "tags": ["implementation"], "title": "707-A", "statement": "A. Brain's Photostime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSmall, but very brave, mouse Brain was not accepted to summer school of young villains. He was upset and decided to postpone his plans of taking over the world, but to become a photographer instead.As you may know, the coolest photos are on the film (because you can specify the hashtag #film for such).Brain took a lot of colourful pictures on colored and black-and-white film. Then he developed and translated it into a digital form. But now, color and black-and-white photos are in one folder, and to sort them, one needs to spend more than one hour!As soon as Brain is a photographer not programmer now, he asks you to help him determine for asinglephoto whether it is colored or black-and-white.Photo can be represented as a matrix sizedn×m, and each element of the matrix stores a symbol indicating corresponding pixel color. There are only6colors:'C' (cyan)'M' (magenta)'Y' (yellow)'W' (white)'G' (grey)'B' (black)The photo is considered black-and-white if it has only white, black and grey pixels in it. If there are any of cyan, magenta or yellow pixels in the photo then it is considered colored.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 100) — the number of photo pixel matrix rows and columns respectively.Thennlines describing matrix rows follow. Each of them containsmspace-separated characters describing colors of pixels in a row. Each character in the line is one of the 'C', 'M', 'Y', 'W', 'G' or 'B'.OutputPrint the \"#Black&White\" (without quotes), if the photo is black-and-white and \"#Color\" (without quotes), if it is colored, in the only line.ExamplesInput2 2C MY YOutput#ColorInput3 2W WW WB BOutput#Black&WhiteInput1 1WOutput#Black&White", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6ed3151f", "template_md5": "35d339e4", "result": "You are given a matrix of size $n \\times m$ representing a photo. Each cell in the matrix contains a character representing a color: 'C' (cyan), 'M' (magenta), 'Y' (yellow), 'W' (white), 'G' (grey), or 'B' (black).\n\nDetermine if the photo is black-and-white or colored. A photo is black-and-white if it contains only white, black, and grey pixels. Otherwise, it is colored.\n\nOutput \"#Black&White\" if the photo is black-and-white and \"#Color\" if it is colored."}, {"prompt_md5": "4011c4d7", "template_md5": "465699a0", "result": "Determine if a picture is black and white or colored based on the colors of its pixels. \nA picture is black and white if it only contains white, black, and grey pixels. Otherwise, it is colored."}]}