{"uid": "708-C", "url": "https://codeforces.com/contest/708/problem/C", "tags": ["data structures", " dfs and similar", " dp", " graphs", " greedy", " trees"], "title": "708-C", "statement": "C. Centroidstime limit per test4 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputTreeis a connected acyclic graph. Suppose you are given a tree consisting ofnvertices. The vertex of this tree is calledcentroidif the size of each connected component that appears if this vertex is removed from the tree doesn't exceed.You are given a tree of sizenand can perform no more than one edge replacement.Edge replacementis the operation of removing one edge from the tree (without deleting incident vertices) and inserting one new edge (without adding new vertices) in such a way that the graph remains a tree. For each vertex you have to determine if it's possible to make it centroid by performing no more than one edge replacement.InputThe first line of the input contains an integern(2 ≤n≤ 400 000) — the number of vertices in the tree. Each of the nextn- 1lines contains a pair of vertex indicesuiandvi(1 ≤ui,vi≤n) — endpoints of the corresponding edge.OutputPrintnintegers. Thei-th of them should be equal to1if thei-th vertex can be made centroid by replacing no more than one edge, and should be equal to0otherwise.ExamplesInput31 22 3Output1 1 1Input51 21 31 41 5Output1 0 0 0 0NoteIn the first sample each vertex can be made a centroid. For example, in order to turn vertex1to centroid one have to replace the edge(2, 3)with the edge(1, 3).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8d83e4de", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices ($2 \\le n \\le 400,000$).  A vertex is a centroid if removing it from the tree results in connected components with sizes no larger than  $\\frac{n}{2}$.\n\nYou can perform one edge replacement operation: remove one edge and replace it with a new edge, keeping the graph a tree.\n\nFor each vertex, determine if it can become a centroid by performing at most one edge replacement.  Output 1 if it's possible, and 0 otherwise."}, {"prompt_md5": "e2a80684", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes.  A node is a centroid if removing it splits the tree into pieces no larger than half the original size.  You can change one edge of the tree into a different edge.  For each node, determine if it can become a centroid with at most one edge change."}]}