{"uid": "708-A", "url": "https://codeforces.com/contest/708/problem/A", "tags": ["constructive algorithms", " greedy", " implementation", " strings"], "title": "708-A", "statement": "A. Letters Cyclic Shifttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a non-empty stringsconsisting of lowercase English letters. You have to pickexactly one non-empty substringofsand shift all its letters 'z''y''x''b''a''z'. In other words, each character is replaced with the previous character of English alphabet and 'a' is replaced with 'z'.What is the lexicographically minimum string that can be obtained fromsby performing this shift exactly once?InputThe only line of the input contains the strings(1 ≤ |s| ≤ 100 000) consisting of lowercase English letters.OutputPrint the lexicographically minimum string that can be obtained fromsby shifting letters of exactly one non-empty substring.ExamplesInputcodeforcesOutputbncdenqbdrInputabacabaOutputaaacabaNoteStringsis lexicographically smaller than some other stringtof the same length if there exists some1 ≤i≤ |s|, such thats1=t1,s2=t2, ...,si- 1=ti- 1, andsi<ti.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "01b2dc80", "template_md5": "35d339e4", "result": "You are given a string  $s$ consisting of lowercase English letters.  You can choose any non-empty part of the string and shift all the letters in that part one position back in the alphabet (wrapping around so 'a' becomes 'z').  \n\nWhat is the lexicographically smallest string you can create by doing this shift exactly once?\n\n**Lexicographically smallest** means that the string comes earlier in alphabetical order than any other possible result."}, {"prompt_md5": "bf6bab7a", "template_md5": "465699a0", "result": "You are given a string of lowercase letters.  You can choose a part of the string and shift each letter one position back in the alphabet (z becomes y, y becomes x, and so on).  a becomes z.  Find the lexicographically smallest string you can make by doing this shift exactly once."}]}