{"uid": "708-B", "url": "https://codeforces.com/contest/708/problem/B", "tags": ["constructive algorithms", " greedy", " implementation", " math"], "title": "708-B", "statement": "B. Recover the Stringtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputFor each stringsconsisting of characters '0' and '1' one can define four integersa00,a01,a10anda11, whereaxyis the number ofsubsequencesof length2of the stringsequal to the sequence{x,y}.In these problem you are given four integersa00,a01,a10,a11and have to find any non-empty stringsthat matches them, or determine that there is no such string. One can prove that if at least one answer exists, there exists an answer of length no more than1 000 000.InputThe only line of the input contains four non-negative integersa00,a01,a10anda11. Each of them doesn't exceed109.OutputIf there exists a non-empty string that matches four integers from the input, print it in the only line of the output. Otherwise, print \"Impossible\". The length of your answer must not exceed1 000 000.ExamplesInput1 2 3 4OutputImpossibleInput1 2 2 1Output0110", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "52c0fd4d", "template_md5": "35d339e4", "result": "You are given four numbers: $a_{00}$, $a_{01}$, $a_{10}$, and $a_{11}$.  \n\nThese numbers represent the counts of subsequences of length 2 in a string made up of only '0's and '1's.  \n\n* $a_{00}$ is the count of subsequences that are \"00\".\n* $a_{01}$ is the count of subsequences that are \"01\".\n* $a_{10}$ is the count of subsequences that are \"10\".\n* $a_{11}$ is the count of subsequences that are \"11\".\n\nYour task is to find any string of '0's and '1's that has these counts, or determine if no such string exists.  The string you find can be at most 1,000,000 characters long. \n\n\n\nLet me know if you'd like help with solving this problem!"}, {"prompt_md5": "a32b6856", "template_md5": "465699a0", "result": "You are given four numbers.  Each number represents how many times a specific two-character sequence appears in a string made of only 0s and 1s.  Find a string that matches these counts, or say it's impossible.  The string can be at most 1,000,000 characters long."}]}