{"uid": "709-A", "url": "https://codeforces.com/contest/709/problem/A", "tags": ["implementation"], "title": "709-A", "statement": "A. Juicertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputKolya is going to make fresh orange juice. He hasnoranges of sizesa1,a2, ...,an. Kolya will put them in the juicer in the fixed order, starting with orange of sizea1, then orange of sizea2and so on. To be put in the juicer the orange must have size not exceedingb, so if Kolya sees an orange that is strictly greater he throws it away and continues with the next one.The juicer has a special section to collect waste. It overflows if Kolya squeezes oranges of the total size strictly greater thand. When it happens Kolya empties the waste section (even if there are no more oranges) and continues to squeeze the juice. How many times will he have to empty the waste section?InputThe first line of the input contains three integersn,bandd(1 ≤n≤ 100 000,1 ≤b≤d≤ 1 000 000) — the number of oranges, the maximum size of the orange that fits in the juicer and the valued, which determines the condition when the waste section should be emptied.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 1 000 000) — sizes of the oranges listed in the order Kolya is going to try to put them in the juicer.OutputPrint one integer — the number of times Kolya will have to empty the waste section.ExamplesInput2 7 105 6Output1Input1 5 107Output0Input3 10 105 7 7Output1Input1 1 11Output0NoteIn the first sample, Kolya will squeeze the juice from two oranges and empty the waste section afterwards.In the second sample, the orange won't fit in the juicer so Kolya will have no juice at all.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "73c4a281", "template_md5": "35d339e4", "result": "You are given a list of $n$ orange sizes ($a_1, a_2, ..., a_n$).  An orange can only be juiced if its size is less than or equal to $b$.  A juicer has a waste section that overflows if the total size of the oranges juiced exceeds $d$.  When the waste section overflows, it must be emptied.\n\nDetermine the number of times the waste section must be emptied."}, {"prompt_md5": "097acd29", "template_md5": "465699a0", "result": "You are given a list of numbers representing the sizes of items. You can only process items that are smaller than a given limit.  A container has a maximum capacity. When the total size of processed items exceeds a threshold, the container must be emptied.  Count how many times the container needs to be emptied."}]}