{"uid": "71-A", "url": "https://codeforces.com/contest/71/problem/A", "tags": ["strings"], "title": "71-A", "statement": "A. Way Too Long Wordstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutSometimes some words like \"localization\" or \"internationalization\" are so long that writing them many times in one text is quite tiresome.Let's consider a wordtoo long, if its length isstrictly morethan10characters. All too long words should be replaced with a special abbreviation.This abbreviation is made like this: we write down the first and the last letter of a word and between them we write the number of letters between the first and the last letters. That number is in decimal system and doesn't contain any leading zeroes.Thus, \"localization\" will be spelt as \"l10n\", and \"internationalization» will be spelt as \"i18n\".You are suggested to automatize the process of changing the words with abbreviations. At that all too long words should be replaced by the abbreviation and the words that are not too long should not undergo any changes.InputThe first line contains an integern(1 ≤n≤ 100). Each of the followingnlines contains one word. All the words consist of lowercase Latin letters and possess the lengths of from1to100characters.OutputPrintnlines. Thei-th line should contain the result of replacing of thei-th word from the input data.ExamplesInput4wordlocalizationinternationalizationpneumonoultramicroscopicsilicovolcanoconiosisOutputwordl10ni18np43s", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d47e5149", "template_md5": "35d339e4", "result": "You are given a list of words.  A word is considered \"too long\" if it has more than 10 characters.  \n\nFor each \"too long\" word, create an abbreviation by taking the first letter, the last letter, and the number of letters in between.  \n\nFor example:\n\n* \"localization\" becomes \"l10n\"\n* \"internationalization\" becomes \"i18n\"\n\nDo not change words that are 10 characters or less. \n\nPrint the list of words with the abbreviations for the \"too long\" words."}, {"prompt_md5": "7f0e09ec", "template_md5": "465699a0", "result": "You are given a list of words. If a word has more than 10 letters, replace it with the first letter, the last letter, and the number of letters in between. Words with 10 or fewer letters stay the same. Print the modified list of words."}]}