{"uid": "711-E", "url": "https://codeforces.com/contest/711/problem/E", "tags": ["math", " number theory", " probabilities"], "title": "711-E", "statement": "E. ZS and The Birthday Paradoxtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputZS the Coder has recently found an interesting concept called the Birthday Paradox. It states that given a random set of23people, there is around50%chance that some two of them share the same birthday. ZS the Coder finds this very interesting, and decides to test this with the inhabitants of Udayland.In Udayland, there are2ndays in a year. ZS the Coder wants to interviewkpeople from Udayland, each of them has birthday in one of2ndays (each day with equal probability). He is interested in the probability of at least two of them have the birthday at the same day.ZS the Coder knows that the answer can be written as an irreducible fraction. He wants to find the values ofAandB(he does not like to deal with floating point numbers). Can you help him?InputThe first and only line of the input contains two integersnandk(1 ≤n≤ 1018, 2 ≤k≤ 1018), meaning that there are2ndays in a year and that ZS the Coder wants to interview exactlykpeople.OutputIf the probability of at least twokpeople having the same birthday in2ndays long year equals(A≥ 0,B≥ 1,), print theAandBin a single line.Since these numbers may be too large, print them modulo106+ 3. Note thatAandBmust be coprimebeforetheir remainders modulo106+ 3are taken.ExamplesInput3 2Output1 8Input1 3Output1 1Input4 3Output23 128NoteIn the first sample case, there are23= 8days in Udayland. The probability that2people have the same birthday among2people is clearly, soA= 1,B= 8.In the second sample case, there are only21= 2days in Udayland, but there are3people, so it is guaranteed that two of them have the same birthday. Thus, the probability is1andA=B= 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2f7970d9", "template_md5": "35d339e4", "result": "Given a year with $n$ days,  find the probability that at least two people out of $k$ randomly chosen people will share the same birthday.  Output the probability as a fraction $A/B$ where $A$ and $B$ are coprime integers and $B \\ge 1$.  \n\nNote that the answer may be very large, so output $A$ and $B$ modulo $10^6 + 3$."}, {"prompt_md5": "01b2da83", "template_md5": "465699a0", "result": "Given a year with a certain number of days and a number of people, what is the probability that at least two people share the same birthday?  Output the probability as a fraction A/B."}]}