{"uid": "712-D", "url": "https://codeforces.com/contest/712/problem/D", "tags": ["combinatorics", " dp", " math"], "title": "712-D", "statement": "D. Memory and Scorestime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputMemory and his friend Lexa are competing to get higher score in one popular computer game. Memory starts with scoreaand Lexa starts with scoreb. In a single turn, both Memory and Lexa get some integer in the range[ -k;k](i.e. one integer among-k,  -k+ 1,  -k+ 2, ...,  - 2,  - 1, 0, 1, 2, ...,k- 1,k) and add them to their current scores. The game has exactlytturns. Memory and Lexa, however, are not good at this game, so they both always get a random integer at their turn.Memory wonders how many possible games exist such that he ends with a strictly higher score than Lexa. Two games are considered to be different if in at least one turn at least one player gets different score. There are(2k+ 1)2tgames in total. Since the answer can be very large, you should print it modulo109+ 7. Please solve this problem for Memory.InputThe first and only line of input contains the four integersa,b,k, andt(1 ≤a,b≤ 100,1 ≤k≤ 1000,1 ≤t≤ 100) — the amount Memory and Lexa start with, the numberk, and the number of turns respectively.OutputPrint the number of possible games satisfying the conditions modulo1 000 000 007(109+ 7) in one line.ExamplesInput1 2 2 1Output6Input1 1 1 2Output31Input2 12 3 1Output0NoteIn the first sample test, Memory starts with1and Lexa starts with2. If Lexa picks- 2, Memory can pick0,1, or2to win. If Lexa picks- 1, Memory can pick1or2to win. If Lexa picks0, Memory can pick2to win. If Lexa picks1or2, Memory cannot win. Thus, there are3 + 2 + 1 = 6possible games in which Memory wins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b4df73a2", "template_md5": "35d339e4", "result": "Two players start with scores $a$ and $b$ respectively.  In each of $t$ turns, each player gets a random integer between $-k$ and $k$ (inclusive) and adds it to their score.  What is the number of possible sequences of turns such that the first player's final score is strictly greater than the second player's final score?  The answer should be given modulo $10^9 + 7$."}, {"prompt_md5": "d50bbfab", "template_md5": "465699a0", "result": "Two players start with different scores.  Each turn, both players get a random number between -k and k, inclusive, and add it to their score.  What is the number of possible game outcomes where one player's final score is strictly higher than the other's?"}]}