{"uid": "712-C", "url": "https://codeforces.com/contest/712/problem/C", "tags": ["greedy", " math"], "title": "712-C", "statement": "C. Memory and De-Evolutiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMemory is now interested in the de-evolution of objects, specifically triangles. He starts with an equilateral triangle of side lengthx, and he wishes to perform operations to obtain an equilateral triangle of side lengthy.In a single second, he can modify the length of a single side of the current triangle such that it remains a non-degenerate triangle (triangle of positive area). At any moment of time, the length of each side should be integer.What is the minimum number of seconds required for Memory to obtain the equilateral triangle of side lengthy?InputThe first and only line contains two integersxandy(3 ≤y<x≤ 100 000) — the starting and ending equilateral triangle side lengths respectively.OutputPrint a single integer — the minimum number of seconds required for Memory to obtain the equilateral triangle of side lengthyif he starts with the equilateral triangle of side lengthx.ExamplesInput6 3Output4Input8 5Output3Input22 4Output6NoteIn the first sample test, Memory starts with an equilateral triangle of side length6and wants one of side length3. Denote a triangle with sidesa,b, andcas(a,b,c). Then, Memory can do.In the second sample test, Memory can do.In the third sample test, Memory can do:.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1d530344", "template_md5": "35d339e4", "result": "You are given two integers, $x$ and $y$ (where $3 \\le y < x \\le 100,000$).  You start with an equilateral triangle with side length $x$.  You can change the length of one side of the triangle each second to make it a non-degenerate triangle (a triangle with positive area).  The length of each side must be an integer. What is the minimum number of seconds it takes to change the triangle to have side length $y$?"}, {"prompt_md5": "07e3d820", "template_md5": "465699a0", "result": "You start with a triangle with sides of equal length. You can change the length of one side each second to make it a valid triangle (area is positive). What is the fewest seconds it takes to change the side length to a target value?"}]}