{"uid": "713-B", "url": "https://codeforces.com/contest/713/problem/B", "tags": ["binary search", " constructive algorithms", " interactive"], "title": "713-B", "statement": "B. Searching Rectanglestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputFilya just learned new geometry object — rectangle. He is given a field consisting ofn×nunit cells. Rows are numbered from bottom to top with integer from1ton. Columns are numbered from left to right with integers from1ton. Cell, located at the intersection of the rowrand columncis denoted as(r,c). Filya has painted two rectangles, such that their sides are parallel to coordinate axes and each cell lies fully inside or fully outside each of them. Moreover, no cell lies in both rectangles.Later, hedgehog Filya became interested in the location of his rectangles but was unable to find the sheet of paper they were painted on. They were taken by Sonya and now she wants to play a little game with Filya. He tells her a query rectangle and she replies with the number of initial rectangles that liefully insidethe given query rectangle. The query rectangle should match the same conditions as initial rectangles. Rectangle lies fully inside the query if each o its cells lies inside the query.Filya knows Sonya really well, so is sure that if he asks more than200questions she will stop to reply.InputThe first line of the input contains an integern(2 ≤n≤ 216) — size of the field.For each query an integer between0and2is returned — the number of initial rectangles that lie fully inside the query rectangle.OutputTo make a query you have to print \"?x1y1x2y2\" (without quotes) (1 ≤x1≤x2≤n,1 ≤y1≤y2≤n), where(x1,y1)stands for the position of the bottom left cell of the query and(x2,y2)stands for the up right cell of the query. You are allowed to ask no more than200queries. After each query you should perform \"flush\" operation and read the answer.In case you suppose you've already determined the location of two rectangles (or run out of queries) you should print \"!x11y11x12y12x21y21x22y22\" (without quotes), where first four integers describe the bottom left and up right cells of the first rectangle, and following four describe the corresponding cells of the second rectangle. You can print the rectangles in an arbitrary order. After you have printed the answer, print the end of the line and perform \"flush\". Your program should terminate immediately after it print the answer.InteractionTo flush you can use (just after printing an integer and end-of-line):fflush(stdout)in C++;System.out.flush()in Java;stdout.flush()in Python;flush(output)in Pascal;See the documentation for other languages.You will get theWrong Answerverdict if you ask more than200queries, or if you print an incorrect coordinates.You will get theIdleness Limit Exceededverdict if you don't print anything (but you should) or if you forget about flushing the output (more info below).Hacking.The first line should contain an integern(2 ≤n≤ 216).The second line should contain four integersx1,y1,x2,y2(1 ≤x1≤x2≤n,1 ≤y1≤y2≤n) — the description of the first rectangle.The third line contains the description of the second rectangle in the similar way.ExampleInput521011101Output? 1 1 5 5? 1 1 3 3? 1 1 3 1? 2 2 2 2? 3 3 5 5? 3 3 3 5? 3 3 3 4? 3 4 3 5! 2 2 2 2 3 4 3 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6eddc3c8", "template_md5": "35d339e4", "result": "You are given a square grid of size $n \\times n$. Two rectangles are hidden inside the grid, and they do not overlap.  \n\nYou can ask up to 200 questions to find the location of the two rectangles. Each question is a query rectangle, also a rectangle inside the grid. For each query, you will be told how many of the hidden rectangles are fully contained within the query rectangle.\n\nOnce you think you know the location of both rectangles, you can submit your answer. Your answer should be four pairs of coordinates, describing the bottom-left and top-right corners of each hidden rectangle. \n\n\n\nLet me know if you'd like help understanding any specific part of the problem!"}, {"prompt_md5": "4a9da5bb", "template_md5": "465699a0", "result": "You are given a grid of squares. Two rectangles are hidden within the grid, and you can ask questions to find their locations.  \n\nEach question is a rectangle you define on the grid. The answer to each question is the number of hidden rectangles that are completely inside your question rectangle.\n\nYou have a limited number of questions (200) to determine the location of both hidden rectangles."}]}