{"uid": "714-B", "url": "https://codeforces.com/contest/714/problem/B", "tags": ["implementation", " sortings"], "title": "714-B", "statement": "B. Filya and Homeworktime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputToday, hedgehog Filya went to school for the very first time! Teacher gave him a homework which Filya was unable to complete without your help.Filya is given an array of non-negative integersa1,a2, ...,an. First, he pick an integerxand then he addsxto some elements of the array (no more than once), subtractxfrom some other elements (also, no more than once) and do no change other elements. He wants all elements of the array to be equal.Now he wonders if it's possible to pick such integerxand change some elements of the array using thisxin order to make all elements equal.InputThe first line of the input contains an integern(1 ≤n≤ 100 000) — the number of integers in the Filya's array. The second line containsnintegersa1,a2, ...,an(0 ≤ai≤ 109) — elements of the array.OutputIf it's impossible to make all elements of the array equal using the process given in the problem statement, then print \"NO\" (without quotes) in the only line of the output. Otherwise print \"YES\" (without quotes).ExamplesInput51 3 3 2 1OutputYESInput51 2 3 4 5OutputNONoteIn the first sample Filya should selectx= 1, then add it to the first and the last elements of the array and subtract from the second and the third elements.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c20440ec", "template_md5": "35d339e4", "result": "You are given an array of integers. You can choose a number $x$ and add it to some elements of the array (no more than once), subtract $x$ from some other elements (also, no more than once), and leave the rest of the elements unchanged. \n\nDetermine if it is possible to choose a value for $x$ and perform these operations to make all the elements in the array equal. If it is possible, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "5c3407fc", "template_md5": "465699a0", "result": "You are given a list of numbers.  You can add or subtract the same number to some of the numbers in the list (each number can only be changed once).  Can you change the list so that all the numbers are the same?"}]}