{"uid": "716-B", "url": "https://codeforces.com/contest/716/problem/B", "tags": ["greedy", " two pointers"], "title": "716-B", "statement": "B. Complete the Wordtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputZS the Coder loves to read the dictionary. He thinks that a word isniceif there exists asubstring(contiguous segment of letters) of it of length26where each letter of English alphabet appears exactly once. In particular, if the string has length strictly less than26, no such substring exists and thus it is not nice.Now, ZS the Coder tells you a word, where some of its letters are missing as he forgot them. He wants to determine if it is possible to fill in the missing letters so that the resulting word is nice. If it is possible, he needs you to find an example of such a word as well. Can you help him?InputThe first and only line of the input contains a single strings(1 ≤ |s| ≤ 50 000), the word that ZS the Coder remembers. Each character of the string is the uppercase letter of English alphabet ('A'-'Z') or is a question mark ('?'), where the question marks denotes the letters that ZS the Coder can't remember.OutputIf there is no way to replace all the question marks withuppercase letterssuch that the resulting word is nice, then print- 1in the only line.Otherwise, print a string which denotes a possible nice word that ZS the Coder learned. This string should match the string from the input, except for the question marks replaced with uppercase English letters.If there are multiple solutions, you may print any of them.ExamplesInputABC??FGHIJK???OPQR?TUVWXY?OutputABCDEFGHIJKLMNOPQRZTUVWXYSInputWELCOMETOCODEFORCESROUNDTHREEHUNDREDANDSEVENTYTWOOutput-1Input??????????????????????????OutputMNBVCXZLKJHGFDSAQPWOEIRUYTInputAABCDEFGHIJKLMNOPQRSTUVW??MOutput-1NoteIn the first sample case,ABCDEFGHIJKLMNOPQRZTUVWXYSis a valid answer beacuse it contains a substring of length26(the whole string in this case) which contains all the letters of the English alphabet exactly once. Note that there are many possible solutions, such asABCDEFGHIJKLMNOPQRSTUVWXYZorABCEDFGHIJKLMNOPQRZTUVWXYS.In the second sample case, there are no missing letters. In addition, the given string does not have a substring of length26that contains all the letters of the alphabet, so the answer is- 1.In the third sample case, any string of length26that contains all letters of the English alphabet fits as an answer.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "934c7673", "template_md5": "35d339e4", "result": "Given a string of uppercase letters and question marks, determine if it's possible to fill in the question marks with uppercase letters to create a word that contains a substring of length 26 with each letter of the alphabet appearing exactly once. If possible, output one such word. Otherwise, output -1."}, {"prompt_md5": "aa015fde", "template_md5": "465699a0", "result": "Given a word with some missing letters represented by \"?\". Determine if it's possible to fill in the missing letters to create a word where a continuous sequence of 26 letters contains each letter of the alphabet exactly once. If possible, provide one such word. Otherwise, output -1."}]}