{"uid": "717-C", "url": "https://codeforces.com/contest/717/problem/C", "tags": ["implementation", " sortings"], "title": "717-C", "statement": "C. Potions Homeworktime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputHarry Water, Ronaldo, Her-my-oh-knee and their friends have started a new school year at their MDCS School of Speechcraft and Misery. At the time, they are very happy to have seen each other after a long time. The sun is shining, birds are singing, flowers are blooming, and their Potions class teacher, professor Snipe is sulky as usual. Due to his angst fueled by disappointment in his own life, he has given them a lot of homework in Potions class.Each of thenstudents has been assigned a single task. Some students do certain tasks faster than others. Thus, they want to redistribute the tasks so that each student still does exactly one task, and that all tasks are finished. Each student has their own laziness level, and each task has its own difficulty level. Professor Snipe is trying hard to improve their work ethics, so each student’s laziness level is equal to their task’s difficulty level. Both sets of values are given by the sequencea, whereairepresents both the laziness level of thei-th student and the difficulty of his task.The time a student needs to finish a task is equal to the product of their laziness level and the task’s difficulty. They are wondering, what is the minimum possible total time they must spend to finish all tasks if they distribute them in the optimal way. Each person should receive one task and each task should be given to one person. Print the answer modulo10 007.InputThe first line of input contains integern(1 ≤n≤ 100 000) — the number of tasks. The nextnlines contain exactly one integer numberai(1 ≤ai≤ 100 000) — both the difficulty of the initial task and the laziness of thei-th students.OutputPrint the minimum total time to finish all tasks modulo10 007.ExampleInput213Output6NoteIn the first sample, if the students switch their tasks, they will be able to finish them in3 + 3 = 6time units.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ec55ee52", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, where each integer represents both the laziness level of a student and the difficulty of a task.  \n\nThere are $n$ students, and each student must be assigned exactly one task. The time it takes a student to complete a task is the product of their laziness level and the task's difficulty.\n\nWhat is the minimum total time it takes for all the tasks to be completed if the students are assigned tasks optimally?\n\nOutput the minimum total time modulo 10007."}, {"prompt_md5": "473335bd", "template_md5": "465699a0", "result": "You are given a list of numbers representing the difficulty and laziness of a set of tasks. Each task must be assigned to one person, and the time it takes to complete a task is the product of the task's difficulty and the person's laziness. Find the minimum total time to complete all tasks."}]}