{"uid": "717-G", "url": "https://codeforces.com/contest/717/problem/G", "tags": ["flows"], "title": "717-G", "statement": "G. Underfailtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou have recently fallen through a hole and, after several hours of unconsciousness, have realized you are in an underground city. On one of your regular, daily walks through the unknown, you have encountered two unusually looking skeletons called Sanz and P’pairus, who decided to accompany you and give you some puzzles for seemingly unknown reasons.One day, Sanz has created a crossword for you. Not any kind of crossword, but a 1D crossword! You are givenmwords and a string of lengthn. You are also given an arrayp, which designates how much each word is worth — thei-th word is worthpipoints. Whenever you find one of themwords in the string, you are given the corresponding number of points. Each position in the crossword can be used at mostxtimes. A certain word can be counted at different places, but you cannot count the same appearance of a word multiple times. If a word is a substring of another word, you can count them both (presuming you haven’t used the positions more thanxtimes).In order to solve the puzzle, you need to tell Sanz what’s the maximum achievable number of points in the crossword. There is no need to cover all postions, just get the maximal score! Crossword and words contain only lowercase English letters.InputThe first line of the input contains a single integern(1 ≤n≤ 500) — the length of the crossword. The second line contains the crossword string. The third line contains a single integerm(1 ≤m≤ 100) — the number of given words, and nextmlines contain description of words: each line will have a string representing a non-empty word (its length doesn't exceed the length of the crossword) and integerpi(0 ≤pi≤ 100). Last line of the input will containx(1 ≤x≤ 100) — maximum number of times a position in crossword can be used.OutputOutput single integer — maximum number of points you can get.ExampleInput6abacba2aba 6ba 33Output12NoteFor example, with the string \"abacba\", words \"aba\" (6 points) and \"ba\" (3 points), andx= 3, you can get at most12points - the word \"aba\" appears once (\"abacba\"), while \"ba\" appears two times (\"abacba\"). Note that forx= 1, you could get at most9points, since you wouldn’t be able to count both \"aba\" and the first appearance of \"ba\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "45d0708b", "template_md5": "35d339e4", "result": "You are given a string of length $n$ and $m$ words. Each word has a corresponding point value $p_i$.  You need to find the maximum number of points you can get by finding occurrences of these words within the string. \n\nHere are the rules:\n\n* Each position in the string can be used at most $x$ times.\n* A word can be counted multiple times if it appears multiple times in the string, but the same appearance of a word cannot be counted multiple times.\n* If a word is a substring of another word, you can count both of them.\n\nOutput the maximum number of points you can achieve."}, {"prompt_md5": "ccb7f413", "template_md5": "465699a0", "result": "You are given a string and a list of words with associated points.  You need to find the maximum number of points you can get by finding these words within the string, with the constraint that each position in the string can only be used a limited number of times."}]}