{"uid": "717-H", "url": "https://codeforces.com/contest/717/problem/H", "tags": ["math", " probabilities"], "title": "717-H", "statement": "H. Pokermon League challengetime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWelcome to the world of Pokermon, yellow little mouse-like creatures, who absolutely love playing poker!Yeah, right…In the ensuing Pokermon League, there arenregistered Pokermon trainers, andtexisting trainer teams each of which belongs to one of two conferences. Since there is a lot of jealousy between trainers, there areepairs of trainers who hate each other. Their hate is mutual, there are no identical pairs among these, and no trainer hates himself (the world of Pokermon is a joyful place!). Each trainer has a wish-list of lengthliof teams he’d like to join.Your task is to divide players into teams and the teams into two conferences, so that:each trainer belongs to exactly one team;no team is in both conferences;total hate between conferences is at leaste/ 2;every trainer is in a team from his wish-list.Total hate between conferences is calculated as the number of pairs of trainers from teams from different conferences who hate each other.InputThe first line of the input contains two integern(4 ≤n≤ 50 000) ande(2 ≤e≤ 100 000) — the total number of Pokermon trainers and the number of pairs of trainers who hate each other.Pokermon trainers are numbered from1ton. Nextelines contain two integersaandb(1 ≤a,b≤n) indicating that Pokermon trainersaandbhate each other. Next2nlines are in a following format. Starting with Pokermon trainer1, for each trainer in consecutive order: first numberli(16 ≤li≤ 20) — a size of Pokermon trainers wish list, thenlipositive integersti,j(1 ≤ti,j≤T), providing the teams thei-th trainer would like to be on.Each trainers wish list will contain each team no more than once. Teams on the wish lists are numbered in such a way that the set of all teams that appear on at least1wish list is set of consecutive positive integers{1, 2, 3, …,T}. HereTmight be up to1 000 000.OutputPrint two lines. The first line should containnnumbers, specifying for each trainer the team he is in.The second line should containTnumbers, specifying the conference for each team (1or2).ExampleInput4 31 22 34 1161 2 3 4 5 6 7 8 9 10 11 12 13 14 16 15162 3 4 5 6 7 8 9 10 11 12 13 14 15 17 18162 3 4 5 6 7 8 9 10 11 12 13 14 15 18 19161 2 3 4 5 6 7 8 9 10 11 12 13 14 16 19Output16 15 19 142 2 2 1 1 1 2 1 1 2 1 1 1 2 2 1 1 1 1Note", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6a1cbbf4", "template_md5": "35d339e4", "result": "You are given $n$ players and $e$ pairs of players who hate each other. Each player has a list of $l_i$ teams they would like to join.  \n\nYour task is to:\n\n1. Divide the players into teams.\n2. Divide the teams into two conferences.\n\nThe goal is to minimize the total hate between the conferences while satisfying these conditions:\n\n* Each player belongs to exactly one team.\n* No team is in both conferences.\n* Every player is in a team from their wish list.\n\nThe total hate between conferences is the number of pairs of players from different conferences who hate each other.\n\nOutput the team assignment for each player and the conference for each team."}, {"prompt_md5": "a96aad56", "template_md5": "465699a0", "result": "You are given a list of people and a list of pairs of people who dislike each other. Each person has a list of groups they would like to join.  \n\nYour task is to divide the people into groups, with each person in exactly one group, and divide the groups into two categories.  \n\nThe goal is to maximize the number of people in different categories who dislike each other."}]}