{"uid": "717-F", "url": "https://codeforces.com/contest/717/problem/F", "tags": ["data structures"], "title": "717-F", "statement": "F. Heroes of Making Magic IIItime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputI’m strolling on sunshine, yeah-ah! And doesn’t it feel good! Well, it certainly feels good for our Heroes of Making Magic, who are casually walking on a one-directional road, fighting imps. Imps are weak and feeble creatures and they are not good at much. However, Heroes enjoy fighting them. For fun, if nothing else.Our Hero, Ignatius, simply adores imps. He is observing a line of imps, represented as a zero-indexed array of integersaof lengthn, whereaidenotes the number of imps at thei-th position. Sometimes, imps can appear out of nowhere. When heroes fight imps, they select a segment of the line, start at one end of the segment, and finish on the other end, without ever exiting the segment. They can move exactly one cell left or right from their current position and when they do so, they defeat one imp on the cell that they moved to, so, the number of imps on that cell decreases by one. This also applies when heroes appear at one end of the segment, at the beginning of their walk.Their goal is to defeat all imps on the segment, without ever moving to an empty cell in it (without imps), since they would get bored. Since Ignatius loves imps, he doesn’t really want to fight them, so no imps are harmed during the events of this task. However, he would like you to tell him whether it would be possible for him to clear a certain segment of imps in the above mentioned way if he wanted to.You are givenqqueries, which have two types:1abk— denotes thatkimps appear at each cell from the interval[a,b]2ab- asks whether Ignatius could defeat all imps on the interval[a,b]in the way described aboveInputThe first line contains a single integern(1 ≤n≤ 200 000), the length of the arraya. The following line containsnintegersa1,a2, ...,an(0 ≤ai≤ 5 000), the initial number of imps in each cell. The third line contains a single integerq(1 ≤q≤ 300 000), the number of queries. The remainingqlines contain one query each. Each query is provided by integersa,band, possibly,k(0 ≤a≤b<n,0 ≤k≤ 5 000).OutputFor each second type of query output1if it is possible to clear the segment, and0if it is not.ExampleInput32 2 232 0 21 1 1 12 0 2Output01NoteFor the first query, one can easily check that it is indeed impossible to get from the first to the last cell while clearing everything. After we add 1 to the second position, we can clear the segment, for example by moving in the following way:.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bc0e4732", "template_md5": "35d339e4", "result": "You are given an array $a$ of length $n$ representing the number of imps in each cell of a one-directional road.  \n\nThere are $q$ queries. The first type of query adds $k$ imps to each cell in the range $[a, b]$. The second type of query asks if it is possible to defeat all imps in the range $[a, b]$ by starting at one end of the segment and moving one cell left or right at a time, never moving to an empty cell.\n\nOutput 1 if it is possible to clear the segment and 0 if it is not."}, {"prompt_md5": "4148619f", "template_md5": "465699a0", "result": "You are given an array representing a line of numbers.  You can move one position left or right along the line, but you can only move to a position that has a number. Your goal is to determine if it is possible to move along the line and visit every position with a number, starting at one end and ending at the other."}]}