{"uid": "718-C", "url": "https://codeforces.com/contest/718/problem/C", "tags": ["data structures", " math", " matrices"], "title": "718-C", "statement": "C. Sasha and Arraytime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSasha has an array of integersa1,a2, ...,an. You have to performmqueries. There might be queries of two types:1 l r x— increase all integers on the segment fromltorby valuesx;2 l r— find, wheref(x)is thex-th Fibonacci number. As this number may be large, you only have to find it modulo109+ 7.In this problem we define Fibonacci numbers as follows:f(1) = 1,f(2) = 1,f(x) =f(x- 1) +f(x- 2)for allx> 2.Sasha is a very talented boy and he managed to perform all queries in five seconds. Will you be able to write the program that performs as well as Sasha?InputThe first line of the input contains two integersnandm(1 ≤n≤ 100 000,1 ≤m≤ 100 000) — the number of elements in the array and the number of queries respectively.The next line containsnintegersa1,a2, ...,an(1 ≤ai≤ 109).Then followmlines with queries descriptions. Each of them contains integerstpi,li,riand may bexi(1 ≤tpi≤ 2,1 ≤li≤ri≤n,1 ≤xi≤ 109). Heretpi= 1corresponds to the queries of the first type andtpicorresponds to the queries of the second type.It's guaranteed that the input will contains at least one query of the second type.OutputFor each query of the second type print the answer modulo109+ 7.ExamplesInput5 41 1 2 1 12 1 51 2 4 22 2 42 1 5Output579NoteInitially, arrayais equal to1,1,2,1,1.The answer for the first query of the second type isf(1) +f(1) +f(2) +f(1) +f(1) = 1 + 1 + 1 + 1 + 1 = 5.After the query1 2 4 2arrayais equal to1,3,4,3,1.The answer for the second query of the second type isf(3) +f(4) +f(3) = 2 + 3 + 2 = 7.The answer for the third query of the second type isf(1) +f(3) +f(4) +f(3) +f(1) = 1 + 2 + 3 + 2 + 1 = 9.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "555db88e", "template_md5": "35d339e4", "result": "You are given an array of integers of length $n$. You need to perform $m$ queries. There are two types of queries:\n\n1. **Update:** Increase all integers in the subarray from index $l$ to $r$ (inclusive) by $x$.\n2. **Fibonacci Sum:** Calculate the sum of the $x$-th Fibonacci numbers for all elements in the subarray from index $l$ to $r$ (inclusive). The answer should be modulo $10^9 + 7$.\n\n**Input:**\n\n* The first line contains two integers $n$ and $m$ ($1 \\le n \\le 100000$, $1 \\le m \\le 100000$).\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($1 \\le a_i \\le 10^9$).\n* The following $m$ lines describe the queries. Each line contains four integers $t_i$, $l_i$, $r_i$, and $x_i$ ($1 \\le t_i \\le 2$, $1 \\le l_i \\le r_i \\le n$, $1 \\le x_i \\le 10^9$). \n    * If $t_i = 1$, it's an update query.\n    * If $t_i = 2$, it's a Fibonacci sum query.\n\n**Output:**\n\nFor each Fibonacci sum query, print the answer modulo $10^9 + 7$."}, {"prompt_md5": "af6621b5", "template_md5": "465699a0", "result": "You are given an array of numbers. You need to perform a series of operations:\n\n1. **Increase:** Increase all numbers in a given range by a given value.\n2. **Fibonacci:** Find the sum of the Fibonacci numbers up to a given index, modulo 10^9 + 7. \n\n\n\nYou need to be able to perform these operations quickly."}]}