{"uid": "72-A", "url": "https://codeforces.com/contest/72/problem/A", "tags": ["*special", " greedy", " math"], "title": "72-A", "statement": "A. Goshtasp, Vishtasp and Eiditime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutGoshtasp was known to be a good programmer in his school. One day Vishtasp, Goshtasp's friend, asked him to solve this task:Given a positive integern, you should determine whethernis rich.The positive integerxis rich, if there exists some set of distinct numbersa1,a2, ...,amsuch that. In addition: everyaishould be either a prime number, or equal to1.Vishtasp said that he would share his Eidi50 / 50with Goshtasp, if he could solve the task. Eidi is money given to children for Noruz by their parents and/or relatives.Goshtasp needs to solve this problem to get money, you need to solve it to get score!InputInput contains a single positive integern(1 ≤n≤ 10000).OutputIf the number is not rich print0. Otherwise print the numbersa1, ...,am. If several solutions exist print the lexicographicallylatestsolution. Answers are compared as sequences of numbers, not as strings.For comparing two sequencesa1, ...,amandb1, ...,bnwe first find the first indexisuch thatai≠bi, ifai<bithenais lexicographically earlier and ifbi<aithenbis lexicographically earlier. Ifm≠nwe add zeroes at the end of the smaller sequence (only for the moment of comparison) and then perform the comparison.You do not need to minimize the number of elements in sequence (i.e.m). You just need to print the lexicographicallylatestsolution.See samples to find out how to print the sequence.ExamplesInput11Output11=11Input545Output541+3+1=545", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d0e03174", "template_md5": "35d339e4", "result": "Given a positive integer $n$, determine if it can be expressed as the sum of distinct numbers where each number is either a prime number or equal to 1. \n\nIf such a sum exists, output the numbers. If there are multiple solutions, output the lexicographically latest one. \n\nIf no such sum exists, output 0. \n\n\nFor example:\n\n* Input: 11\n* Output: 11 \n\n* Input: 545\n* Output: 541 + 3 + 1 = 545"}, {"prompt_md5": "d2441586", "template_md5": "465699a0", "result": "Given a positive integer, determine if it can be expressed as the sum of distinct numbers, where each number is either prime or 1. If it can, output the sum. If not, output 0.  The output should be the lexicographically latest possible sum."}]}