{"uid": "72-D", "url": "https://codeforces.com/contest/72/problem/D", "tags": ["*special", " expression parsing"], "title": "72-D", "statement": "D. Perse-scripttime limit per test7 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTwo good friends were trying to make a new programming language called Perse-script.The most important part of this language isstrings. A string in Perse-script is put between characters\"So for example\"Hello\"is a string. ButHellois a variable name or a keyword, which are not considered in this problem.Perse-script is function-based. So there are no operators in this language. For example for summing two numbers you have to writesum(a,b)and nota+b.There are several functions for working on strings. These include:concat(x,y)is a function which gets two stringsxandyand putsyat the end ofxand returns the result. For exampleconcat(\"Hello\",\"World\")returns\"HelloWorld\".reverse(x)gets a single stringxand reverses it. For examplereverse(\"Hello\")returns\"olleH\".substr(x,a,b)gets a stringxand two integersaandb(1 ≤a≤b≤n, wherenis the length ofx). And returns the substring ofxbetween indexesaandb, inclusive. For examplesubstr(\"Hello\",2,4)returns\"ell\".substr(x,a,b,c)is another version of substr which works just like the last one butcis the step of adding.cispositive. For examplesubstr(\"HelloWorld\",1,10,2)returns\"Hlool\". This substr means that you put theath character , and then everycth character until you reachb.You're going to manipulate the string part of Perse-script. Given a string expression, you should print its result. It is guaranteed that the expression contains only strings shown by characters\"and the above functions.Commands in Perse-script are case-insensitive. So to callsubstrfunction you can writeSUBsTr(). But you can't print as the result\"hElLo\"instead of printing\"Hello\".See the samples for more information.InputA single line containing the correct expression. It is guaranteed that the total length of this expression does not exceed103and that all the integers used in it are less than or equal to100by absolute value. The given string is non-empty.All strings in the input which are placed between\"s consist of uppercase and lowercase Latin letters only.OutputPrint in single line the resulting string. It is guaranteed that an answer exists and that the length of the answer does not exceed104. It is guaranteed that the answer is non-empty.ExamplesInput\"HelloWorld\"Output\"HelloWorld\"InputREVerse(substr(\"helloworld\",1,5))Output\"olleh\"InputconCAT(rEveRSE(\"olleh\"),\"world\")Output\"helloworld\"InputreversE(concAT(substr(\"hello\",1,2),sUbstr(\"world\",1,5,1)))Output\"dlroweh\"InputsuBstr(\"Noruz\",1,4,2)Output\"Nr\"", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2b53bec9", "template_md5": "35d339e4", "result": "You are given a string expression containing only uppercase and lowercase letters and the following functions:\n\n* `concat(x, y)`: Concatenates string `x` and `y`.\n* `reverse(x)`: Reverses string `x`.\n* `substr(x, a, b)`: Returns the substring of `x` from index `a` to `b` (inclusive).\n* `substr(x, a, b, c)`: Returns a substring of `x` starting at index `a`, taking every `c`th character until it reaches index `b`.\n\nYour task is to evaluate the given string expression and print the resulting string. \n\n**Input:** A single line containing the string expression.\n\n**Output:** A single line containing the resulting string."}, {"prompt_md5": "70372af6", "template_md5": "465699a0", "result": "Given a string containing only letters and calls to functions like \"reverse\", \"concat\", and \"substr\", return the final resulting string."}]}