{"uid": "72-F", "url": "https://codeforces.com/contest/72/problem/F", "tags": ["*special", " greedy", " math"], "title": "72-F", "statement": "F. Oiltime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAfter the nationalization of the oil industry, Dr. Mosaddegh wants to dig some oil wells to extract all the oil in Persian Gulf. But Persian Gulf is huge and has an infinite amount of oil. So Dr. Mosaddegh works only on a rectangular plane of sizen×mof the Persian Gulf. Each of the cells in this rectangle either contains an infinite amount of oil or nothing.Two cells are considered adjacent if and only if they have a common edge, a path is a sequencec1,c2, ...,cxof cells so that all of them contain oil and for eachi,ciis adjacent toci- 1andci+ 1(if they exist). Two cells are consideredconnectedto each other if and only if there exists a path between them. If we dig a well in a certain cell, we can extract oil from all the cells that areconnectedto it by oil paths. It is not allowed to dig wells on empty cells.Dr. Mosaddegh also knows that in Persian Gulf, the empty cells form rows and columns. I. e. if some cell is empty, then it's column is completely empty or it's row is completely empty, or both.Help Dr. Mosaddegh find out how many wells he has to dig to access all the oil in that region.InputIn the first line there are two positive integersnandm(1 ≤n,m≤ 100).In the second line there is an integert(0 ≤t≤n), the number of empty rows.tdistinct positive integers follow, these are the numbers of empty rows and are in range[1,n].In the second line there is an integers(0 ≤s≤m) that shows the number of columns not having any oil.sdistinct positive integers follow, these are the numbers of empty columns and are in range of[1,m].Note that rows are numbered from1ton(from top to bottom) and columns are numbered from1tom(from left to right).OutputA single integer, the minimum number of wells that Dr. Mossadegh has to dig.This is actually finding how many regions are made by removing the given rows and columns.ExamplesInput2 31 21 2Output2Input4 42 2 33 2 3 1Output2Input2 31 10Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1aa9820d", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$. Some cells in the grid contain oil, and some are empty.  Empty cells form complete rows and complete columns.\n\nYou want to dig wells in the grid to extract all the oil.  Each well can extract oil from all connected oil cells. Two cells are connected if there is a path of oil cells between them.\n\nYou are given the number of empty rows and columns. Find the minimum number of wells needed to extract all the oil."}, {"prompt_md5": "4174b104", "template_md5": "465699a0", "result": "You are given a rectangular grid where some cells contain a resource and others are empty.  Empty cells form complete rows and columns.  Find the minimum number of wells you need to dig to access all the resource-containing cells.  Each well can access all connected resource-containing cells."}]}