{"uid": "720-D", "url": "https://codeforces.com/contest/720/problem/D", "tags": ["data structures", " dp", " sortings"], "title": "720-D", "statement": "D. Slalomtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle girl Masha likes winter sports, today she's planning to take part in slalom skiing.The track is represented as a grid composed ofn×msquares. There are rectangular obstacles at the track, composed of grid squares. Masha must get from the square(1, 1)to the square(n,m). She can move from a square to adjacent square: either to the right, or upwards. If the square is occupied by an obstacle, it is not allowed to move to that square.One can see that each obstacle can actually be passed in two ways: either it is to the right of Masha's path, or to the left. Masha likes to try all ways to do things, so she would like to know how many ways are there to pass the track. Two ways are considered different if there is an obstacle such that it is to the right of the path in one way, and to the left of the path in the other way.Help Masha to find the number of ways to pass the track. The number of ways can be quite big, so Masha would like to know it modulo109+ 7.The pictures below show different ways to pass the track in sample tests.InputThe first line of input data contains three positive integers:n,mandk(3 ≤n,m≤ 106,0 ≤k≤ 105) — the size of the track and the number of obstacles.The followingklines contain four positive integers each:x1,y1,x2,y2(1 ≤x1≤x2≤n,1 ≤y1≤y2≤m) — coordinates of bottom left, and top right squares of the obstacle.It is guaranteed that there are no obstacles at squares(1, 1)and(n,m), and no obstacles overlap (but some of them may touch).OutputOutput one integer — the number of ways to pass the track modulo109+ 7.ExamplesInput3 3 0Output1Input4 5 12 2 3 4Output2Input5 5 32 2 2 34 2 5 24 4 4 4Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b4549590", "template_md5": "35d339e4", "result": "A track is represented as a grid of $n \\times m$ squares. There are $k$ rectangular obstacles on the track, each defined by the coordinates of its bottom-left and top-right corners. \n\nYou start at square $(1,1)$ and must reach square $(n,m)$. You can only move right or up to an adjacent square.  \n\nYou want to find the number of ways to reach the destination, considering that each obstacle can be passed either to its right or left. Two paths are considered different if there is an obstacle that is to the right of one path and to the left of the other.\n\nThe answer should be modulo $10^9 + 7$."}, {"prompt_md5": "99715ee9", "template_md5": "465699a0", "result": "A grid has obstacles. You need to find the number of ways to travel from the top left corner to the bottom right corner, moving only right or down, avoiding obstacles. Two paths are different if they pass an obstacle on opposite sides.  The answer should be the number of ways modulo 10^9 + 7."}]}