{"uid": "720-C", "url": "https://codeforces.com/contest/720/problem/C", "tags": ["constructive algorithms"], "title": "720-C", "statement": "C. Homeworktime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputToday Peter has got an additional homework for tomorrow. The teacher has given three integers to him:n,mandk, and asked him to mark one or more squares on a square grid of sizen×m.The marked squares must form a connected figure, and there must be exactlyktriples of marked squares that form an L-shaped tromino — all three squares are inside a2 × 2square.The set of squares forms a connected figure if it is possible to get from any square to any other one if you are allowed to move from a square to any adjacent by a common side square.Peter cannot fulfill the task, so he asks you for help. Help him to create such figure.InputInput data contains one or more test cases. The first line contains the number of test casest(1 ≤t≤ 100).Each of the followingttest cases is described by a line that contains three integers:n,mandk(3 ≤n,m,n×m≤ 105,0 ≤k≤ 109).The sum of values ofn×mfor all tests in one input data doesn't exceed105.OutputFor each test case print the answer.If it is possible to create such figure, printnlines,mcharacters each, use asterisk '*' to denote the marked square, and dot '.' to denote the unmarked one.If there is no solution, print-1.Print empty line between test cases.ExampleInput33 3 43 3 53 3 3Output.*.***.*.**.**.*...*.****..", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e28c4c74", "template_md5": "35d339e4", "result": "You are given three integers, $n$, $m$, and $k$. You need to create a grid of size $n \\times m$ and mark some squares with asterisks (*) to form a connected figure.  \n\nHere are the rules:\n\n* The marked squares must form a single connected shape (you can move between marked squares by sharing a side).\n* There must be exactly $k$ groups of three marked squares that form an L-shape (like a tromino).\n\nIf it's possible to create such a figure, print the grid with asterisks marking the squares. If it's not possible, print -1."}, {"prompt_md5": "434a0486", "template_md5": "465699a0", "result": "You are given a grid of a certain size and a number.  You need to mark some squares in the grid to form a connected shape. The shape must contain a specific number of \"L-shaped\" groups of three squares. If this is possible, print the grid with marked squares as \"*\", otherwise print -1."}]}