{"uid": "720-A", "url": "https://codeforces.com/contest/720/problem/A", "tags": ["greedy"], "title": "720-A", "statement": "A. Closing ceremonytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe closing ceremony of Squanch Code Cup is held in the big hall withn×mseats, arranged innrows,mseats in a row. Each seat has two coordinates(x,y)(1 ≤x≤n,1 ≤y≤m).There are two queues of people waiting to enter the hall:kpeople are standing at(0, 0)andn·m-kpeople are standing at(0,m+ 1). Each person should have a ticket for a specific seat. If personpat(x,y)has ticket for seat(xp,yp)then he should walk|x-xp| + |y-yp|to get to his seat.Each person has a stamina — the maximum distance, that the person agrees to walk. You should find out if this is possible to distribute alln·mtickets in such a way that each person has enough stamina to get to their seat.InputThe first line of input contains two integersnandm(1 ≤n·m≤ 104) — the size of the hall.The second line contains several integers. The first integerk(0 ≤k≤n·m) — the number of people at(0, 0). The followingkintegers indicate stamina of each person there.The third line also contains several integers. The first integerl(l=n·m-k) — the number of people at(0,m+ 1). The followinglintegers indicate stamina of each person there.The stamina of the person is a positive integer less that or equal ton+m.OutputIf it is possible to distribute tickets between people in the described manner print \"YES\", otherwise print \"NO\".ExamplesInput2 23 3 3 21 3OutputYESInput2 23 2 3 31 2OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "66288fe4", "template_md5": "35d339e4", "result": "A hall has $n$ rows and $m$ seats in each row, for a total of $n \\times m$ seats.  There are two groups of people waiting to enter:\n\n* $k$ people at $(0,0)$\n* $n \\times m - k$ people at $(0, m+1)$\n\nEach person has a ticket for a specific seat $(x,y)$ in the hall.  Each person also has a stamina value, which is the maximum distance they are willing to walk. The distance a person needs to walk to their seat is  $|x-xp| + |y-yp|$ where $(xp, yp)$ is the seat they have a ticket for.\n\nDetermine if it is possible to assign tickets to the people so that everyone can walk to their seat without exceeding their stamina.\n\n**Input:**\n\n* Two integers $n$ and $m$ ($1 \\le n \\times m \\le 10^4$) representing the number of rows and seats in each row.\n* An integer $k$ ($0 \\le k \\le n \\times m$) representing the number of people at $(0,0)$.\n* $k$ integers representing the stamina of each person at $(0,0)$.\n* An integer $l$ ($l = n \\times m - k$) representing the number of people at $(0, m+1)$.\n* $l$ integers representing the stamina of each person at $(0, m+1)$.\n\n**Output:**\n\n* \"YES\" if it is possible to assign tickets so that everyone can walk to their seat.\n* \"NO\" otherwise."}, {"prompt_md5": "b46a16e6", "template_md5": "465699a0", "result": "You have a rectangular seating area with a given number of rows and columns. There are two groups of people, one at the top left corner and the other at the top right corner. Each person has a maximum walking distance (stamina).  You need to assign each person a seat in the seating area such that the distance they need to walk to reach their seat is less than or equal to their stamina.  Determine if this is possible."}]}