{"uid": "720-B", "url": "https://codeforces.com/contest/720/problem/B", "tags": ["dfs and similar", " flows"], "title": "720-B", "statement": "B. Cactusophobiatime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTree is a connected undirected graph that has no cycles. Edge cactus is a connected undirected graph without loops and parallel edges, such that each edge belongs to at most one cycle.Vasya has an edge cactus, each edge of this graph has some color.Vasya would like to remove the minimal number of edges in such way that his cactus turned to a tree. Vasya wants to make it in such a way that there were edges of as many different colors in the resulting tree, as possible. Help him to find how many different colors can the resulting tree have.InputThe first line contains two integers:n,m(2 ≤n≤ 10 000) — the number of vertices and the number of edges in Vasya's graph, respectively.The followingmlines contain three integers each:u,v,c(1 ≤u,v≤n,u≠v,1 ≤c≤m) — the numbers of vertices connected by the corresponding edge, and its color. It is guaranteed that the described graph is indeed an edge cactus.OutputOutput one integer: the maximal number of different colors that the resulting tree can have.ExamplesInput4 41 2 42 3 13 4 24 2 3Output3Input7 91 2 12 3 43 1 51 4 54 5 25 1 61 6 46 7 67 1 3Output6", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7476296f", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ vertices and $m$ edges. Each edge has a color from 1 to $m$.  The graph is a cactus, meaning it has no cycles except for those formed by single edges.\n\nYour task is to remove the minimum number of edges to transform the graph into a tree (a connected graph with no cycles).  You want to remove edges in a way that results in a tree with the maximum possible number of distinct edge colors.\n\nOutput the maximum number of distinct colors that can be present in the resulting tree."}, {"prompt_md5": "8418a345", "template_md5": "465699a0", "result": "You are given a connected graph with no cycles, where each edge has a color.  Find the maximum number of unique colors you can have in the graph after removing the minimum number of edges to make it a tree."}]}