{"uid": "721-A", "url": "https://codeforces.com/contest/721/problem/A", "tags": ["implementation"], "title": "721-A", "statement": "A. One-dimensional Japanese Crosswordtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently Adaltik discovered japanese crosswords. Japanese crossword is a picture, represented as a table sizeda×bsquares, and each square is colored white or black. There are integers to the left of the rows and to the top of the columns, encrypting the corresponding row or column. The number of integers represents how many groups of black squares there are in corresponding row or column, and the integers themselves represents the number of consecutive black squares in corresponding group (you can find more detailed explanation in Wikipediahttps://en.wikipedia.org/wiki/Japanese_crossword).Adaltik decided that the general case of japanese crossword is too complicated and drew a row consisting ofnsquares (e.g. japanese crossword sized1 ×n), which he wants to encrypt in the same way as in japanese crossword.The example of encrypting of a single row of japanese crossword.Help Adaltik find the numbers encrypting the row he drew.InputThe first line of the input contains a single integern(1 ≤n≤ 100) — the length of the row. The second line of the input contains a single string consisting ofncharacters 'B' or 'W', ('B' corresponds to black square, 'W' — to white square in the row that Adaltik drew).OutputThe first line should contain a single integerk— the number of integers encrypting the row, e.g. the number of groups of black squares in the row.The second line should containkintegers, encrypting the row, e.g. corresponding to sizes of groups of consecutive black squares in the order from left to right.ExamplesInput3BBWOutput12Input5BWBWBOutput31 1 1Input4WWWWOutput0Input4BBBBOutput14Input13WBBBBWWBWBBBWOutput34 1 3NoteThe last sample case correspond to the picture in the statement.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6c0d4277", "template_md5": "35d339e4", "result": "You are given a row of $n$ squares, where each square is either black ('B') or white ('W').  \n\nYour task is to determine:\n\n1. The number of groups of consecutive black squares in the row.\n2. The size of each group of consecutive black squares.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), representing the number of squares in the row.\n* The second line contains a string of 'B's and 'W's, representing the colors of the squares.\n\n**Output:**\n\n* The first line contains an integer $k$, representing the number of groups of consecutive black squares.\n* The second line contains $k$ integers, representing the size of each group of consecutive black squares."}, {"prompt_md5": "0eec324c", "template_md5": "465699a0", "result": "You are given a sequence of 'B's and 'W's representing a row of black and white squares.  Determine the number of groups of consecutive black squares and the size of each group."}]}