{"uid": "721-C", "url": "https://codeforces.com/contest/721/problem/C", "tags": ["dp", " graphs"], "title": "721-C", "statement": "C. Journeytime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently Irina arrived to one of the most famous cities of Berland — the Berlatov city. There arenshowplaces in the city, numbered from1ton, and some of them are connected by one-directional roads. The roads in Berlatov are designed in a way such that thereare nocyclic routes between showplaces.Initially Irina stands at the showplace1, and the endpoint of her journey is the showplacen. Naturally, Irina wants to visit as much showplaces as she can during her journey. However, Irina's stay in Berlatov is limited and she can't be there for more thanTtime units.Help Irina determine how many showplaces she may visit during her journey from showplace1to showplacenwithin a time not exceedingT. It is guaranteed that there is at least one route from showplace1to showplacensuch that Irina will spend no more thanTtime units passing it.InputThe first line of the input contains three integersn,mandT(2 ≤n≤ 5000,  1 ≤m≤ 5000,  1 ≤T≤ 109) — the number of showplaces, the number of roads between them and the time of Irina's stay in Berlatov respectively.The nextmlines describes roads in Berlatov.i-th of them contains3integersui,vi,ti(1 ≤ui,vi≤n,ui≠vi, 1 ≤ti≤ 109), meaning that there is a road starting from showplaceuiand leading to showplacevi, and Irina spendstitime units to pass it. It is guaranteed that the roads do not form cyclic routes.It is guaranteed, that there is at most one road between each pair of showplaces.OutputPrint the single integerk(2 ≤k≤n) — the maximum number of showplaces that Irina can visit during her journey from showplace1to showplacenwithin time not exceedingT, in the first line.Printkdistinct integers in the second line — indices of showplaces that Irina will visit on her route, in the order of encountering them.If there are multiple answers, print any of them.ExamplesInput4 3 131 2 52 3 72 4 8Output31 2 4Input6 6 71 2 21 3 33 6 32 4 24 6 26 5 1Output41 2 4 6Input5 5 61 3 33 5 31 2 22 4 34 5 2Output31 3 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "71d12dfa", "template_md5": "35d339e4", "result": "You are given a graph with $n$ nodes (showplaces) and $m$ directed edges (roads).  Each edge has a weight representing the time it takes to travel between the two nodes.  \n\nYou start at node 1 and want to visit as many nodes as possible within a time limit of $T$.  \n\nOutput the maximum number of nodes you can visit and a possible sequence of nodes that achieves this."}, {"prompt_md5": "cf76eeab", "template_md5": "465699a0", "result": "You are given a graph with numbered nodes.  You start at node 1 and need to reach node n.  Each edge has a travel time.  Find the maximum number of nodes you can visit along the way, given a maximum total travel time.  Output the number of nodes and the order you visit them."}]}