{"uid": "721-B", "url": "https://codeforces.com/contest/721/problem/B", "tags": ["implementation", " math", " sortings", " strings"], "title": "721-B", "statement": "B. Passwordstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVanya is managed to enter his favourite site Codehorses. Vanya usesndistinct passwords for sites at all, however he can't remember which one exactly he specified during Codehorses registration.Vanya will enter passwords in order of non-decreasing their lengths, and he will enter passwords of same length in arbitrary order. Just when Vanya will have entered the correct password, he is immediately authorized on the site. Vanya will not enter any password twice.Entering any passwords takes one second for Vanya. But if Vanya will enter wrong passwordktimes, then he is able to make the next try only5seconds after that. Vanya makes each try immediately, that is, at each moment when Vanya is able to enter password, he is doing that.Determine how many seconds will Vanya need to enter Codehorses in the best case for him (if he spends minimum possible number of second) and in the worst case (if he spends maximum possible amount of seconds).InputThe first line of the input contains two integersnandk(1 ≤n,k≤ 100) — the number of Vanya's passwords and the number of failed tries, after which the access to the site is blocked for5seconds.The nextnlines contains passwords, one per line — pairwise distinct non-empty strings consisting of latin letters and digits. Each password length does not exceed100characters.The last line of the input contains the Vanya's Codehorses password. It is guaranteed that the Vanya's Codehorses password is equal to some of hisnpasswords.OutputPrint two integers — time (in seconds), Vanya needs to be authorized to Codehorses in the best case for him and in the worst case respectively.ExamplesInput5 2cbaabcbb1abCABCabcOutput1 15Input4 10011221222Output3 4NoteConsider the first sample case. As soon as all passwords have the same length, Vanya can enter the right password at the first try as well as at the last try. If he enters it at the first try, he spends exactly1second. Thus in the best case the answer is1. If, at the other hand, he enters it at the last try, he enters another4passwords before. He spends2seconds to enter first2passwords, then he waits5seconds as soon as he made2wrong tries. Then he spends2more seconds to enter2wrong passwords, again waits5seconds and, finally, enters the correct password spending1more second. In summary in the worst case he is able to be authorized in15seconds.Consider the second sample case. There is no way of entering passwords and get the access to the site blocked. As soon as the required password has length of2, Vanya enters all passwords of length1anyway, spending2seconds for that. Then, in the best case, he immediately enters the correct password and the answer for the best case is3, but in the worst case he enters wrong password of length2and only then the right one, spending4seconds at all.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b789fecc", "template_md5": "35d339e4", "result": "You are given a list of $n$ passwords of different lengths. You need to find the minimum and maximum time it takes to find the correct password. \n\nHere are the rules:\n\n* You try passwords in order of increasing length.\n* If you enter a password of the same length, you can try them in any order.\n* Each correct password takes 1 second to enter.\n* If you enter a wrong password $k$ times, you have to wait 5 seconds before trying again.\n\n\nInput:\n\n* The first line contains two integers $n$ and $k$ ($1 \\le n, k \\le 100$).\n* The next $n$ lines contain the passwords, one per line.\n* The last line contains the correct password.\n\nOutput:\n\n* Print two integers: the minimum and maximum time it takes to find the correct password."}, {"prompt_md5": "3a0addc5", "template_md5": "465699a0", "result": "You have a list of passwords of different lengths. You need to find the minimum and maximum time it takes to find the correct password. You can try passwords in any order, but if you get a password wrong too many times, you have to wait 5 seconds before trying again."}]}