{"uid": "722-C", "url": "https://codeforces.com/contest/722/problem/C", "tags": ["data structures", " dsu"], "title": "722-C", "statement": "C. Destroying Arraytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array consisting ofnnon-negative integersa1,a2, ...,an.You are going to destroy integers in the array one by one. Thus, you are given the permutation of integers from1tondefining the order elements of the array are destroyed.After each element is destroyed you have to find out the segment of the array, such that it contains no destroyed elements and the sum of its elements is maximum possible. The sum of elements in the empty segment is considered to be0.InputThe first line of the input contains a single integern(1 ≤n≤ 100 000) — the length of the array.The second line containsnintegersa1,a2, ...,an(0 ≤ai≤ 109).The third line contains a permutation of integers from1ton— the order used to destroy elements.OutputPrintnlines. Thei-th line should contain a single integer — the maximum possible sum of elements on the segment containing no destroyed elements, after firstioperations are performed.ExamplesInput41 3 2 53 4 1 2Output5430Input51 2 3 4 54 2 3 5 1Output65510Input85 5 4 4 6 6 5 55 2 8 7 1 3 4 6Output18161188660NoteConsider the first sample:Third element is destroyed. Array is now1 3  *  5. Segment with maximum sum5consists of one integer5.Fourth element is destroyed. Array is now1 3  *   *. Segment with maximum sum4consists of two integers1 3.First element is destroyed. Array is now*  3  *   *. Segment with maximum sum3consists of one integer3.Last element is destroyed. At this moment there are no valid nonempty segments left in this array, so the answer is equal to0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cba5771e", "template_md5": "35d339e4", "result": "You are given an array of $n$ non-negative integers $a_1, a_2, ..., a_n$. You will destroy the elements of the array one by one in a specific order given by a permutation of integers from 1 to $n$. After each element is destroyed, find the segment of the array (which may be empty) that contains no destroyed elements and has the maximum possible sum. \n\nPrint $n$ lines, where the $i$-th line contains the maximum sum of the segment after the first $i$ elements are destroyed."}, {"prompt_md5": "dd2b6731", "template_md5": "465699a0", "result": "You have a list of numbers. You will remove numbers from the list one by one in a specific order. After each removal, find the longest section of the remaining list where no numbers have been removed and calculate the sum of the numbers in that section.  Report the sum for each step."}]}