{"uid": "722-F", "url": "https://codeforces.com/contest/722/problem/F", "tags": ["chinese remainder theorem", " data structures", " implementation", " number theory", " two pointers"], "title": "722-F", "statement": "F. Cyclic Ciphertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are givennsequences. Each sequence consists of positive integers, not exceedingm. All integers in one sequence are distinct, but the same integer may appear in multiple sequences. The length of thei-th sequence iski.Each second integers in each of the sequences are shifted by one to the left, i.e. integers at positionsi> 1go to positionsi- 1, while the first integers becomes the last.Each second we take the first integer of each sequence and write it down to a new array. Then, for each valuexfrom1tomwe compute the longestsegmentof the array consisting of elementxonly.The above operation is performed for10100seconds. For each integer from1tomfind out the longest segment found at this time.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 100 000) — the number of sequences and the maximum integer that can appear in the sequences.Then follownlines providing the sequences. Each of them starts with an integerki(1 ≤ki≤ 40) — the number of integers in the sequence, proceeded bykipositive integers — elements of the sequence. It's guaranteed that all integers in each sequence are pairwise distinct and do not exceedm.The total lengthof all sequences doesn't exceed200 000.OutputPrintmintegers, thei-th of them should be equal to the length of the longest segment of the array with all its values equal toiduring the first10100seconds.ExamplesInput3 43 3 4 14 1 3 4 23 3 1 4Output2132Input5 52 3 14 5 1 3 24 2 1 3 51 32 5 3Output31401Input4 63 4 5 32 6 32 3 63 3 6 5Output002112", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "081273eb", "template_md5": "35d339e4", "result": "You are given $n$ sequences of positive integers. Each sequence has a length $k_i$ and contains distinct integers between 1 and $m$.  \n\nHere's what happens every second:\n\n1. Each integer in each sequence is shifted one position to the left (the first integer becomes the last).\n2. The first integer of each sequence is collected into a new array.\n\nFor each integer $x$ from 1 to $m$, you need to find the length of the longest consecutive segment in the new array that consists only of the value $x$. This process is repeated for 10,100 seconds.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n, m \\le 100,000$), representing the number of sequences and the maximum integer value.\n* The following lines describe each sequence:\n    * The first integer is $k_i$ (the length of the sequence).\n    * The next $k_i$ integers are the elements of the sequence.\n\n**Output:**\n\nPrint $m$ integers. The $i$-th integer represents the length of the longest segment of the array containing only the value $i$ after 10,100 seconds."}, {"prompt_md5": "4f78f1ed", "template_md5": "465699a0", "result": "You have multiple lists of distinct numbers. Every second, each list shifts its numbers one position to the left (the first number goes to the end).  You keep track of the first number from each list and build a new list. For each number from 1 to a given maximum, find the longest continuous sequence of that number in the new list after a certain number of seconds."}]}