{"uid": "722-D", "url": "https://codeforces.com/contest/722/problem/D", "tags": ["binary search", " data structures", " dfs and similar", " greedy", " strings", " trees"], "title": "722-D", "statement": "D. Generating Setstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a setYofndistinctpositive integersy1,y2, ...,yn.SetXofndistinctpositive integersx1,x2, ...,xnis said togeneratesetYif one can transformXtoYby applying some number of the following two operation to integers inX:Take any integerxiand multiply it by two, i.e. replacexiwith2·xi.Take any integerxi, multiply it by two and add one, i.e. replacexiwith2·xi+ 1.Note that integers inXare not required to be distinct after each operation.Two sets of distinct integersXandYare equal if they are equal as sets. In other words, if we write elements of the sets in the array in the increasing order, these arrays would be equal.Note, that any set of integers (or its permutation) generates itself.You are given a setYand have to find a setXthat generatesYand themaximum element ofXis mininum possible.InputThe first line of the input contains a single integern(1 ≤n≤ 50 000) — the number of elements inY.The second line containsnintegersy1, ...,yn(1 ≤yi≤ 109), that are guaranteed to be distinct.OutputPrintnintegers — set of distinct integers that generateYand the maximum element of which is minimum possible. If there are several such sets, print any of them.ExamplesInput51 2 3 4 5Output4 5 2 3 1Input615 14 3 13 1 12Output12 13 14 7 3 1Input69 7 13 17 5 11Output4 5 2 6 3 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a0be9525", "template_md5": "35d339e4", "result": "You are given a set of $n$ distinct positive integers $Y = \\{y_1, y_2, ..., y_n\\}$.  You need to find a set of $n$ distinct positive integers $X = \\{x_1, x_2, ..., x_n\\}$ that generates $Y$.  \n\nA set $X$ generates a set $Y$ if you can transform $X$ into $Y$ by repeatedly applying one of the following operations to the integers in $X$:\n\n1. Multiply an integer $x_i$ by 2.\n2. Multiply an integer $x_i$ by 2 and add 1.\n\nThe sets $X$ and $Y$ are equal if they contain the same elements, regardless of the order.\n\nYour goal is to find a set $X$ that generates $Y$ and has the smallest possible maximum element.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 50,000), the number of elements in $Y$.\n* The second line contains $n$ integers $y_1, y_2, ..., y_n$ (1 ≤ $y_i$ ≤ 10⁹), which are guaranteed to be distinct.\n\n**Output:**\n\nPrint $n$ integers representing the set $X$ that generates $Y$ and has the smallest possible maximum element. If there are multiple such sets, print any one."}, {"prompt_md5": "6ade1042", "template_md5": "465699a0", "result": "You are given a set of distinct numbers. Find the smallest possible set of distinct numbers that can be transformed into the given set using only two operations: double a number, or double a number and add one."}]}