{"uid": "723-B", "url": "https://codeforces.com/contest/723/problem/B", "tags": ["expression parsing", " implementation", " strings"], "title": "723-B", "statement": "B. Text Document Analysistime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputModern text editors usually show some information regarding the document being edited. For example, the number of words, the number of pages, or the number of characters.In this problem you should implement the similar functionality.You are given a string which only consists of:uppercase and lowercase English letters,underscore symbols (they are used as separators),parentheses (both opening and closing).It is guaranteed that each opening parenthesis has a succeeding closing parenthesis. Similarly, each closing parentheses has a preceding opening parentheses matching it. For each pair of matching parentheses there are no other parenthesis between them. In other words, each parenthesis in the string belongs to a matching \"opening-closing\" pair, and such pairs can't be nested.For example, the following string is valid: \"_Hello_Vasya(and_Petya)__bye_(and_OK)\".Wordis a maximal sequence of consecutive letters, i.e. such sequence that the first character to the left and the first character to the right of it is an underscore, a parenthesis, or it just does not exist. For example, the string above consists of seven words: \"Hello\", \"Vasya\", \"and\", \"Petya\", \"bye\", \"and\" and \"OK\". Write a program that finds:the length of the longest word outside the parentheses (print0, if there is no word outside the parentheses),the number of words inside the parentheses (print0, if there is no word inside the parentheses).InputThe first line of the input contains a single integern(1 ≤n≤ 255) — the length of the given string. The second line contains the string consisting of only lowercase and uppercase English letters, parentheses and underscore symbols.OutputPrint two space-separated integers:the length of the longest word outside the parentheses (print0, if there is no word outside the parentheses),the number of words inside the parentheses (print0, if there is no word inside the parentheses).ExamplesInput37_Hello_Vasya(and_Petya)__bye_(and_OK)Output5 4Input37_a_(_b___c)__de_f(g_)__h__i(j_k_l)m__Output2 6Input27(LoooonG)__shOrt__(LoooonG)Output5 2Input5(___)Output0 0NoteIn the first sample, the words \"Hello\", \"Vasya\" and \"bye\" are outside any of the parentheses, and the words \"and\", \"Petya\", \"and\" and \"OK\" are inside. Note, that the word \"and\" is given twice and you should count it twice in the answer.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9441ae27", "template_md5": "35d339e4", "result": "You are given a string of letters, underscores, and parentheses.  Parentheses always come in matching pairs.  \n\nA \"word\" is a sequence of letters with underscores or parentheses as its boundaries.\n\nYour task is to:\n\n1. Find the length of the longest word that is not inside any parentheses. If there are no such words, print 0.\n2. Count the number of words that are inside parentheses. If there are no such words, print 0. \n\n\n\nLet me know if you'd like help with the code!"}, {"prompt_md5": "7268cf4b", "template_md5": "465699a0", "result": "You are given a string of letters, underscores, and parentheses.  Find the length of the longest sequence of letters that is not inside parentheses, and the number of sequences of letters that are entirely inside parentheses."}]}