{"uid": "724-B", "url": "https://codeforces.com/contest/724/problem/B", "tags": ["brute force", " greedy", " implementation", " math"], "title": "724-B", "statement": "B. Batch Sorttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a table consisting ofnrows andmcolumns.Numbers in each row form a permutation of integers from1tom.You are allowed to pick two elements in one row and swap them, butno more than oncefor each row. Also,no more than onceyou are allowed to pick two columns and swap them. Thus, you are allowed to perform from0ton+ 1actions in total.Operations can be performed in any order.You have to check whether it's possible to obtain the identity permutation1, 2, ...,min each row. In other words, check if one can perform some of the operation following the given rules and make each row sorted in increasing order.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 20) — the number of rows and the number of columns in the given table.Each of nextnlines containsmintegers — elements of the table. It's guaranteed that numbers in each line form a permutation of integers from1tom.OutputIf there is a way to obtain the identity permutation in each row by following the given rules, print \"YES\" (without quotes) in the only line of the output. Otherwise, print \"NO\" (without quotes).ExamplesInput2 41 3 2 41 3 4 2OutputYESInput4 41 2 3 42 3 4 13 4 1 24 1 2 3OutputNOInput3 62 1 3 4 5 61 2 4 3 5 61 2 3 4 6 5OutputYESNoteIn the first sample, one can act in the following way:Swap second and third columns. Now the table is1 2 3 41 4 3 2In the second row, swap the second and the fourth elements. Now the table is1 2 3 41 2 3 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "863a7bda", "template_md5": "35d339e4", "result": "You are given a table with $n$ rows and $m$ columns. Each row contains a unique permutation of numbers from 1 to $m$. You can perform the following operations:\n\n1. Swap two elements within a single row (you can only do this once per row).\n2. Swap two columns (you can only do this once).\n\nDetermine if it's possible to rearrange the table so that each row is in ascending order (1, 2, 3, ..., $m$) after performing these operations. \n\nIf it's possible, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "124fc0b8", "template_md5": "465699a0", "result": "You are given a grid of numbers. Each row must be sorted in order. You can swap two numbers in a row once, and you can swap two columns once.  Determine if it's possible to sort all the rows."}]}