{"uid": "724-D", "url": "https://codeforces.com/contest/724/problem/D", "tags": ["data structures", " greedy", " strings"], "title": "724-D", "statement": "D. Dense Subsequencetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a strings, consisting of lowercase English letters, and the integerm.One should choose some symbols from the given string so that any contiguous subsegment of lengthmhas at least one selected symbol. Note that here we choose positions of symbols, not the symbols themselves.Then one uses the chosen symbols to forma new string. All symbols from the chosen position should be used, but we are allowed to rearrange them in any order.Formally, we choose a subsequence of indices1 ≤i1<i2< ... <it≤ |s|. The selected sequence must meet the following condition: for everyjsuch that1 ≤j≤ |s| -m+ 1, there must be at least one selected index that belongs to the segment[j,j+m- 1], i.e. there should exist akfrom1tot, such thatj≤ik≤j+m- 1.Then we take any permutationpof the selected indices and form a new stringsip1sip2...sipt.Find the lexicographically smallest string, that can be obtained using this procedure.InputThe first line of the input contains a single integerm(1 ≤m≤ 100 000).The second line contains the stringsconsisting of lowercase English letters. It is guaranteed that this string is non-empty and its length doesn't exceed100 000. It is also guaranteed that the numbermdoesn't exceed the length of the strings.OutputPrint the single line containing the lexicographically smallest string, that can be obtained using the procedure described above.ExamplesInput3cbabcOutputaInput2abcabOutputaabInput3bcabcbaccbaOutputaaabbNoteIn the first sample, one can choose the subsequence{3}and form a string \"a\".In the second sample, one can choose the subsequence{1, 2, 4}(symbols on this positions are 'a', 'b' and 'a') and rearrange the chosen symbols to form a string \"aab\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "50dd72dc", "template_md5": "35d339e4", "result": "You are given a string $s$ and an integer $m$.  \n\nYou need to choose some positions in the string so that every contiguous substring of length $m$ contains at least one of the chosen positions.  \n\nThen, you can rearrange the characters at the chosen positions to form a new string.\n\nFind the lexicographically smallest possible new string."}, {"prompt_md5": "d97b811a", "template_md5": "465699a0", "result": "You are given a string of letters and a number.  You need to pick some positions in the string so that every group of consecutive letters of length  the given number has at least one of your chosen positions. Then, rearrange the letters at your chosen positions to make the smallest possible new string. What is that string?"}]}