{"uid": "725-G", "url": "https://codeforces.com/contest/725/problem/G", "tags": [], "title": "725-G", "statement": "G. Messages on a Treetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob are well-known for sending messages to each other. This time you have a rooted tree with Bob standing in the root node and copies of Alice standing in each of the other vertices. The root node has number0, the rest are numbered1throughn.At some moments of time some copies of Alice want to send a message to Bob and receive an answer. We will call this copy theinitiator. The process of sending a message contains several steps:The initiator sends the message to the person standing in the parent node and begins waiting for the answer.When some copy of Alice receives a message from some of her children nodes, she sends the message to the person standing in the parent node and begins waiting for the answer.When Bob receives a message from some of his child nodes, he immediately sends the answer to the child node where the message came from.When some copy of Alice (except for initiator) receives an answer she is waiting for, she immediately sends it to the child vertex where the message came from.When the initiator receives the answer she is waiting for, she doesn't send it to anybody.There is a special case: a copy of Alice can't wait for two answers at the same time, so if some copy of Alice receives a message from her child node while she already waits for some answer, she rejects the message and sends a message saying this back to the child node where the message came from. Then the copy of Alice in the child vertex processes this answer as if it was from Bob.The process of sending a message to a parent node or to a child node is instant but a receiver (a parent or a child) gets a message after1second.If some copy of Alice receives several messages from child nodes at the same moment while she isn't waiting for an answer, she processes the message from theinitiatorwith the smallest number and rejects all the rest. If some copy of Alice receives messages from children nodes and also receives the answer she is waiting for at the same instant, then Alice first processes the answer, then immediately continue as normal with the incoming messages.You are given the moments of time when some copy of Alice becomes the initiator and sends a message to Bob. For each message, find the moment of time when the answer (either from Bob or some copy of Alice) will be received by the initiator.You can assume that if Alice wants to send a message (i.e. become the initiator) while waiting for some answer, she immediately rejects the message and receives an answer from herself in no time.InputThe first line of input contains two integersnandm(1 ≤n,m≤ 200 000) — the number of nodes with Alices and the number of messages.Second line containsnintegersp1,p2, ...,pn(0 ≤pi<i). The integerpiis the number of the parent node of nodei.The nextmlines describe the messages. Thei-th of them contains two integersxiandti(1 ≤xi≤n,1 ≤ti≤ 109) — the number of the vertex of the initiator of thei-th message and the time of the initiation (in seconds). The messages are given in order of increasing initiation time (i.e.ti+ 1≥tiholds for1 ≤i<m). The pairs(xi,ti)are distinct.OutputPrintmintegers — thei-th of them is the moment of time when the answer for thei-th message will be received by the initiator.ExamplesInput6 30 1 2 3 2 54 66 95 11Output14 13 11Input3 20 1 12 13 1Output5 3Input8 30 1 1 2 3 3 4 56 18 24 5Output7 6 11NoteIn the first example the first message is initiated at the moment6, reaches Bob at the moment10, and the answer reaches the initiator at the moment14. The second message reaches vertex2at the moment11. At this moment the copy of Alice in this vertex is still waiting for the answer for the first message, so she rejects the second message. The answer reaches the initiator at the moment13. The third message is not sent at all, because at the moment11Alice in vertex5is waiting for the answer for the second message.In the second example the first message reaches Bob, the second is rejected by Alice in vertex1. This is because the message with smaller initiator number has the priority.In the third example the first and the third messages reach Bob, while the second message is rejected by Alice in vertex3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ecc40160", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, rooted at node 0.  Each node $i$ ($1 \\le i \\le n$) has a parent node $p_i$ ($0 \\le p_i < i$).  \n\nThere are $m$ messages to be sent.  The $i$-th message is initiated at time $t_i$ by node $x_i$ ($1 \\le x_i \\le n$).  \n\nMessages travel up the tree to the root (node 0) and back down.  \n\n* A message sent from a node to its parent takes 1 second to be received.\n* A message sent from the root to a node takes 1 second to be received.\n\nIf a node receives multiple messages at the same time, it processes them in order of increasing initiator number.\n\nIf a node is already waiting for a message, it rejects any new messages it receives.\n\nFor each message, find the time when the initiator receives a response."}, {"prompt_md5": "74512dbd", "template_md5": "465699a0", "result": "You are given a tree with a root node.  At certain times, nodes in the tree send messages upwards to the root.  The root node immediately sends a response back down to the node that sent the message.  Messages can be delayed by one time unit.  If a node receives multiple messages at the same time, it processes them in order of the time they were sent.  Find the time each message is received by its original sender."}]}