{"uid": "725-D", "url": "https://codeforces.com/contest/725/problem/D", "tags": ["data structures", " greedy"], "title": "725-D", "statement": "D. Contest Balloonstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOne tradition of ACM-ICPC contests is that a team gets a balloon for every solved problem. We assume that the submission time doesn't matter and teams are sorted only by the number of balloons they have. It means that one's place is equal to the number of teams with more balloons, increased by1. For example, if there are seven teams with more balloons, you get the eight place. Ties are allowed.You should know that it's important to eat before a contest. If the number of balloons of a team is greater than the weight of this team, the team starts to float in the air together with their workstation. They eventually touch the ceiling, what is strictly forbidden by the rules. The team is then disqualified and isn't considered in the standings.A contest has just finished. There arenteams, numbered1throughn. Thei-th team hastiballoons and weightwi. It's guaranteed thattidoesn't exceedwiso nobody floats initially.Limak is a member of the first team. He doesn't like cheating and he would never steal balloons from other teams. Instead, he can give his balloons away to other teams, possibly making them float. Limak can give away zero or more balloons of his team. Obviously, he can't give away more balloons than his team initially has.What is the best place Limak can get?InputThe first line of the standard input contains one integern(2 ≤n≤ 300 000) — the number of teams.Thei-th ofnfollowing lines contains two integerstiandwi(0 ≤ti≤wi≤ 1018) — respectively the number of balloons and the weight of thei-th team. Limak is a member of the first team.OutputPrint one integer denoting the best place Limak can get.ExamplesInput820 100032 3740 100045 5016 1616 1614 10002 1000Output3Input74 44 44 44 44 44 45 5Output2Input714000000003 100000000000000000081000000000 880000000005000000000 700000000015000000000 3900000000046000000000 510000000000 10000000000 0Output2NoteIn the first sample, Limak has20balloons initially. There are three teams with more balloons (32,40and45balloons), so Limak has the fourth place initially. One optimal strategy is:Limak gives6balloons away to a team with32balloons and weight37, which is just enough to make them fly. Unfortunately, Limak has only14balloons now and he would get the fifth place.Limak gives6balloons away to a team with45balloons. Now they have51balloons and weight50so they fly and get disqualified.Limak gives1balloon to each of two teams with16balloons initially.Limak has20 - 6 - 6 - 1 - 1 = 6balloons.There are three other teams left and their numbers of balloons are40,14and2.Limak gets the third place because there are two teams with more balloons.In the second sample, Limak has the second place and he can't improve it.In the third sample, Limak has just enough balloons to get rid of teams2,3and5(the teams with81 000 000 000,5 000 000 000and46 000 000 000balloons respectively). With zero balloons left, he will get the second place (ex-aequo with team6and team7).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "db9f5a0a", "template_md5": "35d339e4", "result": "There are $n$ teams participating in a competition. Each team has a number of balloons ($t_i$) and a weight ($w_i$). Teams are ranked based on the number of balloons they have. If a team's number of balloons exceeds their weight, they are disqualified.\n\nTeam 1 can give away some of their balloons to other teams. What is the best possible rank Team 1 can achieve? \n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 300,000), the number of teams.\n* Each of the next $n$ lines contains two integers, $t_i$ and $w_i$ (0 ≤ $t_i$ ≤ $w_i$ ≤ 10<sup>18</sup>), representing the number of balloons and weight of the $i$-th team.\n\n**Output:**\n\n* Print a single integer representing the best possible rank Team 1 can achieve."}, {"prompt_md5": "2cd92f01", "template_md5": "465699a0", "result": "You are given a list of teams, each with a number of balloons and a weight. Teams with more balloons than their weight float away and are disqualified. You can give away some of your balloons to other teams. What is the best possible ranking you can achieve?"}]}