{"uid": "727-F", "url": "https://codeforces.com/contest/727/problem/F", "tags": ["binary search", " dp", " greedy"], "title": "727-F", "statement": "F. Polycarp's problemstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp is an experienced participant in Codehorses programming contests. Now he wants to become a problemsetter.He sent to the coordinator a set ofnproblems. Each problem has it's quality, the quality of thei-th problem isai(aican be positive, negative or equal to zero). The problems are ordered by expected difficulty, but the difficulty is not related to the quality in any way. The easiest problem has index1, the hardest problem has indexn.The coordinator's mood is equal toqnow. After reading a problem, the mood changes by it's quality. It means that after the coordinator reads a problem with qualityb, the valuebis added to his mood. The coordinator always reads problems one by one from the easiest to the hardest, it's impossible to change the order of the problems.If after reading some problem the coordinator's mood becomes negative, he immediately stops reading and rejects the problemset.Polycarp wants to remove the minimum number of problems from his problemset to make the coordinator's mood non-negative at any moment of time. Polycarp is not sure about the current coordinator's mood, but he hasmguesses \"the current coordinator's moodq=bi\".For each ofmguesses, find the minimum number of problems Polycarp needs to remove so that the coordinator's mood will always be greater or equal to0while he reads problems from the easiest of the remaining problems to the hardest.InputThe first line of input contains two integersnandm(1 ≤n≤ 750,1 ≤m≤ 200 000) — the number of problems in the problemset and the number of guesses about the current coordinator's mood.The second line of input containsnintegersa1,a2, ...,an(- 109≤ai≤ 109) — the qualities of the problems in order of increasing difficulty.The third line of input containsmintegersb1,b2, ...,bm(0 ≤bi≤ 1015) — the guesses of the current coordinator's moodq.OutputPrintmlines, ini-th line print single integer — the answer to the problem withq=bi.ExampleInput6 38 -5 -4 1 -7 40 7 3Output201", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "17a6e1eb", "template_md5": "35d339e4", "result": "There are $n$ problems, each with a quality $a_i$. The problems are ordered by difficulty, with the easiest problem having index 1 and the hardest problem having index $n$.\n\nA person's mood is initially $q$. After reading a problem with quality $a_i$, their mood changes by $a_i$. If the person's mood becomes negative at any point, they stop reading.\n\nThere are $m$ guesses for the person's initial mood, $b_1, b_2, ..., b_m$. For each guess $b_i$, find the minimum number of problems that need to be removed from the set so that the person's mood is always non-negative while reading the remaining problems in order of difficulty. \n\n\nInput:\n\n* The first line contains two integers $n$ and $m$ ($1 \\le n \\le 750$, $1 \\le m \\le 200000$) - the number of problems and the number of mood guesses.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (-10^9 $\\le a_i \\le$ 10^9) - the qualities of the problems.\n* The third line contains $m$ integers $b_1, b_2, ..., b_m$ (0 $\\le b_i \\le$ 10^15) - the guesses for the initial mood.\n\nOutput:\n\nPrint $m$ lines, with the $i$-th line containing a single integer - the minimum number of problems to remove for the mood guess $b_i$."}, {"prompt_md5": "d4e30489", "template_md5": "465699a0", "result": "You are given a list of items, each with a value. You need to remove some items from the list so that the sum of the values of the remaining items is always non-negative when processed in order. You have multiple guesses for the starting value. For each guess, find the minimum number of items to remove."}]}