{"uid": "727-D", "url": "https://codeforces.com/contest/727/problem/D", "tags": ["constructive algorithms", " flows", " greedy"], "title": "727-D", "statement": "D. T-shirts Distributiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe organizers of a programming contest have decided to present t-shirts to participants. There are six different t-shirts sizes in this problem:S,M,L,XL,XXL,XXXL(sizes are listed in increasing order). The t-shirts are already prepared. For each size fromStoXXXLyou are given the number of t-shirts of this size.During the registration, the organizers asked each of thenparticipants about the t-shirt size he wants. If a participant hesitated between two sizes, he could specify two neighboring sizes — this means that any of these two sizes suits him.Write a program that will determine whether it is possible to present a t-shirt to each participant of the competition, or not. Of course, each participant should get a t-shirt of proper size:the size he wanted, if he specified one size;any of the two neibouring sizes, if he specified two sizes.If it is possible, the program should find any valid distribution of the t-shirts.InputThe first line of the input contains six non-negative integers — the number of t-shirts of each size. The numbers are given for the sizesS,M,L,XL,XXL,XXXL, respectively. The total number of t-shirts doesn't exceed100 000.The second line contains positive integern(1 ≤n≤ 100 000) — the number of participants.The followingnlines contain the sizes specified by the participants, one line per participant. Thei-th line contains information provided by thei-th participant: single size or two sizes separated by comma (without any spaces). If there are two sizes, the sizes are written in increasing order. It is guaranteed that two sizes separated by comma are neighboring.OutputIf it is not possible to present a t-shirt to each participant, print «NO» (without quotes).Otherwise, printn+ 1lines. In the first line print «YES» (without quotes). In the followingnlines print the t-shirt sizes the orginizers should give to participants, one per line. The order of the participants should be the same as in the input.If there are multiple solutions, print any of them.ExamplesInput0 1 0 1 1 03XLS,MXL,XXLOutputYESXLMXXLInput1 1 2 0 1 15SMS,MXXL,XXXLXL,XXLOutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "03e4d199", "template_md5": "35d339e4", "result": "There are 6 sizes of t-shirts: S, M, L, XL, XXL, XXXL. You are given the number of t-shirts for each size.  \n\nThere are $n$ participants, and each participant wants either one size or two neighboring sizes. \n\nDetermine if it is possible to give each participant a t-shirt based on their request. If possible, output a valid distribution of t-shirts to the participants. \n\n**Input:**\n\n* The first line contains 6 integers: the number of S, M, L, XL, XXL, and XXXL t-shirts.\n* The second line contains an integer $n$ (the number of participants).\n* The next $n$ lines each contain a participant's size request (one size or two neighboring sizes separated by a comma).\n\n**Output:**\n\n* If it's not possible to give a t-shirt to every participant, print \"NO\".\n* Otherwise, print \"YES\" followed by $n$ lines, each containing the size of a t-shirt given to a participant. The order of the participants should match the input."}, {"prompt_md5": "db4f81a4", "template_md5": "465699a0", "result": "You are given a number of shirts in different sizes. You are also given a list of people who want shirts, each person wanting either one size or two neighboring sizes.  Determine if it is possible to give each person a shirt and if so, output a possible distribution of shirts."}]}