{"uid": "729-C", "url": "https://codeforces.com/contest/729/problem/C", "tags": ["binary search", " greedy", " sortings"], "title": "729-C", "statement": "C. Road to Cinematime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya is currently at a car rental service, and he wants to reach cinema. The film he has bought a ticket for starts intminutes. There is a straight road of lengthsfrom the service to the cinema. Let's introduce a coordinate system so that the car rental service is at the point0, and the cinema is at the points.There arekgas stations along the road, and at each of them you can fill a car with any amount of fuel for free! Consider that this operation doesn't take any time, i.e. is carried out instantly.There arencars in the rental service,i-th of them is characterized with two integersciandvi— the price of this car rent and the capacity of its fuel tank in liters. It's not allowed to fuel a car with more fuel than its tank capacityvi. All cars are completely fueled at the car rental service.Each of the cars can be driven in one of two speed modes: normal or accelerated. In the normal mode a car covers1kilometer in2minutes, and consumes1liter of fuel. In the accelerated mode a car covers1kilometer in1minutes, but consumes2liters of fuel. The driving mode can be changed at any moment and any number of times.Your task is to choose a car with minimum price such that Vasya can reach the cinema before the show starts, i.e. not later than intminutes. Assume that all cars are completely fueled initially.InputThe first line contains four positive integersn,k,sandt(1 ≤n≤ 2·105,1 ≤k≤ 2·105,2 ≤s≤ 109,1 ≤t≤ 2·109) — the number of cars at the car rental service, the number of gas stations along the road, the length of the road and the time in which the film starts.Each of the nextnlines contains two positive integersciandvi(1 ≤ci,vi≤ 109) — the price of thei-th car and its fuel tank capacity.The next line containskdistinctintegersg1,g2, ...,gk(1 ≤gi≤s- 1) — the positions of the gas stations on the road in arbitrary order.OutputPrint the minimum rent price of an appropriate car, i.e. such car that Vasya will be able to reach the cinema before the film starts (not later than intminutes). If there is no appropriate car, print-1.ExamplesInput3 1 8 1010 85 711 93Output10Input2 2 10 1810 420 65 3Output20NoteIn the first sample, Vasya can reach the cinema in time using the first or the third cars, but it would be cheaper to choose the first one. Its price is equal to10, and the capacity of its fuel tank is8. Then Vasya can drive to the first gas station in the accelerated mode in3minutes, spending6liters of fuel. After that he can full the tank and cover2kilometers in the normal mode in4minutes, spending2liters of fuel. Finally, he drives in the accelerated mode covering the remaining3kilometers in3minutes and spending6liters of fuel.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6c0f283a", "template_md5": "35d339e4", "result": "There is a road of length $s$ kilometers.  There are $n$ cars available for rent, each with a price $c_i$ and a fuel tank capacity $v_i$.  There are $k$ gas stations located at positions $g_1, g_2, ..., g_k$ along the road.\n\nA car can travel at two speeds:\n\n* **Normal mode:** 1 kilometer in 2 minutes, consuming 1 liter of fuel per kilometer.\n* **Accelerated mode:** 1 kilometer in 1 minute, consuming 2 liters of fuel per kilometer.\n\nThe driver can switch between modes at any time.  All cars start with a full tank of fuel.\n\nYou must choose the car with the minimum rental price that can reach the end of the road (position $s$) within $t$ minutes.  \n\nOutput the minimum rental price. If no car can reach the destination in time, output -1."}, {"prompt_md5": "86718b42", "template_md5": "465699a0", "result": "You have a number of cars, each with a price and a fuel tank size. You need to choose the cheapest car that can reach a destination within a time limit.  You can refuel for free at certain points along the way.  The car can travel in two modes: normal (slower, uses less fuel) or accelerated (faster, uses more fuel).  You can switch modes at any time."}]}