{"uid": "729-F", "url": "https://codeforces.com/contest/729/problem/F", "tags": ["dp"], "title": "729-F", "statement": "F. Financiers Gametime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThis problem has unusual memory constraint.At evening, Igor and Zhenya the financiers became boring, so they decided to play a game. They preparednpapers with the income of some company for some time periods. Note that the income can be positive, zero or negative.Igor and Zhenya placed the papers in a row and decided to take turns making moves. Igor will take the papers from the left side, Zhenya will take the papers from the right side. Igor goes first and takes1or2(on his choice) papers from the left. Then, on each turn a player can takekork+ 1papers from his side if the opponent took exactlykpapers in the previous turn. Players can't skip moves. The game ends when there are no papers left, or when some of the players can't make a move.Your task is to determine the difference between the sum of incomes on the papers Igor took and the sum of incomes on the papers Zhenya took, assuming both players play optimally. Igor wants to maximize the difference, Zhenya wants to minimize it.InputThe first line contains single positive integern(1 ≤n≤ 4000) — the number of papers.The second line containsnintegersa1,a2, ...,an(- 105≤ai≤ 105), whereaiis the income on thei-th paper from the left.OutputPrint the difference between the sum of incomes on the papers Igor took and the sum of incomes on the papers Zhenya took, assuming both players play optimally. Igor wants to maximize the difference, Zhenya wants to minimize it.ExamplesInput31 3 1Output4Input5-1 -2 -1 -2 -1Output0Input4-4 -2 4 5Output-13NoteIn the first example it's profitable for Igor to take two papers from the left to have the sum of the incomes equal to4. Then Zhenya wouldn't be able to make a move since there would be only one paper, and he would be able to take only2or3..", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cdef5177", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ numbers ($n \\le 4000$), where each number represents the income of a company for a specific time period.  \n\nTwo players take turns selecting numbers from opposite ends of the sequence. \n\n* On the first turn, the first player can choose to take 1 or 2 numbers from the left end.\n* On subsequent turns, a player can take $k+1$ numbers from their side if the opponent took exactly $k$ numbers on the previous turn.\n* Players cannot skip their turns.\n\nThe game ends when there are no numbers left in the sequence or a player cannot make a move.\n\nDetermine the difference between the sum of incomes of the numbers taken by the first player and the sum of incomes of the numbers taken by the second player, assuming both players play optimally. The first player aims to maximize this difference, while the second player aims to minimize it."}, {"prompt_md5": "6e90949c", "template_md5": "465699a0", "result": "Two players take turns removing items from opposite ends of a line.  A player can remove 1 or 2 items on their first turn, and on subsequent turns, they can remove a number of items equal to one more than the number of items the opponent removed on their previous turn.  The game ends when there are no more items.  Determine the difference in the total value of the items each player takes, assuming both players play optimally."}]}