{"uid": "73-D", "url": "https://codeforces.com/contest/73/problem/D", "tags": ["dfs and similar", " graphs", " greedy"], "title": "73-D", "statement": "D. FreeDivtime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya plays FreeDiv. In this game he manages a huge state, which hasncities andmtwo-way roads between them. Unfortunately, not from every city you can reach any other one moving along these roads. Therefore Vasya decided to divide the state into provinces so that in every province, one could reach from every city all the cities of the province, but there are no roads between provinces.Unlike other turn-based strategies, in FreeDiv a player has the opportunity to build tunnels between cities. The tunnels are two-way roads along which one can move armies undetected by the enemy. However, no more than one tunnel can be connected to each city. As for Vasya, he wants to build a network of tunnels so that any pair of cities in his state were reachable by some path consisting of roads and a tunnels. But at that no more thanktunnels are connected to each province (otherwise, the province will be difficult to keep in case other provinces are captured by enemy armies).Vasya discovered that maybe he will not be able to build such a network for the current condition of the state. Maybe he'll have first to build several roads between cities in different provinces to merge the provinces. Your task is to determine the minimum number of roads Vasya needs to build so that it was possible to build the required network of tunnels in the resulting state.InputThe first line contains three integersn,mandk(1 ≤n,k≤ 106, 0 ≤m≤ 106). Each of the nextmlines contains two integers. They are the numbers of cities connected by a corresponding road. No road connects city to itself and there is at most one road between each pair of cities.OutputPrint a single number, the minimum number of additional roads.ExamplesInput3 3 21 22 33 1Output0Input4 2 21 23 4Output0Input4 0 2Output1NoteIn the first example only one province exists, so it is not necessary to build any tunnels or roads.In the second example two provinces exist. It is possible to merge the provinces by building a tunnel between cities 1 and 3.In the third example at least one additional road is necessary. For example it is possible to build additional road between cities 1 and 2 and build two tunnels between cities 1 and 3, 2 and 4 after that.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac1427cb", "template_md5": "35d339e4", "result": "You are given a map with $n$ cities and $m$ roads connecting them.  The goal is to divide the cities into provinces such that:\n\n* Every city within a province can reach every other city in that province by traveling along the roads.\n* There are no roads connecting cities in different provinces.\n\nYou are also given a number $k$.  You can build tunnels between cities, but there can be at most $k$ tunnels connected to each province.\n\nThe problem is to find the minimum number of new roads you need to build so that you can connect all cities in the map using a combination of roads and tunnels, while respecting the $k$ tunnel limit per province."}, {"prompt_md5": "726bb640", "template_md5": "465699a0", "result": "You are given a map with cities connected by roads.  The goal is to divide the cities into groups (provinces) so that you can travel between any two cities within a province, but not between different provinces. You can build tunnels between cities, but each province can have at most a certain number of tunnels.  \n\nFind the minimum number of new roads you need to build so that you can connect all cities with tunnels, respecting the tunnel limit per province."}]}