{"uid": "73-E", "url": "https://codeforces.com/contest/73/problem/E", "tags": ["math", " number theory"], "title": "73-E", "statement": "E. Morrowindowstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutVasya plays The Elder Trolls III: Morrowindows. He has a huge list of items in the inventory, however, there is no limits on the size of things. Vasya does not know the total amount of items but he is sure that are not more thanxand not less than2items in his inventory. A new patch for the game appeared to view inventory inndifferent modes. Displaying in modeiis a partition of all inventory items on pages, each of which (except for maybe the last one) shows exactlyaiitems. In addition, each mode shows how many pagesbiis in a complete list. Great! Perhaps this information will be enough for Vasya to find the required number. Moreover, it is very interesting, what is the fewest number of modes in which Vasya can see inventory to determine the number of items in it?Vasya cannot use the information that was received while looking on inventory in some mode for selection of next actions. I. e. Vasya chooses some set of modes first, and then sees all the results and determines the size.Knowing the number ofai,xand assuming that Vasya is very smart, check whether he can uniquely determine the number of items in his inventory, and how many modes he will need to do that if he knows numbersai,xand he is able to know numberbiafter viewing items in modei.InputThe first line contains two integersnandx(0 ≤n≤ 105, 2 ≤x≤ 109). The second line contains integersai(1 ≤ai≤ 109). Some numbers among allaimay be equal.OutputOutput the fewest amount of modes required to uniquely determine amount of items in the inventory. If there is no solution output- 1.ExamplesInput2 42 3Output2Input1 42Output-1NoteIn the second example Vasya is not able to determine items count uniquely because 3 items, as well as 4 items, can be displayed on two pages.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2a055b6a", "template_md5": "35d339e4", "result": "You are given a number $n$ and a range $2 \\le x \\le 10^9$.  There are $n$ different ways to display a list of items, each with a different number of items per page ($a_i$) and a different number of pages ($b_i$).  \n\nYou need to find the minimum number of display modes required to uniquely determine the total number of items in the list, given that you know the values of $a_i$ and $b_i$ for each mode.\n\nIf it is impossible to uniquely determine the number of items, output -1."}, {"prompt_md5": "0fe4555e", "template_md5": "465699a0", "result": "You are given a list of numbers representing the number of items shown on each page for different display modes.  You also know the total number of items is between 2 and a given limit.  Determine the fewest number of display modes needed to uniquely figure out the total number of items. If it's impossible to determine the total number of items, output -1."}]}