{"uid": "730-D", "url": "https://codeforces.com/contest/730/problem/D", "tags": ["greedy", " implementation", " math"], "title": "730-D", "statement": "D. Running Over The Bridgestime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputPolycarp is playing a game called \"Running Over The Bridges\". In this game he has to run overnbridges from the left to the right. Bridges are arranged one after the other, so thei-th bridge begins where the(i- 1)-th bridge ends.You have the following data about bridges:liandti— the length of thei-th bridge and the maximum allowed time which Polycarp can spend running over thei-th bridge. Thus, if Polycarp is in the beginning of the bridgeiat the timeTthen he has to leave it at the timeT+tior earlier. It is allowed to reach the right end of a bridge exactly at the timeT+ti.Polycarp can run from the left side to the right one with speed0.5, so he will run over a bridge with lengthsin time2·s. Besides, he has several magical drinks. If he uses one drink, his speed increases twice (i.e. to value 1) forrseconds. All magical drinks are identical. Please note that Polycarp can use a drink only atintegermoments of time, and he drinks it instantly and completely. Additionally, if Polycarp uses a drink at the momentThe can use the next drink not earlier than at the momentT+r.What is the minimal number of drinks Polycarp has to use to run over allnbridges? If this number is not greater than105, then you have to find out the moments of time when Polycarp has to use each magical drink.InputThe first line contains two integersnandr(1 ≤n≤ 2·105,1 ≤r≤ 1012) — the number of bridges and the duration of the effect of a magical drink.The second line contains a sequence of integersl1,l2, ...,ln(1 ≤li≤ 5·106), whereliis equal to the length of thei-th bridge.The third line contains a sequence of integerst1,t2, ...,tn(1 ≤ti≤ 107), wheretiis equal to the maximum allowed time which Polycarp can spend running over thei-th bridge.OutputThe first line of the output should containk— the minimal number of drinks which Polycarp has to use, or-1if there is no solution.If the solution exists and the value ofkis not greater than105then outputkintegers on the next line — moments of time from beginning of the game when Polycarp has to use drinks. Print the moments of time in chronological order. If there are several solutions, you can output any of them.ExamplesInput1 3710Output20 3Input3 33 3 33 3 2Output-1Input3 1000005 5 55 7 8Output10Input4 10001 2 3 410 9 10 9Output0NoteIn the first case, there is only one bridge and it is clear that Polycarp cannot run over it without magical drinks. So, if he will use one magical drink on start (moment of time0), and the second one — three seconds later (moment of time3), he will be able to reach the end of the bridge in time. Please note, in this case there are several possible answers to the problem. For example, Polycarp can use the first drink at the moment of time4and the second one — at the moment of time7.In the second case, Polycarp cannot run over all bridges even if he will use magical drinks. So, answer in this case is-1.In the fourth case, Polycarp can run over all bridges without magical drinks.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "27eb2f1f", "template_md5": "35d339e4", "result": "There are $n$ bridges that need to be crossed. Each bridge has a length $l_i$ and a time limit $t_i$ for crossing it.  You can run at a speed of 0.5 units per time unit. You have magical drinks that can double your speed (to 1 unit per time unit) for $r$ time units.  \n\nYou can only use a drink at integer time units, and you must wait at least $r$ time units after using a drink before using another.\n\nFind the minimum number of drinks needed to cross all the bridges within the time limits. If possible, also list the times at which you should use each drink. \n\n**Input:**\n\n* The first line contains two integers $n$ and $r$ ($1 \\le n \\le 2 \\cdot 10^5$, $1 \\le r \\le 10^{12}$).\n* The second line contains $n$ integers $l_1, l_2, ..., l_n$ ($1 \\le l_i \\le 5 \\cdot 10^6$), representing the lengths of the bridges.\n* The third line contains $n$ integers $t_1, t_2, ..., t_n$ ($1 \\le t_i \\le 10^7$), representing the time limits for each bridge.\n\n**Output:**\n\n* The first line contains an integer $k$, the minimum number of drinks needed. If no solution exists, output -1.\n* If $k \\le 10^5$, the next line contains $k$ integers, representing the times at which to use each drink in chronological order."}, {"prompt_md5": "01d4205a", "template_md5": "465699a0", "result": "You have a series of segments of varying lengths. You can travel at a base speed, but can use special items to temporarily double your speed for a limited time.  You need to determine the minimum number of items needed to traverse all segments within their time limits. If possible, also list the times you should use each item."}]}