{"uid": "730-C", "url": "https://codeforces.com/contest/730/problem/C", "tags": ["binary search", " dfs and similar"], "title": "730-C", "statement": "C. Bulmarttime limit per test1.5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputA new trade empire is rising in Berland. Bulmart, an emerging trade giant, decided to dominate the market of ... shovels! And now almost every city in Berland has a Bulmart store, and some cities even have several of them! The only problem is, at the moment sales are ... let's say a little below estimates. Some people even say that shovels retail market is too small for such a big company to make a profit. But the company management believes in the future of that market and seeks new ways to increase income.There arencities in Berland connected withmbi-directional roads. All roads have equal lengths. It can happen that it is impossible to reach a city from another city using only roads. There is no road which connects a city to itself. Any pair of cities can be connected by at most one road.There arewBulmart stores in Berland. Each of them is described by three numbers:ci— the number of city where thei-th store is located (a city can have no stores at all or have several of them),ki— the number of shovels in thei-th store,pi— the price of a single shovel in thei-th store (in burles).The latest idea of the Bulmart management is to create a program which will help customers get shovels as fast as possible for affordable budget. Formally, the program has to find the minimum amount of time needed to deliverrjshovels to the customer in the citygjfor the total cost of no more thanajburles. The delivery time between any two adjacent cities is equal to1. If shovels are delivered from several cities, the delivery time is equal to the arrival time of the last package. The delivery itself is free of charge.The program needs to find answers toqsuch queries. Each query has to be processed independently from others, i.e. a query does not change number of shovels in stores for the next queries.InputThe first line contains two integersn,m(1 ≤n≤ 5000,0 ≤m≤min(5000,n·(n- 1) / 2)). Each of the nextmlines contains two integersxeandye, meaning that thee-th road connects citiesxeandye(1 ≤xe,ye≤n).The next line contains a single integerw(1 ≤w≤ 5000) — the total number of Bulmart stores in Berland. Each of the nextwlines contains three integers describing thei-th store:ci,ki,pi(1 ≤ci≤n, 1 ≤ki,pi≤ 2·105).The next line contains a single integerq(1 ≤q≤ 1000) — the number of queries. Each of the nextqlines contains three integers describing thej-th query:gj,rjandaj(1 ≤gj≤n,1 ≤rj,aj≤ 109)OutputOutputqlines. On thej-th line, print an answer for thej-th query — the minimum amount of time needed to deliverrjshovels to the customer in citygjspending no more thanajburles. Print-1if there is no solution for thej-th query.ExampleInput6 44 25 41 23 224 1 23 2 361 2 62 3 73 1 24 3 85 2 56 1 10Output2-1223-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d10413d4", "template_md5": "35d339e4", "result": "There are $n$ cities connected by $m$ bidirectional roads of equal length.  Each road connects two distinct cities. There are $w$ stores, each located in a city and containing a certain number of shovels at a specific price.\n\nFor each of $q$ queries, you are given a city $g_j$, the number of shovels $r_j$ needed, and a maximum budget $a_j$.  Find the minimum time to deliver $r_j$ shovels to city $g_j$ with a total cost no more than $a_j$. The delivery time between adjacent cities is 1. If shovels are delivered from multiple cities, the delivery time is the arrival time of the last package.\n\nIf it's impossible to fulfill the query, output -1."}, {"prompt_md5": "a47eb108", "template_md5": "465699a0", "result": "You are given a map of cities connected by roads. Each city can have multiple stores selling a certain number of items at a specific price.  You need to find the fastest way to deliver a given number of items to a specific city, spending no more than a given amount of money.  The delivery time between cities is 1.  If there is no way to deliver the items within the budget, output -1."}]}