{"uid": "730-J", "url": "https://codeforces.com/contest/730/problem/J", "tags": ["dp"], "title": "730-J", "statement": "J. Bottlestime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputNick hasnbottles of soda left after his birthday. Each bottle is described by two values: remaining amount of sodaaiand bottle volumebi(ai≤bi).Nick has decided to pour all remaining soda into minimal number of bottles, moreover he has to do it as soon as possible. Nick spendsxseconds to pourxunits of soda from one bottle to another.Nick asks you to help him to determinek— the minimal number of bottles to store all remaining soda andt— the minimal time to pour soda intokbottles. A bottle can't store more soda than its volume. All remaining soda should be saved.InputThe first line contains positive integern(1 ≤n≤ 100) — the number of bottles.The second line containsnpositive integersa1,a2, ...,an(1 ≤ai≤ 100), whereaiis the amount of soda remaining in thei-th bottle.The third line containsnpositive integersb1,b2, ...,bn(1 ≤bi≤ 100), wherebiis the volume of thei-th bottle.It is guaranteed thatai≤bifor anyi.OutputThe only line should contain two integerskandt, wherekis the minimal number of bottles that can store all the soda andtis the minimal time to pour the soda intokbottles.ExamplesInput43 3 4 34 7 6 5Output2 6Input21 1100 100Output1 1Input510 30 5 6 2410 41 7 8 24Output3 11NoteIn the first example Nick can pour soda from the first bottle to the second bottle. It will take 3 seconds. After it the second bottle will contain3 + 3 = 6units of soda. Then he can pour soda from the fourth bottle to the second bottle and to the third bottle: one unit to the second and two units to the third. It will take1 + 2 = 3seconds. So, all the soda will be in two bottles and he will spend3 + 3 = 6seconds to do it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7f475064", "template_md5": "35d339e4", "result": "You are given $n$ bottles, each with a remaining amount of soda ($a_i$) and a volume ($b_i$).  The goal is to pour all the soda into the minimum number of bottles while minimizing the total time taken.  \n\n**Input:**\n\n* The first line contains $n$ (the number of bottles).\n* The second line contains $n$ integers, $a_1, a_2, ..., a_n$ (the remaining soda in each bottle).\n* The third line contains $n$ integers, $b_1, b_2, ..., b_n$ (the volume of each bottle).\n\n**Output:**\n\n* Output two integers:\n    * $k$: the minimum number of bottles needed.\n    * $t$: the minimum time to pour the soda.\n\n**Constraints:**\n\n* $1 \\le n \\le 100$\n* $1 \\le a_i \\le b_i$ for all $i$\n\n\n\n**Note:** It takes $x$ seconds to pour $x$ units of soda from one bottle to another.  A bottle cannot store more soda than its volume. All soda must be saved."}, {"prompt_md5": "a021c3a4", "template_md5": "465699a0", "result": "You are given a list of items, each with a weight and a capacity. You need to find the minimum number of containers needed to hold all the items, and the minimum time it takes to transfer the items between containers. Each container has a limited capacity, and transferring items between containers takes time proportional to the amount being transferred."}]}