{"uid": "730-B", "url": "https://codeforces.com/contest/730/problem/B", "tags": ["constructive algorithms", " interactive"], "title": "730-B", "statement": "B. Minimum and Maximumtime limit per test4 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThis is an interactive problem. You have to useflushoperation right after printing each line. For example, in C++ you should use functionfflush(stdout), in Java —System.out.flush(), in Pascal —flush(output)and in Python —sys.stdout.flush().In this problem, you need to find maximal and minimal elements of an array. What could be simpler?You can imagine that the jury has an array, and initially you know the only numbern— array's length.Array's elements are numbered from1ton. You are allowed to compare two elements of the array by using their indicesiandj. There are three possible responses to this query: '<' (ifaiis less thanaj), '=' (ifaiis equal toaj) and finally '>' (ifaiis greater thanaj).It's known that it's always possible to find both maximal and minimal elements of the array by using no more thancomparisons, where⌈x⌉is the result of roundingxup.Write the program that will find positions of the minimum and the maximum in the jury's array of lengthn, by using no more thanf(n)comparisons.InteractionEach test for this problem will contain one or more arrays. You have to find positions of minimal and maximal elements for each of these arrays. The first line of the input contains integerT(1 ≤T≤ 1000) — number of arrays in the test.Thus, at the beginning, you program should read numberT, and then it should solve the problem forTjury's arrays one by one.Then input for each array goes. Firstly, your program has to read the numbern(1 ≤n≤ 50) — the length of the array. It will be provided in the next line of the input.Further, your program can perform comparisons or report that the answer is found.To perform a comparison, you have to output string of the following pattern «? i j» (iandjmust be integer numbers from1ton) — the indices of the elements to compare in the current query.To report the indices of minimal and maximal elements of the hidden array, your program have to output a line in the form «! i j» (iandjmust be integer numbers from1ton), whereiis an index of the minimal element of array, andjis an index of the maximal element of the array. If there are several possible answers to the problem, you can output any of them.There are several possible responses for a comparison:'<' — ifaiis less thanaj,'=' — ifaiis equal toaj,'>' — ifaiis greater thanaj.For an array of lengthnyour program can make at mostcomparisons. Note that the operation of reporting an answer («! i j» ) is not included into the value off(n).After the answer is reported, your program has to solve the problem for the next array or it should terminate if allTarrays are processed.ExampleInput22>3==Output? 1 2! 2 1? 3 1? 2 1! 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "42ca1d68", "template_md5": "35d339e4", "result": "You are given a list of integers of length $n$. You can compare any two elements in the list using the following operations:\n\n*  `? i j`: This asks the system to compare the element at index $i$ with the element at index $j$. The system will respond with one of the following:\n    * `<`: If the element at index $i$ is less than the element at index $j$.\n    * `=`: If the element at index $i$ is equal to the element at index $j$.\n    * `>`: If the element at index $i$ is greater than the element at index $j$.\n\n* `! i j`: This tells the system that you have found the minimum and maximum elements. The system will accept this if $i$ is the index of the minimum element and $j$ is the index of the maximum element.\n\nYou need to find the indices of the minimum and maximum elements in the list using as few comparisons as possible. The maximum number of comparisons allowed is  $\\lceil \\log_2 n \\rceil$. \n\n\n\nYou will be given multiple lists to process. For each list, you need to find the minimum and maximum element indices and report them."}, {"prompt_md5": "49ecf636", "template_md5": "465699a0", "result": "You are given a list of numbers. You can compare any two numbers in the list. Your goal is to find the smallest and largest numbers in the list using as few comparisons as possible."}]}