{"uid": "730-K", "url": "https://codeforces.com/contest/730/problem/K", "tags": ["graphs"], "title": "730-K", "statement": "K. Roads Orientation Problemtime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputBerland consists ofncities andmbidirectional roads connecting pairs of cities. There is no road connecting a city to itself, and between any pair of cities there is no more than one road. It is possible to reach any city from any other moving along roads.Currently Mr. President is in the citysand his destination is the cityt. He plans to move along roads fromstot(s≠t).That's why Ministry of Fools and Roads has difficult days. The minister is afraid that Mr. President could get into a traffic jam or get lost. Who knows what else can happen!To be sure that everything goes as planned, the minister decided to temporarily make all roads one-way. So each road will be oriented in one of two possible directions. The following conditions must be satisfied:There should be no cycles along roads after orientation.The citysshould be the only such city that all its roads are oriented out (i.e. there are no ingoing roads to the citysand the citysis the only such city).The citytshould be the only such city that all its roads are oriented in (i.e. there are no outgoing roads from the citytand the citytis the only such city).Help the minister solve his problem. Write a program to find any such orientation of all roads or report that no solution exists.InputEach test in this problem contains one or more test cases to solve. The first line of the input contains positive numberT— the number of cases to solve.Each case starts with a line containing four integersn,m,sandt(2 ≤n≤ 4·105,1 ≤m≤ 106,1 ≤s,t≤n,s≠t) — the number of cities, the number of roads and indices of departure and destination cities. The cities are numbered from1ton.The followingmlines contain roads, one road per line. Each road is given as two integer numbersxj,yj(1 ≤xj,yj≤n,xj≠yj), which means that thej-th road connects citiesxjandyj. There is at most one road between any pair of cities. It is possible to reach any city from any other moving along roads.The sum of valuesnover all cases in a test doesn't exceed4·105. The sum of valuesmover all cases in a test doesn't exceed106.OutputFor each case print \"Yes\" if the answer exists. In the followingmlines print roads in the required directions. You can print roads in arbitrary order. If there are multiple answers, print any of them.Print the only line \"No\" if there is no answer for a case.ExampleInput24 4 1 21 22 33 44 13 2 1 33 12 3OutputYes1 23 24 31 4No", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "da6ba8ea", "template_md5": "35d339e4", "result": "You are given a network of $n$ cities connected by $m$ bidirectional roads.  There is no road connecting a city to itself, and between any pair of cities there is no more than one road.  \n\nYou need to find a way to make all the roads one-way (directed) such that:\n\n* There are no cycles in the resulting directed graph.\n* There is exactly one city $s$ where all roads connected to it point outwards (no roads point into $s$).\n* There is exactly one city $t$ where all roads connected to it point inwards (no roads point out of $t$).\n\nIf such a one-way orientation exists, output \"Yes\" followed by a list of the roads and their directions. Otherwise, output \"No\"."}, {"prompt_md5": "28b82c4b", "template_md5": "465699a0", "result": "You are given a network of cities connected by roads.  You need to assign a direction to each road (one-way) so that:\n\n* There are no loops in the network.\n* One city has all roads leading out of it.\n* Another city has all roads leading into it.\n\nDetermine if such a direction assignment is possible. If so, provide one example."}]}