{"uid": "730-F", "url": "https://codeforces.com/contest/730/problem/F", "tags": [], "title": "730-F", "statement": "F. Ber Patiotime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputPolycarp is a regular customer at the restaurant \"Ber Patio\". He likes having lunches there.\"Ber Patio\" has special discount program for regular customers. A customer can collect bonuses and partially cover expenses in the restaurant.Let's assume a customer currently hasbbonuses and she has to payrburles for a lunch. In this case the customer can use bonuses (1 bonus = 1 burle) to reduce the payment. She can cover at most half of the payment using bonuses. However, 1 bonus will be added to the customer's bonus balance per each 10 burles she paid.Formally:a customer can choose any numberxof bonuses to use ()),the customer's bonus balance is reduced byx,the customer paysr-xburles,the customer's bonus balance is increased by⌊(r-x) / 10⌋(i.e. integer division rounded down is used).Initially, there arebbonuses on Polycarp's account. Polycarp is going to have a lunch in \"Ber Patio\" for the nextndays. He estimated the valuesa1,a2, ...,an, whereaiis the number of burles in a receipt for thei-th day. The sum over all receipts doesn't exceed105burles.Write a program to find the minimum number of burles Polycarp has to spend and an optimal strategy to use bonuses.InputThe first line contains two integer numbersnandb(1 ≤n≤ 5000,0 ≤b≤ 105) — number of days and initial number of bonuses Polycarp has.The second line contains the integer sequencea1,a2, ...,an(1 ≤ai≤ 1000), whereaiis the amount of burles in thei-th day's receipt.It is guaranteed that the sum of all receipts does not exceed105burles.OutputOn the first line, print the expected minimal number of burles to pay for allnreceipts.On the second line, print the sequence of integer numbersb1,b2, ...,bn, wherebiis the number of bonuses to use on thei-th day. If there are multiple solutions, print any of them.ExamplesInput3 2112 75 52Output1102 5 22Input3 3958 64 33Output10728 4 16", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e8117f5b", "template_md5": "35d339e4", "result": "You are given a number of days $n$ and an initial number of bonuses $b$. Each day, you have a receipt with a cost $a_i$ in burles. You can use bonuses to pay for your meals, with 1 bonus equaling 1 burle. You can use at most half of the cost of each meal in bonuses. For every 10 burles you pay, you get 1 bonus.\n\nFind the minimum number of burles you need to spend over all $n$ days and determine how many bonuses to use each day to achieve this minimum. \n\nThe sum of all receipts does not exceed $10^5$ burles."}, {"prompt_md5": "627057b1", "template_md5": "465699a0", "result": "You have a set of costs for  'n' days. You have a starting number of points. Each day, you can use points to reduce the cost, but you can only use up to half the cost in points. For every 10 burles paid, you get 1 point. Find the minimum total burles you need to pay and how many points to use each day."}]}