{"uid": "730-I", "url": "https://codeforces.com/contest/730/problem/I", "tags": ["dp", " flows", " graphs", " greedy"], "title": "730-I", "statement": "I. Olympiad in Programming and Sportstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere arenstudents at Berland State University. Every student has two skills, each measured as a number:ai— the programming skill andbi— the sports skill.It is announced that an Olympiad in programming and sports will be held soon. That's why Berland State University should choose two teams: one to take part in the programming track and one to take part in the sports track.There should be exactlypstudents in the programming team and exactlysstudents in the sports team. A student can't be a member of both teams.The university management considers that the strength of the university on the Olympiad is equal to the sum of two values: the programming team strength and the sports team strength. The strength of a team is the sum of skills of its members in the corresponding area, so the strength of the programming team is the sum of allaiand the strength of the sports team is the sum of allbiover corresponding team members.Help Berland State University to compose two teams to maximize the total strength of the university on the Olympiad.InputThe first line contains three positive integer numbersn,pands(2 ≤n≤ 3000,p+s≤n) — the number of students, the size of the programming team and the size of the sports team.The second line containsnpositive integersa1,a2, ...,an(1 ≤ai≤ 3000), whereaiis the programming skill of thei-th student.The third line containsnpositive integersb1,b2, ...,bn(1 ≤bi≤ 3000), wherebiis the sports skill of thei-th student.OutputIn the first line, print the the maximum strength of the university on the Olympiad. In the second line, printpnumbers — the members of the programming team. In the third line, printsnumbers — the members of the sports team.The students are numbered from 1 tonas they are given in the input. All numbers printed in the second and in the third lines should be distinct and can be printed in arbitrary order.If there are multiple solutions, print any of them.ExamplesInput5 2 21 3 4 5 25 3 2 1 4Output183 41 5Input4 2 210 8 8 310 7 9 4Output311 23 4Input5 3 15 2 5 1 76 3 1 6 3Output231 3 54", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b74c39c5", "template_md5": "35d339e4", "result": "There are $n$ students. Each student has two skills: a programming skill ($a_i$) and a sports skill ($b_i$).  \n\nYou need to form two teams: a programming team of size $p$ and a sports team of size $s$.  Each student can only be on one team.\n\nThe strength of a team is the sum of the skills of its members. The total strength of the university is the sum of the programming team strength and the sports team strength.\n\nFind the two teams that maximize the total strength of the university.\n\n**Input:**\n\n* The first line contains three integers: $n$, $p$, and $s$ ($2 \\le n \\le 3000$, $p + s \\le n$).\n* The second line contains $n$ integers: $a_1$, $a_2$, ..., $a_n$ ($1 \\le a_i \\le 3000$).\n* The third line contains $n$ integers: $b_1$, $b_2$, ..., $b_n$ ($1 \\le b_i \\le 3000$).\n\n**Output:**\n\n* The first line contains the maximum total strength of the university.\n* The second line contains $p$ distinct integers: the members of the programming team.\n* The third line contains $s$ distinct integers: the members of the sports team."}, {"prompt_md5": "a7fa58f6", "template_md5": "465699a0", "result": "You have a group of people with two different skill levels. You need to divide them into two teams, one for a programming competition and one for a sports competition. Each team must have a specific number of people.  Find the team combinations that maximize the total skill level of both teams."}]}