{"uid": "730-E", "url": "https://codeforces.com/contest/730/problem/E", "tags": ["greedy", " implementation"], "title": "730-E", "statement": "E. Award Ceremonytime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputAll-Berland programming contest comes to an end. In total,nteams participated in it. Like in ACM-ICPC, current results stopped refreshing one hour before the contest ends. So at the Award Ceremony, results are partially known. For each team the valueaiis given — the number of points thei-th team has earned before the last hour of the contest. Besides that, the Jury has evaluated all submissions sent during the last hour and knows valuesdi— the number of points earned by thei-th team during the last hour (these values can be negative, which means that a team can lose points).Before the contest, each team got unique id from 1 ton. According to the contest rules, a team with more points takes a higher place. If two or more teams have equal number of points, the team with lower id will take the higher place. So no two teams can share the same place.The Award Ceremony proceeds in the following way. At the beginning of the ceremony, a large screen shows the results for the time moment \"one hour before the end\", which means that thei-th team hasaipoints. Then the Jury unfreezes results of the teams one by one in some order. When result of thej-th team is unfrozen, its score changes fromajtoaj+dj. At this time the table of results is modified and the place of the team can change. The unfreezing of thej-th team is followed by the applause from the audience with duration of|xj-yj|seconds, wherexjis the place of thej-th team before unfreezing andyjis the place right after the unfreezing. For example, if the team does not change the place, there is no applause from the audience. As you can see, during the Award Ceremony, each team will be unfrozen exactly once.Your task is to find such an order to unfreeze all the teams that the total duration of applause is maximum possible.InputThe first line of the input file contains a single integern(1 ≤n≤ 100) — the number of teams.Each of the nextnlines contains two integersaianddi(1 ≤ai≤ 100,- 100 ≤di≤ 100) — the number of points thei-th team has earned before the last hour of the contest and the number of points earned by this team during the last hour. It is possible that after unfreezing a team will have a negative score.OutputPrint the only integer — maximal total applause duration in seconds if the Jury can choose any order of the teams to unfreeze.ExamplesInput417 -1452 -51 526 0Output4Input54 53 25 -36 -24 3Output14NoteIn the first example the initial standings are:Team 2, 52 pointsTeam 1, 17 pointsTeam 4, 6 pointsTeam 3, 1 pointHere any order of unfreezing the teams leads to 4 seconds of applause in total. For example, let's unfreeze teams in their order from the Team 1 to the Team 4.After the Team 1 became unfrozen the standings are:Team 2, 52 pointsTeam 4, 6 pointsTeam 1, 3 pointsTeam 3, 1 pointSo there is 1 second of applause, because the difference between old and new places|2 - 3| = 1.After the Team 2 became unfrozen the standings are:Team 2, 47 pointsTeam 4, 6 pointsTeam 1, 3 pointsTeam 3, 1 pointThe place of the Team 2 has not changed, so no applause during unfreezing.After the Team 3 became unfrozen the standings are:Team 3, 53 pointTeam 2, 47 pointsTeam 4, 6 pointsTeam 1, 3 pointsThe place of the Team 3 has changed from 4 to 1, so the duration of applause is|4 - 1| = 3.The unfreezing of the Team 4 has not changed any place becaused4= 0.Therefore, the total duration of applause is1 + 0 + 3 + 0 = 4seconds.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ad2877b1", "template_md5": "35d339e4", "result": "There are $n$ teams participating in a contest. Each team has a score $a_i$ before the last hour of the contest and a change in score $d_i$ during the last hour.  The teams are ranked based on their total score, with ties broken by team ID (lower ID is higher rank).\n\nThe ceremony reveals the scores one team at a time. When a team's score is revealed, its score changes from $a_i$ to $a_i + d_i$. The ceremony's applause duration depends on how much the team's rank changes. The applause duration for a team is the absolute difference between its old rank and new rank ($|x_i - y_i|$).\n\nFind the order to reveal the teams that maximizes the total applause duration."}, {"prompt_md5": "e474fc0d", "template_md5": "465699a0", "result": "You are given a list of teams and their scores before and after a final hour of competition.  You need to find the order to reveal the final scores that will maximize the total time people clap.  The clapping time is based on how much a team's ranking changes when their final score is revealed."}]}