{"uid": "731-B", "url": "https://codeforces.com/contest/731/problem/B", "tags": ["constructive algorithms", " greedy"], "title": "731-B", "statement": "B. Coupons and Discountstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe programming competition season has already started and it's time to train for ICPC. Sereja coaches his teams for a number of year and he knows that to get ready for the training session it's not enough to prepare only problems and editorial. As the training sessions lasts for several hours, teams become hungry. Thus, Sereja orders a number of pizzas so they can eat right after the end of the competition.Teams plan to train forntimes duringnconsecutive days. During the training session Sereja orders exactly one pizza for each team that is present this day. He already knows that there will beaiteams on thei-th day.There are two types of discounts in Sereja's favourite pizzeria. The first discount works if one buys two pizzas at one day, while the second is a coupon that allows to buy one pizza during twoconsecutivedays (two pizzas in total).As Sereja orders really a lot of pizza at this place, he is the golden client and can use the unlimited number of discounts and coupons of any type at any days.Sereja wants to order exactlyaipizzas on thei-th day while using only discounts and coupons. Note, that he will never buy more pizzas than he need for this particular day. Help him determine, whether he can buy the proper amount of pizzas each day if he is allowed to use only coupons and discounts. Note, that it's also prohibited to have any active coupons after the end of the dayn.InputThe first line of input contains a single integern(1 ≤n≤ 200 000) — the number of training sessions.The second line containsnintegersa1,a2, ...,an(0 ≤ai≤ 10 000) — the number of teams that will be present on each of the days.OutputIf there is a way to order pizzas using only coupons and discounts and do not buy any extra pizzas on any of the days, then print \"YES\" (without quotes) in the only line of output. Otherwise, print \"NO\" (without quotes).ExamplesInput41 2 1 2OutputYESInput31 0 1OutputNONoteIn the first sample, Sereja can use one coupon to buy one pizza on the first and the second days, one coupon to buy pizza on the second and the third days and one discount to buy pizzas on the fourth days. This is the only way to order pizzas for this sample.In the second sample, Sereja can't use neither the coupon nor the discount without ordering an extra pizza. Note, that it's possible that there will be no teams attending the training sessions on some days.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9055c4b9", "template_md5": "35d339e4", "result": "There are $n$ days of training sessions. On the $i$-th day, there will be $a_i$ teams.  \n\nYou can buy pizzas with two types of discounts:\n\n* **Discount 1:** Buy two pizzas at once and get a discount.\n* **Discount 2:** Buy one pizza on day $i$ and one pizza on day $i+1$ at a discounted price.\n\nYou can use as many discounts and coupons as you want, but you can only have active coupons at the end of a day.\n\nDetermine if it's possible to buy exactly $a_i$ pizzas on each day using only discounts and coupons."}, {"prompt_md5": "46d23afc", "template_md5": "465699a0", "result": "You are given a list of numbers representing the number of items needed each day for a certain number of days. You have two discount options: buy two items at once for a discount, or use a coupon to buy one item for two consecutive days.  Determine if it's possible to get the required number of items each day using only these discounts and coupons without buying extra items."}]}