{"uid": "731-E", "url": "https://codeforces.com/contest/731/problem/E", "tags": ["dp", " games"], "title": "731-E", "statement": "E. Funny Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOnce upon a time Petya and Gena gathered after another programming competition and decided to play some game. As they consider most modern games to be boring, they always try to invent their own games. They have only stickers and markers, but that won't stop them.The game they came up with has the following rules. Initially, there arenstickers on the wall arranged in a row. Each sticker has some number written on it. Now they alternate turn, Petya moves first.One move happens as follows. Lets say there arem≥ 2stickers on the wall. The player, who makes the current move, picks some integerkfrom2tomand takeskleftmost stickers (removes them from the wall). After that he makes the new sticker, puts it to the left end of the row, and writes on it the new integer, equal to the sum of all stickers he took on this move.Game ends when there is only one sticker left on the wall. The score of the player is equal to the sum of integers written on all stickers he took during all his moves. The goal of each player is to maximize the difference between his score and the score of his opponent.Given the integernand the initial sequence of stickers on the wall, define the result of the game, i.e. the difference between the Petya's and Gena's score if both players play optimally.InputThe first line of input contains a single integern(2 ≤n≤ 200 000) — the number of stickers, initially located on the wall.The second line containsnintegersa1,a2, ...,an(- 10 000 ≤ai≤ 10 000) — the numbers on stickers in order from left to right.OutputPrint one integer — the difference between the Petya's score and Gena's score at the end of the game if both players play optimally.ExamplesInput32 4 8Output14Input41 -7 -2 3Output-3NoteIn the first sample, the optimal move for Petya is to take all the stickers. As a result, his score will be equal to14and Gena's score will be equal to0.In the second sample, the optimal sequence of moves is the following. On the first move Petya will take first three sticker and will put the new sticker with value- 8. On the second move Gena will take the remaining two stickers. The Petya's score is1 + ( - 7) + ( - 2) =  - 8, Gena's score is( - 8) + 3 =  - 5, i.e. the score difference will be- 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d2480654", "template_md5": "35d339e4", "result": "There are $n$ stickers on a wall, each with a number written on it. Two players take turns playing a game.  \n\nOn each turn, a player chooses a group of at least 2 stickers from the left side of the wall. They remove these stickers and create a new sticker with the sum of the numbers on the removed stickers. This new sticker is placed at the left end of the wall.\n\nThe game ends when there is only one sticker left. The player with the highest sum of all the numbers they collected during the game wins.\n\nGiven the number of stickers ($n$) and the numbers on each sticker, find the difference in scores between the two players if they both play optimally."}, {"prompt_md5": "56e34b2f", "template_md5": "465699a0", "result": "Two players take turns removing a group of consecutive items from a line.  Each time, they remove a group and create a new item with the sum of the removed items' values. The game ends when only one item remains.  The winner is the player with the highest total sum of the values of the items they created.  Find the difference in scores if both players play optimally."}]}