{"uid": "731-F", "url": "https://codeforces.com/contest/731/problem/F", "tags": ["brute force", " data structures", " implementation", " math", " number theory"], "title": "731-F", "statement": "F. Video Cardstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Vlad is fond of popular computer game Bota-2. Recently, the developers announced the new add-on named Bota-3. Of course, Vlad immediately bought only to find out his computer is too old for the new game and needs to be updated.There arenvideo cards in the shop, the power of thei-th video card is equal to integer valueai. As Vlad wants to be sure the new game will work he wants to buy not one, but several video cards and unite their powers using the cutting-edge technology. To use this technology one of the cards is chosen as the leading one and other video cards are attached to it as secondary. For this new technology to work it's required that the power of each of the secondary video cards is divisible by the power of the leading video card. In order to achieve that the power of any secondary video card can be reduced to any integer value less or equal than the current power. However, the power of the leading video card should remain unchanged, i.e. itcan'tbe reduced.Vlad has an infinite amount of money so he can buy any set of video cards. Help him determine which video cards he should buy such that after picking the leading video card and may be reducing some powers of others to make them work together he will get the maximum total value of video power.InputThe first line of the input contains a single integern(1 ≤n≤ 200 000) — the number of video cards in the shop.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 200 000) — powers of video cards.OutputThe only line of the output should contain one integer value — the maximum possible total power of video cards working together.ExamplesInput43 2 15 9Output27Input48 2 2 7Output18NoteIn the first sample, it would be optimal to buy video cards with powers3,15and9. The video card with power3should be chosen as the leading one and all other video cards will be compatible with it. Thus, the total power would be3 + 15 + 9 = 27. If he buys all the video cards and pick the one with the power2as the leading, the powers of all other video cards should be reduced by1, thus the total power would be2 + 2 + 14 + 8 = 26, that is less than27. Please note, that it's not allowed to reduce the power of the leading video card, i.e. one can't get the total power3 + 1 + 15 + 9 = 28.In the second sample, the optimal answer is to buy all video cards and pick the one with the power2as the leading. The video card with the power7needs it power to be reduced down to6. The total power would be8 + 2 + 2 + 6 = 18.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1db9b1df", "template_md5": "35d339e4", "result": "You are given $n$ integers representing the power of $n$ video cards. You can choose one video card as the \"leading\" card, and the power of the other cards can be reduced to any integer less than or equal to their original power, as long as the reduced power is divisible by the leading card's power.  \n\nFind the maximum total power of the video cards that can be achieved by choosing a leading card and optionally reducing the power of the other cards."}, {"prompt_md5": "569f2213", "template_md5": "465699a0", "result": "You are given a list of numbers representing the power of different items. You can choose one item as the \"leader\" and combine it with others.  To combine, the power of each other item must be divisible by the leader's power. You can reduce the power of any item except the leader. Find the combination of items that results in the highest total power."}]}