{"uid": "732-F", "url": "https://codeforces.com/contest/732/problem/F", "tags": ["dfs and similar", " graphs"], "title": "732-F", "statement": "F. Tourist Reformtime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBerland is a tourist country! At least, it can become such — the government of Berland is confident about this.There arencities in Berland, some pairs of which are connected by two-ways roads. Each road connects two different cities. In Berland there are no roads which connect the same pair of cities. It is possible to get from any city to any other city using given two-ways roads.According to the reform each road will become one-way. It will be oriented to one of two directions.To maximize the tourist attraction of Berland, after the reform for each cityithe valueriwill be calculated. It will equal to the number of citiesxfor which there is an oriented path from the cityito the cityx. In other words,riwill equal the number of cities which can be reached from the cityiby roads.The government is sure that tourist's attention will be focused on the minimum value ofri.Help the government of Berland make the reform to maximize the minimum ofri.InputThe first line contains two integersn,m(2 ≤n≤ 400 000, 1 ≤m≤ 400 000) — the number of cities and the number of roads.The nextmlines describe roads in Berland: thej-th of them contains two integersujandvj(1 ≤uj,vj≤n,uj≠vj), whereujandvjare the numbers of cities which are connected by thej-th road.The cities are numbered from1ton. It is guaranteed that it is possible to get from any city to any other by following two-ways roads. In Berland there are no roads which connect the same pair of cities.OutputIn the first line print single integer — the maximum possible valuemin1 ≤i≤n{ri}after the orientation of roads.The nextmlines must contain the description of roads after the orientation: thej-th of them must contain two integersuj,vj, it means that thej-th road will be directed from the cityujto the cityvj. Print roads in the same order as they are given in the input data.ExampleInput7 94 32 67 14 17 33 57 46 52 5Output44 36 27 11 43 75 37 45 62 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a3a00b60", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ roads connecting them. Each road connects two different cities.  You can travel between any two cities using these roads.\n\nEach road will be changed to a one-way street.  For each city $i$, calculate the number of cities $x$ that can be reached from city $i$ using these one-way streets. This number is denoted as $r_i$.\n\nFind the maximum possible minimum value of $r_i$  ($\\min_{1 \\le i \\le n} r_i$)  after changing the roads to one-way streets.  Output this maximum minimum value.\n\nThen, list the one-way streets, specifying the direction of each street (from city $u$ to city $v$)."}, {"prompt_md5": "2013b1aa", "template_md5": "465699a0", "result": "You are given a network of cities connected by two-way roads.  You need to change each two-way road into a one-way road.  The goal is to maximize the minimum number of cities that can be reached from each city after the changes. Output the maximum possible minimum and list the one-way roads."}]}