{"uid": "732-B", "url": "https://codeforces.com/contest/732/problem/B", "tags": ["dp", " greedy"], "title": "732-B", "statement": "B. Cormen — The Best Friend Of a Mantime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently a dog was bought for Polycarp. The dog's name is Cormen. Now Polycarp has a lot of troubles. For example, Cormen likes going for a walk.Empirically Polycarp learned that the dog needs at leastkwalks for any two consecutive days in order to feel good. For example, ifk= 5and yesterday Polycarp went for a walk with Cormen2times, today he has to go for a walk at least3times.Polycarp analysed all his affairs over the nextndays and made a sequence ofnintegersa1,a2, ...,an, whereaiis the number of times Polycarp will walk with the dog on thei-th day while doing all his affairs (for example, he has to go to a shop, throw out the trash, etc.).Help Polycarp determine the minimum number of walks he needs to do additionaly in the nextndays so that Cormen will feel good during all thendays. You can assume that on the day before the first day and on the day after then-th day Polycarp will go for a walk with Cormen exactlyktimes.Write a program that will find the minumum number of additional walks and the appropriate schedule — the sequence of integersb1,b2, ...,bn(bi≥ai), wherebimeans the total number of walks with the dog on thei-th day.InputThe first line contains two integersnandk(1 ≤n,k≤ 500) — the number of days and the minimum number of walks with Cormen for any two consecutive days.The second line contains integersa1,a2, ...,an(0 ≤ai≤ 500) — the number of walks with Cormen on thei-th day which Polycarp has already planned.OutputIn the first line print the smallest number of additional walks that Polycarp should do during the nextndays so that Cormen will feel good during all days.In the second line printnintegersb1,b2, ...,bn, wherebi— the total number of walks on thei-th day according to the found solutions (ai≤bifor allifrom 1 ton). If there are multiple solutions, print any of them.ExamplesInput3 52 0 1Output42 3 2Input3 10 0 0Output10 1 0Input4 62 4 3 5Output02 4 3 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b1ebc649", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers $a_1, a_2, ..., a_n$, where $a_i$ represents the number of times you plan to walk a dog on the $i$-th day. You also have an integer $k$ which represents the minimum number of walks required on consecutive days for the dog to be happy.\n\nDetermine the minimum number of additional walks you need to add to your schedule to ensure the dog is happy every day.  \n\nOutput the minimum number of additional walks and a new schedule $b_1, b_2, ..., b_n$ where $b_i$ represents the total number of walks on the $i$-th day (including the additional walks).  \n\nNote: You can assume that on the day before the first day and the day after the last day, you will walk the dog $k$ times."}, {"prompt_md5": "a4ae5a5b", "template_md5": "465699a0", "result": "You are given a list of numbers representing the planned number of walks per day for the next 'n' days. You also know the minimum number of consecutive days that need to have at least 'k' walks each.  Find the minimum number of extra walks needed to ensure this minimum is met each day, and provide a schedule of the total walks per day."}]}