{"uid": "733-F", "url": "https://codeforces.com/contest/733/problem/F", "tags": ["data structures", " dsu", " graphs", " trees"], "title": "733-F", "statement": "F. Drivers Dissatisfactiontime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn one kingdom there arencities andmtwo-way roads. Each road connects a pair of cities, and for each road we know the level of drivers dissatisfaction — the valuewi.For each road we know the valueci— how many lamziks we should spend to reduce the level of dissatisfaction with this road by one. Thus, to reduce the dissatisfaction with thei-th road byk, we should spendk·cilamziks. Andit is allowed for the dissatisfaction to become zero or even negative.In accordance with the king's order, we need to choosen- 1roads and make them themain roads. An important condition must hold: it should be possible to travel from any city to any other by themain roads.The road ministry has a budget ofSlamziks for the reform. The ministry is going to spend this budget for repair of some roads (to reduce the dissatisfaction with them), and then to choose then- 1main roads.Help to spend the budget in such a way and then to choose the main roads so that the total dissatisfaction with themain roadswill be as small as possible. The dissatisfaction with some roads can become negative. It is not necessary to spend whole budgetS.It is guaranteed that it is possible to travel from any city to any other using existing roads. Each road in the kingdom is a two-way road.InputThe first line contains two integersnandm(2 ≤n≤ 2·105,n- 1 ≤m≤ 2·105) — the number of cities and the number of roads in the kingdom, respectively.The second line containsmintegersw1,w2, ...,wm(1 ≤wi≤ 109), wherewiis the drivers dissatisfaction with thei-th road.The third line containsmintegersc1,c2, ...,cm(1 ≤ci≤ 109), whereciis the cost (in lamziks) of reducing the dissatisfaction with thei-th road by one.The nextmlines contain the description of the roads. Thei-th of this lines contain a pair of integersaiandbi(1 ≤ai,bi≤n,ai≠bi) which mean that thei-th road connects citiesaiandbi. All roads are two-way oriented so it is possible to move by thei-th road fromaitobi, and vice versa. It is allowed that a pair of cities is connected by more than one road.The last line contains one integerS(0 ≤S≤ 109) — the number of lamziks which we can spend for reforms.OutputIn the first line printK— the minimum possible total dissatisfaction withmain roads.In each of the nextn- 1lines print two integersx,vx, which mean that the roadxis among main roads and the roadx, after the reform, has the level of dissatisfactionvx.Consider that roads are numbered from1tomin the order as they are given in the input data. The edges can be printed in arbitrary order. If there are several answers, print any of them.ExamplesInput6 91 3 1 1 3 1 2 2 24 1 4 2 2 5 3 1 61 21 32 32 42 53 53 64 55 67Output01 13 16 17 28 -5Input3 39 5 17 7 22 13 13 22Output53 02 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c50e5890", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ roads connecting them. Each road has a level of driver dissatisfaction, $w_i$, and a cost per unit of dissatisfaction reduction, $c_i$.  You have a budget of $S$ lamziks to spend on reducing dissatisfaction.\n\nYour goal is to choose $n-1$ roads to be \"main roads\" such that:\n\n* You can travel from any city to any other city using only the main roads.\n* The total dissatisfaction of the main roads is minimized.\n\nYou can reduce the dissatisfaction of a road by any amount, even to negative values.\n\nOutput the minimum total dissatisfaction of the main roads and list the chosen main roads along with their final dissatisfaction levels."}, {"prompt_md5": "7fe03b77", "template_md5": "465699a0", "result": "You are given a network of cities connected by roads. Each road has a level of dissatisfaction and a cost to reduce that dissatisfaction. You need to choose a subset of roads to be \"main roads\" such that you can travel between any city and any other city using only the main roads.  You have a budget to spend on reducing the dissatisfaction of some roads.  Find the minimum total dissatisfaction of the main roads after spending your budget."}]}