{"uid": "733-E", "url": "https://codeforces.com/contest/733/problem/E", "tags": ["constructive algorithms", " data structures", " math", " two pointers"], "title": "733-E", "statement": "E. Sleep in Classtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe academic year has just begun, but lessons and olympiads have already occupied all the free time. It is not a surprise that today Olga fell asleep on the Literature. She had a dream in which she was on a stairs.The stairs consists ofnsteps. The steps are numbered from bottom to top, it means that the lowest step has number1, and the highest step has numbern. Above each of them there is a pointer with the direction (up or down) Olga should move from this step. As soon as Olga goes to the next step, the direction of the pointer (above the step she leaves) changes. It means that the direction \"up\" changes to \"down\", the direction \"down\"  —  to the direction \"up\".Olga always moves to the next step in the direction which is shown on the pointer above the step.If Olga moves beyond the stairs, she will fall and wake up. Moving beyond the stairs is a moving down from the first step or moving up from the last one (it means then-th) step.In one second Olga moves one step up or down according to the direction of the pointer which is located above the step on which Olga had been at the beginning of the second.For each step find the duration of the dream if Olga was at this step at the beginning of the dream.Olga's fall also takes one second, so if she was on the first step and went down, she would wake up in the next second.InputThe first line contains single integern(1 ≤n≤ 106) — the number of steps on the stairs.The second line contains a stringswith the lengthn— it denotes the initial direction of pointers on the stairs. Thei-th character of stringsdenotes the direction of the pointer abovei-th step, and is either 'U' (it means that this pointer is directed up), or 'D' (it means this pointed is directed down).The pointers are given in order from bottom to top.OutputPrintnnumbers, thei-th of which is equal either to the duration of Olga's dream or to- 1if Olga never goes beyond the stairs, if in the beginning of sleep she was on thei-th step.ExamplesInput3UUDOutput5 6 3Input10UUDUDUUDDUOutput5 12 23 34 36 27 18 11 6 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1e5411f6", "template_md5": "35d339e4", "result": "There are $n$ steps. Each step has a pointer above it that points either up or down.  \n\nIf a person starts on a step, they move to the next step according to the direction of the pointer. If they move past the top or bottom step, they fall.\n\nGiven the initial direction of each pointer, for each step, determine how long it takes for the person to fall. \n\n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁶) representing the number of steps.\n* The second line contains a string of length $n$ representing the initial direction of each pointer ('U' for up, 'D' for down).\n\nOutput:\n\n* Print $n$ numbers, where the $i$-th number is the duration of the fall starting from the $i$-th step. If the person never falls from the $i$-th step, print -1."}, {"prompt_md5": "7b81f2bc", "template_md5": "465699a0", "result": "Given a staircase with steps numbered 1 to n, each step has a pointer indicating whether to move up or down. Starting from any step, determine how long it takes for a person to fall off the staircase, or -1 if they never fall.  The person moves one step at a time according to the pointer direction."}]}