{"uid": "733-B", "url": "https://codeforces.com/contest/733/problem/B", "tags": ["math"], "title": "733-B", "statement": "B. Paradetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVery soon there will be a parade of victory over alien invaders in Berland. Unfortunately, all soldiers died in the war and now the army consists of entirely new recruits, many of whom do not even know from which leg they should begin to march. The civilian population also poorly understands from which leg recruits begin to march, so it is only important how many soldiers march in step.There will bencolumns participating in the parade, thei-th column consists oflisoldiers, who start to march from left leg, andrisoldiers, who start to march from right leg.The beauty of the parade is calculated by the following formula: ifLis the total number of soldiers on the parade who start to march from the left leg, andRis the total number of soldiers on the parade who start to march from the right leg, so the beauty will equal|L-R|.No more than onceyou can choose one column and tellall the soldiersin this column to switch starting leg, i.e. everyone in this columns who starts the march from left leg will now start it from right leg, and vice versa. Formally, you can pick no more than one indexiand swap valuesliandri.Find the index of the column, such that switching the starting leg for soldiers in it will maximize the the beauty of the parade, or determine, that no such operation can increase the current beauty.InputThe first line contains single integern(1 ≤n≤ 105) — the number of columns.The nextnlines contain the pairs of integersliandri(1 ≤li,ri≤ 500) — the number of soldiers in thei-th column which start to march from the left or the right leg respectively.OutputPrint single integerk— the number of the column in which soldiers need to change the leg from which they start to march, or0if the maximum beauty is already reached.Consider that columns are numbered from 1 tonin the order they are given in the input data.If there are several answers, print any of them.ExamplesInput35 68 910 3Output3Input26 55 6Output1Input65 91 34 84 523 5412 32Output0NoteIn the first example if you don't give the order to change the leg, the number of soldiers, who start to march from the left leg, would equal5 + 8 + 10 = 23, and from the right leg —6 + 9 + 3 = 18. In this case the beauty of the parade will equal|23 - 18| = 5.If you give the order to change the leg to the third column, so the number of soldiers, who march from the left leg, will equal5 + 8 + 3 = 16, and who march from the right leg —6 + 9 + 10 = 25. In this case the beauty equals|16 - 25| = 9.It is impossible to reach greater beauty by giving another orders. Thus, the maximum beauty that can be achieved is 9.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ba1ce54c", "template_md5": "35d339e4", "result": "You are given $n$ columns, each with two groups of soldiers: one group starting to march from the left leg and another group starting from the right leg. The number of soldiers in each group is given as $l_i$ and $r_i$ for the $i$-th column respectively.\n\nYou can choose one column and swap the starting legs of all soldiers in that column (left leg becomes right leg, and vice versa).\n\nThe beauty of the parade is calculated as the absolute difference between the total number of soldiers starting from the left leg and the total number starting from the right leg.\n\nFind the column index that, when its soldiers' starting legs are swapped, maximizes the beauty of the parade. If no such operation increases the beauty, output 0."}, {"prompt_md5": "d017cda8", "template_md5": "465699a0", "result": "You are given a number of groups, each with two types of members. You can swap the types of members in at most one group.  Find the group to swap to maximize the difference between the number of members of each type across all groups."}]}