{"uid": "735-B", "url": "https://codeforces.com/contest/735/problem/B", "tags": ["greedy", " number theory", " sortings"], "title": "735-B", "statement": "B. Urbanizationtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLocal authorities have heard a lot about combinatorial abilities of Ostap Bender so they decided to ask his help in the question of urbanization. There arenpeople who plan to move to the cities. The wealth of theiof them is equal toai. Authorities plan to build two cities, first forn1people and second forn2people. Of course, each ofncandidates can settle in only one of the cities. Thus, first some subset of candidates of sizen1settle in the first city and then some subset of sizen2is chosen among the remaining candidates and the move to the second city. All other candidates receive an official refuse and go back home.To make the statistic of local region look better in the eyes of their bosses, local authorities decided to pick subsets of candidates in such a way thatthe sum of arithmetic meanof wealth of people in each of the cities is as large as possible. Arithmetic mean of wealth in one city is the sum of wealthaiamong all its residents divided by the number of them (n1orn2depending on the city). The division should be done in real numbers without any rounding.Please, help authorities find the optimal way to pick residents for two cities.InputThe first line of the input contains three integersn,n1andn2(1 ≤n,n1,n2≤ 100 000,n1+n2≤n) — the number of candidates who want to move to the cities, the planned number of residents of the first city and the planned number of residents of the second city.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 100 000), thei-th of them is equal to the wealth of thei-th candidate.OutputPrint one real value — the maximum possible sum of arithmetic means of wealth of cities' residents. You answer will be considered correct if its absolute or relative error does not exceed10- 6.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExamplesInput2 1 11 5Output6.00000000Input4 2 11 4 2 3Output6.50000000NoteIn the first sample, one of the optimal solutions is to move candidate1to the first city and candidate2to the second.In the second sample, the optimal solution is to pick candidates3and4for the first city, and candidate2for the second one. Thus we obtain(a3+a4) / 2 +a2= (3 + 2) / 2 + 4 = 6.5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f4a843c2", "template_md5": "35d339e4", "result": "There are $n$ people who want to move to two cities. The first city will have $n_1$ residents and the second city will have $n_2$ residents. Each person has a wealth value $a_i$.  \n\nThe goal is to choose $n_1$ people to live in the first city and $n_2$ people to live in the second city so that the average wealth of people in each city is as large as possible. The average wealth of a city is the sum of the wealth of its residents divided by the number of residents.\n\nInput:\n\n* The first line contains three integers: $n$, $n_1$, and $n_2$ (1 ≤ $n$, $n_1$, $n_2$ ≤ 100,000, $n_1 + n_2$ ≤ $n$).\n* The second line contains $n$ integers $a_1$, $a_2$, ..., $a_n$ (1 ≤ $a_i$ ≤ 100,000), where $a_i$ is the wealth of the $i$-th person.\n\nOutput:\n\n* Print one real number, which is the maximum possible sum of the average wealth of the two cities."}, {"prompt_md5": "fcfe92cc", "template_md5": "465699a0", "result": "You are given a list of people with different wealth values. You need to divide them into two groups of a specific size.  The goal is to maximize the average wealth of each group."}]}