{"uid": "735-A", "url": "https://codeforces.com/contest/735/problem/A", "tags": ["implementation", " strings"], "title": "735-A", "statement": "A. Ostap and Grasshoppertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn the way to Rio de Janeiro Ostap kills time playing with a grasshopper he took with him in a special box. Ostap builds a line of lengthnsuch that some cells of this line are empty and some contain obstacles. Then, he places his grasshopper to one of the empty cells and a small insect in another empty cell. The grasshopper wants to eat the insect.Ostap knows that grasshopper is able to jump to any empty cell that isexactlykcells away from the current (to the left or to the right). Note that it doesn't matter whether intermediate cells are empty or not as the grasshopper makes a jump over them. For example, ifk= 1the grasshopper can jump to a neighboring cell only, and ifk= 2the grasshopper can jump over a single cell.Your goal is to determine whether there is a sequence of jumps such that grasshopper will get from his initial position to the cell with an insect.InputThe first line of the input contains two integersnandk(2 ≤n≤ 100,1 ≤k≤n- 1) — the number of cells in the line and the length of one grasshopper's jump.The second line contains a string of lengthnconsisting of characters '.', '#', 'G' and 'T'. Character '.' means that the corresponding cell is empty, character '#' means that the corresponding cell contains an obstacle and grasshopper can't jump there. Character 'G' means that the grasshopper starts at this position and, finally, 'T' means that the target insect is located at this cell. It's guaranteed that characters 'G' and 'T' appear in this lineexactly once.OutputIf there exists a sequence of jumps (each jump of lengthk), such that the grasshopper can get from his initial position to the cell with the insect, print \"YES\" (without quotes) in the only line of the input. Otherwise, print \"NO\" (without quotes).ExamplesInput5 2#G#T#OutputYESInput6 1T....GOutputYESInput7 3T..#..GOutputNOInput6 2..GT..OutputNONoteIn the first sample, the grasshopper can make one jump to the right in order to get from cell2to cell4.In the second sample, the grasshopper is only able to jump to neighboring cells but the way to the insect is free — he can get there by jumping left5times.In the third sample, the grasshopper can't make a single jump.In the fourth sample, the grasshopper can only jump to the cells with odd indices, thus he won't be able to reach the insect.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "90c32411", "template_md5": "35d339e4", "result": "You are given a line of $n$ cells. Some cells are empty ('.') and some contain obstacles ('#').  The grasshopper starts at cell 'G' and wants to reach cell 'T', which contains an insect. The grasshopper can jump $k$ cells to the left or right in a single jump.  \n\nDetermine if there is a sequence of jumps that allows the grasshopper to reach the insect.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($2 \\le n \\le 100$, $1 \\le k \\le n-1$).\n* The second line contains a string of length $n$ consisting of '.', '#', 'G', and 'T'.\n\n**Output:**\n\n* Print \"YES\" if the grasshopper can reach the insect, otherwise print \"NO\"."}, {"prompt_md5": "bc10cf3f", "template_md5": "465699a0", "result": "You are given a line of cells, some empty and some blocked. There is a starting point and a target point. You can move a fixed distance in one jump. Can you reach the target from the starting point?"}]}