{"uid": "735-D", "url": "https://codeforces.com/contest/735/problem/D", "tags": ["math", " number theory"], "title": "735-D", "statement": "D. Taxestime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutMr. Funt now lives in a country with a very specific tax laws. The total income of mr. Funt during this year is equal ton(n≥ 2) burles and the amount of tax he has to pay is calculated as the maximum divisor ofn(not equal ton, of course). For example, ifn= 6then Funt has to pay3burles, while forn= 25he needs to pay5and ifn= 2he pays only1burle.As mr. Funt is a very opportunistic person he wants to cheat a bit. In particular, he wants to split the initialnin several partsn1+n2+ ... +nk=n(herekis arbitrary, evenk= 1is allowed) and pay the taxes for each part separately. He can't make some part equal to1because it will reveal him. So, the conditionni≥ 2should hold for allifrom1tok.Ostap Bender wonders, how many money Funt has to pay (i.e. minimal) if he chooses and optimal way to splitnin parts.InputThe first line of the input contains a single integern(2 ≤n≤ 2·109) — the total year income of mr. Funt.OutputPrint one integer — minimum possible number of burles that mr. Funt has to pay as a tax.ExamplesInput4Output2Input27Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5581c8cf", "template_md5": "35d339e4", "result": "You are given an integer $n$ ($2 \\le n \\le 2 \\cdot 10^9$).  \n\nA person has to pay taxes based on the largest divisor of $n$ that is not equal to $n$ itself.  \n\nThe person can split $n$ into $k$ parts ($k \\ge 1$) where each part is at least 2. They want to minimize the total tax paid by choosing the optimal way to split $n$.\n\nFind the minimum total tax the person has to pay."}, {"prompt_md5": "0b14160c", "template_md5": "465699a0", "result": "You are given a number *n*.  You need to split *n* into at least two parts.  The tax you pay is the largest number that divides each part (excluding 1). Find the minimum total tax you can pay."}]}