{"uid": "736-D", "url": "https://codeforces.com/contest/736/problem/D", "tags": ["math", " matrices"], "title": "736-D", "statement": "D. Permutationstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOstap Bender is worried that people started to forget that he is the Great Combinator. Now he wants to show them his skills in combinatorics. Now he studies the permutations of lengthn. He has a list ofmvalid pairs, pairaiandbimeans that he is allowed to place integersbiat positionai.He knows that the number of permutations that use only valid pairs isodd. Now, for each pair he wants to find out, will the number of valid permutations beoddif heremovesthis pair (and only it) from the list.InputThe first line contains two integersnandm(1 ≤n≤ 2000,n≤m≤min(n2, 500 000)) — the number of elements in the permutation. Then followmlines, each containing some valid pair(ai,bi)(1 ≤ai,bi≤n). It's guaranteed that no pair occurs in the input twice and that the total number of valid permutations (i.e. using only allowed pairs position-elements) is odd.OutputPrintmlines, one line for each valid pair. Thei-th line should contain \"YES\" if after Ostap removes thei-th pair (and only it) the remaining number of valid permutations is odd. Otherwise, print «NO».ExamplesInput2 31 11 22 2OutputNOYESNOInput3 31 12 23 3OutputNONONOInput3 73 33 11 31 12 21 22 1OutputYESNONONOYESNONO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a06406b6", "template_md5": "35d339e4", "result": "You are given a number $n$ and $m$ pairs of numbers $(a_i, b_i)$.  \n\n* $a_i$ represents a position in a permutation of length $n$.\n* $b_i$ represents a number that can be placed at position $a_i$ in the permutation.\n\nYou are told that there are an odd number of permutations that can be formed using *only* the given pairs.\n\nFor each pair $(a_i, b_i)$, determine if removing that pair will result in an even number of valid permutations. \n\n**Output:**\n\nFor each pair, print \"YES\" if removing it results in an even number of valid permutations, and \"NO\" otherwise."}, {"prompt_md5": "9f644617", "template_md5": "465699a0", "result": "You are given a list of pairs of numbers. Each pair represents a valid placement of a number in a sequence of a given length.  The total number of valid sequences using only these pairs is odd.  For each pair, determine if removing it would make the total number of valid sequences even."}]}