{"uid": "736-E", "url": "https://codeforces.com/contest/736/problem/E", "tags": ["constructive algorithms", " flows", " greedy", " math"], "title": "736-E", "statement": "E. Chess Championshiptime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOstap is preparing to play chess again and this time he is about to prepare. Thus, he was closely monitoring one recent chess tournament. There weremplayers participating and each pair of players played exactly one game. The victory gives2points, draw —1points, lose —0points.Ostap is lazy, so he never tries to remember the outcome of each game. Instead, he computes the total number of points earned by each of the players (the sum of his points in all games which he took part in), sort these value in non-ascending order and then remembers firstnintegers in this list.Now the Great Strategist Ostap wonders whether he remembers everything correct. He considers that he is correct if there exists at least one tournament results table such that it will produce the given integers. That means, if we count the sum of points for each player, sort them and take firstnelements, the result will coincide with what Ostap remembers. Can you check if such table exists?InputThe first line of the input contains two integersmandn(1 ≤n≤m≤ 3000) — the number of participants of the tournament and the number of top results Ostap remembers.The second line containsnintegers, provided in non-ascending order — the number of points earned by top participants as Ostap remembers them. It's guaranteed that this integers are non-negative and do not exceed2·m.OutputIf there is no tournament such that Ostap can obtain the given set of integers using the procedure described in the statement, then print \"no\" in the only line of the output. Otherwise, the first line of the output should contain the word \"yes\". Nextmlines should provide the description of any valid tournament. Each of these lines must containmcharacters 'X', 'W', 'D' and 'L'. Character 'X' should always be located on the main diagonal (and only there), that is on thei-th position of thei-th string. Character 'W' on thej-th position of thei-th string means that thei-th player won the game against thej-th. In the same way character 'L' means loose and 'D' means draw.The table you print must be consistent and the points earned by bestnparticipants should match the memory of Ostap. If there are many possible answers, print any of them.ExamplesInput5 58 6 4 2 0OutputyesXWWWWLXWWWLLXWWLLLXWLLLLXInput5 19Outputno", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f759fc7e", "template_md5": "35d339e4", "result": "There are $m$ players in a chess tournament. Each pair of players plays exactly one game.  A win is worth 2 points, a draw is worth 1 point, and a loss is worth 0 points.\n\nYou are given $n$ points ($1 \\le n \\le m$) representing the top $n$ scores from the tournament, sorted in non-increasing order.  \n\nDetermine if it is possible to have a tournament with these scores. If so, output \"yes\" and provide a possible tournament result table.  \n\nThe table should have $m$ rows and $m$ columns, with each cell containing one of the following:\n\n* 'X':  The main diagonal (i.e., the $i$-th row and $i$-th column) must always contain an 'X'.\n* 'W': Player $i$ won against player $j$.\n* 'L': Player $i$ lost to player $j$.\n* 'D': Player $i$ drew with player $j$.\n\nThe table must be consistent (meaning the results make sense) and the top $n$ scores must match the given input. \n\n\n\nIf no such tournament is possible, output \"no\"."}, {"prompt_md5": "35280b1e", "template_md5": "465699a0", "result": "You are given a list of scores.  Determine if it's possible to have a tournament with these scores, where each player plays every other player once, and the scores are determined by wins (2 points), draws (1 point), and losses (0 points).  If possible, show one such tournament."}]}