{"uid": "737-F", "url": "https://codeforces.com/contest/737/problem/F", "tags": ["constructive algorithms", " math"], "title": "737-F", "statement": "F. Dirty platestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter one of celebrations there is a stack of dirty plates in Nikita's kitchen. Nikita has to wash them and put into a dryer. In dryer, the plates should be also placed in a stack also, and the plates sizes should increase down up. The sizes of all plates are distinct.Nikita has no so much free space, specifically, he has a place for only one more stack of plates. Therefore, he can perform only such two operations:Take any number of plates from1toafrom the top of the dirty stack, wash them and put them to theintermediatestack.Take any number of plates from1tobfrom the top of the intermediate stack and put them to the stack in the dryer.Note that after performing each of the operations, the plates are put in the same order as they were before the operation.You are given the sizes of the platess1,s2, ...,snin the down up order in the dirty stack, and integersaandb. All the sizes are distinct. Write a program that determines whether or not Nikita can put the plates in increasing down up order in the dryer. If he is able to do so, the program should find some sequence of operations (not necessary optimal) to achieve it.InputThe first line contains three integersn,aandb(1 ≤n≤ 2000,1 ≤a,b≤n). The second line contains integerss1,s2, ...,sn(1 ≤si≤n) — the sizes of the plates in down up order. All the sizes are distinct.OutputIn the first line print \"YES\" if there is a solution. In this case, in the second line print integerk— the number of operations. Then inklines print the operations, one per line. Each operation is described by two integerstjandcj, wheretj= 1, if the operation is to wash the topcjplaces from the dirty stack and put them onto the intermediate stack, andtj= 2, if the operation is to move th topcjplates from the intermediate stack to the dryer.In case there is no solution, print single line \"NO\".If there are multiple solutions, print any of them. Note that it is not necessary to minimize the number of operations.ExamplesInput6 2 32 3 6 4 1 5OutputYES81 21 12 11 21 12 12 12 3Input7 7 71 2 3 4 5 6 7OutputYES21 72 7Input7 1 11 2 3 4 5 6 7OutputYES141 11 11 11 11 11 11 12 12 12 12 12 12 12 1Input4 2 23 2 1 4OutputNONoteIn the first example the initial order of plates was2, 3, 6, 4, 1, 5. Here is how the stacks look like after each of the operations:[1 2]: Dirty stack:6, 4, 1, 5. Intermediary stack:2, 3. The dryer is empty.[1 1]: Dirty stack:4, 1, 5. Intermediary stack:6, 2, 3. The dryer is empty.[2 1]: Dirty stack:4, 1, 5. Intermediary stack:2, 3. Dryer stack:6.[1 2]: Dirty stack:5. Intermediary stack:4, 1, 2, 3. Dryer stack:6.[1 1]: There are no dirty plates. Intermediary stack:5, 4, 1, 2, 3. Dryer stack:6.[2 1]: There are no dirty plates. Intermediary stack:4, 1, 2, 3. Dryer stack:5, 6.[2 1]: There are no dirty plates. Intermediary stack:1, 2, 3. Dryer stack:4, 5, 6.[2 3]: All the plates are in the dryer:1, 2, 3, 4, 5, 6.In the second example it is possible to wash all the plates in one operation, and then move them all to the dryer.This is not possible in the third example, because it is not permitted to move more than one plate at the same time. It is possible to wash plates one by one so that they are placed onto the intermediary stack in the reverse order, and then move plates one by one to the dryer. The final order is correct.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2b14c065", "template_md5": "35d339e4", "result": "You are given two stacks of plates. The first stack has $n$ plates with sizes $s_1, s_2, ..., s_n$ where $s_1$ is the smallest and $s_n$ is the largest. The second stack has a limited capacity. You can perform two types of operations:\n\n1. Take the top $c$ plates from the first stack and move them to the second stack.\n2. Take the top $c$ plates from the second stack and move them to the third stack (the dryer).\n\nThe goal is to determine if it is possible to move all the plates to the third stack in increasing order of size. If it is possible, output a sequence of operations that achieve this. \n\n**Input:**\n\n* $n$: The number of plates in the first stack.\n* $a$: The maximum number of plates you can take from the first stack in one operation.\n* $b$: The maximum number of plates you can take from the second stack in one operation.\n* $s_1, s_2, ..., s_n$: The sizes of the plates in the first stack.\n\n**Output:**\n\n* \"YES\" if it is possible to move all plates to the third stack in increasing order.\n* \"NO\" if it is not possible.\n* If it is possible, output the number of operations required and a sequence of operations."}, {"prompt_md5": "3de6e76d", "template_md5": "465699a0", "result": "You have two stacks of items. You can take a number of items from the top of the first stack and put them in the second stack. You can also take a number of items from the top of the second stack and put them in a third stack. The goal is to arrange all the items in the third stack in increasing order from bottom to top. Can you do this? If so, describe the steps."}]}