{"uid": "74-C", "url": "https://codeforces.com/contest/74/problem/C", "tags": ["dfs and similar", " dsu", " graphs", " number theory"], "title": "74-C", "statement": "C. Chessboard Billiardtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutLet's imagine: there is a chess piecebilliard ball. Its movements resemble the ones of a bishop chess piece. The only difference is that when a billiard ball hits the board's border, it can reflect from it and continue moving.More formally, first one of four diagonal directions is chosen and the billiard ball moves in that direction. When it reaches the square located on the board's edge, the billiard ball reflects from it; it changes the direction of its movement by 90 degrees and continues moving. Specifically, having reached a corner square, the billiard ball is reflected twice and starts to move the opposite way. While it moves, the billiard ball can make an infinite number of reflections. At any square of its trajectory the billiard ball can stop and on that the move is considered completed.It is considered that one billiard ballabeats another billiard ballbifacan reach a point wherebis located.You are suggested to find the maximal number of billiard balls, that pairwise do not beat each other and that can be positioned on a chessboardn×min size.InputThe first line contains two integersnandm(2 ≤n,m≤ 106).OutputPrint a single number, the maximum possible number of billiard balls that do not pairwise beat each other.Please do not use the%lldspecificator to read or write 64-bit numbers in C++. It is preferred to usecin(also you may use the%I64dspecificator).ExamplesInput3 4Output2Input3 3Output3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2a93794e", "template_md5": "35d339e4", "result": "You are given a chessboard of size $n \\times m$.  Imagine billiard balls that move like bishops on a chessboard. When a ball hits the edge of the board, it bounces off at a 90-degree angle.\n\nThe problem is to find the maximum number of billiard balls that can be placed on the board so that no two balls can \"beat\" each other. A ball beats another if it can reach the square where the other ball is located. \n\nInput:\n\n* Two integers, $n$ and $m$, representing the size of the chessboard.\n\nOutput:\n\n* A single integer, the maximum number of non-beating billiard balls."}, {"prompt_md5": "20ca4a04", "template_md5": "465699a0", "result": "You have a square board.  Balls can move diagonally and bounce off the edges of the board, changing direction.  Find the most balls you can place on the board so that no ball can reach the position of any other ball."}]}