{"uid": "74-E", "url": "https://codeforces.com/contest/74/problem/E", "tags": ["constructive algorithms"], "title": "74-E", "statement": "E. Shift It!time limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere is a square box6 × 6in size. It contains36chips1 × 1in size. Those chips contain 36 different characters — \"0\"-\"9\" and \"A\"-\"Z\". There is exactly one chip with each character.You are allowed to make the following operations: you may choose one of6rows or one of6columns and cyclically shift the chips there to one position to the left or to the right (for the row) or upwards or downwards (for the column). Those operations are allowed to perform several times.To solve the puzzle is to shift the chips using the above described operations so that they were written in the increasing order (exactly equal to the right picture). An example of solving the puzzle is shown on a picture below.Write a program that finds the sequence of operations that solves the puzzle. That sequenceshould not necessarily be shortest, but you should not exceed the limit of10000operations. It is guaranteed that the solution always exists.InputThe input data are represented by 6 lines containing 6 characters each. They are the puzzle's initial position. Those lines contain each character from the string \"0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ\" exactly once.OutputOn the first line print numbern, which is the number of operations. On the nextnlines print the sequence of operations one per line. An operation is described by a word consisting of two characters. The first character shows the direction where the row or the column will be shifted. The possible directions are \"L\", \"R\" (to the left, to the right correspondingly, we shift a row), \"U\", \"D\" (upwards, downwards correspondingly, we shift a column). The second character is the number of the row (or the column), it is an integer from \"1\" to \"6\". The rows are numbered from the top to the bottom, the columns are numbered from the left to the right.The number of operations should not exceed104. If there are several solutions, print any of them.ExamplesInput01W345729AB6CD8FGHIJELMNOPKRSTUVQXYZOutput2R2U3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "002fcb7d", "template_md5": "35d339e4", "result": "You have a 6x6 grid of chips, each containing a unique character from \"0\" to \"9\" and \"A\" to \"Z\".  Your goal is to rearrange the chips so they are in alphabetical/numerical order. You can perform the following operations:\n\n* **Shift a row:** Move all the chips in a row one position to the left or right.\n* **Shift a column:** Move all the chips in a column one position up or down.\n\nYou can perform these operations any number of times, but you must find a solution within 10,000 operations. \n\nThe input will be the initial arrangement of the chips, and your output should be a sequence of operations that will solve the puzzle."}, {"prompt_md5": "9811b0ae", "template_md5": "465699a0", "result": "You have a 6x6 grid of unique letters.  You can shift each row or column one position to the left, right, up, or down.  Find a sequence of these shifts that sorts the letters in alphabetical order.  You can make at most 10,000 shifts."}]}