{"uid": "740-B", "url": "https://codeforces.com/contest/740/problem/B", "tags": ["constructive algorithms"], "title": "740-B", "statement": "B. Alyona and flowerstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle Alyona is celebrating Happy Birthday! Her mother has an array ofnflowers. Each flower has some mood, the mood ofi-th flower isai. The mood can be positive, zero or negative.Let's define a subarray as a segment of consecutive flowers. The mother suggested some set of subarrays. Alyona wants to choose several of the subarrays suggested by her mother. After that, each of the flowers will add to the girl's happiness its mood multiplied by the number of chosen subarrays the flower is in.For example, consider the case when the mother has5flowers, and their moods are equal to1,  - 2, 1, 3,  - 4. Suppose the mother suggested subarrays(1,  - 2),(3,  - 4),(1, 3),(1,  - 2, 1, 3). Then if the girl chooses the third and the fourth subarrays then:the first flower adds1·1 = 1to the girl's happiness, because he is in one of chosen subarrays,the second flower adds( - 2)·1 =  - 2, because he is in one of chosen subarrays,the third flower adds1·2 = 2, because he is in two of chosen subarrays,the fourth flower adds3·2 = 6, because he is in two of chosen subarrays,the fifth flower adds( - 4)·0 = 0, because he is in no chosen subarrays.Thus, in total1 + ( - 2) + 2 + 6 + 0 = 7is added to the girl's happiness. Alyona wants to choose such subarrays from those suggested by the mother that the value added to her happiness would be as large as possible. Help her do this!Alyona can choose any number of the subarrays, even0or all suggested by her mother.InputThe first line contains two integersnandm(1 ≤n,m≤ 100) — the number of flowers and the number of subarrays suggested by the mother.The second line contains the flowers moods —nintegersa1,a2, ...,an(- 100 ≤ai≤ 100).The nextmlines contain the description of the subarrays suggested by the mother. Thei-th of these lines contain two integersliandri(1 ≤li≤ri≤n) denoting the subarraya[li],a[li+ 1], ...,a[ri].Each subarray can encounter more than once.OutputPrint single integer — the maximum possible value added to the Alyona's happiness.ExamplesInput5 41 -2 1 3 -41 24 53 41 4Output7Input4 31 2 3 41 32 41 1Output16Input2 2-1 -21 11 2Output0NoteThe first example is the situation described in the statements.In the second example Alyona should choose all subarrays.The third example has answer0because Alyona can choose none of the subarrays.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a5bde7b6", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, representing the mood of $n$ flowers.  There are $m$ subarrays defined within this array.  \n\nFor each subarray, you can choose to include it or not.  If you include a subarray, each flower within that subarray contributes its mood value multiplied by the number of subarrays it is in to a total happiness score.\n\nWhat is the maximum possible happiness score you can achieve? \n\n**Input:**\n\n* Line 1: Two integers, $n$ and $m$ ($1 \\le n, m \\le 100$)\n* Line 2: $n$ integers, the moods of the flowers ($-100 \\le a_i \\le 100$)\n* Lines 3 to $m+2$: Each line contains two integers, $l_i$ and $r_i$ ($1 \\le l_i \\le r_i \\le n$), defining the start and end indices of a subarray.\n\n**Output:**\n\n* A single integer, the maximum possible happiness score."}, {"prompt_md5": "ef4e717c", "template_md5": "465699a0", "result": "You are given a list of numbers and a list of ranges within that list.  Each range represents a subset of the numbers. You want to choose some of these ranges so that the sum of the numbers in the chosen ranges is as large as possible."}]}