{"uid": "741-D", "url": "https://codeforces.com/contest/741/problem/D", "tags": ["data structures", " dfs and similar", " trees"], "title": "741-D", "statement": "D. Arpa’s letter-marked tree and Mehrdad’s Dokhtar-kosh pathstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJust in case somebody missed it: we have wonderful girls in Arpa’s land.Arpa has a rooted tree (connected acyclic graph) consisting ofnvertices. The vertices are numbered1throughn, the vertex1is the root. There is a letter written on each edge of this tree. Mehrdad is a fan ofDokhtar-koshthings. He call a string Dokhtar-kosh, if we can shuffle the characters in string such that it becomes palindrome.He asks Arpa, for each vertexv, what is the length of the longest simple path in subtree ofvthat form a Dokhtar-kosh string.InputThe first line contains integern(1  ≤n≤  5·105) — the number of vertices in the tree.(n-  1)lines follow, thei-th of them contain an integerpi+ 1and a letterci+ 1(1  ≤pi+ 1≤i,ci+ 1is lowercase English letter, betweenaandv, inclusively), that mean that there is an edge between nodespi+ 1andi+ 1and there is a letterci+ 1written on this edge.OutputPrintnintegers. Thei-th of them should be the length of the longest simple path in subtree of thei-th vertex that form a Dokhtar-kosh string.ExamplesInput41 s2 a3 sOutput3 1 1 0Input51 a2 h1 a4 hOutput4 1 0 1 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d7afbe4f", "template_md5": "35d339e4", "result": "You are given a rooted tree with $n$ vertices. Each edge of the tree has a lowercase English letter on it. \n\nFor each vertex $v$, find the length of the longest simple path in the subtree rooted at $v$ where the letters on the edges of the path can be rearranged to form a palindrome.\n\n**Input:**\n\n* The first line contains an integer $n$ ($1 \\le n \\le 5 \\cdot 10^5$) representing the number of vertices.\n* The next $n-1$ lines each contain two integers $p_i + 1$ and $c_i$ ($1 \\le p_i + 1 \\le i$, $c_i$ is a lowercase English letter) representing an edge between vertices $p_i + 1$ and $i$ with the letter $c_i$ on the edge.\n\n**Output:**\n\nPrint $n$ integers. The $i$-th integer should be the length of the longest simple path in the subtree of vertex $i$ that forms a palindrome."}, {"prompt_md5": "601fe6e9", "template_md5": "465699a0", "result": "You are given a tree with labeled edges.  For each node, find the length of the longest path in its subtree where the letters on the edges can be rearranged to form a palindrome."}]}