{"uid": "741-B", "url": "https://codeforces.com/contest/741/problem/B", "tags": ["dfs and similar", " dp", " dsu"], "title": "741-B", "statement": "B. Arpa's weak amphitheater and Mehrdad's valuable Hosestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputJust to remind, girls in Arpa's land are really nice.Mehrdad wants to invite some Hoses to the palace for a dancing party. Each Hos has some weightwiand some beautybi. Also each Hos may have some friends. Hoses are divided in some friendship groups. Two Hosesxandyare in the same friendship group if and only if there is a sequence of Hosesa1,a2, ...,aksuch thataiandai+ 1are friends for each1 ≤i<k, anda1=xandak=y.Arpa allowed to use the amphitheater of palace to Mehrdad for this party. Arpa's amphitheater can hold at mostwweight on it.Mehrdad is so greedy that he wants to invite some Hoses such that sum of their weights is not greater thanwand sum of their beauties is as large as possible. Along with that, from each friendship group he can either invite all Hoses, or no more than one. Otherwise, some Hoses will be hurt. Find for Mehrdad the maximum possible total beauty of Hoses he can invite so that no one gets hurt and the total weight doesn't exceedw.InputThe first line contains integersn,mandw(1  ≤n≤  1000,,1 ≤w≤ 1000) — the number of Hoses, the number of pair of friends and the maximum total weight of those who are invited.The second line containsnintegersw1,w2, ...,wn(1 ≤wi≤ 1000) — the weights of the Hoses.The third line containsnintegersb1,b2, ...,bn(1 ≤bi≤ 106) — the beauties of the Hoses.The nextmlines contain pairs of friends, thei-th of them contains two integersxiandyi(1 ≤xi,yi≤n,xi≠yi), meaning that Hosesxiandyiare friends. Note that friendship is bidirectional. All pairs(xi,yi)are distinct.OutputPrint the maximum possible total beauty of Hoses Mehrdad can invite so that no one gets hurt and the total weight doesn't exceedw.ExamplesInput3 1 53 2 52 4 21 2Output6Input4 2 112 4 6 66 4 2 11 22 3Output7NoteIn the first sample there are two friendship groups: Hoses{1, 2}and Hos{3}. The best way is to choose all of Hoses in the first group, sum of their weights is equal to5and sum of their beauty is6.In the second sample there are two friendship groups: Hoses{1, 2, 3}and Hos{4}. Mehrdad can't invite all the Hoses from the first group because their total weight is12 > 11, thus the best way is to choose the first Hos from the first group and the only one from the second group. The total weight will be8, and the total beauty will be7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d7e8e690", "template_md5": "35d339e4", "result": "You are given a list of $n$ people, each with a weight ($w_i$) and a beauty ($b_i$).  Some people are friends.  \n\nYou need to choose a subset of these people to invite to a party, following these rules:\n\n* The total weight of the invited people cannot exceed $w$.\n* You can invite all the people in a friendship group, or none of them. You cannot invite some and not others from the same group.\n\nFind the maximum total beauty of the people you can invite while following these rules. \n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "c4b82311", "template_md5": "465699a0", "result": "You are given a set of items, each with a weight and a value.  You have a weight limit.  You can only select whole groups of items that are connected (friends).  Find the group of items with the highest total value that stays under the weight limit."}]}