{"uid": "742-B", "url": "https://codeforces.com/contest/742/problem/B", "tags": ["brute force", " math", " number theory"], "title": "742-B", "statement": "B. Arpa’s obvious problem and Mehrdad’s terrible solutiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are some beautiful girls in Arpa’s land as mentioned before.Once Arpa came up with an obvious problem:Given an array and a numberx, count the number of pairs of indicesi,j(1 ≤i<j≤n) such that, whereis bitwisexoroperation (see notes for explanation).Immediately, Mehrdad discovered a terrible solution that nobody trusted. Now Arpa needs your help to implement the solution to that problem.InputFirst line contains two integersnandx(1 ≤n≤ 105, 0 ≤x≤ 105) — the number of elements in the array and the integerx.Second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 105) — the elements of the array.OutputPrint a single integer: the answer to the problem.ExamplesInput2 31 2Output1Input6 15 1 2 3 4 1Output2NoteIn the first sample there is only one pair ofi= 1andj= 2.so the answer is1.In the second sample the only two pairs arei= 3,j= 4(since) andi= 1,j= 5(since).A bitwisexortakes two bit integers of equal length and performs the logicalxoroperation on each pair of corresponding bits. The result in each position is1if only the first bit is1or only the second bit is1, but will be0if both are0or both are1. You can read more about bitwisexoroperation here:https://en.wikipedia.org/wiki/Bitwise_operation#XOR.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "485578f5", "template_md5": "35d339e4", "result": "Given an array of integers and an integer $x$, count the number of pairs of indices $(i, j)$ where $1 \\le i < j \\le n$ such that  $a_i \\oplus a_j = x$, where $\\oplus$ represents the bitwise XOR operation.\n\nOutput a single integer: the count of such pairs."}, {"prompt_md5": "ef092322", "template_md5": "465699a0", "result": "Given a list of numbers and a target number, count how many pairs of numbers in the list have a bitwise XOR result equal to the target number."}]}