{"uid": "743-D", "url": "https://codeforces.com/contest/743/problem/D", "tags": ["dfs and similar", " dp", " graphs", " trees"], "title": "743-D", "statement": "D. Chloe and pleasant prizestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputGenerous sponsors of the olympiad in which Chloe and Vladik took part allowed all the participants to choose a prize for them on their own. Christmas is coming, so sponsors decided to decorate the Christmas tree with their prizes.They tooknprizes for the contestants and wrote on each of them a unique id (integer from1ton). A giftiis characterized by integerai— pleasantness of the gift. The pleasantness of the gift can be positive, negative or zero. Sponsors placed the gift1on the top of the tree. All the other gifts hung on a rope tied to some other gift so that each gift hung on the first gift, possibly with a sequence of ropes and another gifts. Formally, the gifts formed a rooted tree withnvertices.The prize-giving procedure goes in the following way: the participants come to the tree one after another, choose any of the remaining gifts and cut the rope this prize hang on. Note that all the ropes which were used to hang other prizes on the chosen one are not cut. So the contestant gets the chosen gift as well as the all the gifts that hang on it, possibly with a sequence of ropes and another gifts.Our friends, Chloe and Vladik, shared the first place on the olympiad and they will choose prizes at the same time! To keep themselves from fighting, they decided to choose two different gifts so that the sets of the gifts that hang on them with a sequence of ropes and another gifts don't intersect. In other words, there shouldn't be any gift that hang both on the gift chosen by Chloe and on the gift chosen by Vladik. From all of the possible variants they will choose such pair of prizes that the sum of pleasantness of all the gifts that they will take after cutting the ropes is as large as possible.Print the maximum sum of pleasantness that Vladik and Chloe can get. If it is impossible for them to choose the gifts without fighting, printImpossible.InputThe first line contains a single integern(1 ≤n≤ 2·105) — the number of gifts.The next line containsnintegersa1,a2, ...,an(- 109≤ai≤ 109) — the pleasantness of the gifts.The next(n- 1)lines contain two numbers each. Thei-th of these lines contains integersuiandvi(1 ≤ui,vi≤n,ui≠vi) — the description of the tree's edges. It means that gifts with numbersuiandviare connected to each other with a rope. The gifts' ids in the description of the ropes can be given in arbirtary order:vihangs onuioruihangs onvi.It is guaranteed that all the gifts hang on the first gift, possibly with a sequence of ropes and another gifts.OutputIf it is possible for Chloe and Vladik to choose prizes without fighting, print single integer — the maximum possible sum of pleasantness they can get together.Otherwise printImpossible.ExamplesInput80 5 -1 4 3 2 6 51 22 42 51 33 66 76 8Output25Input41 -5 1 11 21 42 3Output2Input1-1OutputImpossible", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "698eec05", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, where each node represents a gift with a certain pleasantness value ($a_i$).  The tree is rooted at node 1. Two people want to choose two different gifts from the tree such that the gifts they choose do not share any descendants (i.e., no gift hangs on both of their chosen gifts).  \n\nFind the maximum possible sum of pleasantness that the two people can get by choosing their gifts this way. If it is impossible for them to choose gifts without overlap, print \"Impossible\". \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 2⋅10⁵) representing the number of gifts.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (-10⁹ ≤ $a_i$ ≤ 10⁹) representing the pleasantness of each gift.\n* The next $n-1$ lines each contain two integers $u_i$ and $v_i$ (1 ≤ $u_i$, $v_i$ ≤ $n$, $u_i$ ≠ $v_i$) representing an edge in the tree.\n\n**Output:**\n\n* Print a single integer representing the maximum possible sum of pleasantness, or \"Impossible\" if it is not possible to choose gifts without overlap."}, {"prompt_md5": "0da75904", "template_md5": "465699a0", "result": "You are given a tree with numbered nodes, each node having a value. Two people need to choose distinct nodes from the tree.  The value of a node is the sum of the values of itself and all its descendants. The goal is to find the two nodes that maximize the sum of their values."}]}