{"uid": "743-A", "url": "https://codeforces.com/contest/743/problem/A", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "743-A", "statement": "A. Vladik and flightstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVladik is a competitive programmer. This year he is going to win the International Olympiad in Informatics. But it is not as easy as it sounds: the question Vladik face now is to find the cheapest way to get to the olympiad.Vladik knowsnairports. All the airports are located on a straight line. Each airport has unique id from1ton, Vladik's house is situated next to the airport with ida, and the place of the olympiad is situated next to the airport with idb. It is possible that Vladik's house and the place of the olympiad are located near the same airport.To get to the olympiad, Vladik can fly between any pair of airports any number of times, but he has to start his route at the airportaand finish it at the airportb.Each airport belongs to one of two companies. The cost of flight from the airportito the airportjis zero if both airports belong to the same company, and|i-j|if they belong to different companies.Print the minimum cost Vladik has to pay to get to the olympiad.InputThe first line contains three integersn,a, andb(1 ≤n≤ 105,1 ≤a,b≤n) — the number of airports, the id of the airport from which Vladik starts his route and the id of the airport which he has to reach.The second line contains a string with lengthn, which consists only of characters0and1. If thei-th character in this string is0, theni-th airport belongs to first company, otherwise it belongs to the second.OutputPrint single integer — the minimum cost Vladik has to pay to get to the olympiad.ExamplesInput4 1 41010Output1Input5 5 210110Output0NoteIn the first example Vladik can fly to the airport2at first and pay|1 - 2| = 1(because the airports belong to different companies), and then fly from the airport2to the airport4for free (because the airports belong to the same company). So the cost of the whole flight is equal to1. It's impossible to get to the olympiad for free, so the answer is equal to1.In the second example Vladik can fly directly from the airport5to the airport2, because they belong to the same company.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "384a1263", "template_md5": "35d339e4", "result": "There are $n$ airports numbered from 1 to $n$.  Airport 1 is the starting point and airport $b$ is the destination. Each airport belongs to one of two companies. The cost of flying from airport $i$ to airport $j$ is 0 if they belong to the same company, and $|i-j|$ if they belong to different companies.\n\nFind the minimum cost to travel from airport 1 to airport $b$.\n\nInput:\n\n* The first line contains three integers: $n$, $a$, and $b$ ($1 \\le n \\le 10^5$, $1 \\le a, b \\le n$).\n* The second line contains a string of length $n$ consisting of 0s and 1s. A 0 indicates the airport belongs to company 1, and a 1 indicates it belongs to company 2.\n\nOutput:\n\n* Print a single integer representing the minimum cost."}, {"prompt_md5": "c3775273", "template_md5": "465699a0", "result": "You are given a line with cities. Each city belongs to one of two companies. You need to find the cheapest way to travel from one city to another, where the cost of travel between cities of different companies is the distance between them, and the cost of travel between cities of the same company is zero."}]}