{"uid": "744-B", "url": "https://codeforces.com/contest/744/problem/B", "tags": ["bitmasks", " divide and conquer", " interactive"], "title": "744-B", "statement": "B. Hongcow's Gametime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is an interactive problem. In the interaction section below you will see the information about flushing the output.In this problem, you will be playing a game with Hongcow. How lucky of you!Hongcow has a hiddennbynmatrixM. LetMi,jdenote the entryi-th row andj-th column of the matrix. The rows and columns are labeled from1ton.The matrix entries are between0and109. In addition,Mi,i= 0for all validi. Your task is to find the minimum value along each row, excluding diagonal elements. Formally, for eachi, you must find.To do this, you can ask Hongcow some questions.A question consists of giving Hongcow a subset of distinct indices{w1,w2, ...,wk}, with1 ≤k≤n. Hongcow will respond withnintegers. Thei-th integer will contain the minimum value ofmin1 ≤j≤kMi,wj.You may only ask Hongcow at most20questions — he thinks you only need that many questions answered.When you are ready to answer, print out a single integer- 1on its own line, thennintegers on the next line. Thei-th integer should be the minimum value in thei-th row of the matrix, excluding thei-th element. Do not forget to flush the final answer as well. Printing the answer does not count as asking a question.You will getWrong Answerverdict ifYour question or answers are not in the format described in this statement.You ask strictly more than20questions.Your question contains duplicate indices.The value ofkin your question does not lie in the range from1ton, inclusive.Your final answer is not correct.You will getIdleness Limit Exceededif you don't print anything or if you forget to flush the output, including for the final answer (more info about flushing output below).InputThe first line of input will contain a single integern(2 ≤n≤ 1, 000).OutputTo print the final answer, print out the string-1on its own line. Then, the next line should containnintegers. Thei-th integer should be the minimum value of thei-th row of the matrix, excluding elements on the diagonal.Do not forget to flush your answer!InteractionTo ask a question, print out a single integerkon its own line, denoting the size of your subset. Then, the next line should containkintegersw1,w2, ...wk. Note, you must flush your output to get a response.Hongcow will respond by printing out a line withnintegers. Thei-th integer in this line represents the minimum value ofMi,wjwherejis between1andk.You may only ask a question at most20times, otherwise, you will getWrong Answer.To flush you can use (just after printing an integer and end-of-line):fflush(stdout)in C++;System.out.flush()in Java;stdout.flush()in Python;flush(output)in Pascal;See the documentation for other languages.HackingTo hack someone, use the following formatnM_{1,1} M_{1,2} ... M_{1,n}M_{2,1} M_{2,2} ... M_{2,n}...M_{n,1} M_{n,2} ... M_{n,n}Of course, contestant programs will not be able to see this input.ExamplesInput30 0 02 7 00 0 43 0 80 5 4Output31 2 31321 21211-12 5 4Input20 00 0Output1211-10 0NoteIn the first sample, Hongcow has the hidden matrix[[0, 3, 2],[5, 0, 7],[4, 8 ,0],]Here is a more readable version demonstrating the interaction. The column on the left represents Hongcow, while the column on the right represents the contestant.331 2 30 0 0132 7 021 20 0 4123 0 8110 5 4-12 5 4For the second sample, it is possible for off-diagonal elements of the matrix to be zero.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "742dfcaf", "template_md5": "35d339e4", "result": "You are playing a game with an opponent who has a hidden $n \\times n$ matrix $M$.  The matrix entries are between 0 and $10^9$. You know that $M_{i,i} = 0$ for all $i$. Your goal is to find the minimum value in each row of the matrix, excluding the diagonal element.\n\nYou can ask your opponent questions to help you find the minimums. Each question consists of giving your opponent a set of distinct indices $\\{w_1, w_2, ..., w_k\\}$, where $1 \\le k \\le n$. Your opponent will respond with $n$ integers. The $i$-th integer will be the minimum value of $M_{i, w_j}$ where $j$ is between 1 and $k$.\n\nYou are allowed to ask at most 20 questions.\n\nWhen you think you know the minimum values for each row, you print a -1 followed by $n$ integers. The $i$-th integer should be the minimum value in the $i$-th row of the matrix, excluding the $i$-th element. \n\n\n\nLet me know if you'd like help with a strategy for solving this problem!"}, {"prompt_md5": "84ae41cc", "template_md5": "465699a0", "result": "You need to find the minimum value in each row of a hidden matrix, excluding the diagonal elements. You can ask questions to reveal the minimum value for a subset of columns in each row. You have a limited number of questions (20).  Your final answer should list the minimum values for each row."}]}