{"uid": "745-A", "url": "https://codeforces.com/contest/745/problem/A", "tags": ["implementation", " strings"], "title": "745-A", "statement": "A. Hongcow Learns the Cyclic Shifttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputHongcow is learning to spell! One day, his teacher gives him a word that he needs to learn to spell. Being a dutiful student, he immediately learns how to spell the word.Hongcow has decided to try to make new words from this one. He starts by taking the word he just learned how to spell, and moves the last character of the word to the beginning of the word. He calls this acyclic shift. He can apply cyclic shift many times. For example, consecutively applying cyclic shift operation to the word \"abracadabra\" Hongcow will get words \"aabracadabr\", \"raabracadab\" and so on.Hongcow is now wondering how many distinct words he can generate by doing the cyclic shift arbitrarily many times. The initial string is also counted.InputThe first line of input will be a single strings(1 ≤ |s| ≤ 50), the word Hongcow initially learns how to spell. The stringsconsists only of lowercase English letters ('a'–'z').OutputOutput a single integer equal to the number of distinct strings that Hongcow can obtain by applying the cyclic shift arbitrarily many times to the given string.ExamplesInputabcdOutput4InputbbbOutput1InputyzyzOutput2NoteFor the first sample, the strings Hongcow can generate are \"abcd\", \"dabc\", \"cdab\", and \"bcda\".For the second sample, no matter how many times Hongcow does the cyclic shift, Hongcow can only generate \"bbb\".For the third sample, the two strings Hongcow can generate are \"yzyz\" and \"zyzy\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "14861235", "template_md5": "35d339e4", "result": "You are given a string of lowercase English letters.  Determine the number of unique strings that can be created by repeatedly shifting the last letter to the beginning of the string. The original string is also considered a unique string."}, {"prompt_md5": "6b8f2d5a", "template_md5": "465699a0", "result": "Given a word, find the number of unique words you can create by repeatedly moving the last letter to the beginning."}]}