{"uid": "746-A", "url": "https://codeforces.com/contest/746/problem/A", "tags": ["implementation", " math"], "title": "746-A", "statement": "A. Compotetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputNikolay hasalemons,bapples andcpears. He decided to cook a compote. According to the recipe the fruits should be in the ratio1: 2: 4. It means that for each lemon in the compote should be exactly2apples and exactly4pears. You can't crumble up, break up or cut these fruits into pieces. These fruits — lemons, apples and pears — should be put in the compote as whole fruits.Your task is to determine the maximum total number of lemons, apples and pears from which Nikolay can cook the compote. It is possible that Nikolay can't use any fruits, in this case print0.InputThe first line contains the positive integera(1 ≤a≤ 1000) — the number of lemons Nikolay has.The second line contains the positive integerb(1 ≤b≤ 1000) — the number of apples Nikolay has.The third line contains the positive integerc(1 ≤c≤ 1000) — the number of pears Nikolay has.OutputPrint the maximum total number of lemons, apples and pears from which Nikolay can cook the compote.ExamplesInput257Output7Input4713Output21Input232Output0NoteIn the first example Nikolay can use1lemon,2apples and4pears, so the answer is1 + 2 + 4 = 7.In the second example Nikolay can use3lemons,6apples and12pears, so the answer is3 + 6 + 12 = 21.In the third example Nikolay don't have enough pears to cook any compote, so the answer is0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "66674c96", "template_md5": "35d339e4", "result": "You are given three numbers: $a$, $b$, and $c$. These represent the number of lemons, apples, and pears you have, respectively.\n\nYou want to make a compote where the ratio of lemons to apples to pears is 1 : 2 : 4.  \n\nFind the maximum number of fruits you can use to make the compote. You can only use whole fruits and cannot cut or break them. If you cannot make the compote with the given fruits, output 0."}, {"prompt_md5": "2e9d3d87", "template_md5": "465699a0", "result": "You have a limited number of lemons, apples, and pears.  You need to figure out the maximum number of these fruits you can use to make a mixture where there are always twice as many apples as lemons and four times as many pears as lemons.  If you can't make the mixture with the given fruits, the answer is 0."}]}