{"uid": "746-G", "url": "https://codeforces.com/contest/746/problem/G", "tags": ["constructive algorithms", " graphs", " trees"], "title": "746-G", "statement": "G. New Roadstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arencities in Berland, each of them has a unique id — an integer from1ton, the capital is the one with id1. Now there is a serious problem in Berland with roads — there are no roads.That is why there was a decision to buildn- 1roads so that there will be exactly one simple path between each pair of cities.In the construction plantintegersa1,a2, ...,atwere stated, wheretequals to the distance from the capital to the most distant city, concerning new roads.aiequals the number of cities which should be at the distanceifrom the capital. The distance between two cities is the number of roads one has to pass on the way from one city to another.Also, it was decided that among all the cities except the capital there should be exactlykcities with exactly one road going from each of them. Such cities are dead-ends and can't be economically attractive. In calculation of these cities the capital is not taken into consideration regardless of the number of roads from it.Your task is to offer a plan of road's construction which satisfies all the described conditions or to inform that it is impossible.InputThe first line contains three positive numbersn,tandk(2 ≤n≤ 2·105,1 ≤t,k<n) — the distance to the most distant city from the capital and the number of cities which should be dead-ends (the capital in this number is not taken into consideration).The second line contains a sequence oftintegersa1,a2, ...,at(1 ≤ai<n), thei-th number is the number of cities which should be at the distanceifrom the capital. It is guaranteed that the sum of all the valuesaiequalsn- 1.OutputIf it is impossible to built roads which satisfy all conditions, print-1.Otherwise, in the first line print one integern— the number of cities in Berland. In the each of the nextn- 1line print two integers — the ids of cities that are connected by a road. Each road should be printed exactly once. You can print the roads and the cities connected by a road in any order.If there are multiple answers, print any of them. Remember that the capital has id1.ExamplesInput7 3 32 3 1Output71 32 12 62 47 43 5Input14 5 64 4 2 2 1Output143 11 411 61 210 136 1010 1214 128 45 13 72 65 9Input3 1 12Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e64ffa22", "template_md5": "35d339e4", "result": "There are $n$ cities. City 1 is the capital. You need to build $n-1$ roads to connect all the cities so that there is exactly one path between any two cities.\n\nYou are given:\n\n* $t$: The distance from the capital to the farthest city.\n* $k$: The number of cities (excluding the capital) that should have only one road connecting to them (dead-ends).\n* $a_1, a_2, ..., a_t$:  The number of cities that are $i$ distance units away from the capital.  The sum of all $a_i$ values must equal $n-1$.\n\nYour task is to:\n\n1. Determine if it's possible to build the roads according to these conditions.\n2. If possible, output a plan for the roads by listing each road as a pair of connected city IDs. \n\n\n\nIf it's impossible to build the roads, output -1."}, {"prompt_md5": "b09e9d7d", "template_md5": "465699a0", "result": "You are given a number of cities and the distances from the capital city to the furthest cities. You need to build roads between the cities so that:\n\n* There is exactly one path between any two cities.\n* A certain number of cities have only one road connecting them to other cities. \n\nDetermine if it's possible to build the roads according to these rules. If possible, list the connections between the cities."}]}