{"uid": "747-F", "url": "https://codeforces.com/contest/747/problem/F", "tags": ["brute force", " combinatorics", " dp", " math"], "title": "747-F", "statement": "F. Igor and Interesting Numberstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIgor likes hexadecimal notation and considerspositiveinteger in the hexadecimal notationinterestingif each digit and each letter in it appears no more thanttimes. For example, ift= 3, then integers13a13322,aaa,abcdef0123456789are interesting, but numbersaaaa,ababababand1000000are not interesting.Your task is to find thek-th smallestinterestingfor Igor integer in the hexadecimal notation. The integer should not contain leading zeros.InputThe first line contains the two integerskandt(1 ≤k≤ 2·109,1 ≤t≤ 10) — the number of the required integer and the maximum number of times some integer or letter can appear in interesting integer.It can be shown that the answer always exists for such constraints.OutputPrint in the hexadecimal notation the only integer that is thek-th smallestinterestinginteger for Igor.ExamplesInput17 1Output12Input1000000 2Outputfca2cNoteThe first 20interestingintegers ift= 1:1,2,3,4,5,6,7,8,9,a,b,c,d,e,f,10,12,13,14,15. So the answer for the first example equals12.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ce5e5739", "template_md5": "35d339e4", "result": "You are given two integers, $k$ and $t$.  Find the $k$-th smallest integer that meets the following criteria:\n\n* The integer is represented in hexadecimal notation (using digits 0-9 and letters a-f).\n* Each digit and each letter in the integer appears no more than $t$ times.\n* The integer does not start with any leading zeros. \n\n\n\nLet me know if you'd like help with any part of solving this problem!"}, {"prompt_md5": "2f8f0941", "template_md5": "465699a0", "result": "Find the k-th smallest number that uses only digits 0-9 and letters a-f, where each digit and letter can appear no more than t times."}]}