{"uid": "747-D", "url": "https://codeforces.com/contest/747/problem/D", "tags": ["dp", " greedy", " sortings"], "title": "747-D", "statement": "D. Winter Is Comingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe winter in Berland lastsndays. For each day we know the forecast for the average air temperature that day.Vasya has a new set of winter tires which allows him to drive safely no more thankdays at any average air temperature. Afterkdays of using it (regardless of the temperature of these days) the set of winter tires wears down and cannot be used more. It is not necessary that thesekdays form a continuous segment of days.Before the first winter day Vasya still usessummer tires. It is possible to drive safely on summer tires any number of days when the average air temperature isnon-negative. It is impossible to drive on summer tires at days when the average air temperature is negative.Vasya can change summer tires to winter tires and vice versa at the beginning of any day.Find the minimum number of times Vasya needs to change summer tires to winter tires and vice versa to drive safely during the winter. At the end of the winter the car can be with any set of tires.InputThe first line contains two positive integersnandk(1 ≤n≤ 2·105,0 ≤k≤n) — the number of winter days and the number of days winter tires can be used. It is allowed to drive on winter tires at any temperature, but no more thankdays in total.The second line contains a sequence ofnintegerst1,t2, ...,tn(- 20 ≤ti≤ 20) — the average air temperature in thei-th winter day.OutputPrint the minimum number of times Vasya has to change summer tires to winter tires and vice versa to drive safely during all winter. If it is impossible, print-1.ExamplesInput4 3-5 20 -3 0Output2Input4 2-5 20 -3 0Output4Input10 62 -5 1 3 0 0 -4 -3 1 0Output3NoteIn the first example before the first winter day Vasya should change summer tires to winter tires, use it for three days, and then change winter tires to summer tires because he can drive safely with the winter tires for just three days. Thus, the total number of tires' changes equals two.In the second example before the first winter day Vasya should change summer tires to winter tires, and then after the first winter day change winter tires to summer tires. After the second day it is necessary to change summer tires to winter tires again, and after the third day it is necessary to change winter tires to summer tires. Thus, the total number of tires' changes equals four.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3c10bc3a", "template_md5": "35d339e4", "result": "There are $n$ days of winter. For each day, the average air temperature is known ($t_1, t_2, ..., t_n$).  A set of winter tires can be used for a maximum of $k$ days, regardless of the temperature. After $k$ days, the tires wear down and can't be used anymore.\n\nSummer tires can be used any number of days when the temperature is non-negative.  \n\nYou can switch between summer and winter tires at the beginning of any day.\n\nFind the minimum number of times you need to switch between summer and winter tires to drive safely throughout the winter."}, {"prompt_md5": "9fa34a0f", "template_md5": "465699a0", "result": "You have a set number of days.  For some of these days, you need a special type of tire to drive safely.  You have a limited number of days you can use the special tires before they wear out. You can switch between the two types of tires at the start of any day. Find the fewest times you need to switch tires to drive safely through all the days."}]}