{"uid": "747-B", "url": "https://codeforces.com/contest/747/problem/B", "tags": ["implementation", " strings"], "title": "747-B", "statement": "B. Mammoth's Genome Decodingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe process of mammoth's genome decoding in Berland comes to its end!One of the few remaining tasks is to restore unrecognized nucleotides in a found chains. Each nucleotide is coded with a capital letter of English alphabet: 'A', 'C', 'G' or 'T'. Unrecognized nucleotides are coded by a question mark '?'. Thus,sis a string consisting of letters 'A', 'C', 'G', 'T' and characters '?'.It is known that the number of nucleotides of each of the four types in the decoded genome of mammoth in Berland should be equal.Your task is to decode the genome and replace each unrecognized nucleotide with one of the four types so that the number of nucleotides of each of the four types becomes equal.InputThe first line contains the integern(4 ≤n≤ 255) — the length of the genome.The second line contains the stringsof lengthn— the coded genome. It consists of characters 'A', 'C', 'G', 'T' and '?'.OutputIf it is possible to decode the genome, print it. If there are multiple answer, print any of them. If it is not possible, print three equals signs in a row: \"===\" (without quotes).ExamplesInput8AG?C??CTOutputAGACGTCTInput4AGCTOutputAGCTInput6????G?Output===Input4AA??Output===NoteIn the first example you can replace the first question mark with the letter 'A', the second question mark with the letter 'G', the third question mark with the letter 'T', then each nucleotide in the genome would be presented twice.In the second example the genome is already decoded correctly and each nucleotide is exactly once in it.In the third and the fourth examples it is impossible to decode the genom.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b1b764b2", "template_md5": "35d339e4", "result": "You are given a string of length $n$ ($4 \\le n \\le 255$) consisting of the characters 'A', 'C', 'G', 'T', and '?'.  \n\nThe '?' characters represent unknown nucleotides. You need to replace each '?' with one of the four nucleotides ('A', 'C', 'G', or 'T') so that the resulting string has an equal number of each nucleotide.\n\nIf it is possible to do this, print the decoded string. If it is not possible, print \"===\" ."}, {"prompt_md5": "8a400a0d", "template_md5": "465699a0", "result": "You are given a string of letters representing a genetic sequence. Some letters are unknown and represented by '?'.  Your task is to replace the unknown letters with 'A', 'C', 'G', or 'T' so that each letter appears the same number of times in the final sequence. If this is possible, output the completed sequence. If not, output \"===\" ."}]}