{"uid": "749-E", "url": "https://codeforces.com/contest/749/problem/E", "tags": ["data structures", " probabilities"], "title": "749-E", "statement": "E. Inversions After Shuffletime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a permutation of integers from1ton. Exactly once you apply the following operation to this permutation: pick a random segment and shuffle its elements. Formally:Pick a random segment (continuous subsequence) fromltor. Allsegments are equiprobable.Letk=r-l+ 1, i.e. the length of the chosen segment. Pick a random permutation of integers from1tok,p1,p2, ...,pk. Allk!permutation are equiprobable.This permutation is applied to elements of the chosen segment, i.e. permutationa1,a2, ...,al- 1,al,al+ 1, ...,ar- 1,ar,ar+ 1, ...,anis transformed toa1,a2, ...,al- 1,al- 1 +p1,al- 1 +p2, ...,al- 1 +pk- 1,al- 1 +pk,ar+ 1, ...,an.Inversionif a pair of elements (not necessary neighbouring) with the wrong relative order. In other words, the number of inversion is equal to the number of pairs(i,j)such thati<jandai>aj. Find the expected number of inversions after we apply exactly one operation mentioned above.InputThe first line contains a single integern(1 ≤n≤ 100 000) — the length of the permutation.The second line containsndistinct integers from1ton— elements of the permutation.OutputPrint one real value — the expected number of inversions. Your answer will be considered correct if its absolute or relative error does not exceed10- 9.Namely: let's assume that your answer isa, and the answer of the jury isb. The checker program will consider your answer correct, if.ExampleInput32 3 1Output1.916666666666666666666666666667", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3e207d1a", "template_md5": "35d339e4", "result": "You are given a permutation of numbers from 1 to *n*. You can choose a random segment within this permutation and shuffle the elements within that segment.  \n\n*  You randomly choose a segment of length *k* from the permutation.\n*  You randomly shuffle the *k* elements within that segment.\n\nAn inversion is a pair of numbers in the permutation that are out of order (e.g., 2 is before 1).\n\nWhat is the expected number of inversions in the permutation after you perform this shuffle operation exactly once? \n\nInput:\n\n* The first line contains an integer *n* (1 ≤ *n* ≤ 100,000), the length of the permutation.\n* The second line contains *n* distinct integers from 1 to *n*, representing the permutation.\n\nOutput:\n\n* Print a real number representing the expected number of inversions."}, {"prompt_md5": "393441ce", "template_md5": "465699a0", "result": "You are given a list of numbers. You can choose a section of this list and randomly shuffle the numbers within that section. What is the average number of times you'll end up with numbers in the wrong order after doing this once?"}]}