{"uid": "75-E", "url": "https://codeforces.com/contest/75/problem/E", "tags": ["geometry", " shortest paths"], "title": "75-E", "statement": "E. Ship's Shortest Pathtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutYou have got a new job, and it's very interesting, you are a ship captain. Your first task is to move your ship from one point to another point, and for sure you want to move it at the minimum cost.And it's well known that the shortest distance between any 2 points is the length of the line segment between these 2 points. But unfortunately there is an island in the sea, so sometimes you won't be able to move your ship in the line segment between the 2 points.You canonlymove to safe points. A point is called safe if it's on the line segment between the start and end points, or if it's on the island's edge.But you are too lucky, you have got some clever and strong workers and they can help you in your trip, they can help you move the ship in the sea and they will take 1 Egyptian pound for each moving unit in the sea, and they can carry the ship (yes, they are very strong) and walk on the island and they will take 2 Egyptian pounds for each moving unit in the island. The money which you will give to them will be divided between all workers, so the number of workers does not matter here.You can move your ship on the island edge, and it will be considered moving in the sea.Now you have a sea map, and you have to decide what is the minimum cost for your trip.Your starting point is (xStart,yStart), and the end point is (xEnd,yEnd), both points will be different.The island will be a convex polygon and there will be no more than 2 polygon points on the same line, also the starting and the end points won't be inside or on the boundary of the island. The points for the polygon will be given in the anti-clockwise order.InputThe first line contains 4 integers,xStart,yStart,xEndandyEnd(- 100 ≤xStart,yStart,xEnd,yEnd≤ 100). The second line contains an integern, which is the number of points in the polygon (3 ≤n≤ 30), followed by a line containingnpairs of integersxandy, which are the coordinates of the points (- 100 ≤x,y≤ 100), the polygon points will be distinct.OutputPrint one line which contains the minimum possible cost. The absolute or relative error in the answer should not exceed10- 6.ExamplesInput1 7 6 744 2 4 12 3 12 3 2Output6.000000000Input-1 0 2 040 0 1 0 1 1 0 1Output3.000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "326ff37c", "template_md5": "35d339e4", "result": "You are given a starting point $(x_{start}, y_{start})$ and an ending point $(x_{end}, y_{end})$. There is a convex polygon representing an island.  \n\nYou need to find the shortest path from the starting point to the ending point, considering the following:\n\n* You can only move on the edges of the island or along a straight line between the starting and ending points.\n* Moving on the island costs 2 units of currency per unit of distance.\n* Moving in the sea (outside the island) costs 1 unit of currency per unit of distance.\n\nOutput the minimum cost to travel from the starting point to the ending point. \n\n**Input:**\n\n* The first line contains four integers: $x_{start}$, $y_{start}$, $x_{end}$, $y_{end}$.\n* The second line contains an integer $n$ (the number of points defining the island).\n* The next line contains $n$ pairs of integers, each pair representing the coordinates $(x, y)$ of a point on the island's boundary.\n\n**Output:**\n\n* A single line containing the minimum cost."}, {"prompt_md5": "f1435dae", "template_md5": "465699a0", "result": "You need to find the cheapest way to move a ship from one point to another point on a map. There is an island in the way, and you can only move the ship on the edges of the island or in the open water. Moving in the water costs 1 unit, and moving on the island costs 2 units.  You need to find the shortest path that takes into account these costs."}]}