{"uid": "750-B", "url": "https://codeforces.com/contest/750/problem/B", "tags": ["geometry", " implementation"], "title": "750-B", "statement": "B. New Year and North Poletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn this problem we assume the Earth to be a completely round ball and its surface a perfect sphere. The length of the equator and any meridian is considered to be exactly40 000kilometers. Thus, travelling from North Pole to South Pole or vice versa takes exactly20 000kilometers.Limak, a polar bear, lives on the North Pole. Close to the New Year, he helps somebody with delivering packages all around the world. Instead of coordinates of places to visit, Limak got a description how he should move, assuming that he starts from the North Pole. The description consists ofnparts. In thei-th part of his journey, Limak should movetikilometers in the direction represented by a stringdirithat is one of: \"North\", \"South\", \"West\", \"East\".Limak isn’t sure whether the description is valid. You must help him to check the following conditions:If at any moment of time (before any of the instructions or while performing one of them) Limak is on the North Pole, he can move only to the South.If at any moment of time (before any of the instructions or while performing one of them) Limak is on the South Pole, he can move only to the North.The journey must end on the North Pole.Check if the above conditions are satisfied and print \"YES\" or \"NO\" on a single line.InputThe first line of the input contains a single integern(1 ≤n≤ 50).Thei-th of nextnlines contains an integertiand a stringdiri(1 ≤ti≤ 106,) — the length and the direction of thei-th part of the journey, according to the description Limak got.OutputPrint \"YES\" if the description satisfies the three conditions, otherwise print \"NO\", both without the quotes.ExamplesInput57500 South10000 East3500 North4444 West4000 NorthOutputYESInput215000 South4000 EastOutputNOInput520000 South1000 North1000000 West9000 North10000 NorthOutputYESInput320000 South10 East20000 NorthOutputNOInput21000 North1000 SouthOutputNOInput450 South50 North15000 South15000 NorthOutputYESNoteDrawings below show how Limak's journey would look like in first two samples. In the second sample the answer is \"NO\" because he doesn't end on the North Pole.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5f5787ea", "template_md5": "35d339e4", "result": "You are given a sequence of movements. Each movement consists of a distance and a direction (North, South, East, West).  \n\nThe movements start at the North Pole.\n\nThe rules are:\n\n* If you are at the North Pole, you can only move South.\n* If you are at the South Pole, you can only move North.\n* The journey must end at the North Pole.\n\nDetermine if the sequence of movements follows these rules. If it does, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "afe3a2aa", "template_md5": "465699a0", "result": "Given a sequence of movements (distance and direction), determine if the movements are valid according to the following rules:\n\n1. Starting and ending must be at the North Pole.\n2. If at the North Pole, only South movement is allowed.\n3. If at the South Pole, only North movement is allowed. \n\n\nOutput \"YES\" if valid, \"NO\" otherwise."}]}