{"uid": "750-E", "url": "https://codeforces.com/contest/750/problem/E", "tags": ["data structures", " divide and conquer", " dp", " matrices"], "title": "750-E", "statement": "E. New Year and Old Subsequencetime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA stringtis calledniceif a string \"2017\" occurs intas asubsequencebut a string \"2016\" doesn't occur intas asubsequence. For example, strings \"203434107\" and \"9220617\" are nice, while strings \"20016\", \"1234\" and \"20167\" aren't nice.Theuglinessof a string is the minimum possible number of characters to remove, in order to obtain a nice string. If it's impossible to make a string nice by removing characters, its ugliness is- 1.Limak has a stringsof lengthn, with characters indexed1throughn. He asks youqqueries. In thei-th query you should compute and print the ugliness of asubstring(continuous subsequence) ofsstarting at the indexaiand ending at the indexbi(inclusive).InputThe first line of the input contains two integersnandq(4 ≤n≤ 200 000,1 ≤q≤ 200 000) — the length of the stringsand the number of queries respectively.The second line contains a stringsof lengthn. Every character is one of digits '0'–'9'.Thei-th of nextqlines contains two integersaiandbi(1 ≤ai≤bi≤n), describing a substring in thei-th query.OutputFor each query print the ugliness of the given substring.ExamplesInput8 3201667661 81 72 8Output43-1Input15 50120166620916703 41 144 151 1310 15Output-121-1-1Input4 212342 41 2Output-1-1NoteIn the first sample:In the first query,ugliness(\"20166766\") = 4because all four sixes must be removed.In the second query,ugliness(\"2016676\") = 3because all three sixes must be removed.In the third query,ugliness(\"0166766\") =  - 1because it's impossible to remove some digits to get a nice string.In the second sample:In the second query,ugliness(\"01201666209167\") = 2. It's optimal to remove the first digit '2' and the last digit '6', what gives a string \"010166620917\", which is nice.In the third query,ugliness(\"016662091670\") = 1. It's optimal to remove the last digit '6', what gives a nice string \"01666209170\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "82649637", "template_md5": "35d339e4", "result": "A string is considered \"nice\" if it contains the subsequence \"2017\" but does not contain the subsequence \"2016\". \n\nGiven a string of length $n$, determine the minimum number of characters that need to be removed from a substring of the string to make it \"nice\". If it's impossible to make the substring \"nice\", the answer is -1.\n\nYou will be given $q$ queries, each specifying a substring of the string. For each query, output the ugliness of the substring."}, {"prompt_md5": "dbd717b3", "template_md5": "465699a0", "result": "Given a string, determine the fewest characters to remove to make it contain \"2017\" but not \"2016\". If it's impossible, the answer is -1.  Do this for multiple substrings within the original string."}]}