{"uid": "754-E", "url": "https://codeforces.com/contest/754/problem/E", "tags": ["bitmasks", " brute force", " fft", " strings", " trees"], "title": "754-E", "statement": "E. Dasha and cyclic tabletime limit per test6 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputDasha is fond of challenging puzzles: Rubik's Cube3 × 3 × 3,4 × 4 × 4,5 × 5 × 5and so on. This time she has a cyclic table of sizen×m, and each cell of the table contains a lowercase English letter. Each cell has coordinates(i,j)(0 ≤i<n,0 ≤j<m). The table is cyclic means that to the right of cell(i,j)there is the cell, and to the down there is the cell.Dasha has a pattern as well. A pattern is a non-cyclic table of sizer×c. Each cell is either a lowercase English letter or a question mark. Each cell has coordinates(i,j)(0 ≤i<r,0 ≤j<c).The goal of the puzzle is to find all the appearance positions of the pattern in the cyclic table.We say that the cell(i,j)of cyclic table is an appearance position, if for every pair(x,y)such that0 ≤x<rand0 ≤y<cone of the following conditions holds:There is a question mark in the cell(x,y)of the pattern, orThe cellof the cyclic table equals to the cell(x,y)of the pattern.Dasha solved this puzzle in no time, as well as all the others she ever tried. Can you solve it?.InputThe first line contains two integersnandm(1 ≤n,m≤ 400) — the cyclic table sizes.Each of the nextnlines contains a string ofmlowercase English characters — the description of the cyclic table.The next line contains two integersrandc(1 ≤r,c≤ 400) — the sizes of the pattern.Each of the nextrlines contains a string ofclowercase English letter and/or characters '?' — the description of the pattern.OutputPrintnlines. Each of thenlines should containmcharacters. Each of the characters should equal '0' or '1'.Thej-th character of thei-th (0-indexed) line should be equal to '1', in case the cell(i,j)is an appearance position, otherwise it should be equal to '0'.ExamplesInput5 7qcezchshhedywqwikywqyqckrqztbqexcxz3 2??yw?qOutput00001000001001000000000000000000000Input10 10fwtoayylhwyyaryyjawrywrdzwhscyhnsyyxiphnbnjwzyyjvokkjgseenwngvmiflpcsylxvkwrobwuwyybbcocyyyysijsvqry2 2??yyOutput1000100000000000000100010000000000010000000000000000000000000000000000010000001010000000010000010000Input8 6ibrgxlxqdcsgokbcgitvpetcxgxxigigghzolmlazagpswzv1 4gx??Output000100000001000000000000010001000000000000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "91b550ff", "template_md5": "35d339e4", "result": "You are given a rectangular grid of letters, and a smaller pattern of letters and question marks.  The question marks in the pattern can match any letter in the grid.\n\nYour task is to determine all the positions in the grid where the pattern appears. A match occurs if the corresponding cells in the pattern and the grid either both contain the same letter, or the pattern cell contains a question mark.\n\n**Input:**\n\n* Two integers $n$ and $m$ representing the dimensions of the grid.\n* $n$ lines, each containing $m$ lowercase letters, representing the grid.\n* Two integers $r$ and $c$ representing the dimensions of the pattern.\n* $r$ lines, each containing $c$ lowercase letters and/or question marks, representing the pattern.\n\n**Output:**\n\n* $n$ lines, each containing $m$ characters.\n* Each character should be either '0' or '1'.\n* '1' indicates that the corresponding cell in the grid is a match position for the pattern.\n* '0' indicates that the corresponding cell is not a match position."}, {"prompt_md5": "3dcfdf28", "template_md5": "465699a0", "result": "You are given a large grid of letters and a smaller pattern grid with some question marks.  The pattern grid can be placed anywhere on the large grid, as long as the letters match or the question marks line up with any letter.  Your task is to mark each cell in the large grid with a 1 if it is part of a matching pattern, and a 0 otherwise."}]}