{"uid": "754-C", "url": "https://codeforces.com/contest/754/problem/C", "tags": ["brute force", " constructive algorithms", " dp", " implementation", " strings"], "title": "754-C", "statement": "C. Vladik and chattime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently Vladik discovered a new entertainment — coding bots for social networks. He would like to use machine learning in his bots so now he want to prepare some learning data for them.At first, he need to downloadtchats. Vladik coded a script which should have downloaded the chats, however, something went wrong. In particular, some of the messages have no information of their sender. It is known that if a person sends several messages in a row, they all are merged into a single message. It means thatthere could not be two or more messages in a row with the same sender. Moreover,a sender never mention himself in his messages.Vladik wants to recover senders of all the messages so that each two neighboring messages will have different senders and no sender will mention himself in his messages.He has no idea of how to do this, and asks you for help. Help Vladik to recover senders in each of the chats!InputThe first line contains single integert(1 ≤t≤ 10) — the number of chats. Thetchats follow. Each chat is given in the following format.The first line of each chat description contains single integern(1 ≤n≤ 100) — the number of users in the chat.The next line containsnspace-separated distinct usernames. Each username consists of lowercase and uppercase English letters and digits. The usernames can't start with a digit. Two usernames are different even if they differ only with letters' case. The length of username is positive and doesn't exceed10characters.The next line contains single integerm(1 ≤m≤ 100) — the number of messages in the chat. The nextmline contain the messages in the following formats, one per line:<username>:<text>— the format of a message with known sender. The username should appear in the list of usernames of the chat.<?>:<text>— the format of a message with unknown sender.The text of a message can consist of lowercase and uppercase English letter, digits, characters'.'(dot),','(comma),'!'(exclamation mark),'?'(question mark) and' '(space). The text doesn't contain trailing spaces. The length of the text is positive and doesn't exceed100characters.We say that a text mention a user if his username appears in the text as a word. In other words, the username appears in a such a position that the two characters before and after its appearance either do not exist or are not English letters or digits. For example, the text \"Vasya, masha13 and Kate!\" can mention users \"Vasya\", \"masha13\", \"and\" and \"Kate\", but not \"masha\".It is guaranteed that in each chatno known sender mention himself in his messagesand there are no two neighboring messages with the same known sender.OutputPrint the information about thetchats in the following format:If it is not possible to recover senders, print single line \"Impossible\" for this chat. Otherwise printmmessages in the following format:<username>:<text>If there are multiple answers, print any of them.ExamplesInput12Vladik netman2?: Hello, Vladik!?: HiOutputnetman: Hello, Vladik!Vladik: HiInput12netman vladik3netman:how are you??:wrong messagevladik:im fineOutputImpossibleInput23netman vladik Fedosik2?: users are netman, vladik, Fedosikvladik: something wrong with this chat4netman tigerrrrr banany2001 klinchuh4?: tigerrrrr, banany2001, klinchuh, my favourite team ever, are you ready?klinchuh: yes, coach!?: yes, netmanbanany2001: yes of course.OutputImpossiblenetman: tigerrrrr, banany2001, klinchuh, my favourite team ever, are you ready?klinchuh: yes, coach!tigerrrrr: yes, netmanbanany2001: yes of course.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "864be988", "template_md5": "35d339e4", "result": "You are given a list of chat conversations. Each conversation has a list of usernames and a list of messages. Some messages have a known sender (username), while others do not. \n\nThe rules are:\n\n*  If a person sends multiple messages in a row, they are merged into a single message.\n*  A sender will never mention themselves in their messages.\n\nYour task is to determine the sender of each message, ensuring that:\n\n*  No two consecutive messages have the same sender.\n*  No sender mentions themselves in their messages.\n\nIf it's impossible to determine the senders according to these rules, output \"Impossible\". Otherwise, output the conversation with each message assigned a sender. \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "f3bf3320", "template_md5": "465699a0", "result": "You are given a list of chat messages where some messages have unknown senders.  Messages from the same person are grouped together.  You need to determine the sender of each message, following these rules:\n\n*  No two consecutive messages can have the same sender.\n*  A sender cannot mention themselves in a message. \n\n\nIf it's impossible to determine the senders based on these rules, output \"Impossible\". Otherwise, output the chat with each message correctly assigned to a sender."}]}