{"uid": "756-A", "url": "https://codeforces.com/contest/756/problem/A", "tags": ["constructive algorithms", " dfs and similar"], "title": "756-A", "statement": "A. Pavel and barbecuetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPavel cooks barbecue. There arenskewers, they lay on a brazier in a row, each on one ofnpositions. Pavel wants each skewer to be cooked some time in every ofnpositions in two directions: in the one it was directed originally and in the reversed direction.Pavel has a plan: a permutationpand a sequenceb1,b2, ...,bn, consisting of zeros and ones. Each second Pavel move skewer on positionito positionpi, and ifbiequals1then he reverses it. So he hope that every skewer will visit every position in both directions.Unfortunately, not every pair of permutationpand sequencebsuits Pavel. What is the minimum total number of elements in the given permutationpand the given sequencebhe needs to change so that every skewer will visit each of2nplacements? Note that after changing the permutation should remain a permutation as well.There is no problem for Pavel, if some skewer visits some of the placements several times before he ends to cook. In other words, a permutationpand a sequencebsuit him if there is an integerk(k≥ 2n), so that afterkseconds each skewer visits each of the2nplacements.It can be shown that some suitable pair of permutationpand sequencebexists for anyn.InputThe first line contain the integern(1 ≤n≤ 2·105) — the number of skewers.The second line contains a sequence of integersp1,p2, ...,pn(1 ≤pi≤n) — the permutation, according to which Pavel wants to move the skewers.The third line contains a sequenceb1,b2, ...,bnconsisting of zeros and ones, according to which Pavel wants to reverse the skewers.OutputPrint single integer — the minimum total number of elements in the given permutationpand the given sequencebhe needs to change so that every skewer will visit each of2nplacements.ExamplesInput44 3 2 10 1 1 1Output2Input32 3 10 0 0Output1NoteIn the first example Pavel can change the permutation to4, 3, 1, 2.In the second example Pavel can change any element ofbto1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d200a34b", "template_md5": "35d339e4", "result": "You are given $n$ skewers and a brazier with $n$ positions. Each skewer needs to be cooked in every position on the brazier, both in its original direction and reversed.\n\nYou are given a permutation $p$ of length $n$ and a sequence $b$ of $n$ 0s and 1s.  \n\n* $p_i$ indicates the target position for skewer $i$.\n* $b_i = 1$ means to reverse skewer $i$ at its target position.\n\nYour task is to find the minimum number of changes needed to the permutation $p$ and the sequence $b$ so that every skewer visits every position on the brazier in both directions. \n\nYou can change elements in $p$ and $b$ to achieve this.  \n\n**Note:**\n\n* Changing an element in $p$ means changing its value to a different valid position (1 to $n$).\n* Changing an element in $b$ means changing it from 0 to 1 or vice versa.\n* A skewer visiting a position multiple times before visiting all positions is allowed."}, {"prompt_md5": "fea49fd6", "template_md5": "465699a0", "result": "You are given a sequence of numbers representing a plan for moving objects.  You also have a sequence of 0s and 1s that indicate whether to reverse the objects at each step.  Find the minimum number of changes needed to the plan and the reversal instructions so that each object visits every possible position."}]}