{"uid": "756-E", "url": "https://codeforces.com/contest/756/problem/E", "tags": ["combinatorics", " dp", " math"], "title": "756-E", "statement": "E. Byteland coinstime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputThere arentypes of coins in Byteland. Conveniently, the denomination of the coin typekdivides the denomination of the coin typek+ 1, the denomination of the coin type1equals1tugrick. The ratio of the denominations of coin typesk+ 1andkequalsak. It is known that for eachxthere are at most20coin types of denominationx.Byteasar hasbkcoins of typekwith him, and he needs to pay exactlymtugricks. It is known that Byteasar never has more than3·105coins with him. Byteasar want to know how many ways there are to pay exactlymtugricks. Two ways are different if there is an integerksuch that the amount of coins of typekdiffers in these two ways. As all Byteland citizens, Byteasar wants to know the number of ways modulo109+ 7.InputThe first line contains single integern(1 ≤n≤ 3·105) — the number of coin types.The second line containsn- 1integersa1,a2,...,an- 1(1 ≤ak≤ 109) — the ratios between the coin types denominations. It is guaranteed that for eachxthere are at most20coin types of denominationx.The third line containsnnon-negative integersb1,b2,...,bn— the number of coins of each type Byteasar has. It is guaranteed that the sum of these integers doesn't exceed3·105.The fourth line contains single integerm(0 ≤m< 1010000) — the amount in tugricks Byteasar needs to pay.OutputPrint single integer — the number of ways to pay exactlymtugricks modulo109+ 7.ExamplesInput142Output1Input214 42Output3Input33 310 10 1017Output6NoteIn the first example Byteasar has4coins of denomination1, and he has to pay2tugricks. There is only one way.In the second example Byteasar has4coins of each of two different types of denomination1, he has to pay2tugricks. There are3ways: pay one coin of the first type and one coin of the other, pay two coins of the first type, and pay two coins of the second type.In the third example the denominations are equal to1,3,9.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "88e254c3", "template_md5": "35d339e4", "result": "There are $n$ types of coins. The denomination of coin type $k$ divides the denomination of coin type $k+1$. The ratio of the denominations of coin types $k+1$ and $k$ is $a_k$.  You are given $a_1, a_2, ..., a_{n-1}$ and $b_1, b_2, ..., b_n$ where $b_i$ is the number of coins of type $i$.\n\nYou need to find the number of ways to pay exactly $m$ tugricks using these coins. Two ways are different if the number of coins of a particular type differs.  The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "f6eb6f2f", "template_md5": "465699a0", "result": "You have a set of coins with different denominations.  You know the ratio between the denominations of each coin type. You also know how many coins of each type you have.  You need to find how many ways you can use your coins to make a specific amount of money."}]}