{"uid": "757-B", "url": "https://codeforces.com/contest/757/problem/B", "tags": ["greedy", " math", " number theory"], "title": "757-B", "statement": "B. Bash's Big Daytime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputBash has set out on a journey to become the greatest Pokemon master. To get his first Pokemon, he went to Professor Zulu's Lab. Since Bash is Professor Zulu's favourite student, Zulu allows him to take as many Pokemon from his lab as he pleases.But Zulu warns him that a group ofk> 1Pokemon with strengths{s1,s2,s3, ...,sk}tend to fight among each other ifgcd(s1,s2,s3, ...,sk) = 1(see notes forgcddefinition).Bash, being smart, does not want his Pokemon to fight among each other. However, he also wants to maximize the number of Pokemon he takes from the lab. Can you help Bash find out the maximum number of Pokemon he can take?Note: A Pokemon cannot fight with itself.InputThe input consists of two lines.The first line contains an integern(1 ≤n≤ 105), the number of Pokemon in the lab.The next line containsnspace separated integers, where thei-th of them denotessi(1 ≤si≤ 105), the strength of thei-th Pokemon.OutputPrint single integer — the maximum number of Pokemons Bash can take.ExamplesInput32 3 4Output2Input52 3 4 6 7Output3Notegcd(greatest common divisor) of positive integers set{a1,a2, ...,an}is the maximum positive integer that divides all the integers{a1,a2, ...,an}.In the first sample, we can take Pokemons with strengths{2, 4}sincegcd(2, 4) = 2.In the second sample, we can take Pokemons with strengths{2, 4, 6}, and there is no larger group withgcd≠ 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97967318", "template_md5": "35d339e4", "result": "You are given a list of $n$ positive integers, where each integer represents the strength of a Pokemon.  You need to find the largest number of Pokemon that can be chosen from the list such that the greatest common divisor (GCD) of their strengths is not 1. \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵), the number of Pokemon.\n* The next line contains $n$ space-separated integers, where the $i$-th integer is $s_i$ (1 ≤ $s_i$ ≤ 10⁵), the strength of the $i$-th Pokemon.\n\n**Output:**\n\n* Print a single integer, the maximum number of Pokemon that can be chosen."}, {"prompt_md5": "b7d29ce0", "template_md5": "465699a0", "result": "You are given a list of numbers. Find the largest number of numbers from the list where the greatest common divisor of all the numbers is not 1."}]}