{"uid": "758-C", "url": "https://codeforces.com/contest/758/problem/C", "tags": ["binary search", " constructive algorithms", " implementation", " math"], "title": "758-C", "statement": "C. Unfair Polltime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn the Literature lesson Sergei noticed an awful injustice, it seems that some students are asked more often than others.Seating in the class looks like a rectangle, wherenrows withmpupils in each.The teacher asks pupils in the following order: at first, she asks all pupils from the first row in the order of their seating, then she continues to ask pupils from the next row. If the teacher asked the last row, then the direction of the poll changes, it means that she asks the previous row. The order of asking the rows looks as follows: the1-st row, the2-nd row,..., then- 1-st row, then-th row, then- 1-st row,..., the2-nd row, the1-st row, the2-nd row,...The order of asking of pupils on the same row is always the same: the1-st pupil, the2-nd pupil,..., them-th pupil.During the lesson the teacher managed to ask exactlykquestions from pupils in order described above. Sergei seats on thex-th row, on they-th place in the row. Sergei decided to prove to the teacher that pupils are asked irregularly, help him count three values:the maximum number of questions a particular pupil is asked,the minimum number of questions a particular pupil is asked,how many times the teacher asked Sergei.If there is only one row in the class, then the teacher always asks children from this row.InputThe first and the only line contains five integersn,m,k,xandy(1 ≤n,m≤ 100, 1 ≤k≤ 1018, 1 ≤x≤n, 1 ≤y≤m).OutputPrint three integers:the maximum number of questions a particular pupil is asked,the minimum number of questions a particular pupil is asked,how many times the teacher asked Sergei.ExamplesInput1 3 8 1 1Output3 2 3Input4 2 9 4 2Output2 1 1Input5 5 25 4 3Output1 1 1Input100 100 1000000000000000000 100 100Output101010101010101 50505050505051 50505050505051NoteThe order of asking pupils in the first test:the pupil from the first row who seats at the first table, it means it is Sergei;the pupil from the first row who seats at the second table;the pupil from the first row who seats at the third table;the pupil from the first row who seats at the first table, it means it is Sergei;the pupil from the first row who seats at the second table;the pupil from the first row who seats at the third table;the pupil from the first row who seats at the first table, it means it is Sergei;the pupil from the first row who seats at the second table;The order of asking pupils in the second test:the pupil from the first row who seats at the first table;the pupil from the first row who seats at the second table;the pupil from the second row who seats at the first table;the pupil from the second row who seats at the second table;the pupil from the third row who seats at the first table;the pupil from the third row who seats at the second table;the pupil from the fourth row who seats at the first table;the pupil from the fourth row who seats at the second table, it means it is Sergei;the pupil from the third row who seats at the first table;", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fba828e2", "template_md5": "35d339e4", "result": "There is a classroom arranged in a rectangle with $n$ rows and $m$ pupils in each row. A teacher asks questions to the pupils in a specific pattern:\n\n1.  Start from the first row and ask each pupil in order.\n2.  Move to the next row and ask each pupil in order.\n3.  Continue this pattern until the last row is reached.\n4.  Then, reverse the direction and start asking from the second-to-last row.\n\nThe teacher asks a total of $k$ questions.  You are given that you are sitting in the $x$-th row and the $y$-th position in that row.\n\nYour task is to determine:\n\n1. The maximum number of questions any pupil will be asked.\n2. The minimum number of questions any pupil will be asked.\n3. How many times the teacher will ask you a question."}, {"prompt_md5": "fa41f45e", "template_md5": "465699a0", "result": "You have a rectangular seating arrangement with rows and students in each row. A teacher asks questions in a cyclical pattern, going row by row.  Determine the maximum, minimum, and number of times a specific student is asked questions."}]}