{"uid": "758-D", "url": "https://codeforces.com/contest/758/problem/D", "tags": ["constructive algorithms", " dp", " greedy", " math", " strings"], "title": "758-D", "statement": "D. Ability To Converttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlexander is learning how to convert numbers from the decimal system to any other, however, he doesn't know English letters, so he writes any number only as a decimal number, it means that instead of the letterAhe will write the number10. Thus, by converting the number475from decimal to hexadecimal system, he gets11311(475 = 1·162+ 13·161+ 11·160). Alexander lived calmly until he tried to convert the number back to the decimal number system.Alexander remembers that he worked with little numbers so he asks to find the minimum decimal number so that by converting it to the system with the basenhe will get the numberk.InputThe first line contains the integern(2 ≤n≤ 109). The second line contains the integerk(0 ≤k< 1060), it is guaranteed that the numberkcontains no more than60symbols. All digits in the second line are strictly less thann.Alexander guarantees that the answer exists and does not exceed1018.The numberkdoesn't contain leading zeros.OutputPrint the numberx(0 ≤x≤ 1018) — the answer to the problem.ExamplesInput1312Output12Input1611311Output475Input20999Output3789Input172016Output594NoteIn the first example12could be obtained by converting two numbers to the system with base13:12 = 12·130or15 = 1·131+ 2·130.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6d7a318a", "template_md5": "35d339e4", "result": "Given an integer $n$ and a string $k$ representing a number in base $n$, find the smallest integer $x$ such that converting $x$ to base $n$ results in the string $k$. \n\nIt is guaranteed that:\n\n* $2 \\le n \\le 10^9$\n* $0 \\le k < 10^{60}$\n* All digits in $k$ are strictly less than $n$\n* The answer exists and does not exceed $10^{18}$\n* $k$ does not contain leading zeros."}, {"prompt_md5": "8b191d19", "template_md5": "465699a0", "result": "Given a base *n* and a number *k* represented in that base, find the smallest decimal number that converts to *k* in base *n*."}]}