{"uid": "76-F", "url": "https://codeforces.com/contest/76/problem/F", "tags": ["binary search", " data structures", " dp"], "title": "76-F", "statement": "F. Touristtime limit per test0.5 secondmemory limit per test256 megabytesinputstdinoutputstdoutTourist walks along theXaxis. He can choose either of two directions and any speed not exceedingV. He can also stand without moving anywhere. He knows from newspapers that at timet1in the point with coordinatex1an interesting event will occur, at timet2in the point with coordinatex2— another one, and so on up to (xn,tn). Interesting events are short so we can assume they are immediate. Eventicounts visited if at timetitourist was at point with coordinatexi.Write program tourist that will find maximum number of events tourist if:at the beginning (when time is equal to 0) tourist appears at point 0,tourist can choose initial point for himself.Yes, you should answer on two similar but different questions.InputThe first line of input contains single integer numberN(1 ≤N≤ 100000) — number of interesting events. The followingNlines contain two integersxiandti— coordinate and time of thei-th event. The last line of the input contains integerV— maximum speed of the tourist. Allxiwill be within range- 2·108≤xi≤ 2·108, alltiwill be between1and2·106inclusive.Vwill be positive and will not exceed 1000. The input may contain events that happen at the same time or in the same place but not in the same place at the same time.OutputThe only line of the output should contain two space-sepatated integers — maximum number of events tourist can visit in he starts moving from point 0 at time 0, and maximum number of events tourist can visit if he chooses the initial point for himself.ExamplesInput3-1 142 740 82Output1 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f8243e2d", "template_md5": "35d339e4", "result": "There are $N$ events happening at different points in time and locations on a number line.  Each event is defined by a coordinate $x_i$ and a time $t_i$.  A person can travel along the number line at a maximum speed of $V$.  \n\nThe person starts at coordinate 0 at time 0.  \n\nFind the maximum number of events the person can attend if:\n\n1. The person starts at coordinate 0 at time 0.\n2. The person can choose any starting coordinate at time 0."}, {"prompt_md5": "41a2dc7e", "template_md5": "465699a0", "result": "You are given a list of events happening at specific times and locations. You can travel at a maximum speed.  Find the maximum number of events you can attend starting from location 0 and the maximum number of events you can attend if you can choose any starting location."}]}