{"uid": "761-E", "url": "https://codeforces.com/contest/761/problem/E", "tags": ["constructive algorithms", " dfs and similar", " graphs", " greedy", " trees"], "title": "761-E", "statement": "E. Dasha and Puzzletime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDasha decided to have a rest after solving the problem. She had been ready to start her favourite activity — origami, but remembered the puzzle that she could not solve.The tree is a non-oriented connected graph without cycles. In particular, there always aren- 1edges in a tree withnvertices.The puzzle is to position the vertices at the points of the Cartesian plane with integral coordinates, so that the segments between the vertices connected by edges are parallel to the coordinate axes. Also, the intersection of segments is allowed only at their ends. Distinct vertices should be placed at different points.Help Dasha to find any suitable way to position the tree vertices on the plane.It is guaranteed that if it is possible to position the tree vertices on the plane without violating the condition which is given above, then you can do it by using points with integral coordinates which don't exceed1018in absolute value.InputThe first line contains single integern(1 ≤n≤ 30)— the number of vertices in the tree.Each of nextn- 1lines contains two integersui,vi(1 ≤ui,vi≤n) that mean that thei-th edge of the tree connects verticesuiandvi.It is guaranteed that the described graph is a tree.OutputIf the puzzle doesn't have a solution then in the only line print \"NO\".Otherwise, the first line should contain \"YES\". The nextnlines should contain the pair of integersxi,yi(|xi|, |yi| ≤ 1018)— the coordinates of the point which corresponds to thei-th vertex of the tree.If there are several solutions, print any of them.ExamplesInput71 21 32 42 53 63 7OutputYES0 01 00 12 01 -1-1 10 2Input61 22 32 42 52 6OutputNOInput41 22 33 4OutputYES3 34 35 36 3NoteIn the first sample one of the possible positions of tree is:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "98fce699", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices.  A tree is a connected graph with no cycles.  \n\nYour task is to arrange the vertices on a 2D plane so that:\n\n* Each edge of the tree is represented by a straight line segment connecting two vertices.\n* These line segments are either horizontal or vertical (parallel to the x or y axes).\n* The intersection of line segments is only allowed at their endpoints.\n* No two vertices share the same coordinates.\n\nDetermine if it is possible to arrange the vertices in this way. If it is possible, output \"YES\" followed by the coordinates of each vertex. If it is not possible, output \"NO\". \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 30), the number of vertices in the tree.\n* Each of the next $n-1$ lines contains two integers $u_i$ and $v_i$ (1 ≤ $u_i$, $v_i$ ≤ $n$), representing an edge between vertices $u_i$ and $v_i$.\n\n**Output:**\n\n* If a solution is possible, output \"YES\" followed by $n$ lines, each containing two integers $x_i$ and $y_i$ (| $x_i$ |, | $y_i$ | ≤ 10<sup>18</sup>), representing the coordinates of the $i$-th vertex.\n* If no solution is possible, output \"NO\"."}, {"prompt_md5": "f66495ac", "template_md5": "465699a0", "result": "Given a tree (a connected graph with no cycles), arrange its nodes on a grid so that lines connecting the nodes are either horizontal or vertical.  If this is possible, output \"YES\" followed by the coordinates of each node. Otherwise, output \"NO\"."}]}