{"uid": "762-C", "url": "https://codeforces.com/contest/762/problem/C", "tags": ["binary search", " hashing", " strings", " two pointers"], "title": "762-C", "statement": "C. Two stringstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two stringsaandb. You have to remove the minimum possible number ofconsecutive(standing one after another) characters from stringbin such a way that it becomes a subsequence of stringa. It can happen that you will not need to remove any characters at all, or maybe you will have to remove all of the characters fromband make it empty.Subsequence of stringsis any such string that can be obtained by erasing zero or more characters (not necessarily consecutive) from strings.InputThe first line contains stringa, and the second line — stringb. Both of these strings are nonempty and consist of lowercase letters of English alphabet. The length of each string is no bigger than105characters.OutputOn the first line output a subsequence of stringa, obtained frombby erasing the minimum number of consecutive characters.If the answer consists of zero characters, output «-» (a minus sign).ExamplesInputhibobOutput-InputabcaacceptedOutputacInputabacabaabcdcbaOutputabcbaNoteIn the first example stringsaandbdon't share any symbols, so the longest string that you can get is empty.In the second exampleacis a subsequence ofa, and at the same time you can obtain it by erasing consecutive symbolsceptedfrom stringb.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dfba47dc", "template_md5": "35d339e4", "result": "You are given two strings,  $a$ and $b$.  You need to remove the fewest possible consecutive characters from string $b$ so that the remaining string is a subsequence of string $a$. A subsequence is a sequence of characters that can be obtained from a string by deleting some characters (not necessarily consecutively).\n\nOutput the subsequence of string $a$ that is formed by removing the minimum number of characters from string $b$. If the answer is an empty string, output \"-\"."}, {"prompt_md5": "a4c87f68", "template_md5": "465699a0", "result": "You are given two words.  Find the shortest word you can make from the second word by deleting some letters in a row, so that the shortened word is part of the first word. If you need to delete all the letters from the second word, you can do that too."}]}