{"uid": "764-A", "url": "https://codeforces.com/contest/764/problem/A", "tags": ["brute force", " implementation", " math"], "title": "764-A", "statement": "A. Taymyr is calling youtime limit per test1 secondmemory limit per test255 megabytesinputstandard inputoutputstandard outputComrade Dujikov is busy choosing artists for Timofey's birthday and is recieving calls from Taymyr from Ilia-alpinist.Ilia-alpinist calls everynminutes, i.e. in minutesn,2n,3nand so on. Artists come to the comrade everymminutes, i.e. in minutesm,2m,3mand so on. The day iszminutes long, i.e. the day consists of minutes1, 2, ...,z. How many artists should be killed so that there are no artists in the room when Ilia calls? Consider that a call and a talk with an artist take exactly one minute.InputThe only string contains three integers —n,mandz(1 ≤n,m,z≤ 104).OutputPrint single integer — the minimum number of artists that should be killed so that there are no artists in the room when Ilia calls.ExamplesInput1 1 10Output10Input1 2 5Output2Input2 3 9Output1NoteTaymyr is a place in the north of Russia.In the first test the artists come each minute, as well as the calls, so we need to kill all of them.In the second test we need to kill artists which come on the second and the fourth minutes.In the third test — only the artist which comes on the sixth minute.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "940230da", "template_md5": "35d339e4", "result": "Given three integers $n$, $m$, and $z$, find the minimum number of artists that need to be killed to ensure there are no artists present when a call arrives.\n\n* Calls arrive every $n$, $2n$, $3n$ minutes, and so on.\n* Artists arrive every $m$, $2m$, $3m$ minutes, and so on.\n* The day is $z$ minutes long.\n\nA call and a conversation with an artist take one minute each."}, {"prompt_md5": "153449d9", "template_md5": "465699a0", "result": "You have a room where people arrive at regular intervals. You also have calls coming in at regular intervals.  You need to figure out the minimum number of people to remove so that when a call arrives, there is no one in the room."}]}