{"uid": "765-C", "url": "https://codeforces.com/contest/765/problem/C", "tags": ["math"], "title": "765-C", "statement": "C. Table Tennis Game 2time limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputMisha and Vanya have played several table tennis sets. Each set consists of several serves, each serve is won by one of the players, he receives one point and the loser receives nothing. Once one of the players scores exactlykpoints, the score is reset and a new set begins.Across all the sets Misha scoredapoints in total, and Vanya scoredbpoints. Given this information, determine the maximum number of sets they could have played, or that the situation is impossible.Note that the game consisted of several complete sets.InputThe first line contains three space-separated integersk,aandb(1 ≤k≤ 109,0 ≤a,b≤ 109,a+b> 0).OutputIf the situation is impossible, print a single number -1. Otherwise, print the maximum possible number of sets.ExamplesInput11 11 5Output1Input11 2 3Output-1NoteNote that the rules of the game in this problem differ from the real table tennis game, for example, the rule of \"balance\" (the winning player has to be at least two points ahead to win a set) has no power within the present problem.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b27e5a89", "template_md5": "35d339e4", "result": "Two players are playing a table tennis game.  Each set consists of serves, and the winner of each serve gets 1 point. When one player reaches exactly $k$ points, the set ends and a new set begins.  \n\nGiven that Player 1 scored a total of $a$ points and Player 2 scored a total of $b$ points across all the sets, determine the maximum number of sets they could have played. If it's impossible for them to have reached these scores, output -1."}, {"prompt_md5": "12d39f45", "template_md5": "465699a0", "result": "Two players play a game where points are awarded in sets. Each set resets when a player reaches a certain number of points.  Given the total points each player scored, find the maximum number of sets they could have played. If it's impossible, say so."}]}