{"uid": "767-C", "url": "https://codeforces.com/contest/767/problem/C", "tags": ["dfs and similar", " graphs", " greedy", " trees"], "title": "767-C", "statement": "C. Garlandtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOnce at New Year Dima had a dream in which he was presented a fairy garland. A garland is a set of lamps, some pairs of which are connected by wires. Dima remembered that each two lamps in the garland were connected directly or indirectly via some wires. Furthermore, the number of wires was exactly one less than the number of lamps.There was something unusual about the garland. Each lamp had its own brightness which depended on the temperature of the lamp. Temperatures could be positive, negative or zero. Dima has two friends, so he decided to share the garland with them. He wants to cut two different wires so that the garland breaks up into three parts. Each part of the garland should shine equally, i. e. the sums of lamps' temperatures should be equal in each of the parts. Of course, each of the parts should be non-empty, i. e. each part should contain at least one lamp.Help Dima to find a suitable way to cut the garland, or determine that this is impossible.While examining the garland, Dima lifted it up holding by one of the lamps. Thus, each of the lamps, except the one he is holding by, is now hanging on some wire. So, you should print two lamp ids as the answer which denote that Dima should cut the wires these lamps are hanging on. Of course, the lamp Dima is holding the garland by can't be included in the answer.InputThe first line contains single integern(3 ≤n≤ 106) — the number of lamps in the garland.Thennlines follow. Thei-th of them contain the information about thei-th lamp: the number lampai, it is hanging on (and0, if is there is no such lamp), and its temperatureti(- 100 ≤ti≤ 100). The lamps are numbered from1ton.OutputIf there is no solution, print-1.Otherwise print two integers — the indexes of the lamps which mean Dima should cut the wires they are hanging on. If there are multiple answers, print any of them.ExamplesInput62 40 54 22 11 14 2Output1 4Input62 40 64 22 11 14 2Output-1NoteThe garland and cuts scheme for the first example:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "724dcf59", "template_md5": "35d339e4", "result": "You are given a garland with $n$ lamps ($3 \\le n \\le 10^6$). Each lamp has a temperature ($-100 \\le t_i \\le 100$).  The garland is connected by wires, with one less wire than the number of lamps.  \n\nYou need to find two lamps to cut the wires connecting them, so the garland splits into three parts. The sum of the temperatures in each of the three parts must be equal.\n\nIf it's impossible to split the garland this way, output -1. Otherwise, output the two lamp indices to cut."}, {"prompt_md5": "81a734b7", "template_md5": "465699a0", "result": "You are given a connected graph with $n$ nodes (lamps) and $n-1$ edges (wires). Each node has a value (temperature).  Find two nodes to remove their connecting edges so that the graph is divided into three parts with equal sum of values in each part. If this is not possible, output -1."}]}