{"uid": "767-B", "url": "https://codeforces.com/contest/767/problem/B", "tags": ["brute force", " greedy"], "title": "767-B", "statement": "B. The Queuetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutFinally! Vasya have come of age and that means he can finally get a passport! To do it, he needs to visit the passport office, but it's not that simple. There's only one receptionist at the passport office and people can queue up long before it actually opens. Vasya wants to visit the passport office tomorrow.He knows that the receptionist starts working aftertsminutes have passed after midnight and closes aftertfminutes have passed after midnight (so that(tf- 1)is the last minute when the receptionist is still working). The receptionist spends exactlytminutes on each person in the queue. If the receptionist would stop working withintminutes, he stops serving visitors (other than the one he already serves).Vasya also knows that exactlynvisitors would come tomorrow. For each visitor Vasya knows the point of time when he would come to the passport office. Each visitor queues up and doesn't leave until he was served. If the receptionist is free when a visitor comes (in particular, if the previous visitor was just served and the queue is empty), the receptionist begins to serve the newcomer immediately.\"Reception 1\"For each visitor, the point of time when he would come to the passport office is positive. Vasya can come to the office at the time zero (that is, at midnight) if he needs so, but he can come to the office only at integer points of time. If Vasya arrives at the passport office at the same time with several other visitors, he yields to them and stand in the queue after the last of them.Vasya wants to come at such point of time that he will be served by the receptionist, and he would spend the minimum possible time in the queue. Help him!InputThe first line contains three integers: the point of time when the receptionist begins to workts, the point of time when the receptionist stops workingtfand the time the receptionist spends on each visitort. The second line contains one integern— the amount of visitors (0 ≤n≤ 100 000). The third line contains positive integers in non-decreasing order — the points of time when the visitors arrive to the passport office.All times are set in minutes and do not exceed1012; it is guaranteed thatts<tf. It is also guaranteed that Vasya can arrive at the passport office at such a point of time that he would be served by the receptionist.OutputPrint single non-negative integer — the point of time when Vasya should arrive at the passport office. If Vasya arrives at the passport office at the same time with several other visitors, he yields to them and queues up the last. If there are many answers, you can print any of them.ExamplesInput10 15 2210 13Output12Input8 17 343 4 5 8Output2NoteIn the first example the first visitor comes exactly at the point of time when the receptionist begins to work, and he is served for two minutes. At 12 minutes after the midnight the receptionist stops serving the first visitor, and if Vasya arrives at this moment, he will be served immediately, because the next visitor would only come at 13 minutes after midnight.In the second example, Vasya has to come before anyone else to be served.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "40f7cdd3", "template_md5": "35d339e4", "result": "A receptionist starts working at time $t_s$ and stops working at time $t_f$.  The receptionist takes $t$ minutes to serve each person.  \n\nThere are $n$ people who will arrive at the office at specific times.  \n\nYou need to find the earliest time that you can arrive at the office so that you will be served by the receptionist and spend the least amount of time waiting in line.\n\n**Input:**\n\n* $t_s$ (start time)\n* $t_f$ (end time)\n* $t$ (service time per person)\n* $n$ (number of people)\n* A list of $n$ integers representing the arrival times of each person.\n\n**Output:**\n\n* The earliest time you can arrive at the office."}, {"prompt_md5": "ab7bd414", "template_md5": "465699a0", "result": "A receptionist starts working at time *t* and stops at time *f*. Each customer takes *s* minutes to serve.  There are *n* customers arriving at specific times.  Find the earliest time a new customer can arrive to be served before the receptionist stops working."}]}