{"uid": "768-C", "url": "https://codeforces.com/contest/768/problem/C", "tags": ["brute force", " dp", " implementation", " sortings"], "title": "768-C", "statement": "C. Jon Snow and his Favourite Numbertime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJon Snow now has to fight with White Walkers. He hasnrangers, each of which has his own strength. Also Jon Snow has his favourite numberx. Each ranger can fight with a white walker only if the strength of the white walker equals his strength. He however thinks that his rangers are weak and need to improve. Jon now thinks that if he takes the bitwise XOR of strengths of some of rangers with his favourite numberx, he might get soldiers of high strength. So, he decided to do the following operationktimes:Arrange all the rangers in a straight line in the order of increasing strengths.Take the bitwise XOR (is written as) of the strength of each alternate ranger withxand update it's strength.Suppose, Jon has5rangers with strengths[9, 7, 11, 15, 5]and he performs the operation1time withx= 2. He first arranges them in the order of their strengths,[5, 7, 9, 11, 15]. Then he does the following:The strength of first ranger is updated to, i.e.7.The strength of second ranger remains the same, i.e.7.The strength of third ranger is updated to, i.e.11.The strength of fourth ranger remains the same, i.e.11.The strength of fifth ranger is updated to, i.e.13.The new strengths of the5rangers are[7, 7, 11, 11, 13]Now, Jon wants to know the maximum and minimum strength of the rangers after performing the above operationsktimes. He wants your help for this task. Can you help him?InputFirst line consists of three integersn,k,x(1 ≤n≤ 105,0 ≤k≤ 105,0 ≤x≤ 103) — number of rangers Jon has, the number of times Jon will carry out the operation and Jon's favourite number respectively.Second line consists ofnintegers representing the strengths of the rangersa1,a2, ...,an(0 ≤ai≤ 103).OutputOutput two integers, the maximum and the minimum strength of the rangers after performing the operationktimes.ExamplesInput5 1 29 7 11 15 5Output13 7Input2 100000 569605 986Output986 605", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "816504d0", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers representing the strengths of soldiers. You will perform the following operation $k$ times:\n\n1. Sort the array in ascending order.\n2. For every other element in the sorted array, perform a bitwise XOR operation with a given integer $x$.\n\nAfter performing the operation $k$ times, find the maximum and minimum values in the array. \n\nInput:\n\n* The first line contains three integers: $n$, $k$, and $x$.\n* The second line contains $n$ integers representing the initial strengths of the soldiers.\n\nOutput:\n\n* Output two integers: the maximum and minimum values in the array after performing the operation $k$ times."}, {"prompt_md5": "20aea605", "template_md5": "465699a0", "result": "You are given a list of numbers representing the strengths of soldiers. You can perform an operation repeatedly:\n\n1. Sort the list in ascending order.\n2. For every other soldier, change their strength by performing a bitwise XOR operation with a given number.\n\nFind the highest and lowest possible strength of a soldier after performing this operation a specific number of times."}]}