{"uid": "768-D", "url": "https://codeforces.com/contest/768/problem/D", "tags": ["dp", " math", " probabilities"], "title": "768-D", "statement": "D. Jon and Orbstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJon Snow is on the lookout for some orbs required to defeat the white walkers. There arekdifferent types of orbs and he needs at least one of each. One orb spawns daily at the base of a Weirwood tree north of the wall. The probability of this orb being of any kind is equal. As the north of wall is full of dangers, he wants to know the minimum number of days he should wait before sending a ranger to collect the orbs such that the probability of him getting at least one of each kind of orb is at least, whereε < 10- 7.To better prepare himself, he wants to know the answer forqdifferent values ofpi. Since he is busy designing the battle strategy with Sam, he asks you for your help.InputFirst line consists of two space separated integersk,q(1 ≤k,q≤ 1000) — number of different kinds of orbs and number of queries respectively.Each of the nextqlines contain a single integerpi(1 ≤pi≤ 1000) —i-th query.OutputOutputqlines. Oni-th of them output single integer — answer fori-th query.ExamplesInput1 11Output1Input2 212Output22", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "312f6734", "template_md5": "35d339e4", "result": "There are $k$ different types of items.  Each day, one item of a randomly chosen type appears. You want to find the minimum number of days you need to wait to be at least 99.99999% sure that you have at least one of each type of item.\n\nYou need to answer this question for $q$ different target probabilities. \n\n\n\nLet me know if you'd like help with the algorithm to solve this!"}, {"prompt_md5": "f0183b88", "template_md5": "465699a0", "result": "You are given a number of types of items and a number of target probabilities. For each target probability, find the minimum number of days you need to wait to collect at least one of each item type, given that each day a random item is available with equal chance."}]}