{"uid": "768-F", "url": "https://codeforces.com/contest/768/problem/F", "tags": ["brute force", " combinatorics", " math", " number theory", " probabilities"], "title": "768-F", "statement": "F. Barrels and boxestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTarly has two different type of items, food boxes and wine barrels. There areffood boxes andwwine barrels. Tarly stores them in various stacks and each stack can consist of either food boxes or wine barrels but not both. The stacks are placed in a line such that no two stacks of food boxes are together and no two stacks of wine barrels are together.The height of a stack is defined as the number of items in the stack. Two stacks are considered different if either their heights are different or one of them contains food and other contains wine.Jon Snow doesn't like an arrangement if any stack of wine barrels has height less than or equal toh. What is the probability that Jon Snow will like the arrangement if all arrangement are equiprobably?Two arrangement of stacks are considered different if exists suchi, thati-th stack of one arrangement is different from thei-th stack of the other arrangement.InputThe first line of input contains three integersf,w,h(0 ≤f,w,h≤ 105) — number of food boxes, number of wine barrels andhis as described above. It is guaranteed that he has at least one food box or at least one wine barrel.OutputOutput the probability that Jon Snow will like the arrangement. The probability is of the form, then you need to output a single integerp·q- 1mod(109+ 7).ExamplesInput1 1 1Output0Input1 2 1Output666666672NoteIn the first examplef=  1,w= 1andh= 1, there are only two possible arrangement of stacks and Jon Snow doesn't like any of them.In the second examplef= 1,w= 2andh= 1, there are three arrangements. Jon Snow likes the (1) and (3) arrangement. So the probabilty is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5a4ff030", "template_md5": "35d339e4", "result": "There are $f$ food boxes and $w$ wine barrels.  These can be stacked in any order, but stacks must be either all food boxes or all wine barrels.  No two stacks of the same type can be next to each other.\n\nA stack's height is the number of items in it.  \n\nJon Snow likes an arrangement only if every stack of wine barrels has a height greater than $h$.\n\nWhat is the probability that Jon Snow will like a random arrangement of the boxes and barrels?"}, {"prompt_md5": "0f2f4aef", "template_md5": "465699a0", "result": "You have a number of items of two types.  You must arrange them into stacks, with stacks containing only one type of item.  Each stack must be at least a certain height. What is the probability that a random arrangement will meet the height requirement?"}]}