{"uid": "768-A", "url": "https://codeforces.com/contest/768/problem/A", "tags": ["constructive algorithms", " sortings"], "title": "768-A", "statement": "A. Oath of the Night's Watchtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard output\"Night gathers, and now my watch begins. It shall not end until my death. I shall take no wife, hold no lands, father no children. I shall wear no crowns and win no glory. I shall live and die at my post. I am the sword in the darkness. I am the watcher on the walls. I am the shield that guards the realms of men. I pledge my life and honor to the Night's Watch, for this night and all the nights to come.\"— The Night's Watch oath.With that begins the watch of Jon Snow. He is assigned the task to support the stewards.This time he hasnstewards with him whom he has to provide support. Each steward has his own strength. Jon Snow likes to support a steward only if there exists at least one steward who has strength strictly less than him and at least one steward who has strength strictly greater than him.Can you find how many stewards will Jon support?InputFirst line consists of a single integern(1 ≤n≤ 105) — the number of stewards with Jon Snow.Second line consists ofnspace separated integersa1,a2, ...,an(0 ≤ai≤ 109) representing the values assigned to the stewards.OutputOutput a single integer representing the number of stewards which Jon will feed.ExamplesInput21 5Output0Input31 2 5Output1NoteIn the first sample, Jon Snow cannot support steward with strength1because there is no steward with strength less than1and he cannot support steward with strength5because there is no steward with strength greater than5.In the second sample, Jon Snow can support steward with strength2because there are stewards with strength less than2and greater than2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97ea67db", "template_md5": "35d339e4", "result": "You are given a list of $n$ integers, where each integer represents the strength of a person.  Jon needs to choose some of these people to support.  A person can only be supported if there is at least one person with a lower strength and at least one person with a higher strength.  How many people can Jon support?"}, {"prompt_md5": "083d06bb", "template_md5": "465699a0", "result": "You are given a list of numbers.  Find how many numbers in the list have a smaller number and a larger number in the list."}]}