{"uid": "769-B", "url": "https://codeforces.com/contest/769/problem/B", "tags": ["*special", " greedy", " two pointers"], "title": "769-B", "statement": "B. News About Credittime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp studies at the university in the group which consists ofnstudents (including himself). All they are registrated in the social net \"TheContacnt!\".Not all students are equally sociable. About each student you know the valueai— the maximum number of messages which thei-th student is agree to send per day. The student can't send messages to himself.In early morning Polycarp knew important news that the programming credit will be tomorrow. For this reason it is necessary to urgently inform all groupmates about this news using private messages.Your task is to make a plan of using private messages, so that:the studentisends no more thanaimessages (for allifrom1ton);all students knew the news about the credit (initially only Polycarp knew it);the student can inform the other student only if he knows it himself.Let's consider that all students are numerated by distinct numbers from1ton, and Polycarpalwayshas the number1.In that task you shouldn't minimize the number of messages, the moment of time, when all knew about credit or some other parameters. Find any way how to use private messages which satisfies requirements above.InputThe first line contains the positive integern(2 ≤n≤ 100) — the number of students.The second line contains the sequencea1,a2, ...,an(0 ≤ai≤ 100), whereaiequals to the maximum number of messages which can thei-th student agree to send. Consider that Polycarpalwayshas the number1.OutputPrint-1to the first line if it is impossible to inform all students about credit.Otherwise, in the first line print the integerk— the number of messages which will be sent. In each of the nextklines print twodistinctintegersfandt, meaning that the student numberfsent the message with news to the student numbert. All messages should be printed in chronological order. It means that the student, who is sending the message, must already know this news. It is assumed that students can receive repeated messages with news of the credit.If there are several answers, it is acceptable to print any of them.ExamplesInput41 2 1 0Output31 22 42 3Input62 0 1 3 2 0Output61 33 41 24 55 64 6Input30 2 2Output-1NoteIn the first test Polycarp (the student number1) can send the message to the student number2, who after that can send the message to students number3and4. Thus, all students knew about the credit.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "73548968", "template_md5": "35d339e4", "result": "There are $n$ students ($2 \\le n \\le 100$). Each student has a maximum number of messages they can send per day, represented by $a_i$ ($0 \\le a_i \\le 100$).  \n\nOne student (student 1) knows important news.  They need to inform all other students about the news using private messages, following these rules:\n\n* Each student can only send a message if they already know the news.\n* Each student can't send more than their maximum allowed messages ($a_i$).\n\nDetermine if it's possible to inform all students about the news. If it's possible, output the minimum number of messages needed and a list of who sent messages to whom in chronological order. If it's not possible, output -1."}, {"prompt_md5": "b0721beb", "template_md5": "465699a0", "result": "You have a group of people, each with a limit on how many messages they can send.  You need to find a way to spread a piece of information to everyone in the group, where each person can only send a message if they already know the information.  \n\nOutput -1 if it's impossible to spread the information. Otherwise, output the number of messages needed and a list of who sent messages to whom."}]}