{"uid": "77-B", "url": "https://codeforces.com/contest/77/problem/B", "tags": ["math", " probabilities"], "title": "77-B", "statement": "B. Falling Anvilstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutFor some reason in many American cartoons anvils fall from time to time onto heroes' heads. Of course, safes, wardrobes, cruisers, planes fall sometimes too... But anvils do so most of all.Anvils come in different sizes and shapes. Quite often they get the hero stuck deep in the ground. But have you ever thought who throws anvils from the sky? From what height? We are sure that such questions have never troubled you!It turns out that throwing an anvil properly is not an easy task at all. Let's describe one of the most popular anvil throwing models.Let the heightpof the potential victim vary in the range[0;a]and the direction of the windqvary in the range[ -b;b].pandqcould be any real (floating) numbers.Then we can assume that the anvil will fit the toon's head perfectly only if the following equation has at least one real root:Determine the probability with which an aim can be successfully hit by an anvil.You can assume that thepandqcoefficients are chosen equiprobably and independently in their ranges.InputThe first line contains integert(1 ≤t≤ 10000) — amount of testcases.Each of the followingtlines contain two space-separated integersaandb(0 ≤a,b≤ 106).Pretests contain all the tests with0 <a< 10, 0 ≤b< 10.OutputPrinttlines — the probability of a successful anvil hit for each testcase. The absolute or relative error of the answer should not exceed10- 6.ExamplesInput24 21 2Output0.62500000000.5312500000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e1ed1ebc", "template_md5": "35d339e4", "result": "You are given a target height $a$ and a wind speed $b$. An anvil is thrown with a height and wind speed chosen randomly between 0 and $a$ and $-b$ and $b$ respectively.  \n\nThe anvil hits the target if the following equation has at least one real root:\n\n$$x^2 + qx + p = 0$$\n\nwhere $p$ is the target height and $q$ is the wind speed.\n\nCalculate the probability that the anvil will hit the target. \n\nYou can assume that $p$ and $q$ are chosen equiprobably and independently. \n\n\nInput:\n\nThe first line contains the number of test cases $t$.\n\nEach of the following $t$ lines contains two space-separated integers $a$ and $b$.\n\nOutput:\n\nPrint $t$ lines, each containing the probability of a successful hit for each test case."}, {"prompt_md5": "8a7691bf", "template_md5": "465699a0", "result": "You are given two numbers, 'a' and 'b'.  You need to calculate the probability that a randomly chosen pair of numbers (p, q) within the ranges [0, a] and [-b, b] respectively, will satisfy a certain condition.  The condition is not explicitly stated, but it is implied that it involves the relationship between p and q."}]}