{"uid": "77-D", "url": "https://codeforces.com/contest/77/problem/D", "tags": ["dp", " implementation"], "title": "77-D", "statement": "D. Domino Carpettime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdout...Mike the TV greets you again!Tired of the monotonous furniture? Sick of gray routine? Dreaming about dizzying changes in your humble abode? We have something to offer you!This domino carpet for only $99.99 will change your life! You can lay it on the floor, hang it on the wall or even on the ceiling! Among other things ...Having watched the commercial, virus Hexadecimal also wanted to get a Domino Carpet and wanted badly to be photographed in front of it. But of course, a virus will never consent to buying a licensed Carpet! So she ordered a truck of dominoes and decided to make such a Carpet herself.The original Domino Carpet is a field of squaresn×min size. Each square is half of a domino, and can be rotated either vertically or horizontally, independently from its neighbors. Vertically rotated domino halves look like this:And horizontally rotated halves look like this:Notice, that some halves looks the same in both rotations, but other halves differ.Dominoes bought by Hexadecimal are represented by uncuttable chips1 × 2in size, which can be laid either vertically or horizontally. If the chip is laid vertically, then both of it's halves should be laid vertically orientated; if the chip is laid horizontally, then both of it's halves should be laid horizontally.The samples of valid and invalid dominoes laid vertically and horizontally are:Virus Hexadecimal assembles her own Domino Carpet so that the following conditions are satisfied:each carpet square is covered by a domino chip, i.e. there are no empty squares;all domino chips lie entirely within the carpet and don't overlap with each other;if there is a horizontal domino chip with its left half in columnjthen there are no horizontal domino chips with their left halves in columnsj- 1orj+ 1.Before starting to assemble her own Domino Carpet, the virus wants to know the number of ways to achieve the intended purpose modulo109+ 7.You can assume that the virus has an infinitely large number of dominoes of each type.InputThe first line contains two integersnandm, separated by a space — the size of the Domino Carpet (1 ≤n,m≤ 250). Next4n+ 1lines contain4m+ 1symbols.Each square of the Domino Carpet, which is a domino half, is described by a3 × 3square. Symbol'O'in this square indicates the presence of a point, symbol'.'— its absence.Each3 × 3square is delineated from adjacent squares by symbols'#'as shown in the examples.It is guaranteed that every box describes the correct half of a domino.In all pretests the Domino Carpets have the size of2 × 2and4 × 4.OutputPrint a single number, the number of ways to assemble the Domino Carpet modulo109+ 7, using only standard dominoes of size1 × 2.ExamplesInput3 4##################O..#...#O.O#...##.O.#.O.#.O.#...##..O#...#O.O#...###################O.O#OOO#O.O#...##.O.#...#...#.O.##O.O#OOO#O.O#...###################O.O#...#O.O#...##...#...#...#.O.##O.O#...#O.O#...##################Output3Input2 2##########O.O#O.O##.O.#...##O.O#O.O###########...#O.O##...#...##...#O.O##########Output2Input2 2##########..O#O..##...#...##O..#..O###########O..#..O##...#...##..O#O..##########Output0NoteA note to the first example:all correct ways to make Domino Carpet are represented below:And this way is incorrect:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "873d14a5", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$. Each cell in the grid represents a half of a domino.  \n\nYou need to cover the entire grid with dominoes of size $1 \\times 2$.  A domino can be placed either horizontally or vertically.  \n\nThe rules are:\n\n* Each cell must be covered by a domino.\n* Dominoes cannot overlap.\n* If a horizontal domino is placed in column $j$, then there cannot be any other horizontal dominoes with their left half in columns $j-1$ or $j+1$.\n\nFind the number of ways to cover the grid with dominoes, modulo $10^9 + 7$."}, {"prompt_md5": "36450318", "template_md5": "465699a0", "result": "You are given a rectangular grid representing a carpet. Each cell in the grid can be either empty or filled. You need to cover the entire grid with rectangular tiles that are twice as wide as they are tall,  making sure that the tiles don't overlap and that the placement of horizontal tiles follows a specific rule (no two horizontal tiles can have their left edges in adjacent columns).  Find the number of ways to cover the grid with these tiles."}]}