{"uid": "770-A", "url": "https://codeforces.com/contest/770/problem/A", "tags": ["*special", " implementation"], "title": "770-A", "statement": "A. New Passwordtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputInnokentiy decides to change the password in the social net \"Contact!\", but he is too lazy to invent a new password by himself. That is why he needs your help.Innokentiy decides that new password should satisfy the following conditions:the length of the password must be equal ton,the password should consist only of lowercase Latin letters,the number of distinct symbols in the password must be equal tok,any two consecutive symbols in the password must be distinct.Your task is to help Innokentiy and to invent a new password which will satisfy all given conditions.InputThe first line contains two positive integersnandk(2 ≤n≤ 100,2 ≤k≤min(n, 26)) — the length of the password and the number of distinct symbols in it.Pay attention that a desired new password always exists.OutputPrintanypassword which satisfies all conditions given by Innokentiy.ExamplesInput4 3OutputjavaInput6 6OutputpythonInput5 2OutputphphpNoteIn the first test there is one of the appropriate new passwords —java, because its length is equal to4and3distinct lowercase lettersa,jandvare used in it.In the second test there is one of the appropriate new passwords —python, because its length is equal to6and it consists of6distinct lowercase letters.In the third test there is one of the appropriate new passwords —phphp, because its length is equal to5and2distinct lowercase letterspandhare used in it.Pay attention the condition that no two identical symbols are consecutive is correct for all appropriate passwords in tests.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e27c2c7e", "template_md5": "35d339e4", "result": "Given two integers $n$ and $k$ (where $2 \\le n \\le 100$ and $2 \\le k \\le \\min(n, 26)$), find a password of length $n$ that meets the following criteria:\n\n*  It consists only of lowercase English letters.\n*  It contains exactly $k$ distinct letters.\n*  No two consecutive letters are the same. \n\n\n\nLet me know if you'd like help with solving this problem!"}, {"prompt_md5": "24509f62", "template_md5": "465699a0", "result": "Create a password of a given length using a specific number of unique lowercase letters.  No two letters in a row can be the same."}]}