{"uid": "770-D", "url": "https://codeforces.com/contest/770/problem/D", "tags": ["*special", " implementation"], "title": "770-D", "statement": "D. Draw Brackets!time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA sequence of square brackets is regular if by inserting symbols \"+\" and \"1\" into it, you can get a regular mathematical expression from it. For example, sequences \"[[]][]\", \"[]\" and \"[[][[]]]\" — are regular, at the same time \"][\", \"[[]\" and \"[[]]][\" — are irregular.Draw the given sequence using a minimalistic pseudographics in the strip of the lowest possible height — use symbols '+', '-' and '|'. For example, the sequence \"[[][]][]\" should be represented as:+-        -++- -+|+- -++- -+||   |||   ||   |||   ||+- -++- -+||   |+-        -++- -+Each bracket should be represented with the hepl of one or more symbols '|' (the vertical part) and symbols '+' and '-' as on the example which is given above.Brackets should be drawn without spaces one by one, only dividing pairs of consecutive pairwise brackets with a single-space bar (so that the two brackets do not visually merge into one symbol). The image should have the minimum possible height.The enclosed bracket is always smaller than the surrounding bracket, but each bracket separately strives to maximize the height of the image. So the pair of final brackets in the example above occupies the entire height of the image.Study carefully the examples below, they adequately explain the condition of the problem. Pay attention that in this problem the answer (the image) is unique.InputThe first line contains an even integern(2 ≤n≤ 100) — the length of the sequence of brackets.The second line contains the sequence of brackets — these arensymbols \"[\" and \"]\". It is guaranteed that the given sequence of brackets is regular.OutputPrint the drawn bracket sequence in the format which is given in the condition. Don't print extra (unnecessary) spaces.ExamplesInput8[[][]][]Output+-        -++- -+|+- -++- -+||   |||   ||   |||   ||+- -++- -+||   |+-        -++- -+Input6[[[]]]Output+-     -+|+-   -+|||+- -+|||||   |||||+- -+|||+-   -+|+-     -+Input6[[][]]Output+-        -+|+- -++- -+|||   ||   |||+- -++- -+|+-        -+Input2[]Output+- -+|   |+- -+Input4[][]Output+- -++- -+|   ||   |+- -++- -+", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0029360c", "template_md5": "35d339e4", "result": "You are given a sequence of square brackets.  Your task is to draw this sequence using the following characters:\n\n* `+`\n* `-`\n* `|`\n\nThe drawing should be as compact as possible (minimum height).  \n\nHere are the rules:\n\n* Each bracket should be represented by one or more `|` characters.\n* `+` and `-` characters are used to create the shape of the brackets.\n* Brackets should be drawn next to each other with a single space between them.\n* The enclosed bracket is always smaller than the surrounding bracket.\n\n\n\n**Example:**\n\nInput: `[[][]][]`\n\nOutput:\n\n```\n+-        -++- -+|+- -++- -+||   |||   ||   |||   ||+- -++- -+||   |+-        -++- -+\n``` \n\n**Constraints:**\n\n* The length of the bracket sequence is even and between 2 and 100. \n* The input sequence is guaranteed to be valid (meaning it can be represented as a regular mathematical expression)."}, {"prompt_md5": "230b0e5b", "template_md5": "465699a0", "result": "Given a sequence of brackets, draw it in a minimalist way using '+', '-', and '|' symbols, minimizing the height while ensuring each bracket is visually distinct."}]}