{"uid": "770-C", "url": "https://codeforces.com/contest/770/problem/C", "tags": ["*special", " dfs and similar", " graphs", " implementation"], "title": "770-C", "statement": "C. Online Courses In BSUtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputNow you can take online courses in the Berland State University! Polycarp needs to passkmainonline courses of his specialty to get a diploma. In totalncourses are availiable for the passage.The situation is complicated by the dependence of online courses, for each course there is a list of those that must be passed before starting this online course (the list can be empty, it means that there is no limitation).Help Polycarp to pass the least number of courses in total to get the specialty (it means to pass allmainand necessary courses). Write a program which prints the order of courses.Polycarp passes courses consistently, he starts the next course when he finishes the previous one. Each course can't be passed more than once.InputThe first line containsnandk(1 ≤k≤n≤ 105) — the number of online-courses and the number of main courses of Polycarp's specialty.The second line containskdistinct integers from1ton— numbers of main online-courses of Polycarp's specialty.Thennlines follow, each of them describes the next course: thei-th of them corresponds to the coursei. Each line starts from the integerti(0 ≤ti≤n- 1) — the number of courses on which thei-th depends. Then there follows the sequence oftidistinct integers from1ton— numbers of courses in random order, on which thei-th depends. It is guaranteed that no course can depend on itself.It is guaranteed that the sum of all valuestidoesn't exceed105.OutputPrint-1, if there is no the way to get a specialty.Otherwise, in the first line print the integerm— the minimum number of online-courses which it is necessary to pass to get a specialty. In the second line printmdistinct integers — numbers of courses which it is necessary to pass in the chronological order of their passage. If there are several answers it is allowed to print any of them.ExamplesInput6 25 30002 2 11 41 5Output51 2 3 4 5Input9 33 9 5003 9 4 5001 81 61 22 1 2Output61 2 9 4 5 3Input3 31 2 31 21 31 1Output-1NoteIn the first test firstly you can take courses number1and2, after that you can take the course number4, then you can take the course number5, which is the main. After that you have to take only the course number3, which is the last not passed main course.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "456d4385", "template_md5": "35d339e4", "result": "You are given a list of $n$ online courses.  There are $k$ main courses that must be taken to complete a program.  Each course may have a list of prerequisite courses that must be taken before it.  \n\nFind the minimum number of courses that must be taken to complete the program, and list the order in which they should be taken. If it is impossible to complete the program, output -1.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($1 \\le k \\le n \\le 10^5$), representing the number of courses and the number of main courses.\n* The second line contains $k$ distinct integers from 1 to $n$, representing the numbers of the main courses.\n* Each of the following $n$ lines describes a course. The $i$-th line starts with an integer $t_i$ ($0 \\le t_i \\le n-1$), representing the number of prerequisite courses for the $i$-th course.  The next $t_i$ integers are the numbers of the prerequisite courses for the $i$-th course.\n\n**Output:**\n\n* If it is impossible to complete the program, output -1.\n* Otherwise, output two lines. The first line contains an integer $m$, representing the minimum number of courses to be taken. The second line contains $m$ distinct integers, representing the order in which the courses should be taken."}, {"prompt_md5": "4adc502b", "template_md5": "465699a0", "result": "You are given a list of courses and a list of required courses.  Some courses have prerequisites, meaning they must be taken before others. Find the minimum number of courses to take to fulfill all the required courses, considering prerequisites. If it's impossible to fulfill all requirements, output -1."}]}