{"uid": "771-B", "url": "https://codeforces.com/contest/771/problem/B", "tags": ["constructive algorithms", " greedy"], "title": "771-B", "statement": "B. Bear and Different Namestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn the army, it isn't easy to form a group of soldiers that will be effective on the battlefield. The communication is crucial and thus no two soldiers should share a name (what would happen if they got an order that Bob is a scouter, if there are two Bobs?).A group of soldiers is effective if and only if their names are different. For example, a group (John, Bob, Limak) would be effective, while groups (Gary, Bob, Gary) and (Alice, Alice) wouldn't.You are a spy in the enemy's camp. You noticednsoldiers standing in a row, numbered1throughn. The general wants to choose a group ofkconsecutive soldiers. For everykconsecutive soldiers, the general wrote down whether they would be an effective group or not.You managed to steal the general's notes, withn-k+ 1stringss1,s2, ...,sn-k+ 1, each either \"YES\" or \"NO\".The strings1describes a group of soldiers1throughk(\"YES\" if the group is effective, and \"NO\" otherwise).The strings2describes a group of soldiers2throughk+ 1.And so on, till the stringsn-k+ 1that describes a group of soldiersn-k+ 1throughn.Your task is to find possible names ofnsoldiers. Names should match the stolen notes. Each name should be a string that consists of between1and10English letters, inclusive. The first letter should be uppercase, and all other letters should be lowercase. Names don't have to be existing names — it's allowed to print \"Xyzzzdj\" or \"T\" for example.Find and print any solution. It can be proved that there always exists at least one solution.InputThe first line of the input contains two integersnandk(2 ≤k≤n≤ 50) — the number of soldiers and the size of a group respectively.The second line containsn-k+ 1stringss1,s2, ...,sn-k+ 1. The stringsiis \"YES\" if the group of soldiersithroughi+k- 1is effective, and \"NO\" otherwise.OutputFind any solution satisfying all given conditions. In one line printnspace-separated strings, denoting possible names of soldiers in the order. The first letter of each name should be uppercase, while the other letters should be lowercase. Each name should contain English letters only and has length from1to10.If there are multiple valid solutions, print any of them.ExamplesInput8 3NO NO YES YES YES NOOutputAdam Bob Bob Cpqepqwer Limak Adam Bob AdamInput9 8YES NOOutputR Q Ccccccccc Ccocc Ccc So Strong Samples CccInput3 2NO NOOutputNa Na NaNoteIn the first sample, there are8soldiers. For every3consecutive ones we know whether they would be an effective group. Let's analyze the provided sample output:First three soldiers (i.e. Adam, Bob, Bob) wouldn't be an effective group because there are two Bobs. Indeed, the strings1is \"NO\".Soldiers2through4(Bob, Bob, Cpqepqwer) wouldn't be effective either, and the strings2is \"NO\".Soldiers3through5(Bob, Cpqepqwer, Limak) would be effective, and the strings3is \"YES\"....,Soldiers6through8(Adam, Bob, Adam) wouldn't be effective, and the strings6is \"NO\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6dd4251d", "template_md5": "35d339e4", "result": "You are given a list of $n$ soldiers. You also have $n-k+1$ notes, where each note tells you if a group of $k$ consecutive soldiers is effective (has different names) or not.  \n\nYour task is to come up with names for the $n$ soldiers that satisfy the notes. \n\nHere are the rules for the names:\n\n* Each name must be between 1 and 10 letters long.\n* The first letter of each name must be uppercase.\n* The rest of the letters in each name must be lowercase.\n* The names can be any combination of letters.\n\nYou need to find *any* set of names that works. \n\n\n\nLet me know if you'd like help understanding any part of this!"}, {"prompt_md5": "77808119", "template_md5": "465699a0", "result": "You are given a list of \"yes\" or \"no\" answers indicating whether groups of consecutive people are valid (no two people in a group share the same name).  You need to come up with names for a list of people that satisfy these conditions."}]}