{"uid": "772-E", "url": "https://codeforces.com/contest/772/problem/E", "tags": ["binary search", " divide and conquer", " interactive", " trees"], "title": "772-E", "statement": "E. Verifying Kingdomtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is an interactive problem.The judge has a hidden rooted full binary tree withnleaves. A full binary tree is one where every node has either0or2children. The nodes with0children are called the leaves of the tree. Since this is a full binary tree, there are exactly2n- 1nodes in the tree. The leaves of the judge's tree has labels from1ton. You would like to reconstruct a tree that is isomorphic to the judge's tree. To do this, you can ask some questions.A question consists of printing the label of three distinct leavesa1,a2,a3. Let thedepthof a node be the shortest distance from the node to the root of the tree. LetLCA(a,b)denote the node with maximum depth that is a common ancestor of the nodesaandb.ConsiderX=LCA(a1,a2),Y=LCA(a2,a3),Z=LCA(a3,a1). The judge will tell you which one ofX,Y,Zhas the maximum depth. Note, this pair is uniquely determined since the tree is a binary tree; there can't be any ties.More specifically, ifX(orY,Zrespectively) maximizes the depth, the judge will respond with the string \"X\" (or \"Y\", \"Z\" respectively).You may only ask at most10·nquestions.InputThe first line of input will contain a single integern(3 ≤n≤ 1 000) — the number of leaves in the tree.OutputTo print the final answer, print out the string \"-1\" on its own line. Then, the next line should contain2n- 1integers. Thei-th integer should be the parent of thei-th node, or -1, if it is the root.Your answer will be judged correct if your output is isomorphic to the judge's tree. In particular, the labels of the leaves do not need to be labeled from1ton. Here, isomorphic means that there exists a permutationπsuch that nodeiis the parent of nodejin the judge tree if and only nodeπ(i)is the parent of nodeπ(j)in your tree.InteractionTo ask a question, print out three distinct integersa1,a2,a3. These integers should be between1andn, inclusive.The judge will respond with a single character, either \"X\", \"Y\", \"Z\".If the string is \"X\" (or \"Y\", \"Z\" respectively), that means the pair(a1,a2)(or(a2,a3),(a3,a1)respectively) has the deepestLCAamong the three pairs.You may only ask a question at most10·ntimes, otherwise, you will getWrong Answer.When you are ready to answer, print out a single integer \"-1\" on its own line. The next line should contain2n- 1integers. Thei-th integer should be the parent of thei-th node, or -1, if it is the root. Do not forget to flush the final answer as well. Printing the answer does not count as asking a question.You will getWrong Answerverdict ifYour question or answers are not in the format described in this statement.You ask strictly more than10·nquestions.Your question contains duplicate indices.Your final answer is not isomorphic to the judge tree.You will getIdleness Limit Exceededif you don't print anything or if you forget to flush the output, including for the final answer (more info about flushing output below).To flush you can use (just after printing an integer and end-of-line):fflush(stdout)in C++;System.out.flush()in Java;stdout.flush()in Python;flush(output)in Pascal;See the documentation for other languages.If at any moment your program reads-1as an answer, it should immediately exit normally (for example, by callingexit(0)). You will getWrong Answerin this case, it means that you made more queries than allowed, or made an invalid query. If you ignore this, you can get other verdicts since your program will continue to read from a closed stream.HackingTo hack someone, use the following formatnp_1 p_2 ... p_{2n-1}This denotes a tree where the parent of thei-th node ispi(pi=  - 1orn<pi≤ 2n- 1). Ifpiis equal to-1, then nodeiis the root. This input must describe a valid full rooted binary tree.Of course, contestant programs will not be able to see this input.ExampleInput5XZYYXOutput1 4 21 2 42 4 12 3 52 4 3-1-1 1 1 2 2 3 3 6 6NoteFor the first sample, the judge has the hidden tree:Here is a more readable format of the interaction:The last line can also be8 6 9 8 9 7 -1 6 7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ebe936bb", "template_md5": "35d339e4", "result": "You are given a hidden full binary tree with $n$ leaves. You need to reconstruct the tree by asking questions.\n\n**Questions:**\n\nYou can ask a question by providing three distinct leaf labels ($a_1$, $a_2$, $a_3$). The judge will tell you which of the following has the maximum depth:\n\n* $X = LCA(a_1, a_2)$\n* $Y = LCA(a_2, a_3)$\n* $Z = LCA(a_3, a_1)$\n\nwhere $LCA(a, b)$ is the lowest common ancestor of nodes $a$ and $b$.\n\n**Constraints:**\n\n* $3 \\le n \\le 1000$\n* You can ask at most $10n$ questions.\n\n**Output:**\n\nAfter asking questions, you need to output the reconstructed tree. The output should be a list of $2n-1$ integers, where the $i$-th integer represents the parent of the $i$-th node.  -1 indicates the root node.\n\n**Example:**\n\nLet's say $n=5$. You might ask questions like:\n\n* $(a_1, a_2, a_3) = (1, 2, 3)$\n* $(a_1, a_2, a_3) = (4, 5, 1)$\n\nBased on the judge's responses, you can deduce the tree structure and output your reconstruction."}, {"prompt_md5": "aaba1ace", "template_md5": "465699a0", "result": "You need to reconstruct a tree with a given number of leaves. You can ask questions about the tree by providing three leaf labels. The system will tell you which of the three possible common ancestors of these leaves is the deepest. You have a limited number of questions to figure out the structure of the tree and output the parent-child relationships."}]}