{"uid": "772-C", "url": "https://codeforces.com/contest/772/problem/C", "tags": ["constructive algorithms", " dp", " graphs", " math", " number theory"], "title": "772-C", "statement": "C. Vulnerable Kerbalstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an integerm, and a list ofndistinct integers between0andm- 1.You would like to construct a sequence satisfying the properties:Each element is an integer between0andm- 1, inclusive.All prefix products of the sequence modulomare distinct.No prefix product modulomappears as an element of the input list.The length of the sequence is maximized.Construct any sequence satisfying the properties above.InputThe first line of input contains two integersnandm(0 ≤n<m≤ 200 000) — the number of forbidden prefix products and the modulus.Ifnis non-zero, the next line of input containsndistinct integers between0andm- 1, the forbidden prefix products. Ifnis zero, this line doesn't exist.OutputOn the first line, print the numberk, denoting the length of your sequence.On the second line, printkspace separated integers, denoting your sequence.ExamplesInput0 5Output51 2 4 3 0Input3 102 9 1Output63 9 2 9 8 0NoteFor the first case, the prefix products of this sequence modulomare[1, 2, 3, 4, 0].For the second case, the prefix products of this sequence modulomare[3, 7, 4, 6, 8, 0].", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b80444e9", "template_md5": "35d339e4", "result": "You are given a number $m$ and a list of $n$ distinct numbers between 0 and $m-1$.  You need to create a sequence of numbers following these rules:\n\n* Each number in the sequence is between 0 and $m-1$, inclusive.\n* The product of all numbers in the sequence up to a given point (prefix product) is unique when calculated modulo $m$.\n* No prefix product modulo $m$ appears in the original list of $n$ numbers.\n\nThe goal is to make the sequence as long as possible.\n\nOutput the length of the sequence and the sequence itself."}, {"prompt_md5": "66b124c7", "template_md5": "465699a0", "result": "You are given a number 'm' and a list of 'n' unique numbers between 0 and m-1.  You need to create the longest possible sequence of numbers between 0 and m-1, where:\n\n* The product of any sequence of numbers at the beginning (prefix) is unique when divided by 'm'.\n* None of the prefix products (when divided by 'm') are in the original list. \n\n\nOutput the length of the sequence and the sequence itself."}]}