{"uid": "773-A", "url": "https://codeforces.com/contest/773/problem/A", "tags": ["binary search", " math"], "title": "773-A", "statement": "A. Success Ratetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are an experienced Codeforces user. Today you found out that during your activity on Codeforces you have madeysubmissions, out of whichxhave been successful. Thus, your current success rate on Codeforces is equal tox/y.Your favorite rational number in the[0;1]range isp/q. Now you wonder: what is the smallest number of submissions you have to make if you want your success rate to bep/q?InputThe first line contains a single integert(1 ≤t≤ 1000) — the number of test cases.Each of the nexttlines contains four integersx,y,pandq(0 ≤x≤y≤ 109;0 ≤p≤q≤ 109;y> 0;q> 0).It is guaranteed thatp/qis an irreducible fraction.Hacks.For hacks, an additional constraint oft≤ 5must be met.OutputFor each test case, output a single integer equal to the smallest number of submissions you have to make if you want your success rate to be equal to your favorite rational number, or-1if this is impossible to achieve.ExampleInput43 10 1 27 14 3 820 70 2 75 6 1 1Output4100-1NoteIn the first example, you have to make 4 successful submissions. Your success rate will be equal to7 / 14, or1 / 2.In the second example, you have to make 2 successful and 8 unsuccessful submissions. Your success rate will be equal to9 / 24, or3 / 8.In the third example, there is no need to make any new submissions. Your success rate is already equal to20 / 70, or2 / 7.In the fourth example, the only unsuccessful submission breaks your hopes of having the success rate equal to 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "30f1e372", "template_md5": "35d339e4", "result": "You are given your current number of successful submissions ($x$) and total submissions ($y$). You also have a target success rate ($p/q$).  \n\nDetermine the minimum number of additional submissions needed to achieve the target success rate. If it's impossible to reach the target rate, output -1.\n\nInput:\n\n* The first line contains the number of test cases ($t$).\n* Each of the next $t$ lines contains four integers: $x$, $y$, $p$, and $q$.\n\nOutput:\n\n* For each test case, output the minimum number of additional submissions needed to reach the target success rate, or -1 if it's impossible."}, {"prompt_md5": "e051d628", "template_md5": "465699a0", "result": "You have made a certain number of submissions, some successful and some unsuccessful. You want to know the minimum number of additional submissions needed to reach a target success rate."}]}