{"uid": "774-I", "url": "https://codeforces.com/contest/774/problem/I", "tags": ["*special", " dp"], "title": "774-I", "statement": "I. Composing Of Stringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputStepan has a set ofnstrings. Also, he has a favorite strings.Stepan wants to do the following. He will take some strings of his set and write them down one after another. It is possible that he will take some strings more than once, and will not take some of them at all.Your task is to determine the minimum number of strings in the set which Stepan needs to take and write so that the stringsappears as a subsequence in the resulting written down string.For example, in the string \"abcd\" strings \"ad\", \"acd\", \"abcd\" appear as subsequences, and strings \"ba\", \"abdc\" don't appear as subsequences.InputThe first line contains the integern(1 ≤n≤ 50) — the number of strings in Stepan's set.The nextnlines containnnon-empty strings consisting of lowercase letters of the English alphabet. The length of each of these strings does not exceed50symbols. It is possible that some strings from Stepan's set are the same.The next line contains the non-empty strings, consisting of lowercase letters of the English alphabet — Stepan's favorite string. The length of this string doesn't exceed2500symbols.OutputPrint the minimum number of strings which Stepan should take from the set and write them down one after another so that the stringsappears as a subsequence in the resulting written down string. Each string from the set should be counted as many times as Stepan takes it from the set.If the answer doesn't exsist, print-1.ExamplesInput3aaaaaaaOutput2Input4abaabaabbbaaabOutput3Input2aaabbbaaacbbbOutput-1NoteIn the first test, Stepan can take, for example, the third and the second strings from the set, write them down, and get exactly his favorite string.In the second example Stepan can take, for example, the second, the third and again the second strings from the set and write them down. Then he will get a string \"aabaaaab\", in which his favorite string \"baaab\" is a subsequence.In the third test Stepan can not get his favorite string, because it contains the letter \"c\", which is not presented in any of the strings in the set.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ccb50a31", "template_md5": "35d339e4", "result": "You are given a set of $n$ strings. You also have a target string.  \n\nYour task is to find the minimum number of strings from the set that you need to use (you can use a string multiple times) to create a new string where the target string is a subsequence. \n\nIf it's impossible to create the target string as a subsequence, output -1."}, {"prompt_md5": "c1ac9312", "template_md5": "465699a0", "result": "You are given a set of strings and a target string.  Determine the fewest strings from the set that must be used to create the target string as a subsequence. A subsequence is a sequence of characters that appear in the same order in the target string, but not necessarily consecutively. If it's impossible to create the target string using strings from the set, output -1."}]}