{"uid": "774-D", "url": "https://codeforces.com/contest/774/problem/D", "tags": ["*special", " constructive algorithms", " implementation", " sortings"], "title": "774-D", "statement": "D. Lie or Truthtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasya has a sequence of cubes and exactly one integer is written on each cube. Vasya exhibited all his cubes in a row. So the sequence of numbers written on the cubes in the order from the left to the right equals toa1,a2, ...,an.While Vasya was walking, his little brother Stepan played with Vasya's cubes and changed their order, so now the sequence of numbers written on the cubes became equal tob1,b2, ...,bn.Stepan said that he swapped only cubes which where on the positions betweenlandr, inclusive, and did not remove or add any other cubes (i. e. he said that he reordered cubes between positionslandr, inclusive, in some way).Your task is to determine if it is possible that Stepan said the truth, or it is guaranteed that Stepan deceived his brother.InputThe first line contains three integersn,l,r(1 ≤n≤ 105,1 ≤l≤r≤n) — the number of Vasya's cubes and the positions told by Stepan.The second line contains the sequencea1,a2, ...,an(1 ≤ai≤n) — the sequence of integers written on cubes in the Vasya's order.The third line contains the sequenceb1,b2, ...,bn(1 ≤bi≤n) — the sequence of integers written on cubes after Stepan rearranged their order.It is guaranteed that Stepan did not remove or add other cubes, he only rearranged Vasya's cubes.OutputPrint \"LIE\" (without quotes) if it is guaranteed that Stepan deceived his brother. In the other case, print \"TRUTH\" (without quotes).ExamplesInput5 2 43 4 2 3 13 2 3 4 1OutputTRUTHInput3 1 21 2 33 1 2OutputLIEInput4 2 41 1 1 11 1 1 1OutputTRUTHNoteIn the first example there is a situation when Stepan said the truth. Initially the sequence of integers on the cubes was equal to[3, 4, 2, 3, 1]. Stepan could at first swap cubes on positions2and3(after that the sequence of integers on cubes became equal to[3, 2, 4, 3, 1]), and then swap cubes in positions3and4(after that the sequence of integers on cubes became equal to[3, 2, 3, 4, 1]).In the second example it is not possible that Stepan said truth because he said that he swapped cubes only between positions1and2, but we can see that it is guaranteed that he changed the position of the cube which was on the position3at first. So it is guaranteed that Stepan deceived his brother.In the third example for any valueslandrthere is a situation when Stepan said the truth.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "35554719", "template_md5": "35d339e4", "result": "You are given two sequences of integers,  $a_1, a_2, ..., a_n$ and $b_1, b_2, ..., b_n$, of the same length. You are also given two integers $l$ and $r$ where $1 \\le l \\le r \\le n$. \n\nSomeone claims that they rearranged the elements of the sequence $a$ by swapping elements only between positions $l$ and $r$ (inclusive), resulting in the sequence $b$. \n\nDetermine if it is possible for this rearrangement to have occurred, or if the claim is definitely false."}, {"prompt_md5": "45ec5917", "template_md5": "465699a0", "result": "You are given two sequences of numbers. One sequence is the original order, and the other is the order after some numbers were swapped within a specific range. Determine if the swapping range is possible given the two sequences."}]}