{"uid": "774-K", "url": "https://codeforces.com/contest/774/problem/K", "tags": ["*special", " implementation", " strings"], "title": "774-K", "statement": "K. Stepan and Vowelstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputStepan likes to repeat vowel letters when he writes words. For example, instead of the word \"pobeda\" he can write \"pobeeeedaaaaa\".Sergey does not like such behavior, so he wants to write a program to format the words written by Stepan. This program must combine all consecutive equal vowels to a single vowel. The vowel letters are \"a\", \"e\", \"i\", \"o\", \"u\" and \"y\".There are exceptions: if letters \"e\" or \"o\" repeat in a row exactly2times, like in words \"feet\" and \"foot\", the program must skip them and do not transform in one vowel. For example, the word \"iiiimpleeemeentatiioon\" must be converted to the word \"implemeentatioon\".Sergey is very busy and asks you to help him and write the required program.InputThe first line contains the integern(1 ≤n≤ 100 000) — the number of letters in the word written by Stepan.The second line contains the stringswhich has length that equals tonand contains only lowercase English letters — the word written by Stepan.OutputPrint the single string — the word written by Stepan converted according to the rules described in the statement.ExamplesInput13pobeeeedaaaaaOutputpobedaInput22iiiimpleeemeentatiioonOutputimplemeentatioonInput18aeiouyaaeeiioouuyyOutputaeiouyaeeioouyInput24aaaoooiiiuuuyyyeeeggghhhOutputaoiuyeggghhh", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9451b67f", "template_md5": "35d339e4", "result": "Given a string of lowercase English letters, modify the string by combining consecutive identical vowels into a single vowel. However, if two consecutive vowels are \"e\" or \"o\", do not combine them. \n\nFor example:\n\n* \"pobeeeedaaaaa\" becomes \"pobeda\"\n* \"iiiimpleeemeentatiioon\" becomes \"implemeentatioon\" \n\n\nInput:\n\nThe first line contains an integer $n$ ($1 \\le n \\le 100,000$) representing the length of the string.\nThe second line contains the string of length $n$ consisting of lowercase English letters.\n\nOutput:\n\nPrint the modified string."}, {"prompt_md5": "f50bfc55", "template_md5": "465699a0", "result": "Given a string of lowercase letters, replace consecutive identical vowels with a single vowel, except for \"e\" and \"o\" which are only replaced if they repeat exactly twice.  Return the modified string."}]}