{"uid": "776-B", "url": "https://codeforces.com/contest/776/problem/B", "tags": ["constructive algorithms", " number theory"], "title": "776-B", "statement": "B. Sherlock and his girlfriendtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSherlock has a new girlfriend (so unlike him!). Valentine's day is coming and he wants to gift her some jewelry.He boughtnpieces of jewelry. Thei-th piece has price equal toi+ 1, that is, the prices of the jewelry are2, 3, 4, ...n+ 1.Watson gave Sherlock a challenge to color these jewelry pieces such that two pieces don't have the same color if the price of one piece is a prime divisor of the price of the other piece. Also, Watson asked him to minimize the number of different colors used.Help Sherlock complete this trivial task.InputThe only line contains single integern(1 ≤n≤ 100000) — the number of jewelry pieces.OutputThe first line of output should contain a single integerk, the minimum number of colors that can be used to color the pieces of jewelry with the given constraints.The next line should consist ofnspace-separated integers (between1andk) that specify the color of each piece in the order of increasing price.If there are multiple ways to color the pieces usingkcolors, you can output any of them.ExamplesInput3Output21 1 2Input4Output22 1 1 2NoteIn the first input, the colors for first, second and third pieces of jewelry having respective prices2,3and4are1,1and2respectively.In this case, as2is a prime divisor of4, colors of jewelry having prices2and4must be distinct.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0b9994be", "template_md5": "35d339e4", "result": "You are given an integer $n$ representing the number of jewelry pieces. Each piece has a price equal to $i+1$ where $i$ is the index of the piece (starting from 0).  \n\nYou need to color the jewelry pieces such that:\n\n* No two pieces with a price relationship where one is a divisor of the other have the same color. \n\nFind the minimum number of colors needed to color the jewelry and output it followed by a valid coloring scheme (an assignment of colors to each piece)."}, {"prompt_md5": "57ef1db3", "template_md5": "465699a0", "result": "You are given a list of numbers.  Each number represents the price of an item.  You need to color the items so that no two items with a price that divides evenly into each other have the same color. Use the fewest colors possible."}]}