{"uid": "777-E", "url": "https://codeforces.com/contest/777/problem/E", "tags": ["brute force", " data structures", " dp", " greedy", " sortings"], "title": "777-E", "statement": "E. Hanoi Factorytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOf course you have heard the famous task about Hanoi Towers, but did you know that there is a special factory producing the rings for this wonderful game? Once upon a time, the ruler of the ancient Egypt ordered the workers of Hanoi Factory to create as high tower as possible. They were not ready to serve such a strange order so they had to create this new tower using already produced rings.There arenrings in factory's stock. Thei-th ring has inner radiusai, outer radiusbiand heighthi. The goal is to select some subset of rings and arrange them such that the following conditions are satisfied:Outer radiuses form a non-increasing sequence, i.e. one can put thej-th ring on thei-th ring only ifbj≤bi.Rings should not fall one into the the other. That means one can place ringjon the ringionly ifbj>ai.The total height of all rings used should be maximum possible.InputThe first line of the input contains a single integern(1 ≤n≤ 100 000) — the number of rings in factory's stock.Thei-th of the nextnlines contains three integersai,biandhi(1 ≤ai,bi,hi≤ 109,bi>ai) — inner radius, outer radius and the height of thei-th ring respectively.OutputPrint one integer — the maximum height of the tower that can be obtained.ExamplesInput31 5 12 6 23 7 3Output6Input41 2 11 3 34 6 25 7 1Output4NoteIn the first sample, the optimal solution is to take all the rings and put them on each other in order3,2,1.In the second sample, one can put the ring3on the ring4and get the tower of height3, or put the ring1on the ring2and get the tower of height4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b30b90ec", "template_md5": "35d339e4", "result": "You are given $n$ rings, where each ring has an inner radius ($a_i$), an outer radius ($b_i$), and a height ($h_i$).  \n\nYou need to select some of these rings and stack them on top of each other to form the tallest possible tower.  \n\nHere are the rules:\n\n* The outer radius of a ring must be less than or equal to the inner radius of the ring below it ($b_j \\le b_i$ if ring $j$ is placed on ring $i$).\n* The outer radius of a ring must be greater than the inner radius of the ring below it ($b_j > a_i$ if ring $j$ is placed on ring $i$).\n\nWhat is the maximum total height of the tower you can build?"}, {"prompt_md5": "d7a78f5e", "template_md5": "465699a0", "result": "You have a set of rings, each with an inner radius, outer radius, and height.  You need to choose some of the rings and stack them on top of each other, following these rules:\n\n* The outer radius of a ring must be smaller than or equal to the inner radius of the ring below it.\n* The inner radius of a ring must be smaller than the outer radius of the ring below it.\n\nWhat is the maximum total height you can achieve by stacking the rings?"}]}