{"uid": "778-A", "url": "https://codeforces.com/contest/778/problem/A", "tags": ["binary search", " greedy", " strings"], "title": "778-A", "statement": "A. String Gametime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputLittle Nastya has a hobby, she likes to remove some letters from word, to obtain another word. But it turns out to be pretty hard for her, because she is too young. Therefore, her brother Sergey always helps her.Sergey gives Nastya the wordtand wants to get the wordpout of it. Nastya removes letters in a certain order (one after another, in this order strictly), which is specified by permutation of letters' indices of the wordt:a1...a|t|. We denote the length of wordxas|x|. Note that after removing one letter, the indices of other letters don't change. For example, ift=\"nastya\" anda= [4, 1, 5, 3, 2, 6]then removals make the following sequence of words \"nastya\"\"nastya\"\"nastya\"\"nastya\"\"nastya\"\"nastya\"\"nastya\".Sergey knows this permutation. His goal is to stop his sister at some point and continue removing by himself to get the wordp. Since Nastya likes this activity, Sergey wants to stop her as late as possible. Your task is to determine, how many letters Nastya can remove before she will be stopped by Sergey.It is guaranteed that the wordpcan be obtained by removing the letters from wordt.InputThe first and second lines of the input contain the wordstandp, respectively. Words are composed of lowercase letters of the Latin alphabet (1 ≤ |p| < |t| ≤ 200 000). It is guaranteed that the wordpcan be obtained by removing the letters from wordt.Next line contains a permutationa1,a2, ...,a|t|of letter indices that specifies the order in which Nastya removes letters oft(1 ≤ai≤ |t|, allaiare distinct).OutputPrint a single integer number, the maximum number of letters that Nastya can remove.ExamplesInputababcbaabb5 3 4 1 7 6 2Output3Inputbbbabbbb1 6 3 4 2 5Output4NoteIn the first sample test sequence of removing made by Nastya looks like this:\"ababcba\"\"ababcba\"\"ababcba\"\"ababcba\"Nastya can not continue, because it is impossible to get word \"abb\" from word \"ababcba\".So, Nastya will remove only three letters.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "23738516", "template_md5": "35d339e4", "result": "You are given two strings,  *t* and *p*, where *p* is a substring of *t*.  You are also given a permutation *a* of the indices of the letters in *t*.\n\nThis permutation represents the order in which letters are removed from *t*.  \n\nYour task is to determine the maximum number of letters Nastya can remove from *t* before Sergey stops her, such that the remaining string can be transformed into *p* by removing letters in the order specified by *a*."}, {"prompt_md5": "032f5654", "template_md5": "465699a0", "result": "You are given two strings, a longer string `t` and a shorter string `p`.  A permutation of numbers represents the order in which letters are removed from `t`.  Find the maximum number of letters that can be removed from `t` following this order before the remaining string can no longer be transformed into `p`."}]}