{"uid": "778-B", "url": "https://codeforces.com/contest/778/problem/B", "tags": ["bitmasks", " brute force", " dfs and similar", " expression parsing", " implementation"], "title": "778-B", "statement": "B. Bitwise Formulatime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputBob recently read about bitwise operations used in computers:AND,ORandXOR. He have studied their properties and invented a new game.Initially, Bob chooses integerm, bit depth of the game, which means that all numbers in the game will consist ofmbits. Then he asks Peter to choose somem-bit number. After that, Bob computes the values ofnvariables. Each variable is assigned either a constantm-bit number or result of bitwise operation. Operands of the operation may be either variables defined before, or the number, chosen by Peter. After that, Peter's score equals to the sum of all variable values.Bob wants to know, what number Peter needs to choose to get the minimum possible score, and what number he needs to choose to get the maximum possible score. In both cases, if there are several ways to get the same score, find the minimum number, which he can choose.InputThe first line contains two integersnandm, the number of variables and bit depth, respectively (1 ≤n≤ 5000;1 ≤m≤ 1000).The followingnlines contain descriptions of the variables. Each line describes exactly one variable. Description has the following format: name of a new variable, space, sign \":=\", space, followed by one of:Binary number of exactlymbits.The first operand, space, bitwise operation (\"AND\", \"OR\" or \"XOR\"), space, the second operand. Each operand is either the name of variable defined before or symbol '?', indicating the number chosen by Peter.Variable names are strings consisting of lowercase Latin letters with length at most 10. All variable names are different.OutputIn the first line output the minimum number that should be chosen by Peter, to make the sum of all variable values minimum possible, in the second line output the minimum number that should be chosen by Peter, to make the sum of all variable values maximum possible. Both numbers should be printed asm-bit binary numbers.ExamplesInput3 3a := 101b := 011c := ? XOR bOutput011100Input5 1a := 1bb := 0cx := ? OR ad := ? XOR ?e := d AND bbOutput00NoteIn the first sample if Peter chooses a number0112, thena= 1012,b= 0112,c= 0002, the sum of their values is8. If he chooses the number1002, thena= 1012,b= 0112,c= 1112, the sum of their values is15.For the second test, the minimum and maximum sum of variablesa,bb,cx,dandeis 2, and this sum doesn't depend on the number chosen by Peter, so the minimum Peter can choose is0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "afb260d5", "template_md5": "35d339e4", "result": "You are given a number of variables, each of which is assigned a value based on a bitwise operation. Some variables are assigned a constant binary number, while others are assigned the result of a bitwise operation involving other variables or a number chosen by the user.\n\nThe goal is to determine the minimum and maximum binary number the user can choose to minimize and maximize the sum of all variable values, respectively. \n\n**Input:**\n\n* The first line contains two integers, *n* and *m*, representing the number of variables and the bit depth of the numbers, respectively.\n* The following *n* lines describe each variable. Each line contains:\n    * The variable name.\n    * An assignment operator (\" := \").\n    * Either a binary number of length *m* or an expression involving:\n        * A variable name.\n        * A bitwise operation (AND, OR, XOR).\n        * Another variable name or a \"?\" representing the user's input.\n\n**Output:**\n\n* The first line contains the minimum binary number the user can choose to minimize the sum of variable values.\n* The second line contains the minimum binary number the user can choose to maximize the sum of variable values."}, {"prompt_md5": "30424070", "template_md5": "465699a0", "result": "You are given a set of variables, each defined by a bitwise operation (AND, OR, XOR) on other variables or a user-input number.  Find the smallest and largest numbers the user can input to minimize and maximize the sum of all variable values, respectively."}]}