{"uid": "778-D", "url": "https://codeforces.com/contest/778/problem/D", "tags": ["constructive algorithms"], "title": "778-D", "statement": "D. Parquet Re-layingtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputPeter decided to lay a parquet in the room of sizen×m, the parquet consists of tiles of size1 × 2. When the workers laid the parquet, it became clear that the tiles pattern looks not like Peter likes, and workers will have to re-lay it.The workers decided that removing entire parquet and then laying it again is very difficult task, so they decided to make such an operation every hour: remove two tiles, which form a2 × 2square, rotate them 90 degrees and put them back on the same place.They have no idea how to obtain the desired configuration using these operations, and whether it is possible at all.Help Peter to make a plan for the workers or tell that it is impossible. The plan should contain at most100 000commands.InputThe first line contains integernandm, size of the room (1 ≤n,m≤ 50). At least one of them is even number.The followingnlines containmcharacters each, the description of the current configuration of the parquet tiles. Each character represents the position of the half-tile. Characters 'L', 'R', 'U' and 'D' correspond to the left, right, upper and lower halves, respectively.The followingnlines containmcharacters each, describing the desired configuration in the same format.OutputIn the first line output integerk, the number of operations. In the nextklines output description of operations. The operation is specified by coordinates (row and column) of the left upper half-tile on which the operation is performed.If there is no solution, output-1in the first line.ExamplesInput2 3ULRDLRLRULRDOutput21 21 1Input4 3ULRDLRLRULRDULRDUUUDDDLROutput33 13 22 2NoteIn the first sample test first operation is to rotate two rightmost tiles, after this all tiles lie vertically. Second operation is to rotate two leftmost tiles, after this we will get desired configuration.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2684894c", "template_md5": "35d339e4", "result": "You are given a rectangular room of size $n \\times m$. The room is tiled with $1 \\times 2$ tiles.  \n\nYou are also given the current arrangement of the tiles and the desired arrangement of the tiles.\n\nThe workers can only perform the following operation:\n\n1. Select a $2 \\times 2$ square of tiles.\n2. Rotate the tiles in the square 90 degrees clockwise.\n3. Replace the tiles in the same position.\n\nDetermine the minimum number of operations required to transform the current arrangement to the desired arrangement. If it is impossible to achieve the desired arrangement, output -1. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the dimensions of the room.\n* The next $n$ lines contain $m$ characters each, representing the current arrangement of the tiles. Each character can be 'L', 'R', 'U', or 'D', representing the left, right, upper, or lower half of a tile, respectively.\n* The next $n$ lines contain $m$ characters each, representing the desired arrangement of the tiles in the same format.\n\n**Output:**\n\n* The first line contains an integer, $k$, representing the minimum number of operations.\n* The next $k$ lines each contain two integers, representing the row and column of the top-left tile in the $2 \\times 2$ square to be rotated."}, {"prompt_md5": "c103929b", "template_md5": "465699a0", "result": "You are given a rectangular grid representing a floor made of tiles. You need to rearrange the tiles by rotating 2x2 sections of tiles 90 degrees. Determine the minimum number of rotations needed to transform the current grid into a target grid. If it's impossible to achieve the target grid, output -1."}]}