{"uid": "780-D", "url": "https://codeforces.com/contest/780/problem/D", "tags": ["2-sat", " graphs", " greedy", " implementation", " shortest paths", " strings"], "title": "780-D", "statement": "D. Innokenty and a Football Leaguetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputInnokenty is a president of a new football league in Byteland. The first task he should do is to assign short names to all clubs to be shown on TV next to the score. Of course, the short names should be distinct, and Innokenty wants that all short names consist ofthree letters.Each club's full name consist of two words: the team's name and the hometown's name, for example, \"DINAMO BYTECITY\". Innokenty doesn't want to assign strange short names, so he wants to choose such short names for each club that:the short name is the same as three first letters of the team's name, for example, for the mentioned club it is \"DIN\",or, the first two letters of the short name should be the same as the first two letters of the team's name, while the third letter is the same as the first letter in the hometown's name. For the mentioned club it is \"DIB\".Apart from this, there is a rule that if for some clubxthe second option of short name is chosen, then there should be no club, for which the first option is chosen which is the same as the first option for the clubx. For example, if the above mentioned club has short name \"DIB\", then no club for which the first option is chosen can have short name equal to \"DIN\". However, it is possible that some club have short name \"DIN\", where \"DI\" are the first two letters of the team's name, and \"N\" is the first letter of hometown's name. Of course, no two teams can have the same short name.Help Innokenty to choose a short name for each of the teams. If this is impossible, report that. If there are multiple answer, any of them will suit Innokenty. If for some team the two options of short name are equal, then Innokenty will formally think that only one of these options is chosen.InputThe first line contains a single integern(1 ≤n≤ 1000) — the number of clubs in the league.Each of the nextnlines contains two words — the team's name and the hometown's name for some club. Both team's name and hometown's name consist of uppercase English letters and have length at least3and at most20.OutputIt it is not possible to choose short names and satisfy all constraints, print a single line \"NO\".Otherwise, in the first line print \"YES\". Then printnlines, in each line print the chosen short name for the corresponding club. Print the clubs in the same order as they appeared in input.If there are multiple answers, print any of them.ExamplesInput2DINAMO BYTECITYFOOTBALL MOSCOWOutputYESDINFOOInput2DINAMO BYTECITYDINAMO BITECITYOutputNOInput3PLAYFOOTBALL MOSCOWPLAYVOLLEYBALL SPBGOGO TECHNOCUPOutputYESPLMPLSGOGInput3ABC DEFABC EFGABD OOOOutputYESABDABEABONoteIn the first sample Innokenty can choose first option for both clubs.In the second example it is not possible to choose short names, because it is not possible that one club has first option, and the other has second option if the first options are equal for both clubs.In the third example Innokenty can choose the second options for the first two clubs, and the first option for the third club.In the fourth example note that it is possible that the chosen short name for some clubxis the same as the first option of another clubyif the first options ofxandyare different.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fd0ff3af", "template_md5": "35d339e4", "result": "You are given a list of $n$ ($1 \\le n \\le 1000$) clubs, each with a team name and a hometown. Each team name and hometown name consists of uppercase English letters and has length at least 3 and at most 20.\n\nFor each club, you need to assign a 3-letter short name following these rules:\n\n1. **Option 1:** The short name is the first three letters of the team name.\n2. **Option 2:** The first two letters of the short name are the first two letters of the team name, and the third letter is the first letter of the hometown name.\n\n**Constraints:**\n\n* If a club uses Option 2, no other club can use Option 1 with the same first three letters.\n\n**Output:**\n\n* If it's impossible to assign short names following the rules, print \"NO\".\n* Otherwise, print \"YES\" followed by a list of short names for each club, one per line. The order of the short names should match the order of the clubs in the input. \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem."}, {"prompt_md5": "d3910080", "template_md5": "465699a0", "result": "You are given a list of teams, each with a name and a city.  You need to assign each team a 3-letter short name following these rules:\n\n1. The short name can be the first three letters of the team name.\n2. Alternatively, the short name can be the first two letters of the team name followed by the first letter of the city name.\n3. If a team's short name is chosen using rule 2, no other team can have a short name using rule 1 that is the same as the first part of that team's short name.\n\nIf it's impossible to assign short names following these rules, say \"NO\". Otherwise, list the short names for each team."}]}