{"uid": "785-A", "url": "https://codeforces.com/contest/785/problem/A", "tags": ["implementation", " strings"], "title": "785-A", "statement": "A. Anton and Polyhedronstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAnton's favourite geometric figures are regular polyhedrons. Note that there are five kinds of regular polyhedrons:Tetrahedron. Tetrahedron has4triangular faces.Cube. Cube has6square faces.Octahedron. Octahedron has8triangular faces.Dodecahedron. Dodecahedron has12pentagonal faces.Icosahedron. Icosahedron has20triangular faces.All five kinds of polyhedrons are shown on the picture below:Anton has a collection ofnpolyhedrons. One day he decided to know, how many faces his polyhedrons have in total. Help Anton and find this number!InputThe first line of the input contains a single integern(1 ≤n≤ 200 000)— the number of polyhedrons in Anton's collection.Each of the followingnlines of the input contains a stringsi— the name of thei-th polyhedron in Anton's collection. The string can look like this:\"Tetrahedron\" (without quotes), if thei-th polyhedron in Anton's collection is a tetrahedron.\"Cube\" (without quotes), if thei-th polyhedron in Anton's collection is a cube.\"Octahedron\" (without quotes), if thei-th polyhedron in Anton's collection is an octahedron.\"Dodecahedron\" (without quotes), if thei-th polyhedron in Anton's collection is a dodecahedron.\"Icosahedron\" (without quotes), if thei-th polyhedron in Anton's collection is an icosahedron.OutputOutput one number — the total number of faces in all the polyhedrons in Anton's collection.ExamplesInput4IcosahedronCubeTetrahedronDodecahedronOutput42Input3DodecahedronOctahedronOctahedronOutput28NoteIn the first sample Anton has one icosahedron, one cube, one tetrahedron and one dodecahedron. Icosahedron has20faces, cube has6faces, tetrahedron has4faces and dodecahedron has12faces. In total, they have20 + 6 + 4 + 12 = 42faces.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "653d808e", "template_md5": "35d339e4", "result": "You are given a list of polyhedrons. Each polyhedron is one of the following:\n\n* Tetrahedron (4 faces)\n* Cube (6 faces)\n* Octahedron (8 faces)\n* Dodecahedron (12 faces)\n* Icosahedron (20 faces)\n\nFind the total number of faces in all the polyhedrons. \n\n\nInput:\n\nThe first line contains an integer $n$ (1 ≤ $n$ ≤ 200,000) representing the number of polyhedrons.\n\nThe following $n$ lines each contain a string representing the type of polyhedron.\n\nOutput:\n\nOutput a single integer representing the total number of faces."}, {"prompt_md5": "daaf68a0", "template_md5": "465699a0", "result": "You are given a list of polyhedron types. Each type has a specific number of faces.  Calculate the total number of faces across all the polyhedrons in the list."}]}