{"uid": "786-E", "url": "https://codeforces.com/contest/786/problem/E", "tags": ["data structures", " flows", " graphs", " trees"], "title": "786-E", "statement": "E. ALTtime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputALT is a planet in a galaxy called \"Encore\". Humans rule this planet but for some reason there's no dog in their planet, so the people there are sad and depressed. Rick and Morty are universal philanthropists and they want to make people in ALT happy.ALT hasncities numbered from1tonandn- 1bidirectional roads numbered from1ton- 1. One can go from any city to any other city using these roads.There are two types of people in ALT:Guardians. A guardian lives in a house alongside a road and guards the road.Citizens. A citizen lives in a house inside a city and works in an office in another city.Every person on ALT is either a guardian or a citizen and there's exactly one guardian alongside each road.Rick and Morty talked to all the people in ALT, and here's what they got:There aremcitizens living in ALT.Citizen numberilives in city numberxiand works in city numberyi.Every day each citizen will go through all roads along the shortest path from his home to his work.A citizen will be happy if and only if either he himself has a puppy himself or all of guardians along his path to his work has a puppy (he sees the guardian's puppy in each road and will be happy).A guardian is always happy.You need to tell Rick and Morty the minimum number of puppies they need in order to make all people in ALT happy, and also provide an optimal way to distribute these puppies.InputThe first line of input contains two integersnandm(2 ≤n≤ 2 × 104,1 ≤m≤ 104) — number of cities and number of citizens respectively.The nextn- 1lines contain the roads,i-th line contains endpoint ofi-th edge,vandu(1 ≤v,u≤n,v≠u).The nextmlines contain the information about citizens.i-th line contains two integersxiandyi(1 ≤xi,yi≤n,xi≠yi).OutputIn the first line of input print a single integerk, the total number of puppies they need (1 ≤k≤n).In the second line print an integerq, the number of puppies to give to citizens, followed byqdistinct integersa1,a2, ...,aq, index of citizens to give puppy to (0 ≤q≤min(m,k),1 ≤ai≤m).In the third line print an integere, the number of puppies to give to guardians, followed byedistinct integersb1,b2, ...,be, index of road of guardians to give puppy to (0 ≤e≤min(n- 1,k),1 ≤bi≤n- 1).Sum ofqandeshould be equal tok.ExamplesInput4 52 43 41 42 42 12 41 22 3Output31 52 3 1Input4 73 41 42 14 24 22 41 42 13 14 2Output31 62 2 3NoteMap of ALT in the first sample testcase (numbers written on a road is its index):Map of ALT in the second sample testcase (numbers written on a road is its index):", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "765ee609", "template_md5": "35d339e4", "result": "There are $n$ cities connected by $n-1$ bidirectional roads.  There are $m$ citizens, each living in one city and working in another.  \n\nEach day, each citizen travels along the shortest path between their home and work, passing through a guardian at each road.\n\nA citizen is happy if they either have a puppy themselves or all the guardians they encounter on their route to work have puppies. Guardians are always happy.\n\nDetermine the minimum number of puppies needed to make all people happy, and specify which citizens and guardians should receive them."}, {"prompt_md5": "00c5f657", "template_md5": "465699a0", "result": "There are cities connected by roads. Each citizen lives in one city and works in another.  Citizens are happy if they have a puppy or all the guardians along their path to work have a puppy. Guardians are always happy.  Find the minimum number of puppies needed to make everyone happy and how to distribute them."}]}