{"uid": "788-C", "url": "https://codeforces.com/contest/788/problem/C", "tags": ["dfs and similar", " graphs", " shortest paths"], "title": "788-C", "statement": "C. The Great Mixingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSasha and Kolya decided to get drunk with Coke, again. This time they havektypes of Coke.i-th type is characterised by its carbon dioxide concentration. Today, on the party in honour of Sergiy of Vancouver they decided to prepare a glass of Coke with carbon dioxide concentration. The drink should also be tasty, so the glass can contain only integer number of liters of each Coke type (some types can be not presented in the glass). Also, they want to minimize the total volume of Coke in the glass.Carbon dioxide concentration is defined as the volume of carbone dioxide in the Coke divided by the total volume of Coke. When you mix two Cokes, the volume of carbon dioxide sums up, and the total volume of Coke sums up as well.Help them, find the minimal natural number of liters needed to create a glass with carbon dioxide concentration. Assume that the friends have unlimited amount of each Coke type.InputThe first line contains two integersn,k(0 ≤n≤ 1000,1 ≤k≤ 106) — carbon dioxide concentration the friends want and the number of Coke types.The second line containskintegersa1,a2, ...,ak(0 ≤ai≤ 1000) — carbon dioxide concentration of each type of Coke. Some Coke types can have same concentration.OutputPrint the minimal natural number of liter needed to prepare a glass with carbon dioxide concentration, or-1if it is impossible.ExamplesInput400 4100 300 450 500Output2Input50 2100 25Output3NoteIn the first sample case, we can achieve concentrationusing one liter of Coke of typesand:.In the second case, we can achieve concentrationusing two liters oftype and one liter oftype:.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7cef8d15", "template_md5": "35d339e4", "result": "You are given a target carbon dioxide concentration $n$ and $k$ types of Coke, each with a different carbon dioxide concentration.  You can mix any amount of each type of Coke to create a new mixture. The amount of each type of Coke must be a whole number.\n\nFind the smallest total volume of Coke needed to create a mixture with the target carbon dioxide concentration. If it is impossible to achieve the target concentration, output -1."}, {"prompt_md5": "eadc7405", "template_md5": "465699a0", "result": "You are given a target concentration and a list of concentrations.  Find the smallest total volume needed to mix drinks with those concentrations to reach the target, or say it's impossible.  Each drink can be mixed in whole units."}]}