{"uid": "788-E", "url": "https://codeforces.com/contest/788/problem/E", "tags": ["data structures"], "title": "788-E", "statement": "E. New tasktime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn the 228-th international Uzhlyandian Wars strategic game tournament teams from each country are called. The teams should consist of5participants.The team of Uzhlyandia will consist of soldiers, because there are no gamers.Masha is a new minister of defense and gaming. The prime duty of the minister is to calculate the efficiency of the Uzhlandian army. The army consists ofnsoldiers standing in a row, enumerated from1ton. For each soldier we know hisskillin Uzhlyandian Wars: thei-th soldier's skill isai.It was decided that the team will consist of three players and two assistants. The skills of players should be same, and the assistants' skills should not be greater than the players' skill. Moreover, it is important for Masha that one of the assistants should stand in the row to the left of the players, and the other one should stand in the row to the right of the players. Formally, a team is five soldiers with indexesi,j,k,l,p, such that1 ≤i<j<k<l<p≤nandai≤aj=ak=al≥ap.The efficiency of the army is the number of different teams Masha can choose. Two teams are considered different if there is suchisuch that thei-th soldier is a member of one team, but not a member of the other team.Initially, all players are able to be players. For some reasons, sometimes some soldiers become unable to be players. Sometimes some soldiers, that were unable to be players, become able to be players. At any time any soldier is able to be an assistant. Masha wants to control the efficiency of the army, so she asked you to tell her the number of different possible teams modulo1000000007(109+ 7) after each change.InputThe first line contains single integern(1 ≤n≤ 105) — the number of soldiers in Uzhlyandia.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 109) — the soldiers' skills.The third line contains single integerm(1 ≤m≤ 105) — the number of changes.The nextmlines contain the changes, each change is described with two integerstandx(1 ≤t≤ 2,1 ≤x≤n) on a separate line. Ift= 1, then thex-th soldier is unable to be a player after this change. Ift= 2, then thex-th soldier is able to be a player after this change.It is guaranteed that before each query of the first type the soldier is able to be a player, and before each query of the second type the soldier is unable to be a player.OutputPrintmintegers — the number of distinct teams after each change.Print the answers modulo1000000007(109+ 7).ExamplesInput61 1 1 1 1 121 32 3Output16Input83 4 4 2 4 5 4 131 52 51 2Output162NoteIn the first example, after the first change the only team consists of soldiers[1, 2, 4, 5, 6]. After the second change any five soldiers can form a team.In the first example after the first change the only team is soldiers[1, 2, 3, 7, 8]. After the second change the possible teams are:[1, 2, 3, 5, 7],[1, 2, 3, 5, 8],[1, 2, 3, 7, 8],[1, 2, 5, 7, 8],[1, 3, 5, 7, 8],[2, 3, 5, 7, 8]. After the third change the possible teams are:[1, 3, 5, 7, 8],[2, 3, 5, 7, 8].", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b8bf52a9", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers, $a_1, a_2, ..., a_n$, representing the skills of $n$ soldiers.  You need to find the number of different teams of 5 soldiers that can be formed, subject to the following rules:\n\n* The team must consist of 3 players with equal skills, and 2 assistants.\n* The assistants' skills must be less than or equal to the players' skills.\n* One assistant must be to the left of the players, and the other to the right.\n\nThere will be $m$ updates to the array. Each update will specify an index $x$ and a type $t$:\n\n* If $t=1$, then soldier $x$ becomes unable to be a player.\n* If $t=2$, then soldier $x$ becomes able to be a player.\n\nAfter each update, you need to output the number of distinct teams that can be formed, modulo $10^9 + 7$."}, {"prompt_md5": "a41dcab6", "template_md5": "465699a0", "result": "You are given a list of numbers representing the skills of soldiers.  You need to find the number of different groups of 5 soldiers that can be formed, where:\n\n* The first 3 soldiers in each group have the same skill.\n* The remaining 2 soldiers have skills less than or equal to the first 3.\n* One of the remaining 2 soldiers must be to the left of the first 3, and the other must be to the right.\n\nThe list of soldiers' skills can change over time. After each change, you need to recalculate the number of possible groups."}]}