{"uid": "789-B", "url": "https://codeforces.com/contest/789/problem/B", "tags": ["brute force", " implementation", " math"], "title": "789-B", "statement": "B. Masha and geometric depressiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMasha really loves algebra. On the last lesson, her strict teacher Dvastan gave she new exercise.You are given geometric progressionbdefined by two integersb1andq. Remind that a geometric progression is a sequence of integersb1,b2,b3, ..., where for eachi> 1the respective term satisfies the conditionbi=bi- 1·q, whereqis called the common ratio of the progression. Progressions in Uzhlyandia are unusual: bothb1andqcan equal0. Also, Dvastan gave Masham\"bad\" integersa1,a2, ...,am, and an integerl.Masha writes all progression terms one by one onto the board (including repetitive) while condition|bi| ≤lis satisfied (|x|means absolute value ofx). There is an exception: if a term equals one of the \"bad\" integers, Masha skips it (doesn't write onto the board) and moves forward to the next term.But the lesson is going to end soon, so Masha has to calculate how many integers will be written on the board. In order not to get into depression, Masha asked you for help: help her calculate how many numbers she will write, or print \"inf\" in case she needs to write infinitely many integers.InputThe first line of input contains four integersb1,q,l,m(-109≤b1,q≤ 109,1 ≤l≤ 109,1 ≤m≤ 105) — the initial term and the common ratio of progression, absolute value of maximal number that can be written on the board and the number of \"bad\" integers, respectively.The second line containsmdistinct integersa1,a2, ...,am(-109≤ai≤ 109)— numbers that will never be written on the board.OutputPrint the only integer, meaning the number of progression terms that will be written on the board if it is finite, or \"inf\" (without quotes) otherwise.ExamplesInput3 2 30 46 14 25 48Output3Input123 1 2143435 4123 11 -5453 141245Output0Input123 1 2143435 454343 -13 6 124OutputinfNoteIn the first sample case, Masha will write integers3, 12, 24. Progression term6will be skipped because it is a \"bad\" integer. Terms bigger than24won't be written because they exceedlby absolute value.In the second case, Masha won't write any number because all terms are equal123and this is a \"bad\" integer.In the third case, Masha will write infinitely integers123.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7cf3888c", "template_md5": "35d339e4", "result": "You are given a geometric progression defined by the first term $b_1$ and the common ratio $q$.  You are also given a maximum value $l$ and a list of $m$ \"bad\" integers.\n\nWrite down the terms of the geometric progression, but skip any term that is equal to a \"bad\" integer.  Stop writing terms when the absolute value of a term exceeds $l$.\n\nCount how many terms you wrote down. If you can write down infinitely many terms, output \"inf\"."}, {"prompt_md5": "cc448193", "template_md5": "465699a0", "result": "Given a starting number and a common ratio, generate a sequence of numbers.  If a number in the sequence is in a list of forbidden numbers, skip it.  Stop generating numbers when a number exceeds a given limit. Count how many numbers are generated.  If the sequence continues infinitely, output \"inf\"."}]}