{"uid": "789-A", "url": "https://codeforces.com/contest/789/problem/A", "tags": ["implementation", " math"], "title": "789-A", "statement": "A. Anastasia and pebblestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAnastasia loves going for a walk in Central Uzhlyandian Park. But she became uninterested in simple walking, so she began to collect Uzhlyandian pebbles. At first, she decided to collect all the pebbles she could find in the park.She has onlytwo pockets. She can put at mostkpebbles in each pocket at the same time. There arendifferent pebble types in the park, and there arewipebbles of thei-th type. Anastasia is very responsible, so she never mixes pebbles of different types in same pocket. However, she can put different kinds of pebbles in different pockets at the same time. Unfortunately, she can't spend all her time collecting pebbles, so she can collect pebbles from the park only once a day.Help her to find the minimum number of days needed to collect all the pebbles of Uzhlyandian Central Park, taking into consideration that Anastasia can't place pebbles of different types in same pocket.InputThe first line contains two integersnandk(1 ≤n≤ 105,1 ≤k≤ 109) — the number of different pebble types and number of pebbles Anastasia can place in one pocket.The second line containsnintegersw1,w2, ...,wn(1 ≤wi≤ 104) — number of pebbles of each type.OutputThe only line of output contains one integer — the minimum number of days Anastasia needs to collect all the pebbles.ExamplesInput3 22 3 4Output3Input5 43 1 8 9 7Output5NoteIn the first sample case, Anastasia can collect all pebbles of the first type on the first day, of second type — on the second day, and of third type — on the third day.Optimal sequence of actions in the second sample case:In the first day Anastasia collects8pebbles of the third type.In the second day she collects8pebbles of the fourth type.In the third day she collects3pebbles of the first type and1pebble of the fourth type.In the fourth day she collects7pebbles of the fifth type.In the fifth day she collects1pebble of the second type.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "28caa7eb", "template_md5": "35d339e4", "result": "You are given $n$ types of pebbles and the number of pebbles of each type ($w_1, w_2, ..., w_n$). You have two pockets, each with a capacity of $k$ pebbles. You can only put pebbles of the same type in a pocket.  \n\nFind the minimum number of days needed to collect all the pebbles, visiting the park only once per day."}, {"prompt_md5": "3989bdee", "template_md5": "465699a0", "result": "You have a limited capacity for carrying items. There are multiple types of items, each with a specific quantity. Find the minimum number of trips needed to collect all the items."}]}