{"uid": "79-D", "url": "https://codeforces.com/contest/79/problem/D", "tags": ["bitmasks", " dp", " shortest paths"], "title": "79-D", "statement": "D. Passwordtime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutFinally Fox Ciel arrived in front of her castle!She have to type a password to enter her castle. An input device attached to her castle is a bit unusual.The input device is a1 ×nrectangle divided intonsquare panels. They are numbered1tonfrom left to right. Each panel has a state either ON or OFF. Initially all panels are in the OFF state. She can enter her castle if and only ifx1-th,x2-th,...,xk-th panels are in the ON state and other panels are in the OFF state.She is given an arraya1,...,al. In each move, she can perform the following operation: choose an indexi(1 ≤i≤l), choose consecutiveaipanels, and flip the states of those panels (i.e. ON→OFF, OFF→ON).Unfortunately she forgets how to type the password with only above operations. Determine the minimal number of operations required to enter her castle.InputThe first line contains three integersn,kandl(1 ≤n≤ 10000, 1 ≤k≤ 10, 1 ≤l≤ 100), separated by single spaces.The second line containskintegersx1, ...,xk(1 ≤x1<x2< ... <xk≤n), separated by single spaces.The third line containslintegersa1, ...,al(1 ≤ai≤n), separated by single spaces. It is possible that some elements of the arrayaiare equal value.OutputPrint the minimal number of moves required to type the password. If it's impossible, print-1.ExamplesInput10 8 21 2 3 5 6 7 8 93 5Output2Input3 2 11 23Output-1NoteOne possible way to type the password in the first example is following: In the first move, choose 1st, 2nd, 3rd panels and flip those panels. In the second move, choose 5th, 6th, 7th, 8th, 9th panels and flip those panels.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f40315dc", "template_md5": "35d339e4", "result": "You are given a rectangular grid of $n$ panels, numbered from 1 to $n$.  Initially, all panels are off.  You need to turn on a specific set of $k$ panels, numbered $x_1, x_2, ..., x_k$, to unlock a door.\n\nYou can perform the following operation:\n\n* Choose an index $i$ and flip the state (on/off) of a consecutive group of $a_i$ panels starting at position $i$.\n\nDetermine the minimum number of operations required to turn on the correct set of panels. If it's impossible to turn on the correct panels, output -1.\n\n**Input:**\n\n* The first line contains three integers: $n$, $k$, and $l$ ($1 \\le n \\le 10000$, $1 \\le k \\le 10$, $1 \\le l \\le 100$).\n* The second line contains $k$ integers: $x_1, x_2, ..., x_k$ ($1 \\le x_1 < x_2 < ... < x_k \\le n$).\n* The third line contains $l$ integers: $a_1, a_2, ..., a_l$ ($1 \\le a_i \\le n$).\n\n**Output:**\n\n* Print the minimum number of operations required. If it's impossible, print -1."}, {"prompt_md5": "6d9cb5f6", "template_md5": "465699a0", "result": "You have a line of switches.  You need to turn on a specific set of switches in a specific order. You can flip a group of consecutive switches at a time. What is the fewest flips needed to turn on the correct switches?"}]}