{"uid": "793-B", "url": "https://codeforces.com/contest/793/problem/B", "tags": ["dfs and similar", " graphs", " implementation", " shortest paths"], "title": "793-B", "statement": "B. Igor and his way to worktime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWoken up by the alarm clock Igor the financial analyst hurried up to the work. He ate his breakfast and sat in his car. Sadly, when he opened his GPS navigator, he found that some of the roads in Bankopolis, the city where he lives, are closed due to road works. Moreover, Igor has some problems with the steering wheel, so he can makeno more than two turnson his way to his office in bank.Bankopolis looks like a grid ofnrows andmcolumns. Igor should find a way from his home to the bank that has no more than two turns and doesn't contain cells with road works, or determine that it is impossible and he should work from home. A turn is a change in movement direction. Igor's car can only move to the left, to the right, upwards and downwards. Initially Igor can choose any direction. Igor is still sleepy, so you should help him.InputThe first line contains two integersnandm(1 ≤n,m≤ 1000) — the number of rows and the number of columns in the grid.Each of the nextnlines containsmcharacters denoting the corresponding row of the grid. The following characters can occur:\".\" — an empty cell;\"*\" — a cell with road works;\"S\" — the cell where Igor's home is located;\"T\" — the cell where Igor's office is located.It is guaranteed that \"S\" and \"T\" appear exactly once each.OutputIn the only line print \"YES\" if there is a path between Igor's home and Igor's office with no more than two turns, and \"NO\" otherwise.ExamplesInput5 5..S..****.T....****......OutputYESInput5 5S....****.......****..T..OutputNONoteThe first sample is shown on the following picture:In the second sample it is impossible to reach Igor's office using less that4turns, thus there exists no path using no more than2turns. The path using exactly4turns is shown on this picture:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "24d39b4c", "template_md5": "35d339e4", "result": "Given a grid of size $n \\times m$ representing a city, determine if there is a path from a starting cell \"S\" to a destination cell \"T\" with at most two turns. \n\nThe grid contains the following characters:\n\n* \".\" : Empty cell\n* \"*\" : Cell with road works (cannot be traversed)\n* \"S\" : Starting cell\n* \"T\" : Destination cell\n\nThe path can only move horizontally or vertically.  \n\nOutput \"YES\" if a valid path exists, otherwise output \"NO\"."}, {"prompt_md5": "dc5f47d2", "template_md5": "465699a0", "result": "Given a grid with obstacles and two points, find a path between them with at most two turns."}]}