{"uid": "796-F", "url": "https://codeforces.com/contest/796/problem/F", "tags": ["bitmasks", " data structures", " greedy"], "title": "796-F", "statement": "F. Sequence Recoverytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputZane once had agoodsequenceaconsisting ofnintegersa1,a2, ...,an— but he has lost it.A sequence is said to begoodif and only if all of its integers are non-negative and do not exceed109in value.However, Zane remembers having played around with his sequence by applyingmoperations to it.There are two types of operations:1. Find the maximum value of integers with indicesisuch thatl≤i≤r, givenlandr.2. Assigndas the value of the integer with indexk, givenkandd.After he finished playing, he restored his sequence to the state it was before any operations were applied. That is, sequenceawas no longer affected by the applied type 2 operations. Then, he lost his sequence at some time between now and then.Fortunately, Zane remembers all the operations and the order he applied them to his sequence, along with thedistinctresults of all type 1 operations. Moreover, among allgoodsequences that would produce the same results when the same operations are applied in the same order, he knows that his sequenceahas the greatestcuteness.We definecutenessof a sequence as the bitwise OR result of all integers in such sequence. For example, thecutenessof Zane's sequenceaisa1ORa2OR...ORan.Zane understands that it might not be possible to recover exactly the lost sequence given his information, so he would be happy to get anygoodsequencebconsisting ofnintegersb1,b2, ...,bnthat:1. would give the same results when the same operations are applied in the same order, and2. has the samecutenessas that of Zane's original sequencea.If there is such a sequence, find it. Otherwise, it means that Zane must have remembered something incorrectly, which is possible.InputThe first line contains two integersnandm(1 ≤n,m≤ 3·105) — the number of integers in Zane's original sequence and the number of operations that have been applied to the sequence, respectively.Thei-th of the followingmlines starts with one integerti() — the type of thei-th operation.If the operation is type 1 (ti= 1), then three integersli,ri, andxifollow (1 ≤li≤ri≤n,0 ≤xi≤ 109) — the leftmost index to be considered, the rightmost index to be considered, and the maximum value of all integers with indices betweenliandri, inclusive, respectively.If the operation is type 2 (ti= 2), then two integerskianddifollow (1 ≤ki≤n,0 ≤di≤ 109) — meaning that the integer with indexkishould becomediafter this operation.It is guaranteed thatxi≠xjfor all pairs(i,j)where1 ≤i<j≤mandti=tj= 1.The operations are given in the same order they were applied. That is, the operation that is given first was applied first, the operation that is given second was applied second, and so on.OutputIf there does not exist a validgoodsequence, print \"NO\" (without quotation marks) in the first line.Otherwise, print \"YES\" (without quotation marks) in the first line, and printnspace-separated integersb1,b2, ...,bn(0 ≤bi≤ 109) in the second line.If there are multiple answers, print any of them.ExamplesInput5 41 1 5 191 2 5 12 5 1001 1 5 100OutputYES19 0 0 0 1Input5 21 1 5 01 1 5 100OutputNONoteIn the first sample, it is easy to verify that thisgoodsequence is valid. In particular, itscutenessis19OR0OR0OR0OR1=19.In the second sample, the two operations clearly contradict, so there is no suchgoodsequence.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ccad1b23", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers.  You are also given a list of operations that were performed on the sequence.  The operations are of two types:\n\n1. **Find the maximum:** Find the maximum value of the integers in the sequence from index $l$ to index $r$.\n2. **Assign value:** Set the integer at index $k$ to the value $d$.\n\nYou know the results of all the \"Find the maximum\" operations, but you don't know the original sequence.  You also know that the original sequence had certain properties:\n\n* All integers in the sequence were non-negative.\n* All integers in the sequence were less than or equal to $10^9$.\n\nYou want to find a sequence that satisfies the following:\n\n* When the same operations are applied to this sequence, it produces the same results as the original sequence.\n* The bitwise OR of all the integers in this sequence is the same as the bitwise OR of all the integers in the original sequence.\n\nIf such a sequence exists, print \"YES\" followed by the sequence. Otherwise, print \"NO\"."}, {"prompt_md5": "73659020", "template_md5": "465699a0", "result": "You are given a sequence of numbers and a list of operations performed on it. Some operations find the maximum value within a range of numbers, and others change a specific number.  \n\nYou need to find a new sequence that:\n\n1. Produces the same results when the same operations are applied.\n2. Has the same bitwise OR of all its numbers as the original sequence.\n\nIf such a sequence exists, output \"YES\" followed by the sequence. Otherwise, output \"NO\"."}]}