{"uid": "798-D", "url": "https://codeforces.com/contest/798/problem/D", "tags": ["constructive algorithms", " sortings"], "title": "798-D", "statement": "D. Mike and distributiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMike has always been thinking about the harshness of social inequality. He's so obsessed with it that sometimes it even affects him while solving problems. At the moment, Mike has two sequences of positive integersA= [a1,a2, ...,an]andB= [b1,b2, ...,bn]of lengthneach which he uses to ask people some quite peculiar questions.To test you on how good are you at spotting inequality in life, he wants you to find an\"unfair\"subset of the original sequence. To be more precise, he wants you to selectknumbersP= [p1,p2, ...,pk]such that1 ≤pi≤nfor1 ≤i≤kand elements inPare distinct. SequencePwill represent indices of elements that you'll select from both sequences. He calls such a subsetP\"unfair\"if and only if the following conditions are satisfied:2·(ap1+ ... +apk)isgreaterthan the sum of all elements from sequenceA, and2·(bp1+ ... +bpk)isgreaterthan the sum of all elements from the sequenceB. Also,kshould be smaller or equal tobecause it will be to easy to find sequencePif he allowed you to select too many elements!Mike guarantees you that a solution will always exist given the conditions described above, so please help him satisfy his curiosity!InputThe first line contains integern(1 ≤n≤ 105) — the number of elements in the sequences.On the second line there arenspace-separated integersa1, ...,an(1 ≤ai≤ 109) — elements of sequenceA.On the third line there are alsonspace-separated integersb1, ...,bn(1 ≤bi≤ 109) — elements of sequenceB.OutputOn the first line output an integerkwhich represents the size of the found subset.kshould be less or equal to.On the next line printkintegersp1,p2, ...,pk(1 ≤pi≤n) — the elements of sequenceP. You can print the numbers in any order you want. Elements in sequencePshould be distinct.ExampleInput58 7 4 8 34 2 5 3 7Output31 4 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "50fe7698", "template_md5": "35d339e4", "result": "You are given two sequences of positive integers, A and B, of length n.  Find a subset P of k indices (where k ≤ n) from the sequences such that:\n\n*  2 * (a<sub>p1</sub> + a<sub>p2</sub> + ... + a<sub>pk</sub>) > sum of all elements in A\n*  2 * (b<sub>p1</sub> + b<sub>p2</sub> + ... + b<sub>pk</sub>) > sum of all elements in B\n\nOutput:\n\n* The size of the subset k\n* The k indices p<sub>1</sub>, p<sub>2</sub>, ..., p<sub>k</sub> \n\n\n\nNote:  The indices in P must be distinct.  A solution always exists."}, {"prompt_md5": "932d3406", "template_md5": "465699a0", "result": "You are given two lists of numbers. Find the largest number of elements you can select from each list so that the sum of twice the selected elements from the first list is greater than the sum of all elements in the first list, and the sum of twice the selected elements from the second list is greater than the sum of all elements in the second list."}]}