{"uid": "798-C", "url": "https://codeforces.com/contest/798/problem/C", "tags": ["dp", " greedy", " number theory"], "title": "798-C", "statement": "C. Mike and gcd problemtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMike has a sequenceA= [a1,a2, ...,an]of lengthn. He considers the sequenceB= [b1,b2, ...,bn]beautiful if thegcdof all its elements is bigger than1, i.e..Mike wants to change his sequence in order to make it beautiful. In one move he can choose an indexi(1 ≤i<n), delete numbersai,ai+ 1and put numbersai-ai+ 1,ai+ai+ 1in their place instead, in this order. He wants perform as few operations as possible. Find the minimal number of operations to make sequenceAbeautiful if it's possible, or tell him that it is impossible to do so.is the biggest non-negative numberdsuch thatddividesbifor everyi(1 ≤i≤n).InputThe first line contains a single integern(2 ≤n≤ 100 000) — length of sequenceA.The second line containsnspace-separated integersa1,a2, ...,an(1 ≤ai≤ 109) — elements of sequenceA.OutputOutput on the first line \"YES\" (without quotes) if it is possible to make sequenceAbeautiful by performing operations described above, and \"NO\" (without quotes) otherwise.If the answer was \"YES\", output the minimal number of moves needed to make sequenceAbeautiful.ExamplesInput21 1OutputYES1Input36 2 4OutputYES0Input21 3OutputYES1NoteIn the first example you can simply make one move to obtain sequence[0, 2]with.In the second example thegcdof the sequence is already greater than1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1cc785e1", "template_md5": "35d339e4", "result": "You are given a sequence of numbers. You can perform the following operation on the sequence:\n\n1. Choose an index *i* (where 1 ≤ *i* < *n*)\n2. Delete the numbers at indices *i* and *i+1*.\n3. Insert the numbers *a<sub>i-1</sub>* *a<sub>i+1</sub>* into the sequence at indices *i* and *i+1* respectively.\n\nThe goal is to determine the minimum number of operations required to make the greatest common divisor (GCD) of all the numbers in the sequence greater than 1. If it is impossible to achieve this, output \"NO\". \n\n**Input:**\n\n* The first line contains an integer *n* (2 ≤ *n* ≤ 100,000), the length of the sequence.\n* The second line contains *n* space-separated integers *a<sub>1</sub>*, *a<sub>2</sub>*, ..., *a<sub>n</sub>* (1 ≤ *a<sub>i</sub>* ≤ 10<sup>9</sup>), the elements of the sequence.\n\n**Output:**\n\n* If it is possible to make the GCD greater than 1, output \"YES\" followed by the minimum number of operations.\n* If it is impossible, output \"NO\"."}, {"prompt_md5": "6ae29fbc", "template_md5": "465699a0", "result": "You are given a list of numbers. You can merge two adjacent numbers into a new number by adding them together.  Determine the fewest times you need to do this to make the greatest common divisor of all the numbers in the list greater than 1. If it's impossible, say so."}]}