{"uid": "799-C", "url": "https://codeforces.com/contest/799/problem/C", "tags": ["binary search", " data structures", " implementation"], "title": "799-C", "statement": "C. Fountainstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputArkady plays Gardenscapes a lot. Arkady wants to build two new fountains. There arenavailable fountains, for each fountain its beauty and cost are known. There are two types of money in the game: coins and diamonds, so each fountain cost can be either in coins or diamonds. No money changes between the types are allowed.Help Arkady to find two fountains with maximum total beauty so that he can buy both at the same time.InputThe first line contains three integersn,candd(2 ≤n≤ 100 000,0 ≤c,d≤ 100 000) — the number of fountains, the number of coins and diamonds Arkady has.The nextnlines describe fountains. Each of these lines contain two integersbiandpi(1 ≤bi,pi≤ 100 000) — the beauty and the cost of thei-th fountain, and then a letter \"C\" or \"D\", describing in which type of money is the cost of fountaini: in coins or in diamonds, respectively.OutputPrint the maximum total beauty of exactly two fountains Arkady can build. If he can't build two fountains, print0.ExamplesInput3 7 610 8 C4 3 C5 6 DOutput9Input2 4 52 5 C2 1 DOutput0Input3 10 105 5 C5 5 C10 11 DOutput10NoteIn the first example Arkady should build the second fountain with beauty4, which costs3coins. The first fountain he can't build because he don't have enough coins. Also Arkady should build the third fountain with beauty5which costs6diamonds. Thus the total beauty of built fountains is9.In the second example there are two fountains, but Arkady can't build both of them, because he needs5coins for the first fountain, and Arkady has only4coins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "98e6fd3c", "template_md5": "35d339e4", "result": "There are $n$ fountains, each with a beauty value ($b_i$) and a cost ($p_i$) in either coins or diamonds. You have $c$ coins and $d$ diamonds.  Find the two fountains with the maximum total beauty that you can buy at the same time. If you can't buy two fountains, print 0. \n\nInput:\n\n* The first line contains three integers: $n$, $c$, and $d$.\n* The next $n$ lines describe each fountain: $b_i$, $p_i$, and \"C\" or \"D\" indicating the currency.\n\nOutput:\n\n* Print the maximum total beauty of the two fountains you can buy."}, {"prompt_md5": "ffe3a5ae", "template_md5": "465699a0", "result": "You have a limited amount of two types of currency. There are several items, each with a cost in one of the currencies and a value.  Find two items that can be bought with the available currency and have the highest combined value. If it's not possible to buy two items, output 0."}]}