{"uid": "799-B", "url": "https://codeforces.com/contest/799/problem/B", "tags": ["data structures", " implementation"], "title": "799-B", "statement": "B. T-shirt buyingtime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA new pack ofnt-shirts came to a shop. Each of the t-shirts is characterized by three integerspi,aiandbi, wherepiis the price of thei-th t-shirt,aiis front color of thei-th t-shirt andbiis back color of thei-th t-shirt. All valuespiare distinct, and valuesaiandbiare integers from1to3.mbuyers will come to the shop. Each of them wants to buy exactly one t-shirt. For thej-th buyer we know his favorite colorcj.A buyer agrees to buy a t-shirt, if at least one side (front or back) is painted in his favorite color. Among all t-shirts that have colors acceptable to this buyer he will choose the cheapest one. If there are no such t-shirts, the buyer won't buy anything. Assume that the buyers come one by one, and each buyer is served only after the previous one is served.You are to compute the prices each buyer will pay for t-shirts.InputThe first line contains single integern(1 ≤n≤ 200 000) — the number of t-shirts.The following line contains sequence of integersp1,p2, ...,pn(1 ≤pi≤ 1 000 000 000), wherepiequals to the price of thei-th t-shirt.The following line contains sequence of integersa1,a2, ...,an(1 ≤ai≤ 3), whereaiequals to the front color of thei-th t-shirt.The following line contains sequence of integersb1,b2, ...,bn(1 ≤bi≤ 3), wherebiequals to the back color of thei-th t-shirt.The next line contains single integerm(1 ≤m≤ 200 000) — the number of buyers.The following line contains sequencec1,c2, ...,cm(1 ≤cj≤ 3), wherecjequals to the favorite color of thej-th buyer. The buyers will come to the shop in the order they are given in the input. Each buyer is served only after the previous one is served.OutputPrint to the first linemintegers — thej-th integer should be equal to the price of the t-shirt which thej-th buyer will buy. If thej-th buyer won't buy anything, print-1.ExamplesInput5300 200 400 500 9111 2 1 2 32 1 3 2 162 3 1 2 1 1Output200 400 300 500 911 -1Input21000000000 11 11 222 1Output1 1000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9aeba782", "template_md5": "35d339e4", "result": "There are $n$ t-shirts, each with a price ($p_i$), a front color ($a_i$), and a back color ($b_i$).  There are $m$ buyers, each with a favorite color ($c_j$). \n\nEach buyer will buy a t-shirt if at least one side of the t-shirt matches their favorite color. They will choose the cheapest t-shirt that meets this condition. If no t-shirt matches their favorite color, they will not buy anything.\n\nDetermine the price each buyer will pay for a t-shirt. If a buyer does not buy a t-shirt, output -1."}, {"prompt_md5": "f40935d5", "template_md5": "465699a0", "result": "You are given a list of items, each with a price and two colors.  Buyers come one by one, each wanting an item with at least one of their favorite colors. They will buy the cheapest item that meets their criteria.  Output the price each buyer pays, or -1 if they buy nothing."}]}