{"uid": "8-D", "url": "https://codeforces.com/contest/8/problem/D", "tags": ["binary search", " geometry"], "title": "8-D", "statement": "D. Two Friendstime limit per test1 secondmemory limit per test64 megabytesinputstdinoutputstdoutTwo neighbours, Alan and Bob, live in the city, where there are three buildings only: a cinema, a shop and the house, where they live. The rest is a big asphalt square.Once they went to the cinema, and the film impressed them so deeply, that when they left the cinema, they did not want to stop discussing it.Bob wants to get home, but Alan has to go to the shop first, and only then go home. So, they agreed to cover some distance together discussing the film (their common path might pass through the shop, or they might walk circles around the cinema together), and then to part each other's company and go each his own way. After they part, they will start thinking about their daily pursuits; and even if they meet again, they won't be able to go on with the discussion. Thus, Bob's path will be a continuous curve, having the cinema and the house as its ends. Alan's path — a continuous curve, going through the shop, and having the cinema and the house as its ends.The film ended late, that's why the whole distance covered by Alan should not differ from the shortest one by more thant1, and the distance covered by Bob should not differ from the shortest one by more thant2.Find the maximum distance that Alan and Bob will cover together, discussing the film.InputThe first line contains two integers:t1,t2(0 ≤t1,t2≤ 100). The second line contains the cinema's coordinates, the third one — the house's, and the last line — the shop's.All the coordinates are given in meters, are integer, and do not exceed 100 in absolute magnitude. No two given places are in the same building.OutputIn the only line output one number — the maximum distance that Alan and Bob will cover together, discussing the film. Output the answer accurate to not less than 4 decimal places.ExamplesInput0 20 04 0-3 0Output1.0000000000Input0 00 02 01 0Output2.0000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "98c25fb1", "template_md5": "35d339e4", "result": "There are three points: a cinema, a shop, and a house.  You are given the coordinates of each point.\n\nTwo people need to travel from the cinema to the house. One person must first go to the shop.\n\n* The first person's path must be within $t_1$ meters of the shortest path from the cinema to the house, passing through the shop.\n* The second person's path must be within $t_2$ meters of the shortest path from the cinema to the house.\n\nFind the maximum distance the two people can travel together along their paths. \n\n\nLet me know if you'd like me to clarify any part of this!"}, {"prompt_md5": "b08aad78", "template_md5": "465699a0", "result": "Two people need to travel from a cinema to a house, with one person also needing to stop at a shop along the way.  They want to walk together for as long as possible before going their separate ways.  The total distance each person travels must be within a certain range of the shortest possible distance. Find the maximum distance they can walk together."}]}