{"uid": "80-B", "url": "https://codeforces.com/contest/80/problem/B", "tags": ["geometry", " math"], "title": "80-B", "statement": "B. Depressiontime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutDo you remember a kind cartoon \"Beauty and the Beast\"? No, no, there was no firing from machine guns or radiation mutants time-travels!There was a beauty named Belle. Once she had violated the Beast's order and visited the West Wing. After that she was banished from the castle...Everybody was upset. The beautiful Belle was upset, so was the Beast, so was Lumiere the candlestick. But the worst thing was that Cogsworth was upset. Cogsworth is not a human, but is the mantel clock, which was often used as an alarm clock.Due to Cogsworth's frustration all the inhabitants of the castle were in trouble: now they could not determine when it was time to drink morning tea, and when it was time for an evening stroll.Fortunately, deep in the basement are lying digital clock showing the time in the formatHH:MM. Now the residents of the castle face a difficult task. They should turn Cogsworth's hour and minute mustache hands in such a way, that Cogsworth began to show the correct time. Moreover they need to find turn angles in degrees for each mustache hands. The initial time showed by Cogsworth is12:00.You can only rotate the hands forward, that is, as is shown in the picture:As since there are many ways too select such angles because of full rotations, choose the smallest angles in the right (non-negative) direction.Note that Cogsworth's hour and minute mustache hands move evenly and continuously. Hands are moving independently, so when turning one hand the other hand remains standing still.InputThe only line of input contains current time according to the digital clock, formatted asHH:MM(00 ≤HH≤ 23,00 ≤MM≤ 59). The mantel clock initially shows12:00.Pretests contain times of the beginning of some morning TV programs of the Channel One Russia.OutputPrint two numbersxandy— the angles of turning the hour and minute hands, respectively (0 ≤x,y< 360). The absolute or relative error in the answer should not exceed10- 9.ExamplesInput12:00Output0 0Input04:30Output135 180Input08:17Output248.5 102NoteA note to the second example:the hour hand will be positioned exactly in the middle, between 4 and 5.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1f055762", "template_md5": "35d339e4", "result": "A clock initially shows 12:00.  You are given a time in HH:MM format.  \n\nYou need to determine the angles, in degrees, that you need to rotate the hour and minute hands of the clock to show the given time.  \n\nThe hands can only be rotated forward (clockwise).  \n\nThe smallest possible angles should be used. \n\nInput:\n\nA single line containing the time in HH:MM format.\n\nOutput:\n\nTwo numbers, separated by a space, representing the angle to rotate the hour hand and the minute hand, respectively.  The angles should be in degrees and be between 0 and 360."}, {"prompt_md5": "be2cd755", "template_md5": "465699a0", "result": "A clock is initially set to 12:00. You need to determine the angle to rotate the hour and minute hands to show a given time.  The hands can only be rotated forward. Find the smallest possible angles."}]}