{"uid": "801-B", "url": "https://codeforces.com/contest/801/problem/B", "tags": ["constructive algorithms", " greedy", " strings"], "title": "801-B", "statement": "B. Valued Keystime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou found a mysterious functionf. The function takes two stringss1ands2. These strings must consist only of lowercase English letters, and must be the same length.The output of the functionfis another string of the same length. Thei-th character of the output is equal to the minimum of thei-th character ofs1and thei-th character ofs2.For example,f(\"ab\", \"ba\")= \"aa\", andf(\"nzwzl\", \"zizez\")= \"niwel\".You found two stringsxandyof the same length and consisting of only lowercase English letters. Find any stringzsuch thatf(x,z) =y, or print-1if no such stringzexists.InputThe first line of input contains the stringx.The second line of input contains the stringy.Bothxandyconsist only of lowercase English letters,xandyhave same length and this length is between1and100.OutputIf there is no stringzsuch thatf(x,z) =y, print-1.Otherwise, print a stringzsuch thatf(x,z) =y. If there are multiple possible answers, print any of them. The stringzshould be the same length asxandyand consist only of lowercase English letters.ExamplesInputabaaOutputbaInputnzwzlniwelOutputxiyezInputabbaOutput-1NoteThe first case is from the statement.Another solution for the second case is \"zizez\"There is no solution for the third case. That is, there is nozsuch thatf(\"ab\",z) =\"ba\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c790f3e7", "template_md5": "35d339e4", "result": "You are given two strings,  $x$ and $y$, of the same length, consisting only of lowercase English letters. \n\nA function $f$ takes two strings of the same length and produces a new string of the same length. The $i$-th character of the output string is the minimum of the $i$-th character of the first input string and the $i$-th character of the second input string.\n\nFor example:\n\n* $f(\"ab\", \"ba\") = \"aa\"$\n* $f(\"nzwzl\", \"zizez\") = \"niwel\"$\n\nFind a string $z$ such that $f(x, z) = y$. If no such string $z$ exists, print -1. \n\n\n\nIf there are multiple possible answers, print any one of them."}, {"prompt_md5": "ed3cd9db", "template_md5": "465699a0", "result": "You are given two strings of the same length.  A function takes two strings and produces a new string where each character is the smaller of the corresponding characters in the input strings.  Find a string that, when used as input to the function with the first string, produces the second string. If no such string exists, say so."}]}