{"uid": "802-D", "url": "https://codeforces.com/contest/802/problem/D", "tags": ["math"], "title": "802-D", "statement": "D. Marmots (easy)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputHeidi is a statistician to the core, and she likes to study the evolution of marmot populations in each ofV(1 ≤V≤ 100) villages! So it comes that every spring, when Heidi sees the first snowdrops sprout in the meadows around her barn, she impatiently dons her snowshoes and sets out to the Alps, to welcome her friends the marmots to a new season of thrilling adventures.Arriving in a village, Heidi asks each and every marmot she comes across for the number of inhabitants of that village. This year, the marmots decide to play an April Fools' joke on Heidi. Instead of consistently providing the exact number of inhabitantsP(10 ≤P≤ 1000) of the village, they respond with a random non-negative integerk, drawn from one of two types of probability distributions:Poisson (d'avril) distribution: the probability of getting an answerkisfork= 0, 1, 2, 3, ...,Uniform distribution: the probability of getting an answerkisfork= 0, 1, 2, ..., 2P.Heidi collects exactly 250 answers per village. Every village follows either the Poisson or the uniform distribution. Heidi cannot tell marmots apart, so she may query some marmots several times, and each time the marmot will answer with a new number drawn from the village's distribution.Can you help Heidi to find out whether a village follows a Poisson or a uniform distribution?InputThe first line of input will contain the number of villagesV(1 ≤V≤ 100). The followingVlines each describe one village. The description of each village consists of 250 space-separated integersk, drawn from one of the above distributions.OutputOutput one line per village, in the same order as provided in the input. The village's line shall statepoissonif the village's distribution is of the Poisson type, anduniformif the answer came from a uniform distribution.ExampleInput292 100 99 109 93 105 103 106 101 99 ... (input is truncated)28 180 147 53 84 80 180 85 8 16 ... (input is truncated)OutputpoissonuniformNoteThe full example input is visually represented below, along with the probability distribution function it was drawn from (they-axis is labeled by its values multiplied by 250).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6809e50d", "template_md5": "35d339e4", "result": "There are $V$ villages ($1 \\le V \\le 100$).  Each village has a population of marmots.  \n\nFor each village, you are given 250 integers, each representing the number of marmots in the village as reported by a randomly selected marmot.  \n\nThere are two possible distributions for the marmot reports:\n\n* **Poisson Distribution:** The probability of a marmot reporting $k$ is given by a Poisson distribution.\n* **Uniform Distribution:** The probability of a marmot reporting $k$ is equal for all $k$ from 0 to $2P$, where $P$ is the actual population of the village.\n\nDetermine whether each village follows the Poisson or Uniform distribution based on the 250 reported numbers."}, {"prompt_md5": "9507a82c", "template_md5": "465699a0", "result": "You are given 100 sets of 250 numbers. Each set represents a group of data.  Each group follows either a specific pattern (Poisson) or a uniform distribution.  You need to determine which pattern each group follows based on the given numbers."}]}