{"uid": "802-F", "url": "https://codeforces.com/contest/802/problem/F", "tags": ["math", " probabilities"], "title": "802-F", "statement": "F. Marmots (hard)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYour task is the exact same as for theeasyversion. But this time, the marmots subtract the village's populationPfrom their random number before responding to Heidi's request.Also, there are now villages with as few as a single inhabitant, meaning that.Can you help Heidi find out whether a village follows a Poisson or a uniform distribution?InputSame as for the easy and medium versions. But remember that now1 ≤P≤ 1000and that the marmots may provide positive as well as negative integers.OutputOutput one line per village, in the same order as provided in the input. The village's line shall statepoissonif the village's distribution is of the Poisson type, anduniformif the answers came from a uniform distribution.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "04828620", "template_md5": "35d339e4", "result": "You are given a list of villages, each with a population $P$. For each village, you are given a set of random numbers generated by the village's inhabitants.  \n\nDetermine if the distribution of these random numbers is Poisson or uniform.\n\n**Here's how to determine the distribution:**\n\n* **Poisson Distribution:**  The probability of a given number of events occurring in a fixed interval of time or space is proportional to the exponential of the average rate of occurrence.\n* **Uniform Distribution:** Every value within a given range has an equal probability of being selected.\n\n**Input:**\n\n* A list of villages, each with its population $P$ (where $1 \\le P \\le 1000$).\n* For each village, a set of random numbers generated by its inhabitants.\n\n**Output:**\n\nFor each village, output \"poisson\" if the distribution is Poisson, and \"uniform\" if the distribution is uniform."}, {"prompt_md5": "a5298fb0", "template_md5": "465699a0", "result": "Given a list of numbers, determine if they follow a Poisson distribution or a uniform distribution.  The numbers may be positive or negative."}]}