{"uid": "802-J", "url": "https://codeforces.com/contest/802/problem/J", "tags": ["dfs and similar", " graphs", " trees"], "title": "802-J", "statement": "J. Send the Fool Further! (easy)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputHeidi's friend Jenny is asking Heidi to deliver an important letter to one of their common friends. Since Jenny is Irish, Heidi thinks that this might be a prank. More precisely, she suspects that the message she is asked to deliver states: \"Send the fool further!\", and upon reading it the recipient will ask Heidi to deliver the same message to yet another friend (that the recipient has in common with Heidi), and so on.Heidi believes that her friends want to avoid awkward situations, so she will not be made to visit the same person (including Jenny) twice. She also knows how much it costs to travel between any two of her friends who know each other. She wants to know: what is the maximal amount of money she will waste on travel if it really is a prank?Heidi'snfriends are labeled0throughn- 1, and their network of connections forms a tree. In other words, every two of her friendsa,bknow each other, possibly indirectly (there is a sequence of friends starting fromaand ending onband such that each two consecutive friends in the sequence know each other directly), and there are exactlyn- 1pairs of friends who know each other directly.Jenny is given the number0.InputThe first line of the input contains the number of friendsn(3 ≤n≤ 100). The nextn- 1lines each contain three space-separated integersu,vandc(0 ≤u,v≤n- 1,1 ≤c≤ 104), meaning thatuandvare friends (know each other directly) and the cost for travelling betweenuandvisc.It is guaranteed that the social network of the input forms a tree.OutputOutput a single integer – the maximum sum of costs.ExamplesInput40 1 40 2 22 3 3Output5Input61 2 30 2 1001 4 20 3 73 5 10Output105Input111 0 16642 0 8813 2 46704 2 15555 1 18706 2 12657 2 2888 7 22669 2 153610 6 3378Output5551NoteIn the second example, the worst-case scenario goes like this: Jenny sends Heidi to the friend labeled by number2(incurring a cost of100), then friend2sends her to friend1(costing Heidi3), and finally friend1relays her to friend4(incurring an additional cost of2).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dd9cf3c7", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, where each node represents a person. Each edge in the tree has a cost associated with it, representing the cost of traveling between the two nodes connected by the edge.\n\nYou need to find the maximum cost that will be incurred if a message is passed from one person to another, following a path through the tree, where each person passes the message to a different person they know, until the message reaches a person who has no more connections."}, {"prompt_md5": "6189eecc", "template_md5": "465699a0", "result": "You are given a network of people where each person knows each other directly or indirectly. You need to find the maximum cost of travel if you start at one person and have to visit each person in the network exactly once, without visiting anyone twice. The cost of travel between two people is given."}]}