{"uid": "803-D", "url": "https://codeforces.com/contest/803/problem/D", "tags": ["binary search", " greedy"], "title": "803-D", "statement": "D. Magazine Adtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe main city magazine offers its readers an opportunity to publish their ads. The format of the ad should be like this:There are space-separated non-empty words of lowercase and uppercase Latin letters.There are hyphen characters'-'in some words, their positions set word wrapping points. Word can include more than one hyphen.It is guaranteed that there are no adjacent spaces and no adjacent hyphens. No hyphen is adjacent to space. There are no spaces and no hyphens before the first word and after the last word.When the word is wrapped, the part of the word before hyphen and the hyphen itself stay on current line and the next part of the word is put on the next line. You can also put line break between two words, in that case the space stays on current line. Check notes for better understanding.The ad can occupy no more thatklines and should have minimal width. The width of the ad is the maximal length of string (letters, spaces and hyphens are counted) in it.You should write a program that will find minimal width of the ad.InputThe first line contains numberk(1 ≤k≤ 105).The second line contains the text of the ad — non-empty space-separated words of lowercase and uppercase Latin letters and hyphens. Total length of the ad don't exceed106characters.OutputOutput minimal width of the ad.ExamplesInput4garage for sa-leOutput7Input4Edu-ca-tion-al Ro-unds are so funOutput10NoteHere all spaces are replaced with dots.In the first example one of possible results after all word wraps looks like this:garage.for.sa-leThe second example:Edu-ca-tion-al.Ro-unds.are.so.fun", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f1f41103", "template_md5": "35d339e4", "result": "You are given a text advertisement with words separated by spaces. Some words contain hyphens (-) which act as word wrapping points.  \n\nThe advertisement must fit within $k$ lines, where $k$ is a given number.  \n\nYour task is to find the minimum width of the advertisement, where width is the maximum length of a single line (including letters, spaces, and hyphens). \n\nYou can wrap words at the hyphens and insert line breaks between words to achieve the desired layout."}, {"prompt_md5": "a72fc2b1", "template_md5": "465699a0", "result": "You are given a text advertisement with words that can be broken at hyphen points.  The ad must fit within a certain number of lines and you need to find the smallest possible width for the ad."}]}