{"uid": "803-E", "url": "https://codeforces.com/contest/803/problem/E", "tags": ["dp", " graphs"], "title": "803-E", "statement": "E. Roma and Pokertime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEach evening Roma plays online poker on his favourite website. The rules of poker on this website are a bit strange: there are always two players in a hand, there are no bets, and the winner takes1virtual bourle from the loser.Last evening Roma started to play poker. He decided to spend no more thankvirtual bourles — he will stop immediately if the number of his loses exceeds the number of his wins byk. Also Roma will leave the game if he wins enough money for the evening, i.e. if the number of wins exceeds the number of loses byk.Next morning Roma found a piece of paper with a sequence on it representing his results. Roma doesn't remember the results exactly, and some characters in the sequence are written in a way such that it's impossible to recognize this character, so Roma can't recall whether he wonkbourles or he lost.The sequence written by Roma is a stringsconsisting of charactersW(Roma won the corresponding hand),L(Roma lost),D(draw) and?(unknown result). Roma wants to restore anyvalidsequence by changing all?characters toW,LorD. The sequence is calledvalidif all these conditions are met:In the end the absolute difference between the number of wins and loses is equal tok;There is no hand such that the absolute difference before this hand was equal tok.Help Roma to restore any such sequence.InputThe first line contains two numbersn(the length of Roma's sequence) andk(1 ≤n,k≤ 1000).The second line contains the sequencesconsisting of charactersW,L,Dand?. There are exactlyncharacters in this sequence.OutputIf there is novalidsequence that can be obtained fromsby replacing all?characters byW,LorD, printNO.Otherwise print this sequence. If there are multiple answers, print any of them.ExamplesInput3 2L??OutputLDLInput3 1W??OutputNOInput20 5?LLLLLWWWWW?????????OutputWLLLLLWWWWWWWWLWLWDW", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cd257def", "template_md5": "35d339e4", "result": "You are given a sequence of characters representing the results of a game. Each character is either 'W' (win), 'L' (loss), 'D' (draw), or '?' (unknown result). \n\nThe goal is to replace all '?' characters with 'W', 'L', or 'D' to create a valid sequence. A valid sequence must satisfy these conditions:\n\n* The difference between the number of wins and losses is equal to a given integer $k$.\n* At no point during the sequence does the difference between wins and losses become equal to $k$ before it is equal to $k$ at the end.\n\nIf a valid sequence can be created, output the sequence. Otherwise, output \"NO\"."}, {"prompt_md5": "b398d391", "template_md5": "465699a0", "result": "You are given a sequence of characters representing the results of a game. Some characters are unknown.  You need to fill in the unknowns with 'W' (win), 'L' (loss), or 'D' (draw) so that:\n\n* The number of wins minus losses is always equal to a given number 'k'.\n* The number of wins minus losses never equals 'k' before a specific point in the sequence.\n\nIf it's impossible to create a valid sequence, output \"NO\". Otherwise, output any valid sequence."}]}