{"uid": "804-F", "url": "https://codeforces.com/contest/804/problem/F", "tags": ["combinatorics", " dfs and similar", " dp", " graphs", " number theory"], "title": "804-F", "statement": "F. Fake bullionstime limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputIn Isart people don't die. There arengangs of criminals. Thei-th gang containssievil people numerated from0tosi- 1. Some of these people took part in a big mine robbery and pickedonegold bullion each (these people are given in the input). That happened10100years ago and then all of the gangs escaped to a remote area, far from towns.During the years, they were copying some gold bullions according to an organized plan in order to not get arrested. They constructed atournamentdirected graph (a graph where there is exactly one directed edge between every pair of vertices) of gangs (the graph is given in the input). In this graph an edge fromutovmeans that in thei-th hour the personof the gangucan send a fake gold bullion to personof gangv. He sends it if he has some bullion (real or fake), while the receiver doesn't have any. Thus, at any moment each of the gangsters has zero or one gold bullion. Some of them have real bullions, and some of them have fake ones.In the beginning of this year, the police has finally found the gangs, but they couldn't catch them, as usual. The police decided to open a jewelry store so that the gangsters would sell the bullions. Thus, every gangster that has a bullion (fake or real) will try to sell it. If he has a real gold bullion, he sells it without problems, but if he has a fake one, there is a choice of two events that can happen:The person sells the gold bullion successfully.The person is arrested by police.The power of a gang is the number of people in it that successfully sold their bullion. After all selling is done, the police arrestsbgangs out oftopgangs. Sort the gangs by powers, we call the firstagangtopgangs(you can sort the equal powers in each order). Consider all possible results of selling fake gold bullions and all possible choice ofbgangs among thetopgangs. Count the number of different sets of thesebgangs modulo109+ 7. Two setsXandYare considered different if some gang is inXand isn't inY.InputThe first line contains four integersn,aandb(1 ≤b≤a≤n≤ 5·103) — the number of gangs, the constantsaandbfrom the statement.Thennlines follow, each line contains a string of sizenconsisting of zeros and ones. Thej-th character in thei-th of these lines is equal to1, then the vertexihave a directed edge to the vertexj. It is guaranteed thataii= 0andaij+aji= 1ifi≠j.Thennlines follow, each line starts with the integersi(1 ≤si≤ 2·106) — the number of gangsters in thei-th gang, and then contains a string of zeros and ones with lengthsi. Thej-th character is0if thej-th person of thei-th gang had a real gold bullion initially, otherwise it is1. It is guaranteed that the sum ofsidoes not exceed2·106.OutputPrint single integer: the number of different sets ofbgangs the police can arrest modulo109+ 7.ExamplesInput2 2 101005 110006 100000Output2Input5 2 100000100001101111000110102 001 16 1001101 01 0Output5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8210be9d", "template_md5": "35d339e4", "result": "You are given a directed graph with $n$ nodes, representing $n$ gangs. Each edge $(u,v)$ means that a person from gang $u$ can send a gold bullion to a person in gang $v$ in a specific hour.  \n\nEach gang has $s_i$ members, and initially, some members have a real gold bullion (represented by 0) and some have a fake one (represented by 1).\n\nThe police wants to arrest $b$ gangs out of the top $a$ gangs, where the power of a gang is the number of its members who successfully sell their bullion.  \n\nA person with a real bullion sells it successfully. A person with a fake bullion has a 50% chance of selling it successfully and a 50% chance of being arrested.\n\nYou need to find the number of different sets of $b$ gangs the police can arrest, considering all possible outcomes of selling fake bullions, modulo $10^9 + 7$.\n\n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "63f8f2a3", "template_md5": "465699a0", "result": "You are given a number of groups, each with a number of people. Each person either has a real or fake gold bar.  There are rules about how people can transfer gold bars between groups.  \n\nYou need to figure out how many different sets of groups the police could arrest, given certain constraints."}]}