{"uid": "809-D", "url": "https://codeforces.com/contest/809/problem/D", "tags": ["data structures", " dp"], "title": "809-D", "statement": "D. Hitchhiking in the Baltic Statestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLeha and Noora decided to go on a trip in the Baltic States. As you know from the previous problem, Leha has lost his car on the parking of the restaurant. Unfortunately, requests to the watchman didn't helped hacker find the car, so friends decided to go hitchhiking.In total, they intended to visitntowns. However it turned out that sights ini-th town are open for visitors only on days fromlitori.What to do? Leha proposed to choose for each townia day, when they will visit this town, i.e any integerxiin interval[li,ri]. After that Noora choses some subsequence of townsid1,id2, ...,idk, which friends are going to visit, that at first they are strictly increasing, i.eidi<idi+ 1is for all integersifrom1tok- 1, but also the dates of the friends visits are strictly increasing, i.exidi<xidi+ 1is true for all integersifrom1tok- 1.Please help Leha and Noora in choosing suchxifor each towni, and such subsequence of townsid1,id2, ...,idk, so that friends can visit maximal number of towns.You may assume, that Leha and Noora can start the trip any day.InputThe first line contains a single integern(1 ≤n≤ 3·105) denoting the number of towns Leha and Noora intended to visit.Each lineiof thensubsequent lines contains two integersli,ri(1 ≤li≤ri≤ 109), denoting that sights ini-th town are open for visitors on any day.OutputPrint a single integer denoting the maximal number of towns, that Leha and Noora can visit.ExampleInput56 61 23 42 21 4Output3NoteConsider the first example.Let's take this plan: let's visit the sight in the second town on the first day, in the third town on the third day and in the fifth town on the fourth. That's would be the optimal answer.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e4f412e8", "template_md5": "35d339e4", "result": "There are $n$ towns. Each town has a range of days ($l_i$, $r_i$) when its sights are open.  You need to choose a day to visit each town within its open range.  \n\nThen, you need to select a subsequence of towns to visit, where:\n\n* The towns are visited in strictly increasing order.\n* The days of visit for each town in the subsequence are also strictly increasing.\n\nWhat is the maximum number of towns you can visit following these rules?"}, {"prompt_md5": "9e55909c", "template_md5": "465699a0", "result": "You have a list of cities, each with a range of days it is open.  You need to choose a day to visit each city, and then select a subset of cities to visit in increasing order, with the days of visit also in increasing order. Find the maximum number of cities you can visit."}]}