{"uid": "810-A", "url": "https://codeforces.com/contest/810/problem/A", "tags": ["implementation", " math"], "title": "810-A", "statement": "A. Straight «A»time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputNoora is a student of one famous high school. It's her final year in school — she is going to study in university next year. However, she has to get an «A» graduation certificate in order to apply to a prestigious one.In school, where Noora is studying, teachers are putting down marks to the online class register, which are integers from1tok. The worst mark is1, the best isk. Mark that is going to the certificate, is calculated as an average of all the marks, rounded to the closest integer. If several answers are possible, rounding up is produced. For example,7.3is rounded to7, but7.5and7.8784— to8.For instance, if Noora has marks[8, 9], then the mark to the certificate is9, because the average is equal to8.5and rounded to9, but if the marks are[8, 8, 9], Noora will have graduation certificate with8.To graduate with «A» certificate, Noorahas to have markk.Noora gotnmarks in register this year. However, she is afraid that her marks are not enough to get final markk. Noora decided to ask for help in the internet, where hacker Leha immediately responded to her request. He is ready to hack class register for Noora and to add Noora any number of additional marks from1tok. At the same time, Leha want his hack be unseen to everyone, so he decided to add as less as possible additional marks. Please help Leha to calculate the minimal number of marks he has to add, so that final Noora's mark will become equal tok.InputThe first line contains two integersnandk(1 ≤n≤ 100, 1 ≤k≤ 100)denoting the number of marks, received by Noora and the value of highest possible mark.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤k)denoting marks received by Noora before Leha's hack.OutputPrint a single integer — minimal number of additional marks, that Leha has to add in order to change Noora's final mark tok.ExamplesInput2 108 9Output4Input3 54 4 4Output3NoteConsider the first example testcase.Maximal mark is10, Noora received two marks —8and9, so current final mark is9. To fix it, Leha can add marks[10, 10, 10, 10](4marks in total) to the registry, achieving Noora having average mark equal to. Consequently, new final mark is10. Less number of marks won't fix the situation.In the second example Leha can add[5, 5, 5]to the registry, so that making average mark equal to4.5, which is enough to have5in the certificate.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8df73681", "template_md5": "35d339e4", "result": "You are given an integer $k$ representing the target grade. You are also given $n$ integers representing a student's current grades. The student's final grade is calculated as the average of all the grades, rounded up to the nearest integer. \n\nDetermine the minimum number of additional grades the student needs to add, each ranging from 1 to $k$, to achieve the target grade $k$."}, {"prompt_md5": "7599e29e", "template_md5": "465699a0", "result": "You are given a list of scores and a target score. You can add as many scores as needed to the list, with each new score being between 1 and a given maximum. What is the minimum number of scores you need to add to make the average of all the scores equal to or greater than the target score?"}]}