{"uid": "811-A", "url": "https://codeforces.com/contest/811/problem/A", "tags": ["brute force", " implementation"], "title": "811-A", "statement": "A. Vladik and Courtesytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAt regular competition Vladik and Valera wonaandbcandies respectively. Vladik offered1his candy to Valera. After that Valera gave Vladik2his candies, so that no one thought that he was less generous. Vladik for same reason gave3candies to Valera in next turn.More formally, the guys take turns giving each other one candy more than they received in the previous turn.This continued until the moment when one of them couldn’t give the right amount of candy. Candies, which guys got from each other, theydon’t consider as their own. You need to know, who is the first who can’t give the right amount of candy.InputSingle line of input data contains two space-separated integersa,b(1 ≤a,b≤ 109) — number of Vladik and Valera candies respectively.OutputPring a single line \"Vladik’’ in case, if Vladik first who can’t give right amount of candy, or \"Valera’’ otherwise.ExamplesInput1 1OutputValeraInput7 6OutputVladikNoteIllustration for first test case:Illustration for second test case:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "09c9d73f", "template_md5": "35d339e4", "result": "Two players start with $a$ and $b$ candies respectively. They take turns giving each other candies, with the amount given increasing by 1 from the previous turn.  For example, if Player 1 gives Player 2 1 candy, then Player 2 must give Player 1 2 candies.  The first player who cannot give the required number of candies loses. Determine which player will lose first."}, {"prompt_md5": "cb66edb6", "template_md5": "465699a0", "result": "Two players start with a certain number of items. They take turns giving each other one more item than they received in the previous turn. The first player who can't give the required number of items loses. Determine which player loses first."}]}