{"uid": "811-D", "url": "https://codeforces.com/contest/811/problem/D", "tags": ["constructive algorithms", " dfs and similar", " graphs", " interactive"], "title": "811-D", "statement": "D. Vladik and Favorite Gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis is an interactive problem.Vladik has favorite game, in which he plays all his free time.Game field could be represented asn×mmatrix which consists of cells of three types:«.» — normal cell, player can visit it.«F» — finish cell, player has to finish his way there to win. There is exactly one cell of this type.«*» — dangerous cell, if player comes to this cell, he loses.Initially player is located in the left top cell with coordinates(1, 1).Player has access to4buttons \"U\", \"D\", \"L\", \"R\", each of them move player up, down, left and right directions respectively.But it’s not that easy! Sometimes friends play game and change functions of buttons. Function of buttons \"L\" and \"R\" could have been swapped, also functions of buttons \"U\" and \"D\" could have been swapped. Note that functions of buttons can be changed only at the beginning of the game.Help Vladik win the game!InputFirst line contains two space-separated integersnandm(1 ≤n,m≤ 100) — number of rows and columns respectively.Each of nextnlines containsmcharacters describing corresponding row of field. Set of characters in field is described above.Guaranteed that cell with coordinates(1, 1)is normal and there is at least one way from initial cell to finish cell without dangerous cells.InteractionYou can press buttons no more than2·n·mtimes.To press a button you should print \"U\", \"D\", \"L\", \"R\" in new line. It’s necessary to print newline character andflushoutput. After flushing buffer you should read answer from input data. Answer is the pair of space-separated integersx,y— new position of player. In case, if there is no cell in direction of moving, position will not change. If after any move player lost, in other words player move to dangerous cell, thenxandywill be equal to- 1.If after any move player is in finish or dangerous cell, then you should terminate your program.To finish output buffer (i. e. for operationflush) right after printing direction and newline you should do next:fflush(stdout)in C++System.out.flush()in Javastdout.flush()in Pythonflush(output)in Pascalread documentation for other languages.HacksTo perform a hack you should use this format:n m swapLR swapUDa_1a_2...a_nWheren,m— number of rows and columns in game field.swapLRis equal to1in case, when directions \"L’’ and \"R’’ is swapped, and equal to0otherwise.swapUDis equal to1, when directions \"U’’ and \"D’’ is swapped, and equal to0otherwise.a1,a2, ...,an— description of corresponding rows of game field.ExampleInput4 3...**.F*....1 11 21 31 32 33 34 34 24 13 1OutputRLLDUUURRDNoteIn first test case all four directions swapped with their opposite directions. Protocol of interaction In more convenient form:This test could be presenter for hack in following way:4 3 1 1...**.F*....", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dd344dfa", "template_md5": "35d339e4", "result": "You are given a 2D grid of size $n \\times m$ with the following characters:\n\n* '.' : Normal cell, can be visited.\n* 'F' : Finish cell, must be reached to win. There is exactly one 'F' cell.\n* '*' : Dangerous cell, touching this cell results in loss.\n\nThe player starts at the top-left cell (1,1).  \n\nYou can move the player using the buttons 'U' (up), 'D' (down), 'L' (left), 'R' (right). However, the buttons 'L' and 'R' might be swapped, and 'U' and 'D' might be swapped at the beginning of the game.\n\nYou have at most $2nm$ moves to reach the finish cell.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of rows and columns.\n* The next $n$ lines contain $m$ characters each, describing the grid.\n\n**Output:**\n\n* To make a move, print one of the buttons: 'U', 'D', 'L', or 'R' on a new line.\n* After each move, the program will output the player's new coordinates (x, y).\n* If the move is invalid (e.g., going out of bounds), the coordinates will not change.\n* If the player lands on a dangerous cell, the output will be (-1, -1).\n* If the player reaches the finish cell, the program should terminate.\n\n**Goal:**\n\nHelp the player reach the finish cell without touching any dangerous cells."}, {"prompt_md5": "7d56143f", "template_md5": "465699a0", "result": "You are given a grid with cells of three types: normal, finish, and dangerous. You start at the top left corner and must reach the finish cell. You can move up, down, left, or right, but the directions of the left/right and up/down buttons may be swapped. You have a limited number of moves and must avoid dangerous cells.  Your goal is to find a sequence of moves that leads to the finish cell."}]}