{"uid": "812-E", "url": "https://codeforces.com/contest/812/problem/E", "tags": ["games", " trees"], "title": "812-E", "statement": "E. Sagheer and Apple Treetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSagheer is playing a game with his best friend Soliman. He brought a tree withnnodes numbered from1tonand rooted at node1. Thei-th node hasaiapples. This tree has a special property: the lengths of all paths from the root to any leaf have the same parity (i.e. all paths have even length or all paths have odd length).Sagheer and Soliman will take turns to play. Soliman will make the first move. The player who can't make a move loses.In each move, the current player will pick a single node, take a non-empty subset of apples from it and do one of the following two things:eat the apples, if the node is a leaf.move the apples to one of the children, if the node is non-leaf.Before Soliman comes to start playing, Sagheer will makeexactly one changeto the tree. He will pick two different nodesuandvand swap the apples ofuwith the apples ofv.Can you help Sagheer count the number of ways to make the swap (i.e. to chooseuandv) after which he will win the game if both players play optimally?(u,v)and(v,u)are considered to be the same pair.InputThe first line will contain one integern(2 ≤n≤ 105)— the number of nodes in the apple tree.The second line will containnintegersa1,a2, ...,an(1 ≤ai≤ 107) — the number of apples on each node of the tree.The third line will containn- 1integersp2,p3, ...,pn(1 ≤pi≤n) — the parent of each node of the tree. Nodeihas parentpi(for2 ≤i≤n). Node1is the root of the tree.It is guaranteed that the input describes a valid tree, and the lengths of all paths from the root to any leaf will have the same parity.OutputOn a single line, print the number of different pairs of nodes(u,v),u≠vsuch that if they start playing after swapping the apples of both nodes, Sagheer will win the game.(u,v)and(v,u)are considered to be the same pair.ExamplesInput32 2 31 1Output1Input31 2 31 1Output0Input87 2 2 5 4 3 1 11 1 1 4 4 5 6Output4NoteIn the first sample, Sagheer can only win if he swapped node1with node3. In this case, both leaves will have2apples. If Soliman makes a move in a leaf node, Sagheer can make the same move in the other leaf. If Soliman moved some apples from a root to a leaf, Sagheer will eat those moved apples. Eventually, Soliman will not find a move.In the second sample, There is no swap that will make Sagheer win the game.Note that Sagheer must make the swap even if he can win with the initial tree.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c10a2a32", "template_md5": "35d339e4", "result": "There is a tree with $n$ nodes, numbered from 1 to $n$. Each node has a number of apples, denoted by $a_i$.  The tree has a special property: all paths from the root to a leaf node have the same length (either all even or all odd).\n\nTwo players take turns playing a game. The first player chooses a node and can either:\n\n* Eat all the apples from the node if it is a leaf.\n* Move some apples from the node to one of its children if it is not a leaf.\n\nThe player who cannot make a move loses.\n\nBefore the game starts, the first player can swap the apples of two different nodes.\n\nThe question is: how many ways can the first player swap the apples of two nodes so that they will definitely win the game if both players play optimally?"}, {"prompt_md5": "329bc5c2", "template_md5": "465699a0", "result": "You are given a tree with nodes containing a number of items.  Players take turns removing items from a node and either eating them (if the node is a leaf) or moving them to a child node. The game ends when a player cannot make a move.  Before the game starts, you can swap the items between two nodes.  Find the number of swaps that will allow you to win the game if both players play optimally."}]}