{"uid": "812-B", "url": "https://codeforces.com/contest/812/problem/B", "tags": ["bitmasks", " brute force", " dp"], "title": "812-B", "statement": "B. Sagheer, the Hausmeistertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSome people leave the lights at their workplaces on when they leave that is a waste of resources. As a hausmeister of DHBW, Sagheer waits till all students and professors leave the university building, then goes and turns all the lights off.The building consists ofnfloors with stairs at the left and the right sides. Each floor hasmrooms on the same line with a corridor that connects the left and right stairs passing by all the rooms. In other words, the building can be represented as a rectangle withnrows andm+ 2columns, where the first and the last columns represent the stairs, and themcolumns in the middle represent rooms.Sagheer is standing at the ground floor at the left stairs. He wants to turn all the lights off in such a way that he will not go upstairs until all lights in the floor he is standing at are off. Of course, Sagheer must visit a room to turn the light there off. It takes one minute for Sagheer to go to the next floor using stairs or to move from the current room/stairs to a neighboring room/stairs on the same floor. It takes no time for him to switch the light off in the room he is currently standing in. Help Sagheer find the minimum total time to turn off all the lights.Note that Sagheer does not have to go back to his starting position, and he does not have to visit rooms where the light is already switched off.InputThe first line contains two integersnandm(1 ≤n≤ 15and1 ≤m≤ 100) — the number of floors and the number of rooms in each floor, respectively.The nextnlines contains the building description. Each line contains a binary string of lengthm+ 2representing a floor (the left stairs, thenmrooms, then the right stairs) where0indicates that the light is off and1indicates that the light is on. The floors are listed from top to bottom, so that the last line represents the ground floor.The first and last characters of each string represent the left and the right stairs, respectively, so they are always0.OutputPrint a single integer — the minimum total time needed to turn off all the lights.ExamplesInput2 200100100Output5Input3 4001000000010000010Output12Input4 301110011100111001110Output18NoteIn the first example, Sagheer will go to room1in the ground floor, then he will go to room2in the second floor using the left or right stairs.In the second example, he will go to the fourth room in the ground floor, use right stairs, go to the fourth room in the second floor, use right stairs again, then go to the second room in the last floor.In the third example, he will walk through the whole corridor alternating between the left and right stairs at each floor.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e50faf0b", "template_md5": "35d339e4", "result": "You are given a building with $n$ floors and $m$ rooms on each floor.  The building is represented as a grid where:\n\n* The first and last columns are stairs.\n* The middle columns are rooms.\n* A '0' in the grid represents an off light, and a '1' represents an on light.\n\nYou start at the ground floor (bottom) at the left stairs. You must turn off all the lights in the building.  \n\nYou can move:\n\n* One space to the left or right on the same floor (to a room or the stairs).\n* One floor up or down the stairs.\n\nIt takes one minute to move one space and no time to turn off a light.\n\nFind the minimum time it takes to turn off all the lights."}, {"prompt_md5": "3fc0cb3e", "template_md5": "465699a0", "result": "You are given a building with multiple floors and rooms. Each room can have a light that is either on or off. You start at the bottom floor, left side. You must turn off all the lights in the building. You can only move between rooms on the same floor or to the next floor using the stairs.  Find the minimum time it takes to turn off all the lights."}]}