{"uid": "812-A", "url": "https://codeforces.com/contest/812/problem/A", "tags": ["implementation"], "title": "812-A", "statement": "A. Sagheer and Crossroadstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSagheer is walking in the street when he comes to an intersection of two roads. Each road can be represented as two parts where each part has3lanes getting into the intersection (one for each direction) and3lanes getting out of the intersection, so we have4parts in total. Each part has4lights, one for each lane getting into the intersection (l— left,s— straight,r— right) and a lightpfor a pedestrian crossing.An accident is possible if a car can hit a pedestrian. This can happen if the light of a pedestrian crossing of some part and the light of a lane that can get to or from that same part are green at the same time.Now, Sagheer is monitoring the configuration of the traffic lights. Your task is to help him detect whether an accident is possible.InputThe input consists of four lines with each line describing a road part given in a counter-clockwise order.Each line contains four integersl,s,r,p— for the left, straight, right and pedestrian lights, respectively. The possible values are0for red light and1for green light.OutputOn a single line, print \"YES\" if an accident is possible, and \"NO\" otherwise.ExamplesInput1 0 0 10 1 0 00 0 1 00 0 0 1OutputYESInput0 1 1 01 0 1 01 1 0 00 0 0 1OutputNOInput1 0 0 00 0 0 10 0 0 01 0 1 0OutputNONoteIn the first example, some accidents are possible because cars of part1can hit pedestrians of parts1and4. Also, cars of parts2and3can hit pedestrians of part4.In the second example, no car can pass the pedestrian crossing of part4which is the only green pedestrian light. So, no accident can occur.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cf79b1ff", "template_md5": "35d339e4", "result": "There are four road sections, each with four traffic lights: one for left, one for straight, one for right, and one for pedestrians. Each light can be either green (1) or red (0). \n\nDetermine if an accident is possible. An accident occurs if a pedestrian light is green and any of the car lights (left, straight, or right) are also green for the same road section.\n\nInput: Four lines, each representing a road section with four integers (l, s, r, p) representing the state of the lights (0 or 1).\n\nOutput: \"YES\" if an accident is possible, \"NO\" otherwise."}, {"prompt_md5": "5755926c", "template_md5": "465699a0", "result": "Determine if a collision is possible between cars and pedestrians at an intersection with four road sections. Each section has lights for cars turning left, straight, right, and a pedestrian crossing.  A collision occurs if a car light and a pedestrian crossing light are both green at the same time."}]}