{"uid": "813-F", "url": "https://codeforces.com/contest/813/problem/F", "tags": ["data structures", " dsu", " graphs"], "title": "813-F", "statement": "F. Bipartite Checkingtime limit per test6 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an undirected graph consisting ofnvertices. Initially there are no edges in the graph. Also you are givenqqueries, each query either adds one undirected edge to the graph or removes it. After each query you have to check if the resulting graph is bipartite (that is, you can paint all vertices of the graph into two colors so that there is no edge connecting two vertices of the same color).InputThe first line contains two integersnandq(2 ≤n,q≤ 100000).Thenqlines follow.ith line contains two numbersxiandyi(1 ≤xi<yi≤n). These numbers describeith query: if there is an edge between verticesxiandyi, then remove it, otherwise add it.OutputPrintqlines.ith line must containYESif the graph is bipartite afterith query, andNOotherwise.ExampleInput3 52 31 31 21 21 2OutputYESYESNOYESNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bfa33fd7", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices.  You will be given $q$ queries. Each query will either add or remove an edge between two vertices. After each query, you need to determine if the graph is bipartite. A bipartite graph is a graph whose vertices can be divided into two sets such that every edge connects a vertex in one set to a vertex in the other set.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $q$ ($2 \\le n, q \\le 100000$).\n* The next $q$ lines each contain two integers, $x_i$ and $y_i$ ($1 \\le x_i < y_i \\le n$).  If there is an edge between vertices $x_i$ and $y_i$, then remove it. Otherwise, add it.\n\n**Output:**\n\n* Print $q$ lines. The $i$-th line should contain \"YES\" if the graph is bipartite after the $i$-th query, and \"NO\" otherwise."}, {"prompt_md5": "6b367cef", "template_md5": "465699a0", "result": "You are given a set of points.  You are given a list of pairs of points. For each pair, if there is a line connecting them, remove the line. If there isn't a line connecting them, add a line. After each change, determine if the points can be divided into two groups so that no two points in the same group are connected by a line."}]}