{"uid": "813-D", "url": "https://codeforces.com/contest/813/problem/D", "tags": ["dp", " flows"], "title": "813-D", "statement": "D. Two Melodiestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice is a beginner composer and now she is ready to create another masterpiece. And not even the single one but two at the same time!Alice has a sheet withnnotes written on it. She wants to take two such non-empty non-intersecting subsequences that both of them form amelodyand sum of their lengths is maximal.Subsequence is a sequence that can be derived from another sequence by deleting some elements without changing the order of the remaining elements.Subsequence forms a melody when each two adjacent notes either differs by1or are congruent modulo7.You should write a program which will calculate maximum sum of lengths of such two non-empty non-intersecting subsequences that both of them form a melody.InputThe first line contains one integer numbern(2 ≤n≤ 5000).The second line containsninteger numbersa1,a2, ...,an(1 ≤ai≤ 105) — notes written on a sheet.OutputPrint maximum sum of lengths of such two non-empty non-intersecting subsequences that both of them form a melody.ExamplesInput41 2 4 5Output4Input662 22 60 61 48 49Output5NoteIn the first example subsequences[1, 2]and[4, 5]give length4in total.In the second example subsequences[62, 48, 49]and[60, 61]give length5in total. If you choose subsequence[62, 61]in the first place then the second melody will have maximum length2, that gives the result of4, which is not maximal.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "90bba73e", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers ($2 \\le n \\le 5000$).  You need to find the maximum possible sum of lengths of two non-empty, non-overlapping subsequences within the sequence.  \n\nA subsequence is a sequence formed by deleting elements from the original sequence without changing the order of the remaining elements.\n\nA subsequence forms a \"melody\" if:\n\n*  Every two adjacent notes either differ by 1 or have the same remainder when divided by 7.\n\nOutput the maximum sum of lengths of these two melodies."}, {"prompt_md5": "c4a77cf4", "template_md5": "465699a0", "result": "You are given a list of numbers. Find the longest possible sum of lengths of two non-overlapping sublists within the original list, where each sublist follows a specific pattern: the difference between any two consecutive numbers in the sublist must be either 1 or they must have the same remainder when divided by 7."}]}