{"uid": "814-D", "url": "https://codeforces.com/contest/814/problem/D", "tags": ["dfs and similar", " dp", " geometry", " greedy", " trees"], "title": "814-D", "statement": "D. An overnight dance in discothequetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe crowdedness of the discotheque would never stop our friends from having fun, but a bit more spaciousness won't hurt, will it?The discotheque can be seen as an infinitexy-plane, in which there are a total ofndancers. Once someone starts moving around, they will move only inside their own movement range, which is a circular areaCidescribed by a center(xi,yi)and a radiusri.No two ranges' borders have more than one common point, that is for every pair(i,j)(1 ≤i<j≤n) either rangesCiandCjare disjoint, or one of them is a subset of the other. Note that it's possible that two ranges' borders share a single common point, but no two dancers have exactly the same ranges.Tsukihi, being one of them, defines thespaciousnessto bethe area covered by an odd number of movement ranges of dancers who are moving. An example is shown below, with shaded regions representing thespaciousnessif everyone moves at the same time.But no one keeps moving for the whole night after all, so the whole night's time is divided into two halves — before midnight and after midnight. Every dancer moves around in one half, while sitting down with friends in the other. Thespaciousnessof two halves are calculated separately and their sum should, of course, be as large as possible. The following figure shows an optimal solution to the example above.By different plans of who dances in the first half and who does in the other, different sums ofspaciousnessover two halves are achieved. You are to find the largest achievable value of this sum.InputThe first line of input contains a positive integern(1 ≤n≤ 1 000) — the number of dancers.The followingnlines each describes a dancer: thei-th line among them contains three space-separated integersxi,yiandri(- 106≤xi,yi≤ 106,1 ≤ri≤ 106), describing a circular movement range centered at(xi,yi)with radiusri.OutputOutput one decimal number — the largest achievable sum ofspaciousnessover two halves of the night.The output is considered correct if it has a relative or absolute error of at most10- 9. Formally, let your answer bea, and the jury's answer beb. Your answer is considered correct if.ExamplesInput52 1 60 4 12 -1 31 -2 14 -1 1Output138.23007676Input80 0 10 0 20 0 30 0 40 0 50 0 60 0 70 0 8Output289.02652413NoteThe first sample corresponds to the illustrations in the legend.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "31253f42", "template_md5": "35d339e4", "result": "You are given a 2D plane and $n$ circular regions, each representing the movement area of a dancer.  The regions do not overlap except possibly at a single point.  \n\nYou need to divide the dancers into two groups, one dancing in the first half of the night and the other in the second half.  \n\nThe \"spaciousness\" of a half is defined as the area covered by an odd number of dancers' movement regions.  \n\nFind the largest possible sum of spaciousness for both halves of the night. \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 1000), the number of dancers.\n* Each of the following $n$ lines describes a dancer's movement region: three space-separated integers $x_i$, $y_i$, and $r_i$ (-10⁶ ≤ $x_i$, $y_i$ ≤ 10⁶, 1 ≤ $r_i$ ≤ 10⁶), representing the center coordinates ($x_i$, $y_i$) and radius $r_i$ of the circular region.\n\n**Output:**\n\n* Output one decimal number, the largest achievable sum of spaciousness for both halves of the night."}, {"prompt_md5": "f326128c", "template_md5": "465699a0", "result": "You are given a set of circular areas. Each area represents a person's movement space.  \n\nThe problem is to divide the people into two groups and assign each group to a time period (before midnight and after midnight).  \n\nThe goal is to maximize the total area covered by the movement spaces of people who are moving in each time period.  \n\nOutput the maximum possible total area."}]}