{"uid": "815-A", "url": "https://codeforces.com/contest/815/problem/A", "tags": ["brute force", " greedy", " implementation"], "title": "815-A", "statement": "A. Karen and Gametime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputOn the way to school, Karen became fixated on the puzzle game on her phone!The game is played as follows. In each level, you have a grid withnrows andmcolumns. Each cell originally contains the number0.One move consists of choosing one row or column, and adding1to all of the cells in that row or column.To win the level, after all the moves, the number in the cell at thei-th row andj-th column should be equal togi,j.Karen is stuck on one level, and wants to know a way to beat this level using the minimum number of moves. Please, help her with this task!InputThe first line of input contains two integers,nandm(1 ≤n,m≤ 100), the number of rows and the number of columns in the grid, respectively.The nextnlines each containmintegers. In particular, thej-th integer in thei-th of these rows containsgi,j(0 ≤gi,j≤ 500).OutputIf there is an error and it is actually not possible to beat the level, output a single integer-1.Otherwise, on the first line, output a single integerk, the minimum number of moves necessary to beat the level.The nextklines should each contain one of the following, describing the moves in the order they must be done:rowx, (1 ≤x≤n) describing a move of the form \"choose thex-th row\".colx, (1 ≤x≤m) describing a move of the form \"choose thex-th column\".If there are multiple optimal solutions, output any one of them.ExamplesInput3 52 2 2 3 20 0 0 1 01 1 1 2 1Output4row 1row 1col 4row 3Input3 30 0 00 1 00 0 0Output-1Input3 31 1 11 1 11 1 1Output3row 1row 2row 3NoteIn the first test case, Karen has a grid with3rows and5columns. She can perform the following4moves to beat the level:In the second test case, Karen has a grid with3rows and3columns. It is clear that it is impossible to beat the level; performing any move will create three1s on the grid, but it is required to only have one1in the center.In the third test case, Karen has a grid with3rows and3columns. She can perform the following3moves to beat the level:Note that this is not the only solution; another solution, among others, iscol 1,col 2,col 3.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "39bd3fd5", "template_md5": "35d339e4", "result": "You are given a grid of $n$ rows and $m$ columns. Each cell in the grid initially contains the number 0. \n\nYou can perform moves by choosing a row or column and adding 1 to all the cells in that row or column.\n\nYou are also given a target grid where each cell $g_{i,j}$ represents the desired value for the cell in the $i$-th row and $j$-th column after performing the moves.\n\nDetermine the minimum number of moves required to transform the initial grid into the target grid. If it is impossible to achieve the target grid, output -1.\n\nIf a solution exists, output the minimum number of moves followed by a sequence of moves describing how to achieve the target grid. Each move can be either:\n\n* `row x`: Choose the $x$-th row.\n* `col x`: Choose the $x$-th column."}, {"prompt_md5": "909c1d9d", "template_md5": "465699a0", "result": "You are given a grid of numbers. You can choose to increase all the numbers in a row or a column by 1.  Your goal is to change the grid so that each cell matches a target number.  Find the fewest moves needed to do this, or say it's impossible."}]}