{"uid": "815-D", "url": "https://codeforces.com/contest/815/problem/D", "tags": ["binary search", " combinatorics", " data structures", " geometry"], "title": "815-D", "statement": "D. Karen and Cardstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputKaren just got home from the supermarket, and is getting ready to go to sleep.After taking a shower and changing into her pajamas, she looked at her shelf and saw an album. Curious, she opened it and saw a trading card collection.She recalled that she used to play with those cards as a child, and, although she is now grown-up, she still wonders a few things about it.Each card has three characteristics:strength,defenseandspeed. The values of all characteristics of all cards are positive integers. The maximum possible strength any card can have isp, the maximum possible defense isqand the maximum possible speed isr.There arencards in her collection. Thei-th card has a strengthai, defensebiand speedci, respectively.A cardbeatsanother card if at least two of its characteristics arestrictly greaterthan the corresponding characteristics of the other card.She now wonders how many different cards can beat all the cards in her collection. Two cards are considered different if at least one of their characteristics have different values.InputThe first line of input contains four integers,n,p,qandr(1 ≤n,p,q,r≤ 500000), the number of cards in the collection, the maximum possible strength, the maximum possible defense, and the maximum possible speed, respectively.The nextnlines each contain three integers. In particular, thei-th line containsai,biandci(1 ≤ai≤p,1 ≤bi≤q,1 ≤ci≤r), the strength, defense and speed of thei-th collection card, respectively.OutputOutput a single integer on a line by itself, the number of different cards that can beat all the cards in her collection.ExamplesInput3 4 4 52 2 51 3 44 1 1Output10Input5 10 10 101 1 11 1 11 1 11 1 11 1 1Output972NoteIn the first test case, the maximum possible strength is4, the maximum possible defense is4and the maximum possible speed is5. Karen has three cards:The first card has strength2, defense2and speed5.The second card has strength1, defense3and speed4.The third card has strength4, defense1and speed1.There are10cards that beat all the cards here:The card with strength3, defense3and speed5.The card with strength3, defense4and speed2.The card with strength3, defense4and speed3.The card with strength3, defense4and speed4.The card with strength3, defense4and speed5.The card with strength4, defense3and speed5.The card with strength4, defense4and speed2.The card with strength4, defense4and speed3.The card with strength4, defense4and speed4.The card with strength4, defense4and speed5.In the second test case, the maximum possible strength is10, the maximum possible defense is10and the maximum possible speed is10. Karen has five cards, all with strength1, defense1and speed1.Any of the972cards which have at least two characteristics greater than1can beat all of the cards in her collection.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c2a8d549", "template_md5": "35d339e4", "result": "You are given a collection of $n$ cards. Each card has three attributes: strength ($a_i$), defense ($b_i$), and speed ($c_i$).  You are also given the maximum possible values for each attribute: $p$, $q$, and $r$, respectively.\n\nA card beats another card if at least two of its attributes are strictly greater than the corresponding attributes of the other card.\n\nFind the number of different cards that can beat all the cards in the collection. Two cards are considered different if at least one of their attributes has a different value."}, {"prompt_md5": "ecba782f", "template_md5": "465699a0", "result": "You are given a set of items, each with three attributes.  Find the number of new items that would beat all the given items, where \"beating\" means having at least two attributes strictly greater than the corresponding attributes of any given item."}]}