{"uid": "816-B", "url": "https://codeforces.com/contest/816/problem/B", "tags": ["binary search", " data structures", " implementation"], "title": "816-B", "statement": "B. Karen and Coffeetime limit per test2.5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputTo stay woke and attentive during classes, Karen needs some coffee!Karen, a coffee aficionado, wants to know the optimal temperature for brewing the perfect cup of coffee. Indeed, she has spent some time reading several recipe books, including the universally acclaimed \"The Art of the Covfefe\".She knowsncoffee recipes. Thei-th recipe suggests that coffee should be brewed betweenliandridegrees, inclusive, to achieve the optimal taste.Karen thinks that a temperature isadmissibleif at leastkrecipes recommend it.Karen has a rather fickle mind, and so she asksqquestions. In each question, given that she only wants to prepare coffee with a temperature betweenaandb, inclusive, can you tell her how many admissible integer temperatures fall within the range?InputThe first line of input contains three integers,n,k(1 ≤k≤n≤ 200000), andq(1 ≤q≤ 200000), the number of recipes, the minimum number of recipes a certain temperature must be recommended by to be admissible, and the number of questions Karen has, respectively.The nextnlines describe the recipes. Specifically, thei-th line among these contains two integersliandri(1 ≤li≤ri≤ 200000), describing that thei-th recipe suggests that the coffee be brewed betweenliandridegrees, inclusive.The nextqlines describe the questions. Each of these lines containsaandb, (1 ≤a≤b≤ 200000), describing that she wants to know the number of admissible integer temperatures betweenaandbdegrees, inclusive.OutputFor each question, output a single integer on a line by itself, the number of admissible integer temperatures betweenaandbdegrees, inclusive.ExamplesInput3 2 491 9492 9797 9992 9493 9795 9690 100Output3304Input2 1 11 1200000 20000090 100Output0NoteIn the first test case, Karen knows3recipes.The first one recommends brewing the coffee between91and94degrees, inclusive.The second one recommends brewing the coffee between92and97degrees, inclusive.The third one recommends brewing the coffee between97and99degrees, inclusive.A temperature isadmissibleif at least2recipes recommend it.She asks4questions.In her first question, she wants to know the number of admissible integer temperatures between92and94degrees, inclusive. There are3:92,93and94degrees are all admissible.In her second question, she wants to know the number of admissible integer temperatures between93and97degrees, inclusive. There are3:93,94and97degrees are all admissible.In her third question, she wants to know the number of admissible integer temperatures between95and96degrees, inclusive. There are none.In her final question, she wants to know the number of admissible integer temperatures between90and100degrees, inclusive. There are4:92,93,94and97degrees are all admissible.In the second test case, Karen knows2recipes.The first one, \"wikiHow to make Cold Brew Coffee\", recommends brewing the coffee at exactly1degree.The second one, \"What good is coffee that isn't brewed at at least36.3306times the temperature of the surface of the sun?\", recommends brewing the coffee at exactly200000degrees.A temperature isadmissibleif at least1recipe recommends it.In her first and only question, she wants to know the number of admissible integer temperatures that are actually reasonable. There are none.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2a818a34", "template_md5": "35d339e4", "result": "There are $n$ coffee recipes. The $i$-th recipe suggests brewing coffee between $l_i$ and $r_i$ degrees Celsius, inclusive.  A temperature is admissible if it is recommended by at least $k$ recipes.\n\nYou are given $q$ queries. Each query consists of two integers $a$ and $b$. For each query, determine the number of admissible integer temperatures between $a$ and $b$ degrees Celsius, inclusive."}, {"prompt_md5": "16b23463", "template_md5": "465699a0", "result": "You are given a list of temperature ranges for brewing coffee. Each range represents a recipe.  You are also given a minimum number of recipes required for a temperature to be considered valid.  \n\nYou need to answer queries asking for the number of valid temperatures within a given temperature range."}]}