{"uid": "817-B", "url": "https://codeforces.com/contest/817/problem/B", "tags": ["combinatorics", " implementation", " math", " sortings"], "title": "817-B", "statement": "B. Makes And The Producttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter returning from the army Makes received a gift — an arrayaconsisting ofnpositive integer numbers. He hadn't been solving problems for a long time, so he became interested to answer a particular question: how many triples of indices(i,j,k)(i<j<k), such thatai·aj·akis minimum possible, are there in the array? Help him with it!InputThe first line of input contains a positive integer numbern(3 ≤n≤ 105)— the number of elements in arraya. The second line containsnpositive integer numbersai(1 ≤ai≤ 109)— the elements of a given array.OutputPrint one number — the quantity of triples(i,j,k)such thati,jandkare pairwise distinct andai·aj·akis minimum possible.ExamplesInput41 1 1 1Output4Input51 3 2 3 4Output2Input61 3 3 1 3 2Output1NoteIn the first example Makes always chooses three ones out of four, and the number of ways to choose them is4.In the second example a triple of numbers(1, 2, 3)is chosen (numbers, not indices). Since there are two ways to choose an element3, then the answer is2.In the third example a triple of numbers(1, 1, 2)is chosen, and there's only one way to choose indices.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "91961384", "template_md5": "35d339e4", "result": "You are given an array of $n$ positive integers. Find the number of unique triples of indices $(i, j, k)$ where $i < j < k$ and the product $a_i \\cdot a_j \\cdot a_k$ is minimized. \n\nInput:\n\n* The first line contains an integer $n$ (3 ≤ $n$ ≤ 10⁵) representing the number of elements in the array.\n* The second line contains $n$ positive integers $a_i$ (1 ≤ $a_i$ ≤ 10⁹) representing the elements of the array.\n\nOutput:\n\n* Print a single integer representing the number of valid triples."}, {"prompt_md5": "d0d33716", "template_md5": "465699a0", "result": "Given a list of numbers, find the number of ways to choose three distinct numbers from the list where their product is as small as possible."}]}