{"uid": "817-A", "url": "https://codeforces.com/contest/817/problem/A", "tags": ["implementation", " math", " number theory"], "title": "817-A", "statement": "A. Treasure Hunttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputCaptain Bill the Hummingbird and his crew recieved an interesting challenge offer. Some stranger gave them a map, potion of teleportation and said that only this potion might help them to reach the treasure.Bottle with potion has two valuesxandywritten on it. These values define four moves which can be performed using the potion:Map shows that the position of Captain Bill the Hummingbird is(x1,y1)and the position of the treasure is(x2,y2).You task is to tell Captain Bill the Hummingbird whether he should accept this challenge or decline. If it is possible for Captain to reach the treasure using the potion then output\"YES\", otherwise\"NO\"(without quotes).The potion can be used infinite amount of times.InputThe first line contains four integer numbersx1,y1,x2,y2(- 105≤x1,y1,x2,y2≤ 105) — positions of Captain Bill the Hummingbird and treasure respectively.The second line contains two integer numbersx,y(1 ≤x,y≤ 105) — values on the potion bottle.OutputPrint\"YES\"if it is possible for Captain to reach the treasure using the potion, otherwise print\"NO\"(without quotes).ExamplesInput0 0 0 62 3OutputYESInput1 1 3 61 5OutputNONoteIn the first example there exists such sequence of moves:— the first type of move— the third type of move", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d3eeec54", "template_md5": "35d339e4", "result": "Given two points $(x_1, y_1)$ and $(x_2, y_2)$, representing the starting position and the destination respectively. You are also given two integers $x$ and $y$.  \n\nDetermine if it is possible to reach the destination from the starting point using the following moves, which can be repeated infinitely:\n\n* Move $(x_1, y_1)$ to $(x_1 + x, y_1 + y)$\n* Move $(x_1, y_1)$ to $(x_1 - x, y_1 - y)$\n* Move $(x_1, y_1)$ to $(x_1 + y, y_1 + x)$\n* Move $(x_1, y_1)$ to $(x_1 - y, y_1 - x)$\n\nIf it is possible, output \"YES\", otherwise output \"NO\"."}, {"prompt_md5": "65145972", "template_md5": "465699a0", "result": "You are given two points, a starting point and a destination point. You also have a tool that can move you in four specific directions.  Determine if you can reach the destination point using this tool an unlimited number of times."}]}