{"uid": "817-F", "url": "https://codeforces.com/contest/817/problem/F", "tags": ["binary search", " data structures", " trees"], "title": "817-F", "statement": "F. MEX Queriestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a set of integer numbers, initially it is empty. You should performnqueries.There are three different types of queries:1lr— Add all missing numbers from the interval[l,r]2lr— Remove all present numbers from the interval[l,r]3lr— Invert the interval[l,r]— add all missing and remove all present numbers from the interval[l,r]After each query you should outputMEXof the set — the smallest positive (MEX≥ 1) integer number which is not presented in the set.InputThe first line contains one integer numbern(1 ≤n≤ 105).Nextnlines contain three integer numberst,l,r(1 ≤t≤ 3, 1 ≤l≤r≤ 1018) — type of the query, left and right bounds.OutputPrintMEXof the set after each query.ExamplesInput31 3 43 1 62 1 3Output131Input41 1 33 5 62 4 43 1 6Output4441NoteHere are contents of the set after each query in the first example:{3, 4}— the interval[3, 4]is added{1, 2, 5, 6}— numbers{3, 4}from the interval[1, 6]got deleted and all the others are added{5, 6}— numbers{1, 2}got deleted", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9b100cba", "template_md5": "35d339e4", "result": "You are given an initially empty set of integers. You will perform $n$ queries. There are three types of queries:\n\n1. **Add:** Add all missing numbers from the interval $[l, r]$ to the set.\n2. **Remove:** Remove all numbers from the interval $[l, r]$ from the set.\n3. **Invert:** Add all missing numbers from the interval $[l, r]$ to the set and remove all numbers from the interval $[l, r]$ from the set.\n\nAfter each query, output the MEX of the set. The MEX of a set is the smallest positive integer that is not present in the set.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the number of queries.\n* Each of the next $n$ lines contains three integers $t$, $l$, and $r$ (1 ≤ $t$ ≤ 3, 1 ≤ $l$ ≤ $r$ ≤ 10¹⁸) representing the type of query and the interval $[l, r]$.\n\n**Output:**\n\n* Print the MEX of the set after each query."}, {"prompt_md5": "bf576c71", "template_md5": "465699a0", "result": "You are given an empty set of numbers. You will be given a series of instructions. Each instruction involves a range of numbers and tells you to either add all missing numbers in that range, remove all existing numbers in that range, or add all missing numbers and remove all existing numbers in that range. After each instruction, you need to find the smallest positive number that is not in the set."}]}