{"uid": "818-E", "url": "https://codeforces.com/contest/818/problem/E", "tags": ["binary search", " data structures", " number theory", " two pointers"], "title": "818-E", "statement": "E. Card Game Againtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVova again tries to play some computer card game.The rules of deck creation in this game are simple. Vova is given an existing deck ofncards and a magic numberk. The order of the cards in the deck is fixed. Each card has a number written on it; numberaiis written on thei-th card in the deck.After receiving the deck and the magic number, Vova removesx(possiblyx= 0) cards from the top of the deck,y(possiblyy= 0) cards from the bottom of the deck, and the rest of the deck is his new deck (Vova has to leave at least one card in the deck after removing cards). So Vova's new deck actually contains cardsx+ 1,x+ 2, ...n-y- 1,n-yfrom the original deck.Vova's new deck is consideredvalidiff the product of all numbers written on the cards in his new deck is divisible byk. So Vova received a deck (possibly not avalidone) and a numberk, and now he wonders, how many ways are there to choosexandyso the deck he will get after removingxcards from the top andycards from the bottom isvalid?InputThe first line contains two integersnandk(1 ≤n≤ 100 000,1 ≤k≤ 109).The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 109) — the numbers written on the cards.OutputPrint the number of ways to choosexandyso the resulting deck isvalid.ExamplesInput3 46 2 8Output4Input3 69 1 14Output1NoteIn the first example the possible values ofxandyare:x= 0,y= 0;x= 1,y= 0;x= 2,y= 0;x= 0,y= 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5ed8277c", "template_md5": "35d339e4", "result": "You are given a deck of $n$ cards, each with a number written on it. The numbers are $a_1, a_2, ..., a_n$. You are also given a magic number $k$.\n\nYou can remove some cards from the top and bottom of the deck.  The number of cards removed from the top is $x$, and the number of cards removed from the bottom is $y$.  \n\nThe remaining cards form a new deck.  \n\nFind the number of ways to choose $x$ and $y$ so that the product of the numbers on the cards in the new deck is divisible by $k$.\n\n**Constraints:**\n\n* $1 \\le n \\le 100,000$\n* $1 \\le k \\le 10^9$\n* $1 \\le a_i \\le 10^9$"}, {"prompt_md5": "0131493f", "template_md5": "465699a0", "result": "You are given a list of numbers and a target number.  You can remove some numbers from the beginning and end of the list.  Count how many ways you can remove numbers so that the product of the remaining numbers is divisible by the target number."}]}