{"uid": "818-D", "url": "https://codeforces.com/contest/818/problem/D", "tags": ["data structures", " implementation"], "title": "818-D", "statement": "D. Multicolored Carstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob got very bored during a long car trip so they decided to play a game. From the window they can see cars of different colors running past them. Cars are going one after another.The game rules are like this. Firstly Alice chooses some colorA, then Bob chooses some colorB(A≠B). After each car they update the number of cars of their chosen color that have run past them. Let's define this numbers afteri-th carcntA(i)andcntB(i).IfcntA(i) >cntB(i)for everyithen the winner is Alice.IfcntB(i) ≥cntA(i)for everyithen the winner is Bob.Otherwise it's a draw.Bob knows all the colors of cars that they will encounter and order of their appearance. Alice have already chosen her colorAand Bob now wants to choose such colorBthat he will win the game (draw is not a win). Help him find this color.If there are multiple solutions, print any of them. If there is no such color then print-1.InputThe first line contains two integer numbersnandA(1 ≤n≤ 105, 1 ≤A≤ 106) – number of cars and the color chosen by Alice.The second line containsninteger numbersc1,c2, ...,cn(1 ≤ci≤ 106) — colors of the cars that Alice and Bob will encounter in the order of their appearance.OutputOutput such colorB(1 ≤B≤ 106) that if Bob chooses it then he will win the game. If there are multiple solutions, print any of them. If there is no such color then print-1.It is guaranteed that if there exists any solution then there exists solution with (1 ≤B≤ 106).ExamplesInput4 12 1 4 2Output2Input5 22 2 4 5 3Output-1Input3 101 2 3Output4NoteLet's consider availability of colors in the first example:cnt2(i) ≥cnt1(i)for everyi, and color2can be the answer.cnt4(2) <cnt1(2), so color4isn't the winning one for Bob.All the other colors also havecntj(2) <cnt1(2), thus they are not available.In the third example every color is acceptable except for10.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "90175ab5", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers, representing the colors of cars passing by.  Alice has already chosen a color $A$. Bob wants to choose a color $B$ to maximize his chances of winning a game.\n\nThe rules of the game are:\n\n* Bob and Alice each keep track of how many cars of their chosen color they see.\n* If Bob sees more cars of color $B$ than Alice sees of color $A$ at any point, Bob wins.\n* If Alice sees more cars of color $A$ than Bob sees of color $B$ at any point, Alice wins.\n* If the counts are always equal, it's a draw.\n\nHelp Bob find a color $B$ that guarantees him a win (a draw is not a win). If there are multiple winning colors, any one will do. If no such color exists, output -1."}, {"prompt_md5": "b45ae629", "template_md5": "465699a0", "result": "Given a sequence of colors, determine a color that, if chosen, will result in having more occurrences of that color than any other color in the sequence. If no such color exists, output -1."}]}