{"uid": "818-C", "url": "https://codeforces.com/contest/818/problem/C", "tags": ["brute force", " implementation"], "title": "818-C", "statement": "C. Sofa Thieftime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYet another round on DecoForces is coming! Grandpa Maks wanted to participate in it but someone has stolen his precious sofa! And how can one perform well with such a major loss?Fortunately, the thief had left a note for Grandpa Maks. This note got Maks to the sofa storehouse. Still he had no idea which sofa belongs to him as they all looked the same!The storehouse is represented as matrixn×m. Every sofa takes two neighbouring by some side cells. No cell is covered by more than one sofa. There can be empty cells.SofaAis standing to the left of sofaBif there exist two such cellsaandbthatxa<xb,ais covered byAandbis covered byB. SofaAis standing to the top of sofaBif there exist two such cellsaandbthatya<yb,ais covered byAandbis covered byB. Right and bottom conditions are declared the same way.Note that in all conditionsA≠B.Also some sofaAcan be both to the top of another sofaBand to the bottom of it. The same is for left and right conditions.The note also stated that there arecntlsofas to the left of Grandpa Maks's sofa,cntr— to the right,cntt— to the top andcntb— to the bottom.Grandpa Maks asks you to help him to identify his sofa. It is guaranteed that there is no more than one sofa of given conditions.Output the number of Grandpa Maks's sofa. If there is no such sofa that all the conditions are met for it then output-1.InputThe first line contains one integer numberd(1 ≤d≤ 105) — the number of sofas in the storehouse.The second line contains two integer numbersn,m(1 ≤n,m≤ 105) — the size of the storehouse.Nextdlines contains four integer numbersx1,y1,x2,y2(1 ≤x1,x2≤n,1 ≤y1,y2≤m) — coordinates of thei-th sofa. It is guaranteed that cells (x1,y1) and (x2,y2) have common side, (x1,y1)≠(x2,y2) and no cell is covered by more than one sofa.The last line contains four integer numberscntl,cntr,cntt,cntb(0 ≤cntl,cntr,cntt,cntb≤d- 1).OutputPrint the number of the sofa for which all the conditions are met. Sofas are numbered1throughdas given in input. If there is no such sofa then print-1.ExamplesInput23 23 1 3 21 2 2 21 0 0 1Output1Input310 101 2 1 15 5 6 56 4 5 42 1 2 0Output2Input22 22 1 1 11 2 2 21 0 0 0Output-1NoteLet's consider the second example.The first sofa has0to its left,2sofas to its right ((1, 1)is to the left of both(5, 5)and(5, 4)),0to its top and2to its bottom (both2nd and3rd sofas are below).The second sofa hascntl= 2,cntr= 1,cntt= 2andcntb= 0.The third sofa hascntl= 2,cntr= 1,cntt= 1andcntb= 1.So the second one corresponds to the given conditions.In the third exampleThe first sofa hascntl= 1,cntr= 1,cntt= 0andcntb= 1.The second sofa hascntl= 1,cntr= 1,cntt= 1andcntb= 0.And there is no sofa with the set(1, 0, 0, 0)so the answer is-1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "149a1ce7", "template_md5": "35d339e4", "result": "You are given a 2D grid representing a storehouse. Each cell in the grid can either be empty or occupied by a sofa.  Each sofa takes up two adjacent cells.\n\nYou are also given the following information about a specific sofa:\n\n*  $cntl$: The number of sofas to the left of the target sofa.\n*  $cntr$: The number of sofas to the right of the target sofa.\n*  $cntt$: The number of sofas above the target sofa.\n*  $cntb$: The number of sofas below the target sofa.\n\nFind the unique sofa in the grid that satisfies all these conditions. If no such sofa exists, output -1."}, {"prompt_md5": "26d52aa5", "template_md5": "465699a0", "result": "You are given a grid of cells. Each cell can either be empty or contain a sofa.  Sofas take up two adjacent cells. You are given information about the number of sofas to the left, right, top, and bottom of a specific sofa. Find the number of the sofa that matches these conditions. If no such sofa exists, output -1."}]}