{"uid": "818-B", "url": "https://codeforces.com/contest/818/problem/B", "tags": ["implementation"], "title": "818-B", "statement": "B. Permutation Gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputnchildren are standing in a circle and playing a game. Children's numbers in clockwise order form a permutationa1,a2, ...,anof lengthn. It is an integer sequence such that each integer from1tonappears exactly once in it.The game consists ofmsteps. On each step the current leader with indexicounts outaipeople in clockwise order, starting from the next person. The last one to be pointed at by the leader becomes the new leader.You are given numbersl1,l2, ...,lm— indices of leaders in the beginning of each step. Child with numberl1is the first leader in the game.Write a program which will restore a possible permutationa1,a2, ...,an. If there are multiple solutions then print any of them. If there is no solution then print-1.InputThe first line contains two integer numbersn,m(1 ≤n,m≤ 100).The second line containsminteger numbersl1,l2, ...,lm(1 ≤li≤n) — indices of leaders in the beginning of each step.OutputPrint such permutation ofnnumbersa1,a2, ...,anthat leaders in the game will be exactlyl1,l2, ...,lmif all the rules are followed. If there are multiple solutions print any of them.If there is no permutation which satisfies all described conditions print-1.ExamplesInput4 52 3 1 4 4Output3 1 2 4Input3 33 1 2Output-1NoteLet's follow leadership in the first example:Child2starts.Leadership goes from2to2 +a2= 3.Leadership goes from3to3 +a3= 5. As it's greater than4, it's going in a circle to1.Leadership goes from1to1 +a1= 4.Leadership goes from4to4 +a4= 8. Thus in circle it still remains at4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4c0abaeb", "template_md5": "35d339e4", "result": "You are given a number $n$ representing the number of children and a number $m$ representing the number of steps in a game.  \n\nIn this game, the children are arranged in a circle. Each step, the child at a specific index (given in the input) counts out a certain number of children in a clockwise direction. The last child they point to becomes the new leader for the next step.\n\nYour task is to determine a possible arrangement of the children's numbers (a permutation) such that the given indices represent the leaders at the start of each step. If there are multiple possible arrangements, you can print any one. If no such arrangement exists, print -1."}, {"prompt_md5": "55a19f65", "template_md5": "465699a0", "result": "You are given a list of positions that represent leaders at different points in time.  You need to figure out a possible order of people that would result in those leaders. If there are multiple possible orders, any one will do. If no order is possible, output -1."}]}