{"uid": "819-C", "url": "https://codeforces.com/contest/819/problem/C", "tags": ["number theory"], "title": "819-C", "statement": "C. Mister B and Beacons on Fieldtime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMister B has a house in the middle of a giant plain field, which attracted aliens life. For convenience, aliens specified the Cartesian coordinate system on the field in such a way that Mister B's house has coordinates(0, 0). After that they sent three beacons to the field, but something went wrong. One beacon was completely destroyed, while the other two landed in positions with coordinates(m, 0)and(0,n), respectively, but shut down.Mister B was interested in this devices, so he decided to take them home. He came to the first beacon, placed at(m, 0), lifted it up and carried the beacon home choosing the shortest path. After that he came to the other beacon, placed at(0,n), and also carried it home choosing the shortest path. When first beacon was lifted up, the navigation system of the beacons was activated.Partially destroyed navigation system started to work in following way.At time moments when both survived beacons are at points with integer coordinates the system tries to find a location for the third beacon. It succeeds if and only if there is a point with integer coordinates such that the area of the triangle formed by the two survived beacons and this point is equal tos. In this case the system sends a packet of information with beacon positions to aliens, otherwise it doesn't.Compute how many packets of information system sent while Mister B was moving the beacons.InputThe first line contains one integert(1 ≤t≤ 1000) — the number of test cases. The next3·tlines describettest cases.Every test case is described in three lines as follows.Note that each parameter is given as a product of three factors.The first line of a test case contains three space-separated integers:n1,n2,n3(1 ≤ni≤ 106) such thatn=n1·n2·n3.The second line contains three space-separated integers:m1,m2,m3(1 ≤mi≤ 106) such thatm=m1·m2·m3.The third line contains three space-separated integers:s1,s2,s3(1 ≤si≤ 106) such thats=s1·s2·s3.Note that for hacks only tests witht= 1allowed.OutputPrinttintegers one per line — the answers for each test.ExampleInput32 1 12 1 11 1 31 5 12 2 11 1 210 6 182 103 213 1 13Output47171NoteFirst test case contains the following beacon positions:(2, 0)and(0, 2),s= 3. The following packets could be sent:((2, 0), (0, 2), ( - 1, 0)),((1, 0), (0, 2), (4, 0)),((0, 0), (0, 2), (3, 1)),((0, 0), (0, 1), ( - 6, 0)), where(b1,b2,p)has next description:b1— first beacon position,b2— second beacon position,p— some generated point.Second test case contains the following beacon initial positions:(4, 0)and(0, 5),s= 2. The following packets could be sent:((4, 0), (0, 5), (0, 4)),((3, 0), (0, 5), (2, 3)),((2, 0), (0, 5), (2, 2)),((1, 0), (0, 5), (1, 4)),((0, 0), (0, 4), (0,  - 1)),((0, 0), (0, 2), (2, 0)),((0, 0), (0, 1), (4, 0)).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "852f9e6d", "template_md5": "35d339e4", "result": "There are two beacons placed at coordinates $(m, 0)$ and $(0, n)$.  A third beacon was destroyed.  The surviving beacons have a navigation system that, at times when both beacons are at integer coordinates, tries to find a third beacon location.  The system succeeds if there is a point with integer coordinates that forms a triangle with the two surviving beacons with an area of $s$.\n\nGiven $m$, $n$, and $s$, calculate the number of times the navigation system successfully finds a location for the third beacon while the beacons are being moved. \n\nInput:\n\n* $t$: the number of test cases\n* For each test case:\n    * $n_1$, $n_2$, $n_3$: factors of $n$\n    * $m_1$, $m_2$, $m_3$: factors of $m$\n    * $s_1$, $s_2$, $s_3$: factors of $s$\n\nOutput:\n\n* For each test case, print the number of times the navigation system successfully finds a location for the third beacon."}, {"prompt_md5": "887f0822", "template_md5": "465699a0", "result": "Two points are given on a grid.  A third point must be found on the grid such that the area of the triangle formed by the three points is a given number. Count how many such points exist as the two given points move along the grid."}]}