{"uid": "819-A", "url": "https://codeforces.com/contest/819/problem/A", "tags": ["games", " greedy"], "title": "819-A", "statement": "A. Mister B and Boring Gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSometimes Mister B has free evenings when he doesn't know what to do. Fortunately, Mister B found a new game, where the player can play against aliens.All characters in this game are lowercase English letters. There are two players: Mister B and his competitor.Initially the players have a stringsconsisting of the firstaEnglish letters in alphabetical order (for example, ifa= 5, thensequals to \"abcde\").The players take turns appending letters to strings. Mister B moves first.Mister B must append exactlybletters on each his move. He can arbitrary choose these letters. His opponent adds exactlyaletters on each move.Mister B quickly understood that his opponent was just a computer that used a simple algorithm. The computer on each turn considers the suffix of stringsof lengthaand generates a stringtof lengthasuch that all letters in the stringtare distinct and don't appear in the considered suffix. From multiple variants oftlexicographically minimal is chosen (ifa= 4and the suffix is \"bfdd\", the computer chooses stringtequal to \"aceg\"). After that the chosen stringtis appended to the end ofs.Mister B soon found the game boring and came up with the following question: what can be the minimum possible number of different letters in stringson the segment between positionslandr, inclusive. Letters of stringsare numerated starting from1.InputFirst and only line contains four space-separated integers:a,b,landr(1 ≤a,b≤ 12,1 ≤l≤r≤ 109) — the numbers of letters each player appends and the bounds of the segment.OutputPrint one integer — the minimum possible number of different letters in the segment from positionlto positionr, inclusive, in strings.ExamplesInput1 1 1 8Output2Input4 2 2 6Output3Input3 7 4 6Output1NoteIn the first sample test one of optimal strategies generate strings=\"abababab...\", that's why answer is2.In the second sample test strings=\"abcdbcaefg...\" can be obtained, chosen segment will look like \"bcdbc\", that's why answer is3.In the third sample test strings=\"abczzzacad...\" can be obtained, chosen, segment will look like \"zzz\", that's why answer is1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "45d994f8", "template_md5": "35d339e4", "result": "Two players take turns building a string. \n\n* Player 1 adds $b$ letters to the string on each turn.\n* Player 2 adds $a$ letters to the string on each turn.\n\nThe string starts with the first $a$ lowercase English letters.\n\nPlayer 2's strategy is to choose the lexicographically smallest $a$-letter string that doesn't contain any letters from the last $a$ letters of the current string.\n\nGiven:\n\n* $a$: the number of letters Player 2 adds each turn\n* $b$: the number of letters Player 1 adds each turn\n* $l$: the starting position of the segment\n* $r$: the ending position of the segment\n\nFind the minimum number of distinct letters in the segment from position $l$ to $r$ (inclusive)."}, {"prompt_md5": "43ea756e", "template_md5": "465699a0", "result": "Two players take turns adding letters to a string. The first player adds 'b' letters each turn, and the second player adds 'a' letters each turn. The second player always chooses the lexicographically smallest set of 'a' unique letters that are not already in the string's suffix.  What is the minimum number of unique letters that can be in a given segment of the string?"}]}