{"uid": "819-E", "url": "https://codeforces.com/contest/819/problem/E", "tags": ["constructive algorithms", " graphs"], "title": "819-E", "statement": "E. Mister B and Flight to the Moontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn order to fly to the Moon Mister B just needs to solve the following problem.There is a complete indirected graph withnvertices. You need to cover it with several simple cycles of length3and4so that each edge is in exactly2cycles.We are sure that Mister B will solve the problem soon and will fly to the Moon. Will you?InputThe only line contains single integern(3 ≤n≤ 300).OutputIf there is no answer, print-1.Otherwise, in the first line printk(1 ≤k≤n2) — the number of cycles in your solution.In each of the nextklines print description of one cycle in the following format: first print integerm(3 ≤m≤ 4) — the length of the cycle, then printmintegersv1,v2, ...,vm(1 ≤vi≤n) — the vertices in the cycle in the traverse order. Each edge should be in exactly two cycles.ExamplesInput3Output23 1 2 33 1 2 3Input5Output63 5 4 23 3 1 54 4 5 2 34 4 3 2 13 4 2 13 3 1 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "de633082", "template_md5": "35d339e4", "result": "You are given a complete undirected graph with $n$ vertices ($3 \\le n \\le 300$).  \n\nYour task is to find the minimum number of cycles, where each cycle is either of length 3 or 4, that can cover all the edges of the graph.  Each edge must be part of exactly two cycles.\n\nIf no such solution exists, output -1. Otherwise, output the number of cycles required, followed by a description of each cycle (the length of the cycle and the vertices in the cycle)."}, {"prompt_md5": "94dddb67", "template_md5": "465699a0", "result": "You are given a graph with a number of nodes.  You need to cover all the edges of the graph with cycles of length 3 and 4, where each edge is used in exactly two cycles.  If this is possible, output the number of cycles needed and list each cycle. If it's not possible, output -1."}]}