{"uid": "82-C", "url": "https://codeforces.com/contest/82/problem/C", "tags": ["data structures", " dfs and similar", " sortings"], "title": "82-C", "statement": "C. General Mobilizationtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThe Berland Kingdom is a set ofncities connected with each other withn- 1railways. Each road connects exactly two different cities. The capital is located in city1. For each city there is a way to get from there to the capital by rail.In thei-th city there is a soldier division numberi, each division is characterized by a number ofai. It represents the priority, the smaller the number, the higher the priority of this division. All values ofaiare different.One day the Berland King Berl Great declared a general mobilization, and for that, each division should arrive in the capital. Every day from every city except the capital a train departs. So there are exactlyn- 1departing trains each day. Each train moves toward the capital and finishes movement on the opposite endpoint of the railway on the next day. It has some finite capacity ofcj, expressed in the maximum number of divisions, which this train can transport in one go. Each train moves in the direction of reducing the distance to the capital. So each train passes exactly one railway moving from a city to the neighboring (where it stops) toward the capital.In the first place among the divisions that are in the city, division with the smallest number ofaiget on the train, then with the next smallest and so on, until either the train is full or all the divisions are be loaded. So it is possible for a division to stay in a city for a several days.The duration of train's progress from one city to another is always equal to1day. All divisions start moving at the same time and end up in the capital, from where they don't go anywhere else any more. Each division moves along a simple path from its city to the capital, regardless of how much time this journey will take.Your goal is to find for each division, in how many days it will arrive to the capital of Berland. The countdown begins from day0.InputThe first line contains the single integern(1 ≤n≤ 5000). It is the number of cities in Berland. The second line containsnspace-separated integersa1,a2, ...,an, whereairepresents the priority of the division, located in the city numberi. All numbersa1,a2, ...,anare different (1 ≤ai≤ 109). Thenn- 1lines contain the descriptions of the railway roads. Each description consists of three integersvj,uj,cj, wherevj,ujare number of cities connected by thej-th rail, andcjstands for the maximum capacity of a train riding on this road (1 ≤vj,uj≤n,vj≠uj,1 ≤cj≤n).OutputPrint sequencet1,t2, ...,tn, wheretistands for the number of days it takes for the division of cityito arrive to the capital. Separate numbers with spaces.ExamplesInput440 10 30 201 2 12 3 14 2 1Output0 1 3 2Input55 4 3 2 11 2 12 3 12 4 14 5 1Output0 1 4 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "98a744ff", "template_md5": "35d339e4", "result": "There are $n$ cities connected by $n-1$ railways. Each railway connects exactly two different cities.  \n\nEach city has a division with a priority number $a_i$ (smaller number means higher priority).  \n\nEvery day, a train departs from each city except the capital city, traveling towards the capital. Each train has a capacity of $c_j$ divisions.\n\nDivisions board the trains in order of priority, from lowest to highest, until the train is full.\n\nFind the number of days it takes for each division to reach the capital city. \n\n**Input:**\n\n* The first line contains the number of cities, $n$.\n* The second line contains the priority numbers of the divisions in each city, $a_1, a_2, ..., a_n$.\n* The next $n-1$ lines describe the railways, each line containing three integers: $v_j$, $u_j$, and $c_j$, where $v_j$ and $u_j$ are the cities connected by the $j$-th railway, and $c_j$ is the train capacity on that railway.\n\n**Output:**\n\nPrint a sequence $t_1, t_2, ..., t_n$, where $t_i$ is the number of days it takes for the division in city $i$ to reach the capital."}, {"prompt_md5": "19daf202", "template_md5": "465699a0", "result": "There are cities connected by one-way roads. Each city has a division with a priority level. Divisions travel to a central city one by one on trains with limited capacity.  The division with the lowest priority level in each city boards a train first. Find the number of days it takes for each division to reach the central city."}]}