{"uid": "820-B", "url": "https://codeforces.com/contest/820/problem/B", "tags": ["constructive algorithms", " geometry", " math"], "title": "820-B", "statement": "B. Mister B and Angle in Polygontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOn one quiet day all of sudden Mister B decided to draw angleaon his field. Aliens have already visited his field and left many different geometric figures on it. One of the figures isregular convexn-gon(regular convex polygon withnsides).That's why Mister B decided to use this polygon. Now Mister B must find three distinct verticesv1,v2,v3such that the angle(wherev2is the vertex of the angle, andv1andv3lie on its sides) is as close as possible toa. In other words, the valueshould be minimum possible.If there are many optimal solutions, Mister B should be satisfied with any of them.InputFirst and only line contains two space-separated integersnanda(3 ≤n≤ 105,1 ≤a≤ 180) — the number of vertices in the polygon and the needed angle, in degrees.OutputPrint three space-separated integers: the verticesv1,v2,v3, which form. If there are multiple optimal solutions, print any of them. The vertices are numbered from1tonin clockwise order.ExamplesInput3 15Output1 2 3Input4 67Output2 1 3Input4 68Output4 1 2NoteIn first sample test vertices of regular triangle can create only angle of60degrees, that's why every possible angle is correct.Vertices of square can create45or90degrees angles only. That's why in second sample test the angle of45degrees was chosen, since|45 - 67| < |90 - 67|. Other correct answers are: \"3 1 2\", \"3 2 4\", \"4 2 3\", \"4 3 1\", \"1 3 4\", \"1 4 2\", \"2 4 1\", \"4 1 3\", \"3 1 4\", \"3 4 2\", \"2 4 3\", \"2 3 1\", \"1 3 2\", \"1 2 4\", \"4 2 1\".In third sample test, on the contrary, the angle of90degrees was chosen, since|90 - 68| < |45 - 68|. Other correct answers are: \"2 1 4\", \"3 2 1\", \"1 2 3\", \"4 3 2\", \"2 3 4\", \"1 4 3\", \"3 4 1\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "38c028e9", "template_md5": "35d339e4", "result": "You are given a regular convex polygon with $n$ sides. You need to find three distinct vertices of the polygon such that the angle formed by these vertices is as close as possible to a given angle $a$ (where $3 \\le n \\le 10^5$ and $1 \\le a \\le 180$). \n\nOutput the three vertices that form this angle. If there are multiple solutions, output any one of them."}, {"prompt_md5": "0d03902e", "template_md5": "465699a0", "result": "You are given a polygon with a certain number of sides. Find three points on the polygon that form an angle as close as possible to a given target angle."}]}