{"uid": "821-E", "url": "https://codeforces.com/contest/821/problem/E", "tags": ["dp", " matrices"], "title": "821-E", "statement": "E. Okabe and El Psy Kongrootime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOkabe likes to take walks but knows that spies from the Organization could be anywhere; that's why he wants to know how many different walks he can take in his city safely. Okabe's city can be represented as all points(x,y)such thatxandyare non-negative. Okabe starts at the origin (point(0, 0)), and needs to reach the point(k, 0). If Okabe is currently at the point(x,y), in one step he can go to(x+ 1,y+ 1),(x+ 1,y), or(x+ 1,y- 1).Additionally, there arenhorizontal line segments, thei-th of which goes fromx=aitox=biinclusive, and is aty=ci. It is guaranteed thata1= 0,an≤k≤bn, andai=bi- 1for2 ≤i≤n. Thei-th line segment forces Okabe to walk withy-value in the range0 ≤y≤ciwhen hisxvalue satisfiesai≤x≤bi, or else he might be spied on. This also means he is required to be under two line segments when one segment ends and another begins.Okabe now wants to know how many walks there are from the origin to the point(k, 0)satisfying these conditions, modulo109+ 7.InputThe first line of input contains the integersnandk(1 ≤n≤ 100,1 ≤k≤ 1018) — the number of segments and the destinationxcoordinate.The nextnlines contain three space-separated integersai,bi, andci(0 ≤ai<bi≤ 1018,0 ≤ci≤ 15) — the left and right ends of a segment, and itsycoordinate.It is guaranteed thata1= 0,an≤k≤bn, andai=bi- 1for2 ≤i≤n.OutputPrint the number of walks satisfying the conditions, modulo1000000007(109+ 7).ExamplesInput1 30 3 3Output4Input2 60 3 03 10 2Output4NoteThe graph above corresponds to sample 1. The possible walks are:The graph above corresponds to sample 2. There is only one walk for Okabe to reach(3, 0). After this, the possible walks are:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "588068f1", "template_md5": "35d339e4", "result": "You are given a grid where you can only move right and diagonally up-right. You start at $(0,0)$ and need to reach $(k,0)$. There are $n$ horizontal lines on the grid, the $i$-th line goes from $x=a_i$ to $x=b_i$ and is at $y=c_i$. You must stay above or on these lines at all times. \n\nFind the number of ways to reach $(k,0)$ while following these rules, modulo $10^9 + 7$.\n\nInput:\n\n* The first line contains two integers $n$ and $k$ ($1 \\le n \\le 100$, $1 \\le k \\le 10^{18}$).\n* The next $n$ lines contain three integers $a_i$, $b_i$, and $c_i$ ($0 \\le a_i < b_i \\le 10^{18}$, $0 \\le c_i \\le 15$) representing the line segments.\n\nOutput:\n\n* Print the number of valid paths modulo $10^9 + 7$."}, {"prompt_md5": "dbb2d7c8", "template_md5": "465699a0", "result": "You are given a grid and a destination point. You can only move one step at a time, either up and right, right, or right and down. There are horizontal lines on the grid that restrict your movement.  Find the number of ways to reach the destination point while staying within the allowed movement paths."}]}