{"uid": "821-B", "url": "https://codeforces.com/contest/821/problem/B", "tags": ["brute force", " math"], "title": "821-B", "statement": "B. Okabe and Banana Treestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOkabe needs bananas for one of his experiments for some strange reason. So he decides to go to the forest and cut banana trees.Consider the point(x,y)in the 2D plane such thatxandyare integers and0 ≤x,y. There is a tree in such a point, and it hasx+ybananas. There are no trees nor bananas in other points. Now, Okabe draws a line with equation. Okabe can select a single rectangle with axis aligned sides with all points on or under the line and cut all the trees in all points that are inside or on the border of this rectangle and take their bananas. Okabe's rectangle can be degenerate; that is, it can be a line segment or even a point.Help Okabe and find the maximum number of bananas he can get if he chooses the rectangle wisely.Okabe is sure that the answer does not exceed1018. You can trust him.InputThe first line of input contains two space-separated integersmandb(1 ≤m≤ 1000,1 ≤b≤ 10000).OutputPrint the maximum number of bananas Okabe can get from the trees he cuts.ExamplesInput1 5Output30Input2 3Output25NoteThe graph above corresponds to sample test 1. The optimal rectangle is shown in red and has30bananas.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9b8e22e0", "template_md5": "35d339e4", "result": "You are given two integers $m$ and $b$ (where $1 \\le m \\le 1000$ and $1 \\le b \\le 10000$).  \n\nImagine a grid of points with integer coordinates $(x, y)$ where $0 \\le x$ and $0 \\le y$. Each point $(x, y)$ has a tree with $x + y$ bananas.\n\nA line with equation $y = mx + b$ is drawn on this grid.\n\nYou can choose a rectangle with sides parallel to the axes that is entirely on or below this line.  You can cut down all the trees inside and on the border of this rectangle and collect their bananas.\n\nWhat is the maximum number of bananas you can collect?"}, {"prompt_md5": "d250469a", "template_md5": "465699a0", "result": "You are given a grid of points, each containing a number of items.  You can select a rectangular area on or below a given line.  Find the maximum total number of items you can collect by selecting a rectangle."}]}