{"uid": "821-A", "url": "https://codeforces.com/contest/821/problem/A", "tags": ["implementation"], "title": "821-A", "statement": "A. Okabe and Future Gadget Laboratorytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOkabe needs to renovate theFuture Gadget Laboratoryafter he tried doing some crazy experiments! The lab is represented as annbynsquare grid of integers. Agoodlab is defined as a lab in which every number not equal to1can be expressed as the sum of a number in the same row and a number in the same column. In other words, for everyx,ysuch that1 ≤x,y≤nandax,y≠ 1, there should exist two indicessandtso thatax,y=ax,s+at,y, whereai,jdenotes the integer ini-th row andj-th column.Help Okabe determine whether a given lab isgood!InputThe first line of input contains the integern(1 ≤n≤ 50) — the size of the lab.The nextnlines containnspace-separated integers denoting a row of the grid. Thej-th integer in thei-th row isai,j(1 ≤ai,j≤ 105).OutputPrint \"Yes\" if the given lab isgoodand \"No\" otherwise.You can output each letter in upper or lower case.ExamplesInput31 1 22 3 16 4 1OutputYesInput31 5 21 1 11 2 3OutputNoNoteIn the first sample test, the6in the bottom left corner is valid because it is the sum of the2above it and the4on the right. The same holds for every number not equal to1in this table, so the answer is \"Yes\".In the second sample test, the5cannot be formed as the sum of an integer in the same row and an integer in the same column. Thus the answer is \"No\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bcd85af1", "template_md5": "35d339e4", "result": "You are given a square grid of numbers.  A \"good\" grid is defined as follows: for every number in the grid that is not 1, there must be two other numbers in the same row and same column that add up to it. \n\nDetermine if the given grid is \"good\".\n\n**Input:**\n\n* The first line contains an integer  *n* (1 ≤ *n* ≤ 50), representing the size of the grid.\n* The next *n* lines contain *n* space-separated integers, representing each row of the grid. Each integer is between 1 and 10^5.\n\n**Output:**\n\n* Print \"Yes\" if the grid is \"good\", and \"No\" otherwise."}, {"prompt_md5": "1fb2cdfa", "template_md5": "465699a0", "result": "Given a grid of numbers, determine if every number in the grid (except for 1) can be formed by adding two numbers from the same row or column."}]}