{"uid": "822-A", "url": "https://codeforces.com/contest/822/problem/A", "tags": ["implementation", " math", " number theory"], "title": "822-A", "statement": "A. I'm bored with lifetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputHolidays have finished. Thanks to the help of the hacker Leha, Noora managed to enter the university of her dreams which is located in a town Pavlopolis. It's well known that universities provide students with dormitory for the period of university studies. Consequently Noora had to leave Vičkopolis and move to Pavlopolis. Thus Leha was left completely alone in a quiet town Vičkopolis. He almost even fell into a depression from boredom!Leha came up with a task for himself to relax a little. He chooses two integersAandBand then calculates the greatest common divisor of integers \"Afactorial\" and \"Bfactorial\". Formally the hacker wants to find out GCD(A!,B!). It's well known that the factorial of an integerxis a product of all positive integers less than or equal tox. Thusx! = 1·2·3·...·(x- 1)·x. For example4! = 1·2·3·4 = 24. Recall that GCD(x,y)is the largest positive integerqthat divides (without a remainder) bothxandy.Leha has learned how to solve this task very effective. You are able to cope with it not worse, aren't you?InputThe first and single line contains two integersAandB(1 ≤A,B≤ 109,min(A,B) ≤ 12).OutputPrint a single integer denoting the greatest common divisor of integersA!andB!.ExampleInput4 3Output6NoteConsider the sample.4! = 1·2·3·4 = 24.3! = 1·2·3 = 6. The greatest common divisor of integers24and6is exactly6.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "84aa2be5", "template_md5": "35d339e4", "result": "Given two integers $A$ and $B$ (where $1 \\le A, B \\le 10^9$ and $\\min(A,B) \\le 12$), find the greatest common divisor (GCD) of $A!$ and $B!$.\n\nRecall that $n!$ (n factorial) is the product of all positive integers less than or equal to $n$. For example, $4! = 1 \\cdot 2 \\cdot 3 \\cdot 4 = 24$. \n\nThe GCD of two integers is the largest positive integer that divides both of them without a remainder."}, {"prompt_md5": "83043afd", "template_md5": "465699a0", "result": "Given two integers A and B (where 1 ≤ A, B ≤ 10^9 and min(A, B) ≤ 12), find the greatest common divisor of A! (A factorial) and B! (B factorial)."}]}