{"uid": "822-D", "url": "https://codeforces.com/contest/822/problem/D", "tags": ["brute force", " dp", " greedy", " math", " number theory"], "title": "822-D", "statement": "D. My pretty girl Nooratime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn Pavlopolis University where Noora studies it was decided to hold beauty contest \"Miss Pavlopolis University\". Let's describe the process of choosing the most beautiful girl in the university in more detail.The contest is held in several stages. Suppose that exactlyngirls participate in the competition initially. All the participants are divided into equal groups,xparticipants in each group. Furthermore the numberxis chosen arbitrarily, i. e. on every stage numberxcan be different. Within each group the jury of the contest compares beauty of the girls in the format \"each with each\". In this way, if group consists ofxgirls, thencomparisons occur. Then, from each group, the most beautiful participant is selected. Selected girls enter the next stage of the competition. Thus ifngirls were divided into groups,xparticipants in each group, then exactlyparticipants will enter the next stage. The contest continues until there is exactly one girl left who will be \"Miss Pavlopolis University\"But for the jury this contest is a very tedious task. They would like to divide the girls into groups in each stage so that the total number of pairwise comparisons of the girls is as few as possible. Letf(n)be the minimal total number of comparisons that should be made to select the most beautiful participant, if we admitngirls to the first stage.The organizers of the competition are insane. They give Noora three integerst,landrand ask the poor girl to calculate the value of the following expression:t0·f(l) +t1·f(l+ 1) + ... +tr-l·f(r). However, since the value of this expression can be quite large the organizers ask her to calculate it modulo109+ 7. If Noora can calculate the value of this expression the organizers promise her to help during the beauty contest. But the poor girl is not strong in mathematics, so she turned for help to Leha and he turned to you.InputThe first and single line contains three integerst,landr(1 ≤t< 109+ 7, 2 ≤l≤r≤ 5·106).OutputIn the first line print single integer — the value of the expression modulo109+ 7.ExampleInput2 2 4Output19NoteConsider the sample.It is necessary to find the value of.f(2) = 1. From two girls you can form only one group of two people, in which there will be one comparison.f(3) = 3. From three girls you can form only one group of three people, in which there will be three comparisons.f(4) = 3. From four girls you can form two groups of two girls each. Then at the first stage there will be two comparisons, one in each of the two groups. In the second stage there will be two girls and there will be one comparison between them. Total2 + 1 = 3comparisons. You can also leave all girls in same group in the first stage. Thencomparisons will occur. Obviously, it's better to split girls into groups in the first way.Then the value of the expression is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3266be18", "template_md5": "35d339e4", "result": "You are given three integers $t$, $l$, and $r$ (1 ≤ $t$ < 10<sup>9</sup>+7, 2 ≤ $l$ ≤ $r$ ≤ 5 * 10<sup>6</sup>).\n\nYou need to calculate the following expression modulo 10<sup>9</sup>+7:\n\n$t_0 * f(l) + t_1 * f(l + 1) + ... + t_{r-l} * f(r)$\n\nwhere $f(n)$ is the minimum number of pairwise comparisons needed to determine the \"most beautiful\" person from a group of $n$ people.  \n\nIn each stage of the process, the $n$ people are divided into groups of size $x$, where $x$ can be different in each stage. The most beautiful person from each group advances to the next stage. This continues until only one person remains.\n\n**Example:**\n\n* $t = 2$, $l = 2$, $r = 4$\n\n* $f(2) = 1$ (one comparison needed for two people)\n* $f(3) = 3$ (three comparisons needed for three people)\n* $f(4) = 3$ (three comparisons needed for four people)\n\nTherefore, the expression evaluates to:\n\n2 * 1 + 2 * 3 + 0 * 3 = 8"}, {"prompt_md5": "7d4d3c23", "template_md5": "465699a0", "result": "You are given three numbers: t, l, and r.  Calculate the sum of f(i) for each i from l to r, where f(n) is the minimum number of comparisons needed to determine the \"best\" item from a group of n items.  Each comparison involves two items. The result should be modulo 10^9 + 7."}]}