{"uid": "822-B", "url": "https://codeforces.com/contest/822/problem/B", "tags": ["brute force", " implementation", " strings"], "title": "822-B", "statement": "B. Crossword solvingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputErelong Leha was bored by calculating of the greatest common divisor of two factorials. Therefore he decided to solve some crosswords. It's well known that it is a very interesting occupation though it can be very difficult from time to time. In the course of solving one of the crosswords, Leha had to solve a simple task. You are able to do it too, aren't you?Leha has two stringssandt. The hacker wants to change the stringsat such way, that it can be found intas a substring. All the changes should be the following: Leha chooses one position in the stringsand replaces the symbol in this position with the question mark \"?\". The hacker is sure that the question mark in comparison can play the role of an arbitrary symbol. For example, if he gets strings=\"ab?b\" as a result, it will appear int=\"aabrbb\" as a substring.Guaranteed that the length of the stringsdoesn't exceed the length of the stringt. Help the hacker to replace insas few symbols as possible so that the result of the replacements can be found intas a substring. The symbol \"?\" should be considered equal to any other symbol.InputThe first line contains two integersnandm(1 ≤n≤m≤ 1000) — the length of the stringsand the length of the stringtcorrespondingly.The second line containsnlowercase English letters — strings.The third line containsmlowercase English letters — stringt.OutputIn the first line print single integerk— the minimal number of symbols that need to be replaced.In the second line printkdistinctintegers denoting the positions of symbols in the stringswhich need to be replaced. Print the positions in any order. If there are several solutions print any of them. The numbering of the positions begins from one.ExamplesInput3 5abcxaybzOutput22 3Input4 10abcdebceabazcdOutput12", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "70827584", "template_md5": "35d339e4", "result": "You are given two strings, $s$ of length $n$ and $t$ of length $m$ ($1 \\le n \\le m \\le 1000$).  You can replace some characters in $s$ with question marks (\"?\"), where \"?\" can represent any character.  \n\nFind the minimum number of replacements needed to make $s$ a substring of $t$.  Output the minimum number of replacements and the positions of the characters to be replaced."}, {"prompt_md5": "8b078632", "template_md5": "465699a0", "result": "You are given two strings, one shorter than the other.  You can replace characters in the shorter string with question marks (\"?\"), where \"?\" can represent any character.  Find the minimum number of replacements needed to make the shorter string a substring of the longer string."}]}