{"uid": "825-F", "url": "https://codeforces.com/contest/825/problem/F", "tags": ["dp", " hashing", " string suffix structures", " strings"], "title": "825-F", "statement": "F. String Compressiontime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputIvan wants to write a letter to his friend. The letter is a stringsconsisting of lowercase Latin letters.Unfortunately, when Ivan started writing the letter, he realised that it is very long and writing the whole letter may take extremely long time. So he wants to write thecompressed versionof stringsinstead of the string itself.Thecompressed versionof stringsis a sequence of stringsc1,s1,c2,s2, ...,ck,sk, whereciis the decimal representation of numberai(without any leading zeroes) andsiis some string consisting of lowercase Latin letters. If Ivan writes strings1exactlya1times, then strings2exactlya2times, and so on, the result will be strings.The length of acompressed versionis|c1| + |s1| + |c2| + |s2|... |ck| + |sk|. Among allcompressed versionsIvan wants to choose a version such that its length is minimum possible. Help Ivan to determine minimum possible length.InputThe only line of input contains one stringsconsisting of lowercase Latin letters (1 ≤ |s| ≤ 8000).OutputOutput one integer number — the minimum possible length of acompressed versionofs.ExamplesInputaaaaaaaaaaOutput3InputabcabOutput6InputcczababababOutput7NoteIn the first example Ivan will choose this compressed version:c1is10,s1isa.In the second example Ivan will choose this compressed version:c1is1,s1isabcab.In the third example Ivan will choose this compressed version:c1is2,s1isc,c2is1,s2isz,c3is4,s3isab.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8a8035f9", "template_md5": "35d339e4", "result": "Given a string $s$ consisting of lowercase letters, find the shortest possible compressed representation of the string. \n\nA compressed representation is a sequence of pairs $(a, t)$ where:\n\n* $a$ is the number of times the substring $t$ appears in the original string.\n\nThe length of a compressed representation is the sum of the lengths of all the numbers $a$ and all the substrings $t$. \n\n\nFor example, the string \"aaabbbcc\" could be compressed as (3, \"a\")(2, \"b\")(2, \"c\") with a total length of 3 + 3 + 3 + 2 + 2 + 2 = 15."}, {"prompt_md5": "23311f0f", "template_md5": "465699a0", "result": "Given a string, find the shortest way to represent it using a sequence of numbers and substrings. Each number represents how many times a specific substring should be repeated."}]}