{"uid": "825-E", "url": "https://codeforces.com/contest/825/problem/E", "tags": ["data structures", " dfs and similar", " graphs", " greedy"], "title": "825-E", "statement": "E. Minimal Labelstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a directed acyclic graph withnvertices andmedges. There are no self-loops or multiple edges between any pair of vertices. Graph can be disconnected.You should assign labels to all vertices in such a way that:Labels form a valid permutation of lengthn— an integer sequence such that each integer from1tonappears exactly once in it.If there exists an edge from vertexvto vertexuthenlabelvshould be smaller thanlabelu.Permutation should be lexicographically smallest among all suitable.Find such sequence of labels to satisfy all the conditions.InputThe first line contains two integer numbersn,m(2 ≤n≤ 105, 1 ≤m≤ 105).Nextmlines contain two integer numbersvandu(1 ≤v,u≤n,v≠u) — edges of the graph. Edges are directed, graph doesn't contain loops or multiple edges.OutputPrintnnumbers — lexicographically smallest correct permutation of labels of vertices.ExamplesInput3 31 21 33 2Output1 3 2Input4 53 14 12 33 42 4Output4 1 2 3Input5 43 12 12 34 5Output3 1 2 4 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "46e1cd92", "template_md5": "35d339e4", "result": "You are given a directed acyclic graph with $n$ vertices and $m$ edges.  There are no self-loops or multiple edges between any pair of vertices.  \n\nYour task is to assign a label to each vertex such that:\n\n* The labels form a permutation of the numbers from 1 to $n$ (each number appears exactly once).\n* If there is an edge from vertex $v$ to vertex $u$, then the label of $v$ must be smaller than the label of $u$.\n\nFind the lexicographically smallest possible permutation of labels that satisfies these conditions.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$.\n* The next $m$ lines each contain two integers, $v$ and $u$, representing a directed edge from vertex $v$ to vertex $u$.\n\n**Output:**\n\nPrint $n$ integers, representing the lexicographically smallest valid permutation of labels."}, {"prompt_md5": "61924811", "template_md5": "465699a0", "result": "You are given a list of connections between items.  You need to assign numbers to each item from 1 to n (where n is the total number of items) following these rules:\n\n*  The number assigned to an item connected to another item must be smaller than the number assigned to the connected item.\n*  The list of numbers must be in alphabetical order.\n\nFind the smallest possible list of numbers that follow these rules."}]}