{"uid": "825-G", "url": "https://codeforces.com/contest/825/problem/G", "tags": ["dfs and similar", " graphs", " trees"], "title": "825-G", "statement": "G. Tree Queriestime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a tree consisting ofnvertices (numbered from1ton). Initially all vertices are white. You have to processqqueries of two different types:1x— change the color of vertexxto black. It is guaranteed that the first query will be of this type.2x— for the vertexx, find the minimum indexysuch that the vertex with indexybelongs to the simple path fromxto some black vertex (a simple path never visits any vertex more than once).For each query of type2print the answer to it.Note that the queries are given in modified way.InputThe first line contains two numbersnandq(3 ≤n,q≤ 106).Thenn- 1lines follow, each line containing two numbersxiandyi(1 ≤xi<yi≤n) and representing the edge between verticesxiandyi.It is guaranteed that these edges form a tree.Thenqlines follow. Each line contains two integerstiandzi, wheretiis the type ofith query, andzican be used to restorexifor this query in this way: you have to keep track of the answer to the last query of type2(let's call this answerlast, and initiallylast= 0); thenxi= (zi+last)modn+ 1.It is guaranteed that the first query is of type1, and there is at least one query of type2.OutputFor each query of type2output the answer to it.ExampleInput4 61 22 33 41 21 22 21 32 22 2Output321", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c635bf49", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices (numbered from 1 to $n$). Initially, all vertices are white. You need to process $q$ queries of two types:\n\n1. **Change color:** Change the color of vertex $x$ to black. The first query will always be of this type.\n2. **Find minimum index:** For vertex $x$, find the smallest index $y$ such that vertex $y$ is on the path from $x$ to a black vertex. A path never visits a vertex more than once.\n\nFor each query of type 2, print the answer.\n\nThe queries are given in a specific format:\n\n* The first line contains $n$ and $q$.\n* The next $n-1$ lines describe the tree edges, each line containing two numbers $x_i$ and $y_i$ representing an edge between vertices $x_i$ and $y_i$.\n* The next $q$ lines describe the queries. Each line contains two integers $t_i$ and $z_i$. \n    * If $t_i$ is 1, it's a \"Change color\" query and $x_i$ is calculated as $(z_i + last) \\mod n + 1$, where `last` is the answer to the last query of type 2.\n    * If $t_i$ is 2, it's a \"Find minimum index\" query and $x_i$ is calculated as $(z_i + last) \\mod n + 1$.\n\nThe first query is always of type 1, and there is at least one query of type 2."}, {"prompt_md5": "7de9ba31", "template_md5": "465699a0", "result": "You are given a tree with nodes.  You can change the color of a node to black.  You need to find the smallest node on the path from a given node to a black node."}]}