{"uid": "827-A", "url": "https://codeforces.com/contest/827/problem/A", "tags": ["data structures", " greedy", " sortings", " strings"], "title": "827-A", "statement": "A. String Reconstructiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIvan had stringsconsisting of small English letters. However, his friend Julia decided to make fun of him and hid the strings. Ivan preferred making a new string to finding the old one.Ivan knows some information about the strings. Namely, he remembers, that stringtioccurs in stringsat leastkitimes or more, he also remembers exactlykipositions where the stringtioccurs in strings: these positions arexi, 1,xi, 2, ...,xi,ki. He remembersnsuch stringsti.You are to reconstructlexicographically minimalstringssuch that it fits all the information Ivan remembers. Stringstiand stringsconsist of small English letters only.InputThe first line contains single integern(1 ≤n≤ 105) — the number of strings Ivan remembers.The nextnlines contain information about the strings. Thei-th of these lines contains non-empty stringti, then positive integerki, which equal to the number of times the stringtioccurs in strings, and thenkidistinct positive integersxi, 1,xi, 2, ...,xi,kiin increasing order — positions, in which occurrences of the stringtiin the stringsstart. It is guaranteed that the sum of lengths of stringstidoesn't exceed106,1 ≤xi,j≤ 106,1 ≤ki≤ 106, and the sum of allkidoesn't exceed106. The stringstican coincide.It is guaranteed that the input data is not self-contradictory, and thus at least one answeralwaysexists.OutputPrint lexicographically minimal string that fits all the information Ivan remembers.ExamplesInput3a 4 1 3 5 7ab 2 1 5ca 1 4OutputabacabaInput1a 1 3OutputaaaInput3ab 1 1aba 1 3ab 2 3 5Outputababab", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aa2f1fd3", "template_md5": "35d339e4", "result": "You are given $n$ strings, each with a specific number of occurrences ($k_i$) and their starting positions ($x_{i,1}, x_{i,2}, ..., x_{i,k_i}$) within a larger unknown string.  \n\nYour task is to reconstruct the lexicographically smallest possible string that satisfies these conditions.\n\n**Input:**\n\n* The first line contains an integer $n$ ($1 \\le n \\le 10^5$) representing the number of strings.\n* Each of the following $n$ lines contains:\n    * A string $t_i$\n    * An integer $k_i$ ($1 \\le k_i \\le 10^6$) representing the number of occurrences of $t_i$ in the unknown string.\n    * $k_i$ distinct integers $x_{i,1}, x_{i,2}, ..., x_{i,k_i}$ ($1 \\le x_{i,j} \\le 10^6$) representing the starting positions of the occurrences of $t_i$ in the unknown string.\n\n**Output:**\n\nPrint the lexicographically smallest string that satisfies all the given conditions."}, {"prompt_md5": "1e801c79", "template_md5": "465699a0", "result": "You are given a list of words and how many times each word appears in a larger hidden word. You are also given the starting positions of each word in the hidden word. Reconstruct the lexicographically smallest hidden word that satisfies these conditions."}]}