{"uid": "830-B", "url": "https://codeforces.com/contest/830/problem/B", "tags": ["data structures", " implementation", " sortings"], "title": "830-B", "statement": "B. Cards Sortingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVasily has a deck of cards consisting ofncards. There is an integer on each of the cards, this integer is between1and100 000, inclusive. It is possible that some cards have the same integers on them.Vasily decided to sort the cards. To do this, he repeatedly takes the top card from the deck, and if the number on it equals the minimum number written on the cards in the deck, then he places the card away. Otherwise, he puts it under the deck and takes the next card from the top, and so on. The process ends as soon as there are no cards in the deck. You can assume that Vasily always knows the minimum number written on some card in the remaining deck, but doesn't know where this card (or these cards) is.You are to determine the total number of times Vasily takes the top card from the deck.InputThe first line contains single integern(1 ≤n≤ 100 000) — the number of cards in the deck.The second line contains a sequence ofnintegersa1,a2, ...,an(1 ≤ai≤ 100 000), whereaiis the number written on thei-th from top card in the deck.OutputPrint the total number of times Vasily takes the top card from the deck.ExamplesInput46 3 1 2Output7Input11000Output1Input73 3 3 3 3 3 3Output7NoteIn the first example Vasily at first looks at the card with number6on it, puts it under the deck, then on the card with number3, puts it under the deck, and then on the card with number1. He places away the card with1, because the number written on it is the minimum among the remaining cards. After that the cards from top to bottom are[2, 6, 3]. Then Vasily looks at the top card with number2and puts it away. After that the cards from top to bottom are[6, 3]. Then Vasily looks at card6, puts it under the deck, then at card3and puts it away. Then there is only one card with number6on it, and Vasily looks at it and puts it away. Thus, in total Vasily looks at7cards.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "78f0bc74", "template_md5": "35d339e4", "result": "You are given a deck of $n$ cards, each with an integer value between 1 and 100,000.  The goal is to determine the minimum number of times a card must be taken from the top of the deck to sort the cards in ascending order.\n\nHere's how the sorting process works:\n\n1. Take the top card from the deck.\n2. If the value on the card is the minimum value remaining in the deck, remove the card.\n3. Otherwise, place the card at the bottom of the deck.\n4. Repeat steps 1-3 until the deck is empty.\n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100,000), representing the number of cards.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (1 ≤ $a_i$ ≤ 100,000), representing the values on the cards.\n\n**Output:**\n\nPrint the total number of times a card is taken from the top of the deck."}, {"prompt_md5": "42839ef2", "template_md5": "465699a0", "result": "You are given a deck of cards with numbers on them.  You repeatedly take the top card. If the number on the card is the smallest number remaining in the deck, you remove it. Otherwise, you put it back on the bottom of the deck.  Count how many times you take a card from the top of the deck until the deck is empty."}]}