{"uid": "831-B", "url": "https://codeforces.com/contest/831/problem/B", "tags": ["implementation", " strings"], "title": "831-B", "statement": "B. Keyboard Layoutstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are two popular keyboard layouts in Berland, they differ only in letters positions. All the other keys are the same. In Berland they use alphabet with26letters which coincides with English alphabet.You are given two strings consisting of26distinct letters each: all keys of the first and the second layouts in the same order.You are also given some text consisting of small and capital English letters and digits. It is known that it was typed in the first layout, but the writer intended to type it in the second layout. Print the text if the same keys were pressed in the second layout.Since all keys but letters are the same in both layouts, the capitalization of the letters should remain the same, as well as all other characters.InputThe first line contains a string of length26consisting of distinct lowercase English letters. This is the first layout.The second line contains a string of length26consisting of distinct lowercase English letters. This is the second layout.The third line contains a non-empty stringsconsisting of lowercase and uppercase English letters and digits. This is the text typed in the first layout. The length ofsdoes not exceed1000.OutputPrint the text if the same keys were pressed in the second layout.ExamplesInputqwertyuiopasdfghjklzxcvbnmveamhjsgqocnrbfxdtwkylupziTwccpQZAvb2017OutputHelloVKCup2017Inputmnbvcxzlkjhgfdsapoiuytrewqasdfghjklqwertyuiopzxcvbnm7abaCABAABAcaba7Output7uduGUDUUDUgudu7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e034da92", "template_md5": "35d339e4", "result": "You are given two different keyboard layouts, each with 26 unique letters.  You are also given a text that was typed using the first layout.  \n\nYour task is to determine what the text would look like if it was typed using the second layout.  \n\nAssume that all keys other than letters are the same in both layouts.  The capitalization and other characters (like digits) should remain the same. \n\n\nLet me know if you'd like help with the code to solve this!"}, {"prompt_md5": "da2b36b5", "template_md5": "465699a0", "result": "You are given two different keyboard layouts with the same keys but in different positions. You are also given a text typed using the first layout.  Re-arrange the text based on the second layout."}]}