{"uid": "831-C", "url": "https://codeforces.com/contest/831/problem/C", "tags": ["brute force", " constructive algorithms"], "title": "831-C", "statement": "C. Jury Markstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp watched TV-show wherekjury members one by one rated a participant by adding him a certain number of points (may be negative, i. e. points were subtracted). Initially the participant had some score, and each the marks were one by one added to his score. It is known that thei-th jury member gaveaipoints.Polycarp does not remember how many points the participant had before thiskmarks were given, but he remembers that among the scores announced after each of thekjudges rated the participant there weren(n≤k) valuesb1,b2, ...,bn(it is guaranteed that all valuesbjare distinct). It is possible that Polycarp remembers not all of the scores announced, i. e.n<k. Note that the initial score wasn't announced.Your task is to determine the number of options for the score the participant could have before the judges rated the participant.InputThe first line contains two integerskandn(1 ≤n≤k≤ 2 000) — the number of jury members and the number of scores Polycarp remembers.The second line containskintegersa1,a2, ...,ak(- 2 000 ≤ai≤ 2 000) — jury's marks in chronological order.The third line containsndistinctintegersb1,b2, ...,bn(- 4 000 000 ≤bj≤ 4 000 000) — the values of points Polycarp remembers. Note that these values are not necessarily given in chronological order.OutputPrint the number of options for the score the participant could have before the judges rated the participant. If Polycarp messes something up and there is no options, print \"0\" (without quotes).ExamplesInput4 1-5 5 0 2010Output3Input2 2-2000 -20003998000 4000000Output1NoteThe answer for the first example is3because initially the participant could have- 10,10or15points.In the second example there is only one correct initial score equaling to4 002 000.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5e889aa8", "template_md5": "35d339e4", "result": "There are $k$ judges who each give a participant a score (which can be positive or negative).  The participant starts with an unknown initial score.  We know the scores each judge gave, and we also know $n$ of the scores the participant had after some of the judges had given their scores.  \n\nFind the number of possible initial scores the participant could have had. \n\n**Input:**\n\n* The first line contains two integers, $k$ and $n$ ($1 \\le n \\le k \\le 2000$), the number of judges and the number of scores remembered.\n* The second line contains $k$ integers, $a_1, a_2, ..., a_k$ (-2000 $\\le a_i \\le$ 2000), the scores each judge gave.\n* The third line contains $n$ distinct integers, $b_1, b_2, ..., b_n$ (-4000000 $\\le b_i \\le$ 4000000), the remembered scores.\n\n**Output:**\n\nPrint the number of possible initial scores. If there are no possible initial scores, print \"0\"."}, {"prompt_md5": "4e1c2d39", "template_md5": "465699a0", "result": "You are given a list of scores added to a participant's total score by multiple judges. You also know a subset of the scores announced after each judge. Determine the possible initial scores the participant could have had before the judges started adding their scores."}]}