{"uid": "832-A", "url": "https://codeforces.com/contest/832/problem/A", "tags": ["games", " math"], "title": "832-A", "statement": "A. Sasha and Stickstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIt's one more school day now. Sasha doesn't like classes and is always bored at them. So, each day he invents some game and plays in it alone or with friends.Today he invented one simple game to play with Lena, with whom he shares a desk. The rules are simple. Sasha drawsnsticks in a row. After that the players take turns crossing out exactlyksticks from left or right in each turn. Sasha moves first, because he is the inventor of the game. If there are less thanksticks on the paper before some turn, the game ends. Sasha wins if he makes strictly more moves than Lena. Sasha wants to know the result of the game before playing, you are to help him.InputThe first line contains two integersnandk(1 ≤n,k≤ 1018,k≤n) — the number of sticks drawn by Sasha and the numberk— the number of sticks to be crossed out on each turn.OutputIf Sasha wins, print \"YES\" (without quotes), otherwise print \"NO\" (without quotes).You can print each letter in arbitrary case (upper of lower).ExamplesInput1 1OutputYESInput10 4OutputNONoteIn the first example Sasha crosses out1stick, and then there are no sticks. So Lena can't make a move, and Sasha wins.In the second example Sasha crosses out4sticks, then Lena crosses out4sticks, and after that there are only2sticks left. Sasha can't make a move. The players make equal number of moves, so Sasha doesn't win.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "02eb8067", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $k$.  \n\n* $n$ represents the initial number of items in a row.\n* $k$ represents the number of items that can be removed in each turn.\n\nTwo players take turns removing $k$ items from either end of the row. The first player removes items, then the second player removes items, and so on. The game ends when there are fewer than $k$ items remaining in the row.\n\nDetermine if the first player can win the game by making strictly more moves than the second player. \n\n\nIf the first player can win, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "4f17205d", "template_md5": "465699a0", "result": "You are given two numbers, n and k.  A game is played where someone starts with n items and removes k items each turn. Players take turns. The game ends when there are fewer than k items left.  Determine if the first player can force a win."}]}