{"uid": "832-D", "url": "https://codeforces.com/contest/832/problem/D", "tags": ["dfs and similar", " graphs", " trees"], "title": "832-D", "statement": "D. Misha, Grisha and Undergroundtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMisha and Grisha are funny boys, so they like to use new underground. The underground hasnstations connected withn- 1routes so that each route connects two stations, and it is possible to reach every station from any other.The boys decided to have fun and came up with a plan. Namely, in some day in the morning Misha will ride the underground from stationsto stationfby the shortest path, and will draw with aerosol an ugly text \"Misha was here\" on every station he will pass through (includingsandf). After that on the same day at evening Grisha will ride from stationtto stationfby the shortest path and will count stations with Misha's text. After that at night the underground workers will wash the texts out, because the underground should be clean.The boys have already chosen three stationsa,bandcfor each of several following days, one of them should be stationson that day, another should be stationf, and the remaining should be stationt. They became interested how they should choose these stationss,f,tso that the number Grisha will count is as large as possible. They asked you for help.InputThe first line contains two integersnandq(2 ≤n≤ 105,1 ≤q≤ 105) — the number of stations and the number of days.The second line containsn- 1integersp2,p3, ...,pn(1 ≤pi≤n). The integerpimeans that there is a route between stationspiandi. It is guaranteed that it's possible to reach every station from any other.The nextqlines contains three integersa,bandceach (1 ≤a,b,c≤n) — the ids of stations chosen by boys for some day. Note that some of these ids could be same.OutputPrintqlines. In thei-th of these lines print the maximum possible number Grisha can get counting when the stationss,tandfare chosen optimally from the three stations on thei-th day.ExamplesInput3 21 11 2 32 3 3Output23Input4 11 2 31 2 3Output2NoteIn the first example on the first day ifs=1,f=2,t=3, Misha would go on the route12, and Grisha would go on the route312. He would see the text at the stations1and2. On the second day, ifs=3,f=2,t=3, both boys would go on the route312. Grisha would see the text at3stations.In the second examle ifs=1,f=3,t=2, Misha would go on the route123, and Grisha would go on the route23and would see the text at both stations.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4f2453fc", "template_md5": "35d339e4", "result": "There are $n$ stations connected by $n-1$ routes. Each route connects two stations, and it is possible to reach every station from any other.\n\nOn each of $q$ days, two people will travel on the underground.\n\n* **Day 1:**\n    * Person 1 travels from station $a$ to station $b$ along the shortest path, writing a message on each station they pass through.\n    * Person 2 travels from station $c$ to station $b$ along the shortest path and counts the number of stations with the message.\n\nThe goal is to determine the maximum number of stations Person 2 can count for each day, given the three stations $a$, $b$, and $c$. \n\n\nInput:\n\n* The first line contains two integers $n$ and $q$ (2 ≤ $n$ ≤ 10⁵, 1 ≤ $q$ ≤ 10⁵) — the number of stations and the number of days.\n* The second line contains $n-1$ integers $p_2$, $p_3$, ..., $p_n$ (1 ≤ $p_i$ ≤ $n$). Each integer $p_i$ means there is a route between stations $i$ and $p_i$.\n* The next $q$ lines contain three integers $a$, $b$, and $c$ each (1 ≤ $a$, $b$, $c$ ≤ $n$) — the ids of stations chosen for each day.\n\nOutput:\n\nPrint $q$ lines. In the $i$-th of these lines, print the maximum possible number Person 2 can count on the $i$-th day."}, {"prompt_md5": "bfaa8c2f", "template_md5": "465699a0", "result": "You are given a network of connected points.  For each of several days, you are given three points.  One point is the starting point, one is the ending point, and one is a \"target\" point.  \n\nYou need to figure out the best way to choose the starting and ending points for each day so that the number of points visited along the way to the ending point is maximized."}]}