{"uid": "833-C", "url": "https://codeforces.com/contest/833/problem/C", "tags": ["brute force", " combinatorics", " greedy", " math"], "title": "833-C", "statement": "C. Ever-Hungry Krakozyabratime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently, a wild Krakozyabra appeared at Jelly Castle. It is, truth to be said, always eager to have something for dinner.Its favorite meal is natural numbers (typically served with honey sauce), or, to be more precise, the zeros in their corresponding decimal representations. As for other digits, Krakozyabra dislikes them; moreover, they often cause it indigestion! So, as a necessary precaution, Krakozyabra prefers to sort the digits of a number in non-descending order before proceeding to feast. Then, the leading zeros of the resulting number are eaten and the remaining part is discarded as aninedible tail.For example, if Krakozyabra is to have the number57040for dinner, itsinedible tailwould be the number457.Slastyona is not really fond of the idea of Krakozyabra living in her castle. Hovewer, her natural hospitality prevents her from leaving her guest without food. Slastyona has a range of natural numbers fromLtoR, which she is going to feed the guest with. Help her determine how many distinctinedible tailsare going to be discarded by Krakozyabra by the end of the dinner.InputIn the first and only string, the numbersLandRare given – the boundaries of the range(1 ≤L≤R≤ 1018).OutputOutput the sole number – the answer for the problem.ExamplesInput1 10Output9Input40 57Output17Input157 165Output9NoteIn the first sample case, theinedible tailsare the numbers from1to9. Note that10and1have the sameinedible tail– the number1.In the second sample case, each number has a uniqueinedible tail, except for the pair45, 54. The answer to this sample case is going to be(57 - 40 + 1) - 1 = 17.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7185d533", "template_md5": "35d339e4", "result": "Given a range of integers from $L$ to $R$ inclusive, determine the number of distinct remainders when each number in the range is sorted in non-decreasing order, leading zeros are removed, and the remaining digits are discarded."}, {"prompt_md5": "c71b5f2a", "template_md5": "465699a0", "result": "Given a range of numbers, determine how many unique remainders are produced when each number is sorted, leading zeros are removed, and the remaining digits are discarded."}]}