{"uid": "834-B", "url": "https://codeforces.com/contest/834/problem/B", "tags": ["data structures", " implementation"], "title": "834-B", "statement": "B. The Festive Eveningtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIt's the end of July – the time when a festive evening is held at Jelly Castle! Guests from all over the kingdom gather here to discuss new trends in the world of confectionery. Yet some of the things discussed here are not supposed to be disclosed to the general public: the information can cause discord in the kingdom of Sweetland in case it turns out to reach the wrong hands. So it's a necessity to not let any uninvited guests in.There are 26 entrances in Jelly Castle, enumerated with uppercase English letters fromAtoZ. Because of security measures, each guest is known to be assigned an entrance he should enter the castle through. The door of each entrance is opened right before the first guest's arrival and closed right after the arrival of the last guest that should enter the castle through this entrance. No two guests can enter the castle simultaneously.For an entrance to be protected from possible intrusion, a candy guard should be assigned to it. There areksuch guards in the castle, so if there are more thankopened doors, one of them is going to be left unguarded! Notice that a guard can't leave his post until the door he is assigned to is closed.Slastyona had a suspicion that there could be uninvited guests at the evening. She knows the order in which the invited guests entered the castle, and wants you to help her check whether there was a moment when more thankdoors were opened.InputTwo integers are given in the first string: the number of guestsnand the number of guardsk(1 ≤n≤ 106,1 ≤k≤ 26).In the second string,nuppercase English letterss1s2...snare given, wheresiis the entrance used by thei-th guest.OutputOutput «YES» if at least one door was unguarded during some time, and «NO» otherwise.You can output each letter in arbitrary case (upper or lower).ExamplesInput5 1AABBBOutputNOInput5 1ABABBOutputYESNoteIn the first sample case, the door A is opened right before the first guest's arrival and closed when the second guest enters the castle. The door B is opened right before the arrival of the third guest, and closed after the fifth one arrives. One guard can handle both doors, as the first one is closed before the second one is opened.In the second sample case, the door B is opened before the second guest's arrival, but the only guard can't leave the door A unattended, as there is still one more guest that should enter the castle through this door.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1b55f1da", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $k$, representing the number of guests and the number of guards, respectively.  You are also given a string of $n$ uppercase English letters, where each letter represents the entrance a guest used.\n\nDetermine if there was a time when more than $k$ doors were open simultaneously. \n\n**Input:**\n\n* Two integers: $n$ and $k$\n* A string of $n$ uppercase English letters\n\n**Output:**\n\n* \"YES\" if more than $k$ doors were open simultaneously at some point.\n* \"NO\" otherwise."}, {"prompt_md5": "23046d99", "template_md5": "465699a0", "result": "You are given a list of people entering through numbered doors. You also have a limited number of guards.  Determine if there was ever a time when more doors were open than guards available."}]}