{"uid": "834-A", "url": "https://codeforces.com/contest/834/problem/A", "tags": ["implementation"], "title": "834-A", "statement": "A. The Useless Toytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWalking through the streets of Marshmallow City, Slastyona have spotted some merchants selling a kind of useless toy which is very popular nowadays – caramel spinner! Wanting to join the craze, she has immediately bought the strange contraption.Spinners in Sweetland have the form of V-shaped pieces of caramel. Each spinner can, well, spin around an invisible magic axis. At a specific point in time, a spinner can take 4 positions shown below (each one rotated 90 degrees relative to the previous, with the fourth one followed by the first one):After the spinner was spun, it starts its rotation, which is described by a following algorithm: the spinner maintains its position for a second then majestically switches to the next position in clockwise or counter-clockwise order, depending on the direction the spinner was spun in.Slastyona managed to have spinner rotating for exactlynseconds. Being fascinated by elegance of the process, she completely forgot the direction the spinner was spun in! Lucky for her, she managed to recall the starting position, and wants to deduct the direction given the information she knows. Help her do this.InputThere are two characters in the first string – the starting and the ending position of a spinner. The position is encoded with one of the following characters:v(ASCII code118, lowercase v),<(ASCII code60),^(ASCII code94) or>(ASCII code62) (see the picture above for reference). Characters are separated by a single space.In the second strings, a single numbernis given (0 ≤n≤ 109) – the duration of the rotation.It is guaranteed that the ending position of a spinner is a result of ansecond spin in any of the directions, assuming the given starting position.OutputOutputcw, if the direction is clockwise,ccw– if counter-clockwise, andundefinedotherwise.ExamplesInput^ >1OutputcwInput< ^3OutputccwInput^ v6Outputundefined", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "608d45ee", "template_md5": "35d339e4", "result": "A toy spinner can be in one of four positions: v, <, ^, or >.  The spinner rotates for a given number of seconds, switching positions every second.  Given the starting position and the ending position of the spinner after a certain number of seconds, determine if the rotation was clockwise or counter-clockwise. \n\nInput:\n\n* Two characters: the starting position and the ending position of the spinner.\n* An integer: the number of seconds the spinner rotated.\n\nOutput:\n\n* \"cw\" if the rotation was clockwise.\n* \"ccw\" if the rotation was counter-clockwise.\n* \"undefined\" if the information is insufficient to determine the direction."}, {"prompt_md5": "c31be5a6", "template_md5": "465699a0", "result": "Given the starting and ending position of a toy that spins in a 4-position cycle, determine if the spin was clockwise or counter-clockwise. The toy spins for a given number of seconds."}]}