{"uid": "835-A", "url": "https://codeforces.com/contest/835/problem/A", "tags": ["math"], "title": "835-A", "statement": "A. Key racestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputTwo boys decided to compete in text typing on the site \"Key races\". During the competition, they have to type a text consisting ofscharacters. The first participant types one character inv1milliseconds and has pingt1milliseconds. The second participant types one character inv2milliseconds and has pingt2milliseconds.If connection ping (delay) istmilliseconds, the competition passes for a participant as follows:Exactly aftertmilliseconds after the start of the competition the participant receives the text to be entered.Right after that he starts to type it.Exactlytmilliseconds after he ends typing all the text, the site receives information about it.The winner is the participant whose information on the success comes earlier. If the information comes from both participants at the same time, it is considered that there is a draw.Given the length of the text and the information about participants, determine the result of the game.InputThe first line contains five integerss,v1,v2,t1,t2(1 ≤s,v1,v2,t1,t2≤ 1000) — the number of characters in the text, the time of typing one character for the first participant, the time of typing one character for the the second participant, the ping of the first participant and the ping of the second participant.OutputIf the first participant wins, print \"First\". If the second participant wins, print \"Second\". In case of a draw print \"Friendship\".ExamplesInput5 1 2 1 2OutputFirstInput3 3 1 1 1OutputSecondInput4 5 3 1 5OutputFriendshipNoteIn the first example, information on the success of the first participant comes in7milliseconds, of the second participant — in14milliseconds. So, the first wins.In the second example, information on the success of the first participant comes in11milliseconds, of the second participant — in5milliseconds. So, the second wins.In the third example, information on the success of the first participant comes in22milliseconds, of the second participant — in22milliseconds. So, it is be a draw.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f66e9d00", "template_md5": "35d339e4", "result": "Two people are competing in a typing race. \n\n*  The race consists of typing a text of $s$ characters.\n*  Person 1 types one character in $v1$ milliseconds and has a ping of $t1$ milliseconds.\n*  Person 2 types one character in $v2$ milliseconds and has a ping of $t2$ milliseconds.\n\nHere's how the competition works:\n\n*  Both people receive the text to type after $t$ milliseconds.\n*  They start typing immediately after receiving the text.\n*  The time it takes for the site to receive the completed text is calculated as the time it takes to type all the characters plus the ping time.\n\nDetermine the winner of the race. If they finish at the same time, it's a draw."}, {"prompt_md5": "a958e808", "template_md5": "465699a0", "result": "Two people are typing the same text. Person 1 types one character in a certain amount of time and has a certain ping (delay). Person 2 types one character in a different amount of time and has a different ping.  Determine who finishes typing first, considering the typing time and ping for each person."}]}