{"uid": "837-B", "url": "https://codeforces.com/contest/837/problem/B", "tags": ["brute force", " implementation"], "title": "837-B", "statement": "B. Flag of Berlandtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe flag of Berland is such rectangular fieldn×mthat satisfies following conditions:Flag consists of three colors which correspond to letters'R','G'and'B'.Flag consists of three equal in width and height stripes, parralel to each other and to sides of the flag. Each stripe hasexactly one color.Each color should be used inexactly one stripe.You are given a fieldn×m, consisting of characters'R','G'and'B'. Output \"YES\" (without quotes) if this field corresponds to correct flag of Berland. Otherwise, print \"NO\" (without quotes).InputThe first line contains two integer numbersnandm(1 ≤n,m≤ 100) — the sizes of the field.Each of the followingnlines consisting ofmcharacters'R','G'and'B'— the description of the field.OutputPrint \"YES\" (without quotes) if the given field corresponds to correct flag of Berland . Otherwise, print \"NO\" (without quotes).ExamplesInput6 5RRRRRRRRRRBBBBBBBBBBGGGGGGGGGGOutputYESInput4 3BRGBRGBRGBRGOutputYESInput6 7RRRGGGGRRRGGGGRRRGGGGRRRBBBBRRRBBBBRRRBBBBOutputNOInput4 4RRRRRRRRBBBBGGGGOutputNONoteThe field in the third example doesn't have three parralel stripes.Rows of the field in the fourth example are parralel to each other and to borders. But they have different heights —2,1and1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4a029bc5", "template_md5": "35d339e4", "result": "You are given a 2D grid of size $n \\times m$ filled with characters 'R', 'G', and 'B'.  \n\nDetermine if the grid represents a flag with the following properties:\n\n* The flag has three equal horizontal stripes.\n* Each stripe has only one color ('R', 'G', or 'B').\n* Each color appears exactly once in a stripe.\n\nIf the grid meets these conditions, print \"YES\". Otherwise, print \"NO\"."}, {"prompt_md5": "59673a60", "template_md5": "465699a0", "result": "You are given a rectangular grid of colors (R, G, B). Determine if the grid represents a flag with three equal horizontal stripes, each containing only one color."}]}