{"uid": "837-C", "url": "https://codeforces.com/contest/837/problem/C", "tags": ["brute force", " implementation"], "title": "837-C", "statement": "C. Two Sealstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOne very important person has a piece of paper in the form of a rectanglea×b.Also, he hasnseals. Each seal leaves an impression on the paper in the form of a rectangle of the sizexi×yi. Each impression must be parallel to the sides of the piece of paper (but seal can be rotated by 90 degrees).A very important person wants to choose two different seals and put them two impressions. Each of the selected seals puts exactly one impression. Impressions should not overlap (but they can touch sides), and the total area occupied by them should be the largest possible. What is the largest area that can be occupied by two seals?InputThe first line contains three integer numbersn,aandb(1 ≤n,a,b≤ 100).Each of the nextnlines contain two numbersxi,yi(1 ≤xi,yi≤ 100).OutputPrint the largest total area that can be occupied by two seals. If you can not select two seals, print0.ExamplesInput2 2 21 22 1Output4Input4 10 92 31 15 109 11Output56Input3 10 106 67 720 5Output0NoteIn the first example you can rotate the second seal by 90 degrees. Then put impression of it right under the impression of the first seal. This will occupy all the piece of paper.In the second example you can't choose the last seal because it doesn't fit. By choosing the first and the third seals you occupy the largest area.In the third example there is no such pair of seals that they both can fit on a piece of paper.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "797aa372", "template_md5": "35d339e4", "result": "You are given a rectangle with dimensions $a \\times b$. There are $n$ seals, each leaving an impression in the shape of a rectangle with dimensions $x_i \\times y_i$.  \n\nThe impressions must be parallel to the sides of the larger rectangle and can be rotated.\n\nFind the largest possible area that can be covered by the impressions of two different seals, where the impressions do not overlap (but can touch sides). If it's impossible to place two impressions without overlap, output 0."}, {"prompt_md5": "621aa512", "template_md5": "465699a0", "result": "You have a rectangular piece of paper and a list of rectangles. Each rectangle represents a seal's impression.  Find the two seals whose impressions, placed without overlapping, cover the largest combined area on the paper.  If no two seals can fit without overlapping, the answer is 0."}]}