{"uid": "838-C", "url": "https://codeforces.com/contest/838/problem/C", "tags": ["dp", " games"], "title": "838-C", "statement": "C. Future Failuretime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob are playing a game with a string of characters, with Alice going first. The string consistsncharacters, each of which is one of the firstkletters of the alphabet. On a player’s turn, they can either arbitrarily permute the characters in the words, or delete exactly one character in the word (if there is at least one character). In addition, their resulting word cannot have appeared before throughout the entire game. The player unable to make a valid move loses the game.Givenn,k,p, find the number of words with exactlyncharacters consisting of the firstkletters of the alphabet such that Alice will win if both Alice and Bob play optimally. Return this number modulo the prime numberp.InputThe first line of input will contain three integersn,k,p(1 ≤n≤ 250 000,1 ≤k≤ 26,108≤p≤ 109+ 100,pwill be prime).OutputPrint a single integer, the number of winning words for Alice, modulop.ExampleInput4 2 100000007Output14NoteThere are 14 strings that that Alice can win with. For example, some strings are \"bbaa\" and \"baaa\". Alice will lose on strings like \"aaaa\" or \"bbbb\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a23a4a7e", "template_md5": "35d339e4", "result": "Given $n$, $k$, and $p$, find the number of strings with exactly $n$ characters consisting of the first $k$ letters of the alphabet such that the first player will win if both players play optimally. The players take turns, and on each turn, a player can either rearrange the letters in the string or delete exactly one letter (if there is at least one letter). A player loses if they cannot make a valid move. Return the number of winning strings modulo $p$. \n\n$1 \\le n \\le 250000$, $1 \\le k \\le 26$, $10^8 \\le p \\le 10^9 + 100$, and $p$ is prime."}, {"prompt_md5": "46ca74d1", "template_md5": "465699a0", "result": "Given a length and a set of characters, find how many words of that length, made from those characters, can be played in a game where players take turns rearranging or removing one character at a time, with the goal of being the last one able to make a move.  The result should be the number of winning words modulo a given prime number."}]}