{"uid": "838-D", "url": "https://codeforces.com/contest/838/problem/D", "tags": ["math", " number theory"], "title": "838-D", "statement": "D. Airplane Arrangementstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is an airplane which hasnrows from front to back. There will bempeople boarding this airplane.This airplane has an entrance at the very front and very back of the plane.Each person has some assigned seat. It is possible for multiple people to have the same assigned seat. The people will then board the plane one by one starting with person1. Each person can independently choose either the front entrance or back entrance to enter the plane.When a person walks into the plane, they walk directly to their assigned seat and will try to sit in it. If it is occupied, they will continue walking in the direction they walked in until they are at empty seat - they will take the earliest empty seat that they can find. If they get to the end of the row without finding a seat, they will be angry.Find the number of ways to assign tickets to the passengers and board the plane without anyone getting angry. Two ways are different if there exists a passenger who chose a different entrance in both ways, or the assigned seat is different. Print this count modulo109+ 7.InputThe first line of input will contain two integersn,m(1 ≤m≤n≤ 1 000 000), the number of seats, and the number of passengers, respectively.OutputPrint a single number, the number of ways, modulo109+ 7.ExampleInput3 3Output128NoteHere, we will denote a passenger by which seat they were assigned, and which side they came from (either \"F\" or \"B\" for front or back, respectively).For example, one valid way is 3B, 3B, 3B (i.e. all passengers were assigned seat 3 and came from the back entrance). Another valid way would be 2F, 1B, 3F.One invalid way would be 2B, 2B, 2B, since the third passenger would get to the front without finding a seat.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "34826276", "template_md5": "35d339e4", "result": "There is an airplane with $n$ rows of seats.  $m$ people need to board the plane. Each person has a assigned seat number.  People can enter the plane through the front or back doors.  \n\nWhen a person boards, they go directly to their assigned seat. If the seat is taken, they keep walking in the direction they entered until they find an empty seat. If they reach the end of the row without finding a seat, they are unhappy.\n\nFind the number of ways to assign seats and have everyone board the plane without anyone being unhappy.  Two ways are different if a person chooses a different entrance or has a different assigned seat.  The answer should be the number of ways modulo $10^9 + 7$."}, {"prompt_md5": "b48fd186", "template_md5": "465699a0", "result": "You have a plane with a set number of seats.  A set number of people need to board the plane. Each person has a designated seat. People can enter from either end of the plane.  If a person's seat is taken, they must walk to the end of the row in the direction they entered and find the first empty seat.  Find the number of ways to assign seats and have everyone board successfully without anyone getting stuck."}]}