{"uid": "838-B", "url": "https://codeforces.com/contest/838/problem/B", "tags": ["data structures", " dfs and similar", " trees"], "title": "838-B", "statement": "B. Diverging Directionstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a directed weighted graph withnnodes and2n- 2edges. The nodes are labeled from1ton, while the edges are labeled from1to2n- 2. The graph's edges can be split into two parts.The firstn- 1edges will form a rooted spanning tree, with node1as the root. All these edges will point away from the root.The lastn- 1edges will be from nodeito node1, for all2 ≤i≤n.You are givenqqueries. There are two types of queries1iw: Change the weight of thei-th edge tow2uv: Print the length of the shortest path between nodesutovGiven these queries, print the shortest path lengths.InputThe first line of input will contain two integersn,q(2 ≤n,q≤ 200 000), the number of nodes, and the number of queries, respectively.The next2n- 2integers will contain 3 integersai,bi,ci, denoting a directed edge from nodeaito nodebiwith weightci.The firstn- 1of these lines will describe a rooted spanning tree pointing away from node1, while the lastn- 1of these lines will havebi= 1.More specifically,The edges(a1,b1), (a2,b2), ... (an- 1,bn- 1)will describe a rooted spanning tree pointing away from node1.bj= 1forn≤j≤ 2n- 2.an,an+ 1, ...,a2n- 2will be distinct and between2andn.The nextqlines will contain 3 integers, describing a query in the format described in the statement.All edge weights will be between1and106.OutputFor each type 2 query, print the length of the shortest path in its own line.ExampleInput5 91 3 13 2 21 4 33 5 45 1 53 1 62 1 74 1 82 1 12 1 32 3 52 5 21 1 1002 1 31 8 302 4 22 2 4Output014810013210", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "04702c96", "template_md5": "35d339e4", "result": "You are given a directed weighted graph with $n$ nodes and $2n-2$ edges.  The nodes are labeled from 1 to $n$. The edges are labeled from 1 to $2n-2$.\n\nThe graph can be divided into two parts:\n\n* The first $n-1$ edges form a rooted spanning tree with node 1 as the root. All these edges point away from the root.\n* The last $n-1$ edges point from node $i$ to node 1 for all $2 \\le i \\le n$.\n\nYou are given $q$ queries. There are two types of queries:\n\n* **Type 1:** Change the weight of the $i$-th edge to $w$.\n* **Type 2:** Print the length of the shortest path between nodes $u$ and $v$.\n\n**Input:**\n\n* The first line contains two integers $n$ and $q$ (2 ≤ $n$, $q$ ≤ 200,000), the number of nodes and the number of queries, respectively.\n* The next $2n-2$ lines describe the edges. Each line contains three integers $a_i$, $b_i$, and $c_i$, denoting a directed edge from node $a_i$ to node $b_i$ with weight $c_i$.\n* The next $q$ lines describe the queries. Each line contains three integers, describing a query in the format described above.\n\n**Output:**\n\nFor each type 2 query, print the length of the shortest path in its own line."}, {"prompt_md5": "607c7614", "template_md5": "465699a0", "result": "You are given a directed graph with a special structure.  \n\nThere are two parts to the graph:\n\n1. A tree rooted at node 1 where all edges point away from node 1.\n2. Edges connecting each node (except node 1) back to node 1.\n\nYou can change the weight of edges. You need to answer queries of two types:\n\n1. Change the weight of a specific edge.\n2. Find the shortest path between two nodes."}]}