{"uid": "838-A", "url": "https://codeforces.com/contest/838/problem/A", "tags": ["brute force"], "title": "838-A", "statement": "A. Binary Blockstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an image, that can be represented with a2-dnbymgrid of pixels. Each pixel of the image is either on or off, denoted by the characters \"0\" or \"1\", respectively. You would like to compress this image. You want to choose an integerk> 1and split the image intokbykblocks. Ifnandmare not divisible byk, the image is padded with only zeros on the right and bottom so that they are divisible byk. Each pixel in each individual block must have the same value. The given image may not be compressible in its current state. Find the minimum number of pixels you need to toggle (after padding) in order for the image to be compressible for somek. More specifically, the steps are to first choosek, then the image is padded with zeros, then, we can toggle the pixels so it is compressible for thisk. The image must be compressible in that state.InputThe first line of input will contain two integersn,m(2 ≤n,m≤ 2 500), the dimensions of the image.The nextnlines of input will contain a binary string with exactlymcharacters, representing the image.OutputPrint a single integer, the minimum number of pixels needed to toggle to make the image compressible.ExampleInput3 5001001011011001Output5NoteWe first choosek= 2.The image is padded as follows:001000101100110010000000We can toggle the image to look as follows:001100001100000000000000We can see that this image is compressible fork= 2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c25983bc", "template_md5": "35d339e4", "result": "You are given a 2D grid of pixels, where each pixel is either \"0\" (off) or \"1\" (on).  The grid has dimensions $n \\times m$.  \n\nYou want to compress the image by dividing it into $k \\times k$ blocks. If $n$ and $m$ are not divisible by $k$, you must pad the image with zeros on the right and bottom until they are divisible by $k$.  \n\nEach block must have the same value (either all \"0\"s or all \"1\"s).\n\nFind the minimum number of pixels you need to change (toggle from \"0\" to \"1\" or \"1\" to \"0\") to make the image compressible for some value of $k$."}, {"prompt_md5": "8eb969a5", "template_md5": "465699a0", "result": "You are given a grid of 0s and 1s. You can split the grid into square blocks of a certain size.  Each block must have the same value (all 0s or all 1s).  You can change some of the 0s to 1s and vice versa to make the grid compressible. Find the fewest changes needed to make it compressible."}]}