{"uid": "838-F", "url": "https://codeforces.com/contest/838/problem/F", "tags": [], "title": "838-F", "statement": "F. Expected Earningstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are playing a game with a bag of red and black balls. Initially, you are told that the bag hasnballs total. In addition, you are also told that the bag has probabilitypi/ 106of containing exactlyired balls.You now would like to buy balls from this bag. You really like the color red, so red balls are worth a unit of1, while black balls are worth nothing. To buy a ball, if there are still balls in the bag, you pay a costcwith0 ≤c≤ 1, and draw a ball randomly from the bag. You can choose to stop buying at any point (and you can even choose to not buy anything at all).Given that you buy optimally to maximize the expected profit (i.e. # red balls - cost needed to obtain them), print the maximum expected profit.InputThe first line of input will contain two integersn,X(1 ≤n≤ 10 000,0 ≤X≤ 106).The next line of input will containn+ 1integersp0,p1, ...pn(0 ≤pi≤ 106,)The value ofccan be computed as.OutputPrint a single floating point number representing the optimal expected value.Your answer will be accepted if it has absolute or relative error at most10- 9. More specifically, if your answer isaand the jury answer isb, your answer will be accepted if.ExampleInput3 200000250000 250000 250000 250000Output0.9000000000NoteHere, there is equal probability for the bag to contain 0,1,2,3 red balls. Also, it costs 0.2 to draw a ball from the bag.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "164309c1", "template_md5": "35d339e4", "result": "You have a bag with a certain number of balls, and you know the probability of the bag containing a specific number of red balls. You can buy balls from the bag one at a time. Each ball costs $c$ to buy, and you get $1$ for each red ball you buy.  \n\nYou want to figure out the maximum expected profit you can make by buying balls from the bag.\n\n**Input:**\n\n* $n$: The number of possible numbers of red balls in the bag.\n* $X$: The total number of balls in the bag.\n* $p_0, p_1, ..., p_n$: The probability of the bag containing $0$, $1$, $2$, ..., $n$ red balls, respectively.\n* $c$: The cost of buying a ball.\n\n**Output:**\n\n* The maximum expected profit you can make."}, {"prompt_md5": "6cb29523", "template_md5": "465699a0", "result": "You have a bag with a certain number of balls. You know the probability of the bag having a specific number of red balls. You can buy balls from the bag for a cost, and each red ball is worth 1 point. What is the maximum expected profit you can make by buying balls?"}]}