{"uid": "839-A", "url": "https://codeforces.com/contest/839/problem/A", "tags": ["implementation"], "title": "839-A", "statement": "A. Arya and Brantime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputBran and his older sister Arya are from the same house. Bran like candies so much, so Arya is going to give him some Candies.At first, Arya and Bran have0Candies. There arendays, at thei-th day, Arya findsaicandies in a box, that is given by the Many-Faced God. Every day she can give Branat most8of her candies. If she don't give him the candies at the same day, they are saved for her and she can give them to him later.Your task is to find the minimum number of days Arya needs to give Brankcandiesbeforethe end of then-th day. Formally, you need to output the minimum day index to the end of whichkcandies will be given out (the days are indexed from 1 ton).Print-1if she can't give himkcandies duringngiven days.InputThe first line contains two integersnandk(1 ≤n≤ 100,1 ≤k≤ 10000).The second line containsnintegersa1,a2,a3, ...,an(1 ≤ai≤ 100).OutputIf it is impossible for Arya to give Brankcandies withinndays, print-1.Otherwise print a single integer — the minimum number of days Arya needs to give Brankcandies before the end of then-th day.ExamplesInput2 31 2Output2Input3 1710 10 10Output3Input1 910Output-1NoteIn the first sample, Arya can give Bran3candies in2days.In the second sample, Arya can give Bran17candies in3days, because she can give him at most8candies per day.In the third sample, Arya can't give Bran9candies, because she can give him at most8candies per day and she must give him the candies within1day.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ebe8ce32", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $k$.  $n$ represents the number of days, and $k$ represents the target number of candies to be given out.\n\nOn each day $i$, a number of candies, $a_i$, is found.  On each day, a maximum of 8 candies can be given out.\n\nFind the minimum number of days required to give out at least $k$ candies. If it's impossible to give out $k$ candies within $n$ days, output -1."}, {"prompt_md5": "b86afbef", "template_md5": "465699a0", "result": "You are given a number of days and a target number of candies. Each day, a certain number of candies are found. You can give away at most 8 candies per day. Find the minimum number of days needed to give away the target number of candies. If it's impossible, output -1."}]}