{"uid": "842-B", "url": "https://codeforces.com/contest/842/problem/B", "tags": ["geometry"], "title": "842-B", "statement": "B. Gleb And Pizzatime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputGleb ordered pizza home. When the courier delivered the pizza, he was very upset, because several pieces of sausage lay on the crust, and he does not really like the crust.The pizza is a circle of radiusrand center at the origin. Pizza consists of the main part — circle of radiusr-dwith center at the origin, and crust around the main part of the widthd. Pieces of sausage are also circles. The radius of thei-th piece of the sausage isri, and the center is given as a pair (xi,yi).Gleb asks you to help determine the number of pieces of sausage caught on the crust. A piece of sausage got on the crust, if it completely lies on the crust.InputFirst string contains two integer numbersrandd(0 ≤d<r≤ 500) — the radius of pizza and the width of crust.Next line contains one integer numbern— the number of pieces of sausage (1 ≤n≤ 105).Each of nextnlines contains three integer numbersxi,yiandri(- 500 ≤xi,yi≤ 500,0 ≤ri≤ 500), wherexiandyiare coordinates of the center ofi-th peace of sausage,ri— radius ofi-th peace of sausage.OutputOutput the number of pieces of sausage that lay on the crust.ExamplesInput8 477 8 1-7 3 20 2 10 -2 2-3 -3 10 6 25 3 1Output2Input10 840 0 90 0 101 0 11 0 2Output0NoteBelow is a picture explaining the first example. Circles of green color denote pieces of sausage lying on the crust.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e1c7dacc", "template_md5": "35d339e4", "result": "A pizza has a radius of $r$ and a crust of width $d$.  There are $n$ pieces of sausage, each with a radius of $r_i$ and center at $(x_i, y_i)$.  Determine the number of sausage pieces that are entirely within the crust. \n\n**Input:**\n\n* Two integers, $r$ and $d$ (0 ≤ $d$ < $r$ ≤ 500), representing the pizza's radius and crust width.\n* An integer $n$ (1 ≤ $n$ ≤ 10⁵), representing the number of sausage pieces.\n* $n$ lines, each containing three integers $x_i$, $y_i$, and $r_i$ (-500 ≤ $x_i$, $y_i$ ≤ 500, 0 ≤ $r_i$ ≤ 500), representing the center coordinates and radius of each sausage piece.\n\n**Output:**\n\n* An integer, the number of sausage pieces entirely within the crust."}, {"prompt_md5": "490c04d8", "template_md5": "465699a0", "result": "A pizza has a main circle and a crust around it.  There are several small circles representing pieces of sausage. Determine how many sausage pieces are entirely within the crust."}]}