{"uid": "842-E", "url": "https://codeforces.com/contest/842/problem/E", "tags": ["binary search", " dfs and similar", " divide and conquer", " graphs", " trees"], "title": "842-E", "statement": "E. Nikita and gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputNikita plays a new computer game. There aremlevels in this game. In the beginning of each level a new class appears in the game; this class is a child-class of the classyi(andyiis called parent-class for this new class). Thus, the classes form a tree. Initially there is only one class with index1.Changing the class to its neighbour (child-class or parent-class) in the tree costs1coin. You can not change the class back. The cost of changing the classato the classbis equal to the total cost of class changes on the path fromatobin the class tree.Suppose that ati-th level the maximum cost of changing one class to another isx. For each level output the number of classes such that for each of these classes there exists some other classy, and the distance from this class toyis exactlyx.InputFirst line contains one integer numberm— number of queries (1 ≤m≤ 3·105).Nextmlines contain description of queries.i-th line (1 ≤i≤m) describes thei-th level and contains an integeryi— the index of the parent-class of class with indexi+ 1(1 ≤yi≤i).OutputSuppose that ati-th level the maximum cost of changing one class to another isx. For each level output the number of classes such that for each of these classes there exists some other classy, and the distance from this class toyis exactlyx.ExamplesInput41121Output2223Input41123Output2222", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1fd83aef", "template_md5": "35d339e4", "result": "There are $m$ levels in a game. Each level has a class, and each class is connected to a parent class. The classes form a tree structure.\n\nChanging from one class to its child or parent class costs 1 coin. You cannot change back. The cost of changing from class $a$ to class $b$ is the total cost of changes along the path from $a$ to $b$ in the tree.\n\nFor each level $i$, find the number of classes where the maximum cost to reach another class is $x$. \n\n**Input:**\n\n* The first line contains an integer $m$ (the number of levels).\n* Each of the next $m$ lines contains an integer $y_i$ (the index of the parent class for the class at level $i$).\n\n**Output:**\n\nFor each level $i$, output the number of classes where the maximum cost to reach another class is $x$."}, {"prompt_md5": "c401b3e8", "template_md5": "465699a0", "result": "You are given a tree-like structure where each node represents a class.  Each node has a parent node.  \n\nFor each level of the tree, find the number of nodes where the distance to a specific target node is a given value."}]}