{"uid": "842-A", "url": "https://codeforces.com/contest/842/problem/A", "tags": ["brute force", " two pointers"], "title": "842-A", "statement": "A. Kirill And The Gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputKirill plays a new computer game. He came to the potion store where he can buy any potion. Each potion is characterized by two integers — amount of experience and cost. The efficiency of a potion is the ratio of the amount of experience to the cost. Efficiency may be a non-integer number.For each two integer numbersaandbsuch thatl≤a≤randx≤b≤ythere is a potion with experienceaand costbin the store (that is, there are(r-l+ 1)·(y-x+ 1)potions).Kirill wants to buy a potion which has efficiencyk. Will he be able to do this?InputFirst string contains five integer numbersl,r,x,y,k(1 ≤l≤r≤ 107,1 ≤x≤y≤ 107,1 ≤k≤ 107).OutputPrint \"YES\" without quotes if a potion with efficiency exactlykcan be bought in the store and \"NO\" without quotes otherwise.You can output each of the letters in any register.ExamplesInput1 10 1 10 1OutputYESInput1 5 6 10 1OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "62e4d7eb", "template_md5": "35d339e4", "result": "You are given five integers: $l$, $r$, $x$, $y$, and $k$.  \n\nThere are potions available for purchase, where each potion has an amount of experience and a cost.  The potions available are defined by the following:\n\n* The experience of a potion is an integer between $l$ and $r$ inclusive.\n* The cost of a potion is an integer between $x$ and $y$ inclusive.\n\nThe efficiency of a potion is the ratio of its experience to its cost.\n\nDetermine if there exists a potion with an efficiency exactly equal to $k$. If such a potion exists, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "9b383d09", "template_md5": "465699a0", "result": "You are given a range of possible experience points and costs for potions.  You are also given a target efficiency.  Determine if there is a potion with the target efficiency within the given ranges."}]}