{"uid": "843-A", "url": "https://codeforces.com/contest/843/problem/A", "tags": ["dfs and similar", " dsu", " implementation", " math", " sortings"], "title": "843-A", "statement": "A. Sorting by Subsequencestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a sequencea1,a2, ...,anconsisting ofdifferentintegers. It is required to split this sequence into themaximumnumber of subsequences such that after sorting integers in each of them in increasing order, the total sequence also will be sorted in increasing order.Sorting integers in a subsequence is a process such that the numbers included in a subsequence are ordered in increasing order, and the numbers which are not included in a subsequence don't change their places.Every element of the sequence must appear in exactly one subsequence.InputThe first line of input data contains integern(1 ≤n≤ 105) — the length of the sequence.The second line of input data containsndifferent integersa1,a2, ...,an(- 109≤ai≤ 109) — the elements of the sequence. It is guaranteed that all elements of the sequence are distinct.OutputIn the first line print the maximum number of subsequencesk, which the original sequence can be split into while fulfilling the requirements.In the nextklines print the description of subsequences in the following format: the number of elements in subsequenceci(0 <ci≤n), thenciintegersl1,l2, ...,lci(1 ≤lj≤n) — indices of these elements in the original sequence.Indices could be printed in any order. Every index from1tonmust appear in outputexactly once.If there are several possible answers, print any of them.ExamplesInput63 2 1 6 5 4Output42 1 31 22 4 61 5Input683 -75 -49 11 37 62Output16 1 2 3 4 5 6NoteIn the first sample output:After sorting the first subsequence we will get sequence1 2 3 6 5 4.Sorting the second subsequence changes nothing.After sorting the third subsequence we will get sequence1 2 3 4 5 6.Sorting the last subsequence changes nothing.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "271b9e81", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ distinct integers.  You need to split this sequence into the maximum number of subsequences.  \n\nHere's the catch:\n\n* After sorting each subsequence in increasing order, the entire combined sequence must also be sorted in increasing order.\n* Each element in the original sequence must be part of exactly one subsequence.\n\nOutput the maximum number of subsequences and then list them. Each subsequence should be described by:\n\n1. The number of elements in the subsequence.\n2. The indices of those elements in the original sequence. \n\n\n\nLet me know if you'd like help with any part of the problem!"}, {"prompt_md5": "07e51125", "template_md5": "465699a0", "result": "You are given a list of distinct numbers.  You need to divide the list into groups so that:\n\n1. Each group can be sorted in increasing order.\n2. When you sort each group and place them together, the entire list is sorted in increasing order.\n\nFind the maximum number of groups you can make and list the numbers in each group."}]}