{"uid": "843-C", "url": "https://codeforces.com/contest/843/problem/C", "tags": ["constructive algorithms", " dfs and similar", " graphs", " math", " trees"], "title": "843-C", "statement": "C. Upgrading Treetime limit per test4 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given a tree withnvertices and you are allowed to performno more than2ntransformations on it. Transformation is defined by three verticesx,y,y'and consists of deleting edge(x,y)and adding edge(x,y'). Transformationx,y,y'could be performed if all the following conditions are satisfied:There is an edge(x,y)in the current tree.After the transformation the graph remains a tree.After the deletion of edge(x,y)the tree would consist of two connected components. Let's denote the set of nodes in the component containing vertexxbyVx, and the set of nodes in the component containing vertexybyVy. Then condition|Vx| > |Vy|should be satisfied, i.e. the size of the component withxshould be strictly larger than the size of the component withy.You shouldminimizethe sum of squared distances between all pairs of vertices in a tree, which you could get after no more than2ntransformations and output any sequence of transformations leading initial tree to such state.Note that you don't need to minimize the number of operations. It is necessary to minimize only the sum of the squared distances.InputThe first line of input contains integern(1 ≤n≤ 2·105) — number of vertices in tree.The nextn- 1lines of input contains integersaandb(1 ≤a,b≤n,a≠b) — the descriptions of edges. It is guaranteed that the given edges form a tree.OutputIn the first line output integerk(0 ≤k≤ 2n) — the number of transformations from your example,minimizingsum of squared distances between all pairs of vertices.In each of the nextklines output three integersx,y,y'— indices of vertices from the corresponding transformation.Transformations withy=y'are allowed (even though they don't change tree) if transformation conditions are satisfied.If there are several possible answers, print any of them.ExamplesInput33 21 3Output0Input71 22 33 44 55 66 7Output24 3 24 5 6NoteThis is a picture for the second sample. Added edges are dark, deleted edges are dotted.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "441dd1b0", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices. You can perform at most $2n$ transformations on it. A transformation involves deleting an edge $(x,y)$ and adding a new edge $(x,y')$.  A transformation is valid if:\n\n1. The edge $(x,y)$ exists in the current tree.\n2. After the transformation, the graph remains a tree.\n3. Deleting the edge $(x,y)$ splits the tree into two connected components. The component containing vertex $x$ must have more vertices than the component containing vertex $y$.\n\nYour goal is to find a sequence of at most $2n$ transformations that minimize the sum of squared distances between all pairs of vertices in the resulting tree. You don't need to minimize the number of transformations, only the sum of squared distances.\n\n**Input:**\n\n* The first line contains the number of vertices, $n$.\n* The next $n-1$ lines each contain two integers, $a$ and $b$, representing an edge between vertices $a$ and $b$.\n\n**Output:**\n\n* The first line contains the number of transformations used, $k$.\n* Each of the next $k$ lines contains three integers, $x$, $y$, and $y'$, representing a transformation $(x,y,y')$."}, {"prompt_md5": "5e08774f", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes. You can perform a limited number of operations on the tree. Each operation involves removing one connection between two nodes and adding a new connection between one of those nodes and a different node.  The goal is to perform these operations in a way that minimizes the total distance between all pairs of nodes in the resulting tree. You need to output the number of operations you performed and a list of the operations."}]}