{"uid": "845-D", "url": "https://codeforces.com/contest/845/problem/D", "tags": ["data structures", " dp", " greedy"], "title": "845-D", "statement": "D. Driving Testtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp has just attempted to pass the driving test. He ran over the straight road with the signs of four types.speed limit: this sign comes with a positive integer number — maximal speed of the car after the sign (cancel the action of the previous sign of this type);overtake is allowed: this sign means that after some car meets it, it can overtake any other car;no speed limit: this sign cancels speed limit if any (car can move with arbitrary speed after this sign);no overtake allowed: some car can't overtake any other car after this sign.Polycarp goes past the signs consequentially, each new sign cancels the action of all the previous signs of it's kind (speed limit/overtake). It is possible that two or more \"no overtake allowed\" signs go one after another with zero \"overtake is allowed\" signs between them. It works with \"no speed limit\" and \"overtake is allowed\" signs as well.In the beginning of the ride overtake is allowed and there is no speed limit.You are given the sequence of events in chronological order — events which happened to Polycarp during the ride. There are events of following types:Polycarp changes the speed of his car to specified (this event comes with a positive integer number);Polycarp's car overtakes the other car;Polycarp's car goes past the \"speed limit\" sign (this sign comes with a positive integer);Polycarp's car goes past the \"overtake is allowed\" sign;Polycarp's car goes past the \"no speed limit\";Polycarp's car goes past the \"no overtake allowed\";It is guaranteed that the first event in chronological order is the event of type1(Polycarp changed the speed of his car to specified).After the exam Polycarp can justify his rule violations by telling the driving instructor that he just didn't notice some of the signs. What is the minimal number of signs Polycarp should say he didn't notice, so that he would make no rule violations from his point of view?InputThe first line contains one integer numbern(1 ≤n≤ 2·105) — number of events.Each of the nextnlines starts with integert(1 ≤t≤ 6) — the type of the event.An integers(1 ≤s≤ 300) follows in the query of the first and the third type (if it is the query of first type, then it's new speed of Polycarp's car, if it is the query of third type, then it's new speed limit).It is guaranteed that the first event in chronological order is the event of type1(Polycarp changed the speed of his car to specified).OutputPrint the minimal number of road signs Polycarp should say he didn't notice, so that he would make no rule violations from his point of view.ExamplesInput111 1003 70423 12053 12061 15043 300Output2Input51 1003 200245Output0Input71 20264662Output2NoteIn the first example Polycarp should say he didn't notice the \"speed limit\" sign with the limit of70and the second \"speed limit\" sign with the limit of120.In the second example Polycarp didn't make any rule violation.In the third example Polycarp should say he didn't notice both \"no overtake allowed\" that came after \"overtake is allowed\" sign.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4d534855", "template_md5": "35d339e4", "result": "A driver encounters a series of road signs that affect their speed and overtaking ability. The signs have the following types:\n\n* **Speed Limit:** Sets a maximum speed for the car. Subsequent speed limit signs override previous ones.\n* **Overtake Allowed:** Allows the car to overtake other vehicles. Subsequent \"Overtake Allowed\" signs override previous ones.\n* **No Speed Limit:** Cancels any existing speed limit. Subsequent \"No Speed Limit\" signs override previous ones.\n* **No Overtake Allowed:** Prevents the car from overtaking other vehicles. Subsequent \"No Overtake Allowed\" signs override previous ones.\n\nThe driver starts with no speed limit and is allowed to overtake.\n\nYou are given a sequence of events describing the driver's actions and encounters with these signs. Each event is one of the following types:\n\n1. **Change Speed:** The driver changes their speed to a given value.\n2. **Overtake:** The driver overtakes another vehicle.\n3. **Speed Limit:** The driver passes a speed limit sign with a given maximum speed.\n4. **Overtake Allowed:** The driver passes an \"Overtake Allowed\" sign.\n5. **No Speed Limit:** The driver passes a \"No Speed Limit\" sign.\n6. **No Overtake Allowed:** The driver passes a \"No Overtake Allowed\" sign.\n\nDetermine the minimum number of signs the driver must claim they didn't notice to avoid any rule violations from their perspective."}, {"prompt_md5": "7eb48ead", "template_md5": "465699a0", "result": "A driver follows a sequence of road signs that can change speed limits and overtaking rules. The driver wants to minimize the number of signs they claim to have missed to avoid breaking any rules.  Determine the minimum number of signs the driver should claim to have missed."}]}