{"uid": "845-E", "url": "https://codeforces.com/contest/845/problem/E", "tags": ["binary search", " data structures"], "title": "845-E", "statement": "E. Fire in the Citytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe capital of Berland looks like a rectangle of sizen×mof the square blocks of same size.Fire!It is known thatk+ 1blocks got caught on fire (k+ 1 ≤n·m). Those blocks are centers of ignition. Moreover positions ofkof these centers are known and one of these stays unknown. Allk+ 1positions are distinct.The fire goes the following way: during the zero minute of fire only thesek+ 1centers of ignition are burning. Every next minute the fire goes to all neighbouring blocks to the one which is burning. You can consider blocks to burn for so long that this time exceeds the time taken in the problem. The neighbouring blocks are those that touch the current block by a side or by a corner.Berland Fire Deparment wants to estimate the minimal time it takes the fire to lighten up the whole city. Remember that the positions ofkblocks (centers of ignition) are known and (k+ 1)-th can be positioned in any other block.Help Berland Fire Department to estimate the minimal time it takes the fire to lighten up the whole city.InputThe first line contains three integersn,mandk(1 ≤n,m≤ 109,1 ≤k≤ 500).Each of the nextklines contain two integersxiandyi(1 ≤xi≤n,1 ≤yi≤m) — coordinates of thei-th center of ignition. It is guaranteed that the locations of all centers of ignition are distinct.OutputPrint the minimal time it takes the fire to lighten up the whole city (in minutes).ExamplesInput7 7 31 22 15 5Output3Input10 5 13 3Output2NoteIn the first example the last block can have coordinates(4, 4).In the second example the last block can have coordinates(8, 3).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9a752f3a", "template_md5": "35d339e4", "result": "A city is represented as a grid of $n \\times m$ blocks.  There are $k+1$ blocks that catch fire, where $k$ of their locations are known. The fire spreads to adjacent blocks (horizontally, vertically, or diagonally) each minute.\n\nGiven the locations of the $k$ known fire blocks, find the minimum number of minutes it takes for the fire to spread to all blocks in the city. \n\n**Input:**\n\n* Three integers: $n$, $m$, and $k$ ($1 \\le n, m \\le 10^9$, $1 \\le k \\le 500$)\n* $k$ lines, each containing two integers $x_i$ and $y_i$ (1 $\\le x_i \\le n$, 1 $\\le y_i \\le m$) representing the coordinates of a known fire block.\n\n**Output:**\n\n* An integer representing the minimum time (in minutes) for the fire to spread to all blocks."}, {"prompt_md5": "b327e349", "template_md5": "465699a0", "result": "A city is represented as a grid. Some squares in the grid catch fire. Fire spreads to adjacent squares each minute. You know the location of most of the initial fires, but not the last one.  Find the minimum time it takes for the fire to spread to all squares in the grid."}]}