{"uid": "845-G", "url": "https://codeforces.com/contest/845/problem/G", "tags": ["dfs and similar", " graphs", " math"], "title": "845-G", "statement": "G. Shortest Path Problem?time limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given an undirected graph with weighted edges. The length of some path between two vertices is the bitwise xor of weights of all edges belonging to this path (if some edge is traversed more than once, then it is included in bitwise xor the same number of times). You have to find the minimum length of path between vertex1and vertexn.Note that graph can contain multiple edges and loops. It is guaranteed that the graph is connected.InputThe first line contains two numbersnandm(1 ≤n≤ 100000,n- 1 ≤m≤ 100000) — the number of vertices and the number of edges, respectively.Thenmlines follow, each line containing three integer numbersx,yandw(1 ≤x,y≤n,0 ≤w≤ 108). These numbers denote an edge that connects verticesxandyand has weightw.OutputPrint one number — the minimum length of path between vertices1andn.ExamplesInput3 31 2 31 3 23 2 0Output2Input2 21 1 31 2 3Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3afb6570", "template_md5": "35d339e4", "result": "You are given a network of connected points (vertices) with weighted edges.  The weight of a path between two points is the bitwise XOR of the weights of all the edges along that path.  If an edge is used multiple times in a path, its weight is XORed in as many times.\n\nFind the shortest path (the path with the smallest weight) between point 1 and point $n$.\n\n**Input:**\n\n* The first line contains two numbers, $n$ and $m$, representing the number of points and the number of edges, respectively.\n* The next $m$ lines each contain three numbers, $x$, $y$, and $w$, representing an edge connecting points $x$ and $y$ with weight $w$.\n\n**Output:**\n\n* Print a single number representing the minimum weight of a path between point 1 and point $n$."}, {"prompt_md5": "3546302c", "template_md5": "465699a0", "result": "You are given a network of connected points. Each connection between points has a weight.  The cost to travel between two points is the sum of the weights of all the connections used. Find the lowest cost path between a starting point and an ending point."}]}