{"uid": "845-A", "url": "https://codeforces.com/contest/845/problem/A", "tags": ["implementation", " sortings"], "title": "845-A", "statement": "A. Chess Tourneytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputBerland annual chess tournament is coming!Organizers have gathered2·nchess players who should be divided into two teams withnpeople each. The first team is sponsored by BerOil and the second team is sponsored by BerMobile. Obviously, organizers should guarantee the win for the team of BerOil.Thus, organizers should divide all2·nplayers into two teams withnpeople each in such a way that the first team always wins.Every chess player has its ratingri. It is known that chess player with the greater rating always wins the player with the lower rating. If their ratings are equal then any of the players can win.After teams assignment there will come a drawing to formnpairs of opponents: in each pair there is a player from the first team and a player from the second team. Every chess player should be in exactly one pair. Every pair plays once. The drawing is totally random.Is it possible to divide all2·nplayers into two teams withnpeople each so that the player from the first team in every pair winsregardlessof the results of the drawing?InputThe first line contains one integern(1 ≤n≤ 100).The second line contains2·nintegersa1,a2, ...a2n(1 ≤ai≤ 1000).OutputIf it's possible to divide all2·nplayers into two teams withnpeople each so that the player from the first team in every pair wins regardless of the results of the drawing, then print\"YES\". Otherwise print\"NO\".ExamplesInput21 3 2 4OutputYESInput13 3OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "143921e6", "template_md5": "35d339e4", "result": "You are given an even number of integers, $2n$, representing the ratings of $2n$ chess players.  \n\nYou need to divide these players into two teams of $n$ players each.  \n\nDetermine if it is possible to form the teams so that a player from the first team will always win against a player from the second team, regardless of which players are matched up against each other. \n\nIf it is possible, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "c1cbbf78", "template_md5": "465699a0", "result": "You are given an even number of people, each with a rating.  You need to divide them into two equal groups.  Can you arrange the groups so that each person in one group will always beat the person they are paired with from the other group, regardless of who they are matched with?"}]}