{"uid": "846-B", "url": "https://codeforces.com/contest/846/problem/B", "tags": ["brute force", " greedy"], "title": "846-B", "statement": "B. Math Showtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp takes part in a math show. He is givenntasks, each consists ofksubtasks, numbered1throughk. It takes himtjminutes to solve thej-th subtask of any task. Thus, time required to solve a subtask depends only on its index, but not on the task itself. Polycarp can solve subtasks in any order.By solving subtask of arbitrary problem he earns one point. Thus, the number of points for task is equal to the number of solved subtasks in it. Moreover, if Polycarpcompletelysolves the task (solves allkof its subtasks), he recieves one extra point. Thus, total number of points he recieves for the complete solution of the task isk+ 1.Polycarp hasMminutes of time. What is the maximum number of points he can earn?InputThe first line contains three integer numbersn,kandM(1 ≤n≤ 45,1 ≤k≤ 45,0 ≤M≤ 2·109).The second line containskinteger numbers, valuestj(1 ≤tj≤ 1000000), wheretjis the time in minutes required to solvej-th subtask of any task.OutputPrint the maximum amount of points Polycarp can earn inMminutes.ExamplesInput3 4 111 2 3 4Output6Input5 5 101 2 4 8 16Output7NoteIn the first example Polycarp can complete the first task and spend1 + 2 + 3 + 4 = 10minutes. He also has the time to solve one subtask of the second task in one minute.In the second example Polycarp can solve the first subtask of all five tasks and spend5·1 = 5minutes. Also he can solve the second subtasks of two tasks and spend2·2 = 4minutes. Thus, he earns5 + 2 = 7points in total.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7a7065d0", "template_md5": "35d339e4", "result": "There are $n$ tasks, each with $k$ subtasks. It takes $t_j$ minutes to solve the $j$-th subtask of any task.  You can solve subtasks in any order.\n\n* You earn 1 point for solving each subtask.\n* You earn an additional 1 point for completing a task (solving all $k$ of its subtasks).\n\nYou have $M$ minutes. What is the maximum number of points you can earn?"}, {"prompt_md5": "68758701", "template_md5": "465699a0", "result": "You have a set of tasks, each with multiple subtasks. Each subtask takes a specific amount of time to complete. You have a limited amount of time.  What is the maximum number of points you can earn by completing subtasks, where you get one point per subtask and an extra point for completing all subtasks of a task?"}]}