{"uid": "846-F", "url": "https://codeforces.com/contest/846/problem/F", "tags": ["data structures", " math", " probabilities", " two pointers"], "title": "846-F", "statement": "F. Random Querytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an arrayaconsisting ofnpositive integers. You pick two integer numberslandrfrom1ton, inclusive (numbers are picked randomly, equiprobably and independently). Ifl>r, then you swap values oflandr. You have to calculate the expected value of the number of unique elements in segment of the array from indexlto indexr, inclusive (1-indexed).InputThe first line contains one integer numbern(1 ≤n≤ 106). The second line containsninteger numbersa1,a2, ...an(1 ≤ai≤ 106)— elements of the array.OutputPrint one number — the expected number of unique elements in chosen segment.Your answer will be considered correct if its absolute or relative error doesn't exceed10- 4— formally, the answer is correct if, wherexis jury's answer, andyis your answer.ExamplesInput21 2Output1.500000Input22 2Output1.000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e98c71e4", "template_md5": "35d339e4", "result": "You are given an array of $n$ positive integers.  You randomly choose two indices $l$ and $r$ from 1 to $n$ (inclusive). If $l > r$, you swap the values at those indices.  \n\nCalculate the expected number of unique elements in the segment of the array from index $l$ to index $r$, inclusive. \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁶).\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (1 ≤ $a_i$ ≤ 10⁶) — the elements of the array.\n\n**Output:**\n\nPrint one number — the expected number of unique elements in the chosen segment. Your answer will be considered correct if its absolute or relative error doesn't exceed 10⁻⁴."}, {"prompt_md5": "e5d12582", "template_md5": "465699a0", "result": "You are given a list of numbers.  You randomly pick two positions in the list.  Calculate the average number of unique numbers between those two positions, considering all possible pairs of positions."}]}