{"uid": "846-E", "url": "https://codeforces.com/contest/846/problem/E", "tags": ["dfs and similar", " greedy", " trees"], "title": "846-E", "statement": "E. Chemistry in Berlandtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIgor is a post-graduate student of chemistry faculty in Berland State University (BerSU). He needs to conduct a complicated experiment to write his thesis, but laboratory of BerSU doesn't contain all the materials required for this experiment.Fortunately, chemical laws allow material transformations (yes, chemistry in Berland differs from ours). But the rules of transformation are a bit strange.Berland chemists are aware ofnmaterials, numbered in the order they were discovered. Each material can be transformed into some other material (or vice versa). Formally, for eachi(2 ≤i≤n)there exist two numbersxiandkithat denote a possible transformation:kikilograms of materialxican be transformed into1kilogram of materiali, and1kilogram of materialican be transformed into1kilogram of materialxi. Chemical processing equipment in BerSU allows only such transformation that the amount of resulting material isalways an integer number of kilograms.For eachi(1 ≤i≤n) Igor knows that the experiment requiresaikilograms of materiali, and the laboratory containsbikilograms of this material. Is it possible to conduct an experiment after transforming some materials (or none)?InputThe first line contains one integer numbern(1 ≤n≤ 105) — the number of materials discovered by Berland chemists.The second line containsninteger numbersb1,b2...bn(1 ≤bi≤ 1012) — supplies of BerSU laboratory.The third line containsninteger numbersa1,a2...an(1 ≤ai≤ 1012) — the amounts required for the experiment.Thenn- 1lines follow.j-th of them contains two numbersxj+ 1andkj+ 1that denote transformation of(j+ 1)-th material (1 ≤xj+ 1≤j, 1 ≤kj+ 1≤ 109).OutputPrintYESif it is possible to conduct an experiment. Otherwise printNO.ExamplesInput31 2 33 2 11 11 1OutputYESInput33 2 11 2 31 11 2OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "87cded24", "template_md5": "35d339e4", "result": "There are $n$ materials.  For each material $i$ (where $2 \\le i \\le n$), there are two numbers $x_i$ and $k_i$ that describe a transformation: $k_i$ kilograms of material $x_i$ can be transformed into 1 kilogram of material $i$, and 1 kilogram of material $i$ can be transformed into $k_i$ kilograms of material $x_i$.\n\nYou are given the amount of each material available in a lab ($b_i$) and the amount of each material required for an experiment ($a_i$).\n\nDetermine if it is possible to conduct the experiment by transforming materials.\n\n**Input:**\n\n* The first line contains an integer $n$ (the number of materials).\n* The second line contains $n$ integers $b_1, b_2, ..., b_n$ (the amount of each material available).\n* The third line contains $n$ integers $a_1, a_2, ..., a_n$ (the amount of each material required).\n* The next $n-1$ lines each contain two integers $x_i+1$ and $k_i+1$ (describing the transformation for material $i+1$).\n\n**Output:**\n\n* Print \"YES\" if it is possible to conduct the experiment.\n* Print \"NO\" otherwise."}, {"prompt_md5": "87165651", "template_md5": "465699a0", "result": "You are given a list of items and the amount needed for a task. You also have a list of items and their available quantities. Some items can be transformed into other items in specific ratios.  Determine if it's possible to obtain the required amount of each item for the task."}]}