{"uid": "847-B", "url": "https://codeforces.com/contest/847/problem/B", "tags": ["binary search", " data structures"], "title": "847-B", "statement": "B. Preparing for Merge Sorttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIvan has an array consisting ofndifferent integers. He decided to reorder all elements in increasing order. Ivan loves merge sort so he decided to represent his array with one or several increasing sequences which he then plans to merge into one sorted array.Ivan represent his array with increasing sequences with help of the following algorithm.While there is at least one unused number in array Ivan repeats the following procedure:iterate through array from the left to the right;Ivan only looks at unused numbers on current iteration;if current number is the first unused number on this iteration or this number is greater than previous unused number on current iteration, then Ivan marks the number as used and writes it down.For example, if Ivan's array looks like[1, 3, 2, 5, 4]then he will perform two iterations. On first iteration Ivan will use and write numbers[1, 3, 5], and on second one —[2, 4].Write a program which helps Ivan and finds representation of the given array with one or several increasing sequences in accordance with algorithm described above.InputThe first line contains a single integern(1 ≤n≤ 2·105) — the number of elements in Ivan's array.The second line contains a sequence consisting of distinct integersa1,a2, ...,an(1 ≤ai≤ 109) — Ivan's array.OutputPrint representation of the given array in the form of one or more increasing sequences in accordance with the algorithm described above. Each sequence must be printed on a new line.ExamplesInput51 3 2 5 4Output1 3 52 4Input44 3 2 1Output4321Input410 30 50 101Output10 30 50 101", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c72fcd44", "template_md5": "35d339e4", "result": "You are given an array of $n$ distinct integers.  You need to find a way to represent this array as one or more increasing sequences.  \n\nHere's how to create these sequences:\n\n1. Start with an empty list of sequences.\n2. Iterate through the array.\n3. For each unused number in the array:\n    * If it's the first unused number encountered in the current iteration, or if it's greater than the last unused number in the current sequence, add it to the current sequence.\n4. Once all numbers have been used, you have your representation of the array as increasing sequences.\n\nOutput the sequences, each on a new line."}, {"prompt_md5": "6eabc510", "template_md5": "465699a0", "result": "Given a list of distinct numbers, find a way to group them into increasing sequences.  Each sequence is formed by picking numbers from the list, starting with the first unused number, and then adding the next unused number that is greater than the previous one. Print each sequence on a new line."}]}