{"uid": "847-A", "url": "https://codeforces.com/contest/847/problem/A", "tags": ["implementation"], "title": "847-A", "statement": "A. Union of Doubly Linked Liststime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDoubly linked list is one of the fundamental data structures. A doubly linked list is a sequence of elements, each containing information about the previous and the next elements of the list. In this problem all lists have linear structure. I.e. each element except the first has exactly one previous element, each element except the last has exactly one next element. The list is not closed in a cycle.In this problem you are givennmemory cells forming one or more doubly linked lists. Each cell contains information about element from some list. Memory cells are numbered from1ton.For each celliyou are given two values:li— cell containing previous element for the element in the celli;ri— cell containing next element for the element in the celli.If cellicontains information about the element which has no previous element thenli= 0. Similarly, if cellicontains information about the element which has no next element thenri= 0.Three lists are shown on the picture.For example, for the picture above the values oflandrare the following:l1= 4,r1= 7;l2= 5,r2= 0;l3= 0,r3= 0;l4= 6,r4= 1;l5= 0,r5= 2;l6= 0,r6= 4;l7= 1,r7= 0.Your task is to unite all given lists in a single list, joining them to each other in any order. In particular, if the input data already contains a single list, then there is no need to perform any actions. Print the resulting list in the form of valuesli,ri.Any other action, other than joining the beginning of one list to the end of another, can not be performed.InputThe first line contains a single integern(1 ≤n≤ 100) — the number of memory cells where the doubly linked lists are located.Each of the followingnlines contains two integersli,ri(0 ≤li,ri≤n) — the cells of the previous and the next element of list for celli. Valueli= 0if element in cellihas no previous element in its list. Valueri= 0if element in cellihas no next element in its list.It is guaranteed that the input contains the correct description of a single or more doubly linked lists. All lists have linear structure: each element of list except the first has exactly one previous element; each element of list except the last has exactly one next element. Each memory cell contains information about one element from some list, each element of each list written in one ofngiven cells.OutputPrintnlines, thei-th line must contain two integersliandri— the cells of the previous and the next element of list for celliafter all lists from the input are united in a single list. If there are many solutions print any of them.ExampleInput74 75 00 06 10 20 41 0Output4 75 60 56 13 22 41 0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "84388ae0", "template_md5": "35d339e4", "result": "You are given a set of memory cells, each containing information about a doubly linked list. Each cell has two values:\n\n*  `l[i]`: The cell number of the previous element in the list.\n*  `r[i]`: The cell number of the next element in the list.\n\nIf a cell has no previous element, `l[i]` is 0. If a cell has no next element, `r[i]` is 0.\n\nYour task is to merge all the given lists into a single list. You can only join the beginning of one list to the end of another list. \n\nOutput the resulting list in the same format as the input, showing the `l` and `r` values for each cell."}, {"prompt_md5": "9509efa0", "template_md5": "465699a0", "result": "You are given a set of linked lists. Each list is represented by a sequence of numbers where each number indicates the previous and next element in the list.  Your task is to merge all the lists into a single list and output the resulting sequence of numbers."}]}