{"uid": "847-G", "url": "https://codeforces.com/contest/847/problem/G", "tags": ["implementation"], "title": "847-G", "statement": "G. University Classestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arenstudent groups at the university. During the study day, each group can take no more than7classes. Seven time slots numbered from1to7are allocated for the classes.The schedule on Monday is known for each group, i. e. time slots when group will have classes are known.Your task is to determine the minimum number of rooms needed to hold classes for all groups on Monday. Note that one room can hold at most one group class in a single time slot.InputThe first line contains a single integern(1 ≤n≤ 1000) — the number of groups.Each of the followingnlines contains a sequence consisting of7zeroes and ones — the schedule of classes on Monday for a group. If the symbol in a position equals to1then the group has class in the corresponding time slot. In the other case, the group has no class in the corresponding time slot.OutputPrint minimum number of rooms needed to hold all groups classes on Monday.ExamplesInput201010101010101Output1Input3010101100110010110111Output3NoteIn the first example one room is enough. It will be occupied in each of the seven time slot by the first group or by the second group.In the second example three rooms is enough, because in the seventh time slot all three groups have classes.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6e425d2f", "template_md5": "35d339e4", "result": "There are $n$ groups of students. Each group can attend a maximum of 7 classes on Monday.  Classes are held in 7 time slots, numbered 1 through 7.  \n\nYou are given the schedule for each group, indicating which time slots they have classes (1 means a class, 0 means no class).\n\nFind the minimum number of rooms needed so that all groups can attend their classes on Monday, given that each room can only hold one group's class at a time."}, {"prompt_md5": "ff3a722a", "template_md5": "465699a0", "result": "You have a number of groups, each with a schedule of classes on a single day. Each class is held in a specific time slot.  Find the fewest number of rooms needed so that all classes can be held simultaneously, with each room holding only one class at a time."}]}