{"uid": "847-F", "url": "https://codeforces.com/contest/847/problem/F", "tags": ["greedy", " sortings"], "title": "847-F", "statement": "F. Berland Electionstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe elections to Berland parliament are happening today. Voting is in full swing!Totally there arencandidates, they are numbered from1ton. Based on election resultsk(1 ≤k≤n) top candidates will take seats in the parliament.After the end of the voting the number of votes for each candidate is calculated. In the resulting table the candidates are ordered by the number of votes. In case of tie (equal number of votes) they are ordered by the time of the last vote given. The candidate with ealier last vote stands higher in the resulting table.So in the resulting table candidates are sorted by the number of votes (more votes stand for the higher place) and if two candidates have equal number of votes they are sorted by the time of last vote (earlier last vote stands for the higher place).There is no way for a candidate with zero votes to take a seat in the parliament. So it is possible that less thankcandidates will take a seat in the parliament.In Berland there aremcitizens who can vote. Each of them will vote for some candidate. Each citizen will give a vote to exactly one ofncandidates. There is no option \"against everyone\" on the elections. It is not accepted to spoil bulletins or not to go to elections. So each ofmcitizens will vote for exactly one ofncandidates.At the momentacitizens have voted already (1 ≤a≤m). This is an open election, so for each citizen it is known the candidate for which the citizen has voted. Formally, thej-th citizen voted for the candidategj. The citizens who already voted are numbered in chronological order; i.e. the(j+ 1)-th citizen voted after thej-th.The remainingm-acitizens will vote before the end of elections, each of them will vote for one ofncandidates.Your task is to determine for each ofncandidates one of the three possible outcomes:a candidate will be elected to the parliament regardless of votes of the remainingm-acitizens;a candidate has chance to be elected to the parliament after allncitizens have voted;a candidate has no chances to be elected to the parliament regardless of votes of the remainingm-acitizens.InputThe first line contains four integersn,k,manda(1 ≤k≤n≤ 100,1 ≤m≤ 100,1 ≤a≤m) — the number of candidates, the number of seats in the parliament, the number of Berland citizens and the number of citizens who already have voted.The second line contains a sequence ofaintegersg1,g2, ...,ga(1 ≤gj≤n), wheregjis the candidate for which thej-th citizen has voted. Citizens who already voted are numbered in increasing order of voting times.OutputPrint the sequence consisting ofnintegersr1,r2, ...,rnwhere:ri= 1means that thei-th candidate is guaranteed to take seat in the parliament regardless of votes of the remainingm-acitizens;ri= 2means that thei-th candidate has a chance to take a seat in the parliament, i.e. the remainingm-acitizens can vote in such a way that the candidate will take a seat in the parliament;ri= 3means that thei-th candidate will not take a seat in the parliament regardless of votes of the remainingm-acitizens.ExamplesInput3 1 5 41 2 1 3Output1 3 3Input3 1 5 31 3 1Output2 3 2Input3 2 5 31 3 1Output1 2 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d6b46b1d", "template_md5": "35d339e4", "result": "There are $n$ candidates running for $k$ seats in parliament.  We know the number of votes each candidate has received so far from $a$ voters.  We also know which candidate each of these $a$ voters chose. The remaining $m-a$ voters will vote later.\n\nYour task is to determine for each candidate if they are guaranteed to win a seat, have a chance to win a seat, or are guaranteed to not win a seat, regardless of how the remaining voters vote.\n\n**Rules:**\n\n* Candidates are ranked by the number of votes they have received.\n* If two candidates have the same number of votes, the candidate who received their last vote earlier is ranked higher.\n* A candidate with zero votes cannot win a seat.\n\n\n\nLet $r_i$ represent the outcome for the $i$th candidate.\n\n* $r_i = 1$ means the $i$th candidate is guaranteed to win a seat.\n* $r_i = 2$ means the $i$th candidate has a chance to win a seat.\n* $r_i = 3$ means the $i$th candidate is guaranteed to not win a seat. \n\nOutput a sequence of $n$ integers, $r_1, r_2, ..., r_n$."}, {"prompt_md5": "6946a710", "template_md5": "465699a0", "result": "You are given a list of candidates and the number of votes each has received so far. Some citizens have already voted, and the rest will vote later.  You need to determine for each candidate if they are guaranteed a seat in parliament, have a chance of getting a seat, or are definitely not getting a seat, regardless of how the remaining citizens vote."}]}