{"uid": "848-B", "url": "https://codeforces.com/contest/848/problem/B", "tags": ["constructive algorithms", " data structures", " geometry", " implementation", " sortings", " two pointers"], "title": "848-B", "statement": "B. Rooter's Songtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputWherever the destination is, whoever we meet, let's render this song together.On a Cartesian coordinate plane lies a rectangular stage of sizew×h, represented by a rectangle with corners(0, 0),(w, 0),(w,h)and(0,h). It can be seen that no collisions will happen before one enters the stage.On the sides of the stage standndancers. Thei-th of them falls into one of the following groups:Vertical: stands at(xi, 0), moves in positiveydirection (upwards);Horizontal: stands at(0,yi), moves in positivexdirection (rightwards).According to choreography, thei-th dancer should stand still for the firsttimilliseconds, and then start moving in the specified direction at1unit per millisecond, until another border is reached. It is guaranteed that no two dancers have the same group, position and waiting time at the same time.When two dancers collide (i.e. are on the same point at some time when both of them are moving), they immediately exchange their moving directions and go on.Dancers stop when a border of the stage is reached. Find out every dancer's stopping position.InputThe first line of input contains three space-separated positive integersn,wandh(1 ≤n≤ 100 000,2 ≤w,h≤ 100 000) — the number of dancers and the width and height of the stage, respectively.The followingnlines each describes a dancer: thei-th among them contains three space-separated integersgi,pi, andti(1 ≤gi≤ 2,1 ≤pi≤ 99 999,0 ≤ti≤ 100 000), describing a dancer's groupgi(gi= 1— vertical,gi= 2— horizontal), position, and waiting time. Ifgi= 1thenpi=xi; otherwisepi=yi. It's guaranteed that1 ≤xi≤w- 1and1 ≤yi≤h- 1. It is guaranteed that no two dancers have the same group, position and waiting time at the same time.OutputOutputnlines, thei-th of which contains two space-separated integers(xi,yi)— the stopping position of thei-th dancer in the input.ExamplesInput8 10 81 1 101 4 131 7 11 8 22 2 02 5 142 6 02 6 1Output4 810 58 810 610 21 87 810 6Input3 2 31 1 22 1 11 1 5Output1 32 11 3NoteThe first example corresponds to the initial setup in the legend, and the tracks of dancers are marked with different colours in the following figure.In the second example, no dancers collide.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "73f8256d", "template_md5": "35d339e4", "result": "You are given a rectangular stage of size $w \\times h$.  There are $n$ dancers, each starting at a specific point on the edge of the stage. Each dancer belongs to one of two groups:\n\n* **Vertical:** Starts at $(x_i, 0)$ and moves upwards.\n* **Horizontal:** Starts at $(0, y_i)$ and moves to the right.\n\nEach dancer waits for a certain amount of time ($t_i$) before starting to move. Once they start moving, they move at a speed of 1 unit per millisecond until they hit a border of the stage.\n\nWhen two dancers collide (occupy the same point at the same time), they swap their directions of movement and continue.\n\nYour task is to determine the final position of each dancer after they stop moving. \n\n**Input:**\n\n* The first line contains three integers: $n$, $w$, and $h$ (the number of dancers, width of the stage, and height of the stage).\n* Each of the following $n$ lines describes a dancer:\n    * Three integers: $g_i$, $p_i$, and $t_i$ \n        * $g_i = 1$ if the dancer is vertical, $g_i = 2$ if the dancer is horizontal.\n        * $p_i$ is the starting $x$ coordinate for vertical dancers, or the starting $y$ coordinate for horizontal dancers.\n        * $t_i$ is the waiting time in milliseconds.\n\n**Output:**\n\n* Output $n$ lines, each containing two integers: $x_i$ and $y_i$, representing the final position of the $i$-th dancer."}, {"prompt_md5": "34187628", "template_md5": "465699a0", "result": "You have a rectangular stage. Dancers start at specific points on the edges of the stage and wait for a certain amount of time before moving either up or right. When two dancers meet, they switch directions.  Find the final position of each dancer."}]}