{"uid": "848-D", "url": "https://codeforces.com/contest/848/problem/D", "tags": ["combinatorics", " dp", " flows", " graphs"], "title": "848-D", "statement": "D. Shake It!time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA never-ending, fast-changing and dream-like world unfolds, as the secret door opens.Aworldis an unordered graphG, in whose vertex setV(G)there are two special verticess(G)andt(G). Aninitial worldhas vertex set{s(G),t(G)}and an edge between them.A total ofnchanges took place in aninitial world. In each change, a new vertexwis added intoV(G),an existing edge(u,v)is chosen, and two edges(u,w)and(v,w)are added intoE(G). Note that it's possible that some edges are chosen in more than one change.It's known that the capacity of the minimums-tcut of the resulting graph ism, that is, at leastmedges need to be removed in order to makes(G)andt(G)disconnected.Count the number ofnon-similar worldsthat can be built under the constraints, modulo109+ 7. We define twoworldssimilar, if they are isomorphic and there is isomorphism in which thesandtvertices are not relabelled. Formally, twoworldsGandHare considered similar, if there is a bijection between their vertex sets, such that:f(s(G)) =s(H);f(t(G)) =t(H);Two verticesuandvofGare adjacent inGif and only iff(u)andf(v)are adjacent inH.InputThe first and only line of input contains two space-separated integersn,m(1 ≤n,m≤ 50) — the number of operations performed and the minimum cut, respectively.OutputOutput one integer — the number ofnon-similar worldsthat can be built, modulo109+ 7.ExamplesInput3 2Output6Input4 4Output3Input7 3Output1196Input31 8Output64921457NoteIn the first example, the following6worldsare pairwise non-similar and satisfy the constraints, withs(G)marked in green,t(G)marked in blue, and one of their minimum cuts in light blue.In the second example, the following3worldssatisfy the constraints.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2428572f", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $m$.  \n\nYou need to find the number of ways to build a graph with the following properties:\n\n* The graph starts with two vertices, $s$ and $t$, connected by a single edge.\n* Over $n$ steps, you add new vertices and edges to the graph.\n* In each step, you:\n    * Add a new vertex to the graph.\n    * Choose an existing edge $(u,v)$ in the graph.\n    * Add two new edges $(u,w)$ and $(v,w)$ to the graph, where $w$ is the new vertex.\n\nThe minimum number of edges that need to be removed to disconnect vertices $s$ and $t$ in the final graph is $m$.\n\nTwo graphs are considered \"similar\" if they are isomorphic, meaning you can rearrange the vertices of one graph to make it look exactly like the other, and the mapping between vertices preserves the connections (edges).\n\nFind the number of non-similar graphs that can be built under these rules, and output the result modulo $10^9 + 7$."}, {"prompt_md5": "d13aba2a", "template_md5": "465699a0", "result": "You are given two numbers, *n* and *m*.  You need to find how many different ways you can build a network of connected points (nodes) with these rules:\n\n* Start with two points.\n* In each of the next *n* steps, add a new point and connect it to two existing points.\n* The network must always be connected, meaning you can always travel from the first point to the second point by following the connections.\n* The minimum number of connections you need to remove to disconnect the network is *m*.\n\nCount the number of unique networks you can build, considering that two networks are the same if you can rearrange the points without changing the connections."}]}