{"uid": "85-A", "url": "https://codeforces.com/contest/85/problem/A", "tags": ["constructive algorithms", " implementation"], "title": "85-A", "statement": "A. Dominotime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutWe all know the problem about the number of ways one can tile a2 ×nfield by1 × 2dominoes. You probably remember that it goes down to Fibonacci numbers. We will talk about some other problem below, there you also are going to deal with tiling a rectangular field with dominoes.You are given a4 ×nrectangular field, that is the field that contains four lines andncolumns. You have to find for it any tiling by1 × 2dominoes such that each of then- 1potential vertical cuts along the grid lines intersects at least one domino, splitting it in two. No two dominoes in the sought tiling should overlap, each square of the field should be covered by exactly one domino. It is allowed to rotate the dominoes, that is, you can use2 × 1as well as1 × 2dominoes.Write a program that finds an arbitrary sought tiling.InputThe input contains one positive integern(1 ≤n≤ 100) — the number of the field's columns.OutputIf there's no solution, print \"-1\" (without the quotes). Otherwise, print four lines containingncharacters each — that's the description of tiling, where each vertical cut intersects at least one domino. You should print the tiling, having painted the field in no more than26colors. Each domino should be painted a color. Different dominoes can be painted the same color, but dominoes of the same color should not be side-neighbouring. To indicate colors you should use lowercase Latin letters. Print any of the acceptable ways of tiling.ExamplesInput4Outputyyzzbccdbxxdyyaa", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "efee2c16", "template_md5": "35d339e4", "result": "You are given a 4 x $n$ rectangular grid. You need to find a way to tile the grid using 1 x 2 dominoes (which can be rotated) such that every vertical cut through the grid intersects at least one domino.  \n\nNo two dominoes can overlap, and each square on the grid must be covered by exactly one domino.\n\nOutput your solution as a 4-line grid where each character represents a different color used to tile a domino.  \n\n**Constraints:**\n\n* $1 \\le n \\le 100$ \n\n\nIf no such tiling exists, output \"-1\"."}, {"prompt_md5": "09fdace4", "template_md5": "465699a0", "result": "You are given a 4xN rectangle.  You need to fill it with dominoes (which can be placed horizontally or vertically) so that every vertical line through the rectangle cuts at least one domino.  Output a valid arrangement of dominoes, coloring each domino with a letter.  No two adjacent dominoes can have the same color."}]}