{"uid": "850-D", "url": "https://codeforces.com/contest/850/problem/D", "tags": ["constructive algorithms", " dp", " graphs", " greedy", " math"], "title": "850-D", "statement": "D. Tournament Constructiontime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputIvan is reading a book about tournaments. He knows that a tournament is an oriented graph with exactly one oriented edge between each pair of vertices. The score of a vertex is the number of edges going outside this vertex.Yesterday Ivan learned Landau's criterion: there is tournament with scoresd1≤d2≤ ... ≤dnif and only iffor all1 ≤k<nand.Now, Ivan wanna solve following problem: given asetof numbersS= {a1,a2, ...,am}, is there a tournament with given set of scores? I.e. is there tournament with sequence of scoresd1,d2, ...,dnsuch that if we remove duplicates in scores, we obtain the required set{a1,a2, ...,am}?Find a tournament withminimumpossible number of vertices.InputThe first line contains a single integerm(1 ≤m≤ 31).The next line containsmdistinct integersa1,a2, ...,am(0 ≤ai≤ 30) — elements of the setS. It is guaranteed that all elements of the set are distinct.OutputIf there are no such tournaments, print string \"=(\" (without quotes).Otherwise, print an integern— the number of vertices in the tournament.Then printnlines withncharacters — matrix of the tournament. Thej-th element in thei-th row should be1if the edge between thei-th and thej-th vertices is oriented towards thej-th vertex, and0otherwise. The main diagonal should contain only zeros.ExamplesInput21 2Output40011100101000010Input20 3Output6000111100011110001011001001101000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1f29cfe7", "template_md5": "35d339e4", "result": "Given a set of distinct non-negative integers $S = \\{a_1, a_2, ..., a_m\\}$, determine if there exists a tournament with scores $d_1, d_2, ..., d_n$ such that removing duplicates from the scores results in the set $S$. If such a tournament exists, output the minimum number of vertices $n$ and the corresponding tournament represented as an adjacency matrix.\n\n**Tournament Definition:**\n\nA tournament is a directed graph where each pair of distinct vertices has exactly one directed edge between them. The score of a vertex is the number of edges directed outwards from that vertex.\n\n**Landau's Criterion:**\n\nA tournament has scores $d_1 \\le d_2 \\le ... \\le d_n$ if and only if  $\\sum_{i=1}^{k} d_i \\le \\sum_{j=k+1}^{n} d_j$ for all $1 \\le k < n$.\n\n\n\nLet me know if you'd like me to elaborate on any of these concepts."}, {"prompt_md5": "bfdc5795", "template_md5": "465699a0", "result": "Given a set of distinct numbers, determine if a tournament (a type of directed graph with one edge between each pair of vertices) can be constructed with those numbers as the scores of the vertices. If possible, output the minimum number of vertices needed and the structure of the tournament."}]}