{"uid": "850-C", "url": "https://codeforces.com/contest/850/problem/C", "tags": ["bitmasks", " dp", " games"], "title": "850-C", "statement": "C. Arpa and a game with Mojtabatime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMojtaba and Arpa are playing a game. They have a list ofnnumbers in the game.In a player's turn, he chooses a numberpk(wherepis a prime number andkis a positive integer) such thatpkdivides at least one number in the list. For each number in the list divisible bypk, call itx, the player will deletexand addto the list. The player who can not make a valid choice ofpandkloses.Mojtaba starts the game and the players alternatively make moves. Determine which one of players will be the winner if both players play optimally.InputThe first line contains a single integern(1 ≤n≤ 100) — the number of elements in the list.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 109) — the elements of the list.OutputIf Mojtaba wins, print \"Mojtaba\", otherwise print \"Arpa\" (without quotes).You can print each letter in any case (upper or lower).ExamplesInput41 1 1 1OutputArpaInput41 1 17 17OutputMojtabaInput41 1 17 289OutputArpaInput51 2 3 4 5OutputArpaNoteIn the first sample test, Mojtaba can't move.In the second sample test, Mojtaba choosesp= 17andk= 1, then the list changes to[1, 1, 1, 1].In the third sample test, if Mojtaba choosesp= 17andk= 1, then Arpa choosesp= 17andk= 1and wins, if Mojtaba choosesp= 17andk= 2, then Arpa choosesp= 17andk= 1and wins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "df5daf73", "template_md5": "35d339e4", "result": "Two players take turns in a game. They are given a list of numbers.  On a player's turn, they choose a prime number $p$ and a positive integer $k$. If there is at least one number in the list divisible by $p^k$, the player removes all such numbers from the list and adds $p^k$ to the list for each removed number. The first player who cannot make a valid choice loses. Determine which player will win if both players play optimally. \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), the number of elements in the list.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (1 ≤ $a_i$ ≤ 10⁹), the elements of the list.\n\nOutput:\n\nPrint \"Player 1\" if Player 1 wins, otherwise print \"Player 2\"."}, {"prompt_md5": "e5a0f857", "template_md5": "465699a0", "result": "Two players take turns removing numbers from a list.  A player can remove a number if it is divisible by a prime number chosen by the player.  The player who cannot make a valid move loses. Determine the winner if both players play optimally."}]}