{"uid": "852-G", "url": "https://codeforces.com/contest/852/problem/G", "tags": ["implementation"], "title": "852-G", "statement": "G. Bathroom terminaltime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSmith wakes up at the side of a dirty, disused bathroom, his ankle chained to pipes. Next to him is tape-player with a hand-written message \"Play Me\". He finds a tape in his own back pocket. After putting the tape in the tape-player, he sees a key hanging from a ceiling, chained to some kind of a machine, which is connected to the terminal next to him. After pressing a Play button a rough voice starts playing from the tape:\"Listen up Smith. As you can see, you are in pretty tough situation and in order to escape, you have to solve a puzzle.You are givenNstrings which represent words. Each word is of the maximum lengthLand consists of characters 'a'-'e'. You are also givenMstrings which represent patterns. Pattern is a string of length≤Land consists of characters 'a'-'e' as well as the maximum 3 characters '?'. Character '?' is an unknown character, meaning it can be equal to any character 'a'-'e', or even an empty character. For each pattern find the number of words that matches with the given pattern. After solving it and typing the result in the terminal, the key will drop from the ceiling and you may escape. Let the game begin.\"Help Smith escape.InputThe first line of input contains two integersNandM(1 ≤N≤  100 000,1 ≤M≤  5000), representing the number of words and patterns respectively.The nextNlines represent each word, and after thoseNlines, followingMlines represent each pattern. Each word and each pattern has a maximum lengthL(1 ≤L≤ 50). Each pattern has no more that three characters '?'. All other characters in words and patters are lowercase English letters from 'a' to 'e'.OutputOutput containsMlines and each line consists of one integer, representing the number of words that match the corresponding pattern.ExampleInput3 1abcaecaca?cOutput3NoteIf we switch '?' with 'b', 'e' and with empty character, we get 'abc', 'aec' and 'ac' respectively.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "14cb26d1", "template_md5": "35d339e4", "result": "You are given $N$ words, each of length $L$, consisting of lowercase letters from 'a' to 'e'. You are also given $M$ patterns, each of length at most $L$, consisting of lowercase letters from 'a' to 'e' and at most 3 question marks ('?'). A '?' in a pattern can represent any lowercase letter from 'a' to 'e', or an empty character.\n\nFor each pattern, find the number of words that match the pattern. A word matches a pattern if it can be formed by replacing each '?' in the pattern with a lowercase letter from 'a' to 'e' such that the resulting string is equal to the word.\n\nOutput $M$ lines, one for each pattern, containing the number of matching words."}, {"prompt_md5": "be535952", "template_md5": "465699a0", "result": "You are given a list of words and a list of patterns. Each pattern can contain up to three question marks, which represent any letter. Count how many words match each pattern."}]}