{"uid": "852-C", "url": "https://codeforces.com/contest/852/problem/C", "tags": ["greedy", " sortings"], "title": "852-C", "statement": "C. Propertytime limit per test0.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputBill is a famous mathematician in BubbleLand. Thanks to his revolutionary math discoveries he was able to make enough money to build a beautiful house. Unfortunately, for not paying property tax on time, court decided to punish Bill by making him lose a part of his property.Bill’s property can be observed as a convex regular2n-sided polygonA0A1...A2n- 1A2n,A2n=A0, with sides of the exactly 1 meter in length.Court rules for removing part of his property are as follows:Split every edgeAkAk+ 1,k= 0... 2n- 1innequal parts of size1 /nwith pointsP0,P1, ...,Pn- 1On every edgeA2kA2k+ 1,k= 0...n- 1court will choose one pointB2k=Pifor somei= 0, ...,n- 1such thatOn every edgeA2k+ 1A2k+ 2,k= 0...n- 1Bill will choose one pointB2k+ 1=Pifor somei= 0, ...,n- 1such thatBill gets to keep property inside of2n-sided polygonB0B1...B2n- 1Luckily, Bill found out whichB2kpoints the court chose. Even though he is a great mathematician, his house is very big and he has a hard time calculating. Therefore, he is asking you to help him choose points so he maximizes area of property he can keep.InputThe first line contains one integer numbern(2 ≤n≤ 50000), representing number of edges of2n-sided polygon.The second line containsndistinct integer numbersB2k(0 ≤B2k≤n- 1,k= 0...n- 1)separated by a single space, representing points the court chose. IfB2k=i, the court chose pointPion sideA2kA2k+ 1.OutputOutput containsndistinct integers separated by a single space representing pointsB1,B3, ...,B2n- 1Bill should choose in order to maximize the property area. If there are multiple solutions that maximize the area, return any of them.ExampleInput30 1 2Output0 2 1NoteTo maximize area Bill should choose points:B1=P0,B3=P2,B5=P1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5779c5e2", "template_md5": "35d339e4", "result": "You are given a convex $2n$-sided polygon where each side has a length of 1 meter.  The polygon is divided into $n$ smaller segments along each side.  \n\nThe court has chosen a point on each of the odd-numbered sides of the polygon. You need to choose a point on each of the even-numbered sides to maximize the area of the remaining polygon.\n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 50000), representing the number of sides of the polygon.\n* The second line contains $n$ distinct integers $B_2k$ (0 ≤ $B_{2k}$ ≤ $n-1$, $k$ = 0... $n-1$), representing the points chosen by the court on the odd-numbered sides.\n\n**Output:**\n\n* Output $n$ distinct integers separated by a single space, representing the points you choose on the even-numbered sides to maximize the area."}, {"prompt_md5": "eae25c8d", "template_md5": "465699a0", "result": "You are given a polygon with an even number of sides.  Some points on the edges of the polygon are already chosen. You need to choose the remaining points on the edges to maximize the area of the remaining polygon."}]}