{"uid": "852-D", "url": "https://codeforces.com/contest/852/problem/D", "tags": ["binary search", " flows", " graph matchings", " shortest paths"], "title": "852-D", "statement": "D. Exploration plantime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe competitors of Bubble Cup X gathered after the competition and discussed what is the best way to get to know the host country and its cities.After exploring the map of Serbia for a while, the competitors came up with the following facts: the country hasVcities which are indexed with numbers from1toV, and there areEbi-directional roads that connect the cites. Each road has a weight (the time needed to cross that road). There areNteams at the Bubble Cup and the competitors came up with the following plan: each of theNteams will start their journey in one of theVcities, and some of the teams share the starting position.They want to find the shortest timeT, such that every team can move in theseTminutes, and the number of different cities they end up in is at leastK(because they will only get to know the cities they end up in). A team doesn't have to be on the move all the time, if they like it in a particular city, they can stay there and wait for the time to pass.Please help the competitors to determine the shortest timeTso it's possible for them to end up in at leastKdifferent cities or print-1if that is impossible no matter how they move.Note that there can exist multiple roads between some cities.InputThe first line contains four integers:V,E,NandK(1 ≤V≤  600,  1  ≤E≤  20000,  1  ≤N≤min(V, 200),  1  ≤K≤N), number of cities, number of roads, number of teams and the smallest number of different cities they need to end up in, respectively.The second line containsNintegers, the cities where the teams start their journey.NextElines contain information about the roads in following format:AiBiTi(1 ≤Ai,Bi≤V,  1 ≤Ti≤ 10000), which means that there is a road connecting citiesAiandBi, and you needTiminutes to cross that road.OutputOutput a single integer that represents the minimal time the teams can move for, such that they end up in at leastKdifferent cities or output-1if there is no solution.If the solution exists, result will be no greater than1731311.ExampleInput6 7 5 45 5 2 2 51 3 31 5 21 6 52 5 42 6 73 4 113 5 3Output3NoteThree teams start from city 5, and two teams start from city 2. If they agree to move for 3 minutes, one possible situation would be the following: Two teams in city 2, one team in city 5, one team in city 3 , and one team in city 1. And we see that there are four different cities the teams end their journey at.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "303b74ea", "template_md5": "35d339e4", "result": "There are $V$ cities and $E$ roads connecting them. Each road has a travel time.  There are $N$ teams, each starting in one of the cities.  \n\nThe teams want to find the shortest amount of time $T$ they can all travel so that they end up in at least $K$ different cities. Teams can choose to stay in a city and wait if they want.\n\nDetermine the shortest possible time $T$ or output $-1$ if it's impossible to reach at least $K$ cities.\n\n**Input:**\n\n* $V$, $E$, $N$, $K$ (number of cities, number of roads, number of teams, minimum number of cities to visit)\n* $N$ integers representing the starting city for each team\n* $E$ lines, each with three integers $A$, $B$, and $T$ representing a road between cities $A$ and $B$ with travel time $T$.\n\n**Output:**\n\n* The shortest time $T$ or $-1$ if no solution exists."}, {"prompt_md5": "24bcaca7", "template_md5": "465699a0", "result": "You are given a map with cities connected by roads of varying travel times.  Teams start at different cities and need to travel for a minimum amount of time to end up in at least a specified number of unique cities. Find the shortest possible travel time. If it's impossible to achieve this, output -1."}]}