{"uid": "853-B", "url": "https://codeforces.com/contest/853/problem/B", "tags": ["greedy", " sortings", " two pointers"], "title": "853-B", "statement": "B. Jury Meetingtime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputCountry of Metropolia is holding Olympiad of Metrpolises soon. It mean that all jury members of the olympiad should meet together in Metropolis (the capital of the country) for the problem preparation process.There aren+ 1cities consecutively numbered from0ton. City0is Metropolis that is the meeting point for all jury members. For each city from1tonthere is exactly one jury member living there. Olympiad preparation is a long and demanding process that requireskdays of work. For all of thesekdays each of thenjury members should be present in Metropolis to be able to work on problems.You know the flight schedule in the country (jury members consider themselves important enough to only use flights for transportation). All flights in Metropolia are either going to Metropolis or out of Metropolis. There are no night flights in Metropolia, or in the other words, plane always takes off at the same day it arrives. On his arrival day and departure day jury member is not able to discuss the olympiad. All flights in Megapolia depart and arrive at the same day.Gather everybody forkdays in the capital is a hard objective, doing that while spending the minimum possible money is even harder. Nevertheless, your task is to arrange the cheapest way to bring all of the jury members to Metrpolis, so that they can work together forkdays and then send them back to their home cities. Cost of the arrangement is defined as a total cost of tickets for all used flights. It is allowed for jury member to stay in Metropolis for more thankdays.InputThe first line of input contains three integersn,mandk(1 ≤n≤ 105,0 ≤m≤ 105,1 ≤k≤ 106).Thei-th of the followingmlines contains the description of thei-th flight defined by four integersdi,fi,tiandci(1 ≤di≤ 106,0 ≤fi≤n,0 ≤ti≤n,1 ≤ci≤ 106, exactly one offiandtiequals zero), the day of departure (and arrival), the departure city, the arrival city and the ticket cost.OutputOutput the only integer that is the minimum cost of gathering all jury members in city0forkdays and then sending them back to their home cities.If it is impossible to gather everybody in Metropolis forkdays and then send them back to their home cities, output \"-1\" (without the quotes).ExamplesInput2 6 51 1 0 50003 2 0 55002 2 0 600015 0 2 90009 0 1 70008 0 2 6500Output24500Input2 4 51 2 0 50002 1 0 45002 1 0 30008 0 1 6000Output-1NoteThe optimal way to gather everybody in Metropolis in the first sample test is to use flights that take place on days1,2,8and9. The only alternative option is to send jury member from second city back home on day15, that would cost 2500 more.In the second sample it is impossible to send jury member from city2back home from Metropolis.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5c2504da", "template_md5": "35d339e4", "result": "There are $n$ cities numbered from 0 to $n-1$. City 0 is the capital.  There are $m$ flights, each described by four integers:\n\n* $d$: the day of departure and arrival\n* $f$: the departure city\n* $t$: the arrival city\n* $c$: the cost of the ticket\n\nEach flight departs and arrives on the same day.  \n\nYou need to bring all $n$ people from the other cities to the capital city (city 0) for $k$ days.  Then, you need to send them back to their home cities.  \n\nFind the minimum total cost of all the flights needed to accomplish this. If it's impossible to bring everyone to the capital and send them back, output -1."}, {"prompt_md5": "35bb8878", "template_md5": "465699a0", "result": "You are given a list of flights between cities.  Some cities have people who need to be brought to a central city for a meeting.  The meeting lasts for a set number of days.  Find the cheapest way to get everyone to the central city for the meeting and then back home."}]}