{"uid": "855-C", "url": "https://codeforces.com/contest/855/problem/C", "tags": ["dp", " trees"], "title": "855-C", "statement": "C. Helga Hufflepuff's Cuptime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputHarry, Ron and Hermione have figured out that Helga Hufflepuff's cup is a horcrux. Through her encounter with Bellatrix Lestrange, Hermione came to know that the cup is present in Bellatrix's family vault in Gringott's Wizarding Bank.The Wizarding bank is in the form of a tree with totalnvaults where each vault has some type, denoted by a number between1tom. A tree is an undirected connected graph with no cycles.The vaults with the highest security are of typek, and all vaults of typekhave the highest security.There can be at mostxvaults of highest security.Also,if a vault is of the highest security, its adjacent vaults are guaranteed to not be of the highest security and their type is guaranteed to be less thank.Harry wants to consider every possibility so that he can easily find the best path to reach Bellatrix's vault. So, you have to tell him, given the tree structure of Gringotts, the number of possible ways of giving each vault a type such that the above conditions hold.InputThe first line of input contains two space separated integers,nandm— the number of vaults and the number of different vault types possible. (1 ≤n≤ 105, 1 ≤m≤ 109).Each of the nextn- 1lines contain two space separated integersuiandvi(1 ≤ui,vi≤n) representing thei-th edge, which shows there is a path between the two vaultsuiandvi. It is guaranteed that the given graph is a tree.The last line of input contains two integerskandx(1 ≤k≤m, 1 ≤x≤ 10), the type of the highest security vault and the maximum possible number of vaults of highest security.OutputOutput a single integer, the number of ways of giving each vault a type following the conditions modulo109+ 7.ExamplesInput4 21 22 31 41 2Output1Input3 31 21 32 1Output13Input3 11 21 31 1Output0NoteIn test case1, we cannot have any vault of the highest security as its type is1implying that its adjacent vaults would have to have a vault type less than1, which is not allowed. Thus, there is only one possible combination, in which all the vaults have type2.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9cd838b6", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes, where each node represents a vault. There are $m$ different types of vaults.  \n\nYou need to assign a type to each vault such that:\n\n*  At most $x$ vaults have the highest security type, denoted by $k$.\n*  If a vault has the highest security type, all its adjacent vaults must have a type less than $k$.\n\nFind the number of ways to assign types to the vaults that satisfy these conditions. The answer should be taken modulo $10^9 + 7$."}, {"prompt_md5": "7c1cc4a9", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes. Each node can have one of several possible types.  You need to determine how many ways you can assign types to the nodes such that:\n\n*  At most a certain number of nodes can have the highest type.\n*  If a node has the highest type, its connected neighbors cannot have the highest type. \n\n\n\nLet me know if you'd like help with the algorithmic approach to solving this problem!"}]}