{"uid": "855-E", "url": "https://codeforces.com/contest/855/problem/E", "tags": ["bitmasks", " dp"], "title": "855-E", "statement": "E. Salazar Slytherin's Lockettime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputHarry came to know from Dumbledore that Salazar Slytherin's locket is a horcrux. This locket was present earlier at 12 Grimmauld Place, the home of Sirius Black's mother. It was stolen from there and is now present in the Ministry of Magic in the office of Dolorous Umbridge, Harry's former Defense Against the Dark Arts teacher.Harry, Ron and Hermione are infiltrating the Ministry. Upon reaching Umbridge's office, they observed a code lock with a puzzle asking them to calculate count of magic numbers between two integerslandr(both inclusive).Harry remembered from his detention time with Umbridge that she defined a magic number as a number which when converted to a given baseb, all the digits from0tob- 1appear even number of times in its representation without any leading zeros.You have to answerqqueries to unlock the office. Each query has three integersbi,liandri, the base and the range for which you have to find the count of magic numbers.InputFirst line of input containsq(1 ≤q≤ 105) — number of queries.Each of the nextqlines contain three space separated integersbi,li,ri(2 ≤bi≤ 10,1 ≤li≤ri≤ 1018).OutputYou have to outputqlines, each containing a single integer, the answer to the corresponding query.ExamplesInput22 4 93 1 10Output12Input22 1 1005 1 100Output214NoteIn sample test case1, for first query, when we convert numbers4to9into base2, we get:4 = 1002,5 = 1012,6 = 1102,7 = 1112,8 = 10002,9 = 10012.Out of these, only base2representation of9has even number of1and0. Thus, the answer is1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c622d07a", "template_md5": "35d339e4", "result": "You are given $q$ queries. Each query consists of three integers: $b$, $l$, and $r$ ($2 \\le b \\le 10$, $1 \\le l \\le r \\le 10^{18}$). \n\nFor each query, you need to find the count of \"magic numbers\" between $l$ and $r$ (inclusive) when represented in base $b$. \n\nA magic number in base $b$ is a number where each digit from 0 to $b-1$ appears an even number of times in its representation, without any leading zeros.\n\nOutput the count of magic numbers for each query."}, {"prompt_md5": "3aa94b46", "template_md5": "465699a0", "result": "Given a range of numbers and a base, count how many numbers in that range have an even number of each digit when represented in that base."}]}