{"uid": "855-G", "url": "https://codeforces.com/contest/855/problem/G", "tags": ["dfs and similar", " dp", " graphs", " trees"], "title": "855-G", "statement": "G. Harry Vs Voldemorttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter destroying all of Voldemort's Horcruxes, Harry and Voldemort are up for the final battle. They each cast spells from their wands and the spells collide.The battle scene is Hogwarts, which can be represented in the form of a tree. There are, in total,nplaces in Hogwarts joined usingn- 1undirected roads.Ron, who was viewing this battle between Harry and Voldemort, wondered how many triplets of places(u,v,w)are there such that if Harry is standing at placeuand Voldemort is standing at placev, their spells collide at a placew. This is possible for a triplet only whenu,vandware distinct, and there exist paths fromutowand fromvtowwhich do not pass through the same roads.Now, due to the battle havoc, new paths are being added all the time. You have to tell Ron the answer after each addition.Formally, you are given a tree withnvertices andn- 1edges.qnew edges are being added between the nodes of the tree. After each addition you need to tell the number of triplets(u,v,w)such thatu,vandware distinct and there exist two paths, one betweenuandw, another betweenvandwsuch that these paths do not have an edge in common.InputFirst line contains an integern(1 ≤n≤ 105), the number of places in Hogwarts.Each of the nextn- 1lines contains two space separated integersuandv(1 ≤u,v≤n) indicating a road between placesuandv. It is guaranteed that the given roads form a connected tree.Next line contains a single integerq(1 ≤q≤ 105), the number of new edges being added.Each of the nextqlines contains two space separated integersuandv(1 ≤u,v≤n) representing the new road being added.Note that it is possible that a newly added road connects places that were connected by a road before. Also, a newly added road may connect a place to itself.OutputIn the first line print the value for the number of triplets before any changes occurred.After that printqlines, a single integeransiin each line containing the value for the number of triplets afteri-th edge addition.ExamplesInput31 22 312 3Output24Input41 22 32 421 43 4Output61824Input51 22 33 44 511 5Output2060NoteIn the first sample case, for the initial tree, we have(1, 3, 2)and(3, 1, 2)as the only possible triplets(u,v,w).After addition of edge from2to3, we have(1, 3, 2),(3, 1, 2),(1, 2, 3)and(2, 1, 3)as the possible triplets.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "441c438d", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes.  Each node represents a place.  There are $n-1$ edges in the tree, representing roads between the places.\n\nYou are then given $q$ new edges to add to the tree. After each edge is added, you need to count the number of triplets of distinct nodes $(u,v,w)$ such that:\n\n* There is a path from node $u$ to node $w$ in the updated tree.\n* There is a path from node $v$ to node $w$ in the updated tree.\n* The paths from $u$ to $w$ and from $v$ to $w$ do not share any edges.\n\nOutput the count of triplets for the initial tree and after each edge addition."}, {"prompt_md5": "87a53cf9", "template_md5": "465699a0", "result": "You are given a tree with a certain number of nodes.  New edges are added to the tree. After each addition, you need to count the number of unique triplets of nodes where there are two separate paths between each pair of nodes in the triplet."}]}