{"uid": "856-B", "url": "https://codeforces.com/contest/856/problem/B", "tags": ["dp", " hashing", " strings", " trees"], "title": "856-B", "statement": "B. Similar Wordstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputLet us call a non-empty sequence of lowercase English letters aword.Prefixof a wordxis a wordythat can be obtained fromxby removing zero or more last letters ofx.Let us call two wordssimilar, if one of them can be obtained from the other by removing its first letter.You are given a setSof words. Find the maximal possible size of set of non-empty wordsXsuch that they satisfy the following:each word ofXis prefix of some word fromS;Xhas no similar words.InputInput data contains multiple test cases. The first line of the input data contains an integert— the number of test cases. The descriptions of test cases follow.The first line of each description contains an integern— the number of words in the setS(1 ≤n≤ 106). Each of the followingnlines contains one non-empty word — elements ofS. All words inSare different.It is guaranteed that the total length of all words in one input data doesn't exceed106.OutputFor each test case print one line that contains one integerm— the maximal number of words thatXcan contain.ExampleInput23abababaaaab2aaaOutput61", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ca68a54f", "template_md5": "35d339e4", "result": "You are given a set of words.  Find the largest number of words you can choose from the set such that:\n\n* Each chosen word is a prefix of some word in the original set.\n* No two chosen words are similar (meaning one can be made by removing the first letter of the other). \n\n\nLet me know if you'd like help with any part of solving this problem!"}, {"prompt_md5": "cae9ea90", "template_md5": "465699a0", "result": "You are given a list of words. Find the largest number of words you can choose from the list such that:\n\n* Each chosen word is a prefix of at least one word in the original list.\n* No two chosen words are similar (meaning one can be made by removing the first letter of the other)."}]}