{"uid": "856-A", "url": "https://codeforces.com/contest/856/problem/A", "tags": ["brute force", " constructive algorithms"], "title": "856-A", "statement": "A. Set Theorytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMasha and Grisha like studying sets of positive integers.One day Grisha has written a setAcontainingndifferent integersaion a blackboard. Now he asks Masha to create a setBcontainingndifferent integersbjsuch that alln2integers that can be obtained by summing upaiandbjfor all possible pairs ofiandjare different.Both Masha and Grisha don't like big numbers, so all numbers inAare from1to106, and all numbers inBmust also be in the same range.Help Masha to create the setBthat satisfies Grisha's requirement.InputInput data contains multiple test cases. The first line contains an integert— the number of test cases (1 ≤t≤ 100).Each test case is described in the following way: the first line of the description contains one integern— the number of elements inA(1 ≤n≤ 100).The second line containsnintegersai— the elements ofA(1 ≤ai≤ 106).OutputFor each test first print the answer:NO, if Masha's task is impossible to solve, there is no way to create the required setB.YES, if there is the way to create the required set. In this case the second line must containndifferent positive integersbj— elements ofB(1 ≤bj≤ 106). If there are several possible sets, output any of them.ExampleInput331 10 1001122 4OutputYES1 2 3YES1YES1 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "930becb4", "template_md5": "35d339e4", "result": "You are given a set of $n$ positive integers $A = \\{a_1, a_2, ..., a_n\\}$.  You need to create another set $B = \\{b_1, b_2, ..., b_n\\}$ such that the sum of any two distinct elements from $A$ and $B$ is different.  \n\nDetermine if it is possible to create set $B$ and, if so, output one possible set. All numbers in $A$ and $B$ are between 1 and $10^6$."}, {"prompt_md5": "00a02c09", "template_md5": "465699a0", "result": "Given a set of numbers, find another set of numbers such that the sum of every possible pair of numbers from the two sets is unique. If this is possible, output \"YES\" and the second set. Otherwise, output \"NO\"."}]}