{"uid": "856-E", "url": "https://codeforces.com/contest/856/problem/E", "tags": [], "title": "856-E", "statement": "E. Satellitestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputReal Cosmic Communications is the largest telecommunication company on a far far away planet, located at the very edge of the universe. RCC launches communication satellites.The planet is at the very edge of the universe, so its form is half of a circle. Its radius isr, the ends of its diameter are pointsAandB. The lineABis the edge of the universe, so one of the half-planes contains nothing, neither the planet, nor RCC satellites, nor anything else. Let us introduce coordinates in the following way: the origin is at the center ofABsegment,OXaxis coincides with lineAB, the planet is completely iny> 0half-plane.The satellite can be in any point of the universe, except the planet points. Satellites are never located beyond the edge of the universe, nor on the edge itself — that is, they have coordinatey> 0. Satellite antennas are directed in such way that they cover the angle with the vertex in the satellite, and edges directed to pointsAandB. Let us call this area the satellitecoverage area.The picture below shows coordinate system and coverage area of a satellite.When RCC was founded there were no satellites around the planet. Since then there have been several events of one of the following types:1 x y— launch the new satellite and put it to the point(x,y). Satellites never move and stay at the point they were launched. Let us assign the numberito thei-th satellite in order of launching, starting from one.2 i— remove satellite numberi.3 i j— make an attempt to create a communication channel between satellitesiandj. To create a communication channel a repeater is required. It must not be located inside the planet, but can be located at its half-circle border, or above it. Repeater must be in coverage area of both satellitesiandj. To avoid signal interference, it must not be located in coverage area of any other satellite. Of course, the repeater must be within the universe, it must have a coordinatey> 0.For each attempt to create a communication channel you must find out whether it is possible.Sample test has the following satellites locations:InputThe first line of input data contains integersrandn— radius of the planet and the number of events (1 ≤r≤ 109,1 ≤n≤ 5·105).Each of the followingnlines describe events in the specified format.Satellite coordinates are integer, the satisfy the following constraints|x| ≤ 109,0 <y≤ 109. No two satellites that simultaneously exist can occupy the same point. Distance from each satellite to the center of the planet is strictly greater thanr.It is guaranteed that events of types2and3only refer to satellites that exist at the moment. For all events of type3the inequalityi≠jis satisfied.OutputFor each event of type3print «YES» on a separate line, if it is possible to create a communication channel, or «NO» if it is impossible.ExampleInput5 81 -5 81 -4 81 -3 81 2 73 1 32 23 1 33 3 4OutputNOYESYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "043a29aa", "template_md5": "35d339e4", "result": "A planet is shaped like a half-circle with radius $r$. The planet is located in the upper half-plane ($y>0$) and the edge of the universe is the line $y=0$. Satellites can be placed anywhere in the upper half-plane, but not on the planet's surface. Each satellite has an antenna that covers an angle with its vertex at the satellite, pointing towards the two ends of the diameter of the planet.\n\nYou are given a series of events:\n\n1. **Launch:** A new satellite is launched at coordinates $(x,y)$.\n2. **Remove:** Satellite number $i$ is removed.\n3. **Connect:** Attempt to create a communication channel between satellites $i$ and $j$ using a repeater.\n\nA repeater can be placed anywhere in the upper half-plane, but it must:\n\n* Be within the coverage area of both satellites $i$ and $j$.\n* Not be within the coverage area of any other existing satellite.\n* Not be on the planet's surface.\n\nFor each \"Connect\" event, determine if it is possible to place a repeater that satisfies all the conditions."}, {"prompt_md5": "1d38bd95", "template_md5": "465699a0", "result": "You are given a half-circle representing a planet. Satellites are placed at points above the planet. Each satellite has a coverage area that forms a sector.  You need to determine if it's possible to establish a communication channel between two satellites using a repeater. The repeater must be:\n\n* Outside the planet\n* Within the coverage area of both satellites\n* Not within the coverage area of any other satellite \n\n\nFor each request to establish a channel, say if it's possible or not."}]}