{"uid": "858-B", "url": "https://codeforces.com/contest/858/problem/B", "tags": ["brute force", " implementation"], "title": "858-B", "statement": "B. Which floor?time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn a building where Polycarp lives there areequalnumber of flats on each floor. Unfortunately, Polycarp don't remember how many flats are on each floor, but he remembers that the flats are numbered from1from lower to upper floors. That is, the first several flats are on the first floor, the next several flats are on the second and so on. Polycarp don't remember the total number of flats in the building, so you can consider the building to be infinitely high (i.e. there are infinitely many floors). Note that the floors are numbered from1.Polycarp remembers on which floors several flats are located. It is guaranteed that this information is not self-contradictory. It means that there exists a building with equal number of flats on each floor so that the flats from Polycarp's memory have the floors Polycarp remembers.Given this information, is it possible to restore the exact floor for flatn?InputThe first line contains two integersnandm(1 ≤n≤ 100,0 ≤m≤ 100), wherenis the number of the flat you need to restore floor for, andmis the number of flats in Polycarp's memory.mlines follow, describing the Polycarp's memory: each of these lines contains a pair of integerski,fi(1 ≤ki≤ 100,1 ≤fi≤ 100), which means that the flatkiis on thefi-th floor. All valueskiare distinct.It is guaranteed that the given information is not self-contradictory.OutputPrint the number of the floor in which then-th flat is located, if it is possible to determine it in a unique way. Print-1if it is not possible to uniquely restore this floor.ExamplesInput10 36 22 17 3Output4Input8 43 16 25 22 1Output-1NoteIn the first example the 6-th flat is on the 2-nd floor, while the 7-th flat is on the 3-rd, so, the 6-th flat is the last on its floor and there are 3 flats on each floor. Thus, the 10-th flat is on the 4-th floor.In the second example there can be 3 or 4 flats on each floor, so we can't restore the floor for the 8-th flat.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "20d473aa", "template_md5": "35d339e4", "result": "You are given a list of flats and their corresponding floors.  The number of flats on each floor is the same.  \n\nGiven a flat number $n$, determine the floor it is located on. If it is not possible to determine the floor uniquely, output -1.\n\n**Input:**\n\n* Two integers $n$ and $m$ ($1 \\le n \\le 100$, $0 \\le m \\le 100$):\n    * $n$: The number of the flat.\n    * $m$: The number of flats in the memory.\n* $m$ lines, each containing two integers $k_i$ and $f_i$ ($1 \\le k_i \\le 100$, $1 \\le f_i \\le 100$):\n    * $k_i$: The number of a flat.\n    * $f_i$: The floor of the flat $k_i$.\n\n**Output:**\n\n* An integer representing the floor of the $n$-th flat, or -1 if it cannot be uniquely determined."}, {"prompt_md5": "4eca6014", "template_md5": "465699a0", "result": "You are given a list of flats and their floors.  The number of flats on each floor is the same.  Find the floor of a specific flat. If there is more than one possible answer, say it's impossible."}]}