{"uid": "858-C", "url": "https://codeforces.com/contest/858/problem/C", "tags": ["dp", " greedy", " implementation"], "title": "858-C", "statement": "C. Did you mean...time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputBeroffice text editor has a wide range of features that help working with text. One of the features is an automatic search for typos and suggestions of how to fix them.Beroffice works only with small English letters (i.e. with 26 letters fromatoz). Beroffice thinks that a word is typed with a typo if there are three or more consonants in a row in the word. The only exception is that if the block of consonants has all letters the same, then this block (even if its length is greater than three) is not considered a typo. Formally, a word is typed with a typo if there is a block of not less that three consonants in a row, and there are at least two different letters in this block.For example:the following words have typos: \"hellno\", \"hackcerrs\" and \"backtothefutttture\";the following words don't have typos: \"helllllooooo\", \"tobeornottobe\" and \"oooooo\".When Beroffice editor finds a word with a typo, it inserts as little as possible number of spaces in this word (dividing it into several words) in such a way that each of the resulting words is typed without any typos.Implement this feature of Beroffice editor. Consider the following letters as the only vowels: 'a', 'e', 'i', 'o' and 'u'. All the other letters are consonants in this problem.InputThe only line contains a non-empty word consisting of small English letters. The length of the word is between1and3000letters.OutputPrint the given word without any changes if there are no typos.If there is at least one typo in the word, insert the minimum number of spaces into the word so that each of the resulting words doesn't have any typos. If there are multiple solutions, print any of them.ExamplesInputhellnoOutputhell noInputabacabaOutputabacabaInputasdfasdfOutputasd fasd f", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c426078b", "template_md5": "35d339e4", "result": "You are given a word consisting of lowercase English letters.  \n\nA typo in the word is defined as having three or more consecutive consonants, where there are at least two different consonants in that block.  \n\nIf a block of consonants is all the same letter, it is not considered a typo.\n\nYour task is to insert spaces into the word to correct any typos.  You should insert the minimum number of spaces possible so that each resulting word does not have any typos. If there are multiple solutions, any one is acceptable.\n\nPrint the corrected word."}, {"prompt_md5": "b3c26a82", "template_md5": "465699a0", "result": "Given a word, insert spaces to split it into smaller words so that no three or more consecutive letters are the same except for when they are all the same letter.  Print the resulting word."}]}