{"uid": "86-D", "url": "https://codeforces.com/contest/86/problem/D", "tags": ["data structures", " implementation", " math", " two pointers"], "title": "86-D", "statement": "D. Powerful arraytime limit per test5 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAn array of positive integersa1,a2, ...,anis given. Let us consider its arbitrary subarrayal,al+ 1...,ar, where1 ≤l≤r≤n. For every positive integersdenote byKsthe number of occurrences ofsinto the subarray. We call thepowerof the subarray the sum of productsKs·Ks·sfor every positive integers. The sum contains only finite number of nonzero summands as the number of different values in the array is indeed finite.You should calculate the power oftgiven subarrays.InputFirst line contains two integersnandt(1 ≤n,t≤ 200000) — the array length and the number of queries correspondingly.Second line containsnpositive integersai(1 ≤ai≤ 106) — the elements of the array.Nexttlines contain two positive integersl,r(1 ≤l≤r≤n) each — the indices of the left and the right ends of the corresponding subarray.OutputOutputtlines, thei-th line of the output should contain single positive integer — the power of thei-th query subarray.Please, do not use%lldspecificator to read or write 64-bit integers in C++. It is preferred to usecoutstream (also you may use%I64d).ExamplesInput3 21 2 11 21 3Output36Input8 31 1 2 2 1 3 1 12 71 62 7Output202020NoteConsider the following array (see the second sample) and its [2, 7] subarray (elements of the subarray are colored):ThenK1= 3,K2= 2,K3= 1, so the power is equal to32·1 + 22·2 + 12·3 = 20.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "782393b1", "template_md5": "35d339e4", "result": "You are given an array of positive integers $a_1, a_2, ..., a_n$.  \n\nFor each subarray $a_l, a_{l+1}, ..., a_r$ (where $1 \\le l \\le r \\le n$), calculate the \"power\" of the subarray. The power is defined as the sum of  $K_s \\cdot K_s \\cdot s$ for every positive integer $s$ that appears in the subarray. Here, $K_s$ is the number of times $s$ appears in the subarray.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $t$ ($1 \\le n, t \\le 200000$), representing the length of the array and the number of queries, respectively.\n* The second line contains $n$ positive integers $a_i$ ($1 \\le a_i \\le 10^6$), representing the elements of the array.\n* The next $t$ lines each contain two positive integers $l$ and $r$ ($1 \\le l \\le r \\le n$), representing the indices of the left and right ends of a subarray.\n\n**Output:**\n\n* Output $t$ lines, each containing a single positive integer, representing the power of the corresponding subarray."}, {"prompt_md5": "74025bf0", "template_md5": "465699a0", "result": "You are given a list of numbers.  For each given range of numbers in the list, calculate the sum of the squares of the number of times each number in the range appears."}]}