{"uid": "862-F", "url": "https://codeforces.com/contest/862/problem/F", "tags": ["data structures", " strings"], "title": "862-F", "statement": "F. Mahmoud and Ehab and the final stagetime limit per test5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputMahmoud and Ehab solved Dr. Evil's questions so he gave them the password of the door of the evil land. When they tried to open the door using it, the door gave them a final question to solve before they leave (yes, the door is digital, Dr. Evil is modern). If they don't solve it, all the work will be useless and they won't leave the evil land forever. Will you help them?Mahmoud and Ehab are givennstringss1,s2, ... ,snnumbered from1tonandqqueries, Each query has one of the following forms:1ab(1 ≤a≤b≤n), For all the intervals[l;r]where(a≤l≤r≤b)find the maximum value of this expression:(r-l+ 1) *LCP(sl,sl+ 1, ... ,sr- 1,sr)whereLCP(str1,str2,str3, ... )is the length of the longest common prefix of the stringsstr1,str2,str3, ....2xy(1 ≤x≤n)whereyis a string, consisting of lowercase English letters. Change the string at positionxtoy.InputThe first line of input contains 2 integersnandq(1 ≤n≤ 105, 1 ≤q≤ 105)– The number of strings and the number of queries, respectively.The second line containsnstringsstriconsisting of lowercase English letters.The nextqlines describe the queries and may have one of the 2 forms:1ab(1 ≤a≤b≤n).2xy(1 ≤x≤n), whereyis a string consisting of lowercase English letters.the total length of all strings in input won't exceed105OutputFor each query of first type output its answer in a new line.ExampleInput5 9mahmoud mahmoudbadawy drmahmoud drevil mahmoud1 1 51 1 21 2 32 3 mahmoud2 4 mahmoud2 2 mahmouu1 1 51 2 31 1 1Output14141330127", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "50ae9458", "template_md5": "35d339e4", "result": "You are given $n$ strings $s_1, s_2, ..., s_n$. You will then receive $q$ queries. \n\nThere are two types of queries:\n\n* **Type 1:**  A query of the form $1ab$ ($1 \\le a \\le b \\le n$) asks you to find the maximum value of  $(r-l+1) * LCP(s_l, s_{l+1}, ..., s_{r-1}, s_r)$ for all intervals $[l, r]$ where $a \\le l \\le r \\le b$. Here, $LCP(str1, str2, ..., strk)$ represents the length of the longest common prefix of the strings $str1, str2, ..., strk$.\n\n* **Type 2:** A query of the form $2xy$ ($1 \\le x \\le n$, $y$ is a string) asks you to change the string at position $x$ to $y$.\n\nFor each Type 1 query, output the maximum value found."}, {"prompt_md5": "9b4f0979", "template_md5": "465699a0", "result": "You are given a list of strings.  You need to answer queries of two types:\n\n1. For a given range of strings in the list, find the maximum length of the longest common prefix of all the strings in that range, multiplied by the number of strings in the range.\n2. Change a specific string in the list to a new string."}]}