{"uid": "862-A", "url": "https://codeforces.com/contest/862/problem/A", "tags": ["greedy", " implementation"], "title": "862-A", "statement": "A. Mahmoud and Ehab and the MEXtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDr. Evil kidnapped Mahmoud and Ehab in the evil land because of their performance in the Evil Olympiad in Informatics (EOI). He decided to give them some problems to let them go.Dr. Evil is interested in sets, He has a set ofnintegers. Dr. Evil calls a set of integersevilif theMEXof it is exactlyx. theMEXof a set of integers is the minimum non-negative integer that doesn't exist in it. For example, theMEXof the set{0, 2, 4}is1and theMEXof the set{1, 2, 3}is0.Dr. Evil is going to make his setevil. To do this he can perform some operations. During each operation he can add some non-negative integer to his set or erase some element from it. What is the minimal number of operations Dr. Evil has to perform to make his setevil?InputThe first line contains two integersnandx(1 ≤n≤ 100,0 ≤x≤ 100) — the size of the set Dr. Evil owns, and the desiredMEX.The second line containsndistinct non-negative integers not exceeding100that represent the set.OutputThe only line should contain one integer — the minimal number of operations Dr. Evil should perform.ExamplesInput5 30 4 5 6 7Output2Input1 00Output1Input5 01 2 3 4 5Output0NoteFor the first test case Dr. Evil should add1and2to the set performing2operations.For the second test case Dr. Evil should erase0from the set. After that, the set becomes empty, so theMEXof it is0.In the third test case the set is alreadyevil.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aa4e20b2", "template_md5": "35d339e4", "result": "You are given a set of $n$ distinct non-negative integers. You need to find the minimum number of operations required to make the MEX of the set equal to a given integer $x$.  \n\nAn operation can be either:\n\n* Adding a non-negative integer to the set.\n* Removing an integer from the set.\n\nThe MEX (Minimum Excluded) of a set is the smallest non-negative integer that is not present in the set. \n\n\nFor example:\n\n* The MEX of the set {0, 2, 4} is 1.\n* The MEX of the set {1, 2, 3} is 0."}, {"prompt_md5": "a9848127", "template_md5": "465699a0", "result": "You are given a set of numbers.  Find the fewest number of additions or removals needed to make the smallest missing non-negative number in the set equal to a target value."}]}