{"uid": "863-E", "url": "https://codeforces.com/contest/863/problem/E", "tags": ["data structures", " sortings"], "title": "863-E", "statement": "E. Turn Off The TVtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLuba needs your help again! Luba hasnTV sets. She knows thati-th TV set will be working from moment of timelitill momentri, inclusive.Luba wants to switch off one of TV sets in order to free the socket. Let's call some TV setredundantif after switching it off the number ofintegermoments of time when at least one of TV sets is working won't decrease. Luba will be very upset if she has to switch off a non-redundantTV set.Help Luba by telling her the index of someredundantTV set. If there is no any, print-1.InputThe first line contains one integer numbern(1 ≤n≤ 2·105)— the number of TV sets.Thennlines follow, each of them containing two integer numbersli,ri(0 ≤li≤ri≤ 109)denoting the working time ofi-th TV set.OutputIf there is no any redundant TV set, print-1. Otherwise print the index of any redundant TV set (TV sets are indexed from 1 ton).If there are multiple answers, print any of them.ExamplesInput31 34 61 7Output1Input20 100 10Output1Input31 23 46 8Output-1Input31 22 33 4Output2NoteConsider the first sample. Initially all integer moments of time such that at least one TV set is working are from the segment[1;7]. It's easy to see that this segment won't change if we switch off the first TV set (or the second one).Note that in the fourth sample you can switch off the second TV set, since even without it all integer moments such that any of the TV sets is working denote the segment[1;4].", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1901266b", "template_md5": "35d339e4", "result": "You are given $n$ TV sets. Each TV set $i$ works from time $l_i$ to time $r_i$ (inclusive).  \n\nYou want to find one TV set that you can turn off without changing the set of all times when at least one TV is working. \n\nIf there is no such TV set, print -1. Otherwise, print the index of any one such TV set."}, {"prompt_md5": "682ec73b", "template_md5": "465699a0", "result": "You are given a list of time intervals. Each interval represents when a device is active.  Find one interval that can be removed without changing the set of all times when at least one device is active. If no such interval exists, output -1."}]}