{"uid": "863-G", "url": "https://codeforces.com/contest/863/problem/G", "tags": [], "title": "863-G", "statement": "G. Graphic Settingstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecently Ivan bought a new computer. Excited, he unpacked it and installed his favourite game. With his old computer Ivan had to choose the worst possible graphic settings (because otherwise the framerate would be really low), but now he wants to check, maybe his new computer can perform well even with the best possible graphics?There aremgraphics parameters in the game.i-th parameter can be set to any positive integer from1toai, and initially is set tobi(bi≤ai). So there aredifferent combinations of parameters. Ivan can increase or decrease any of these parameters by1; after that the game will be restarted with new parameters (and Ivan will have the opportunity to check chosen combination of parameters).Ivan wants to try allppossible combinations. Also he wants to return to the initial settings after trying all combinations, because he thinks that initial settings can be somehow best suited for his hardware. But Ivan doesn't really want to make a lot of restarts.So he wants you to tell the following:If there exists a way to make exactlypchanges (each change either decreases or increases some parameter by1) to try all possible combinations and return to initial combination, then Ivan wants to know this way.Otherwise, if there exists a way to make exactlyp- 1changes to try all possible combinations (including the initial one), then Ivan wants to know this way.Help Ivan by showing him the way to change parameters!InputThe first line of input contains one integer numberm(1 ≤m≤ 6).The second line containsminteger numbersa1,a2, ...,am(2 ≤ai≤ 1000). It is guaranteed that.The third line containsminteger numbersb1,b2, ...,bm(1 ≤bi≤ai).OutputIf there is a way to make exactlypchanges (each change either decreases or increases some parameter by1) to try all possible combinations and return to initial combination, then outputCyclein the first line. Thenplines must follow, each desribing a change. The line must be eitherinc x(increase parameterxby1) ordec x(decrease it).Otherwise, if there is a way to make exactlyp- 1changes to try all possible combinations (including the initial one), then outputPathin the first line. Thenp- 1lines must follow, each describing the change the same way as mentioned above.Otherwise, outputNo.ExamplesInput131OutputPathinc 1inc 1Input132OutputNoInput23 21 1OutputCycleinc 1inc 1inc 2dec 1dec 1dec 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b244e757", "template_md5": "35d339e4", "result": "There are $m$ graphics parameters. The $i$-th parameter can be set to any positive integer from 1 to $a_i$, and it is initially set to $b_i$ ($b_i \\le a_i$).\n\nYou need to find a sequence of changes to these parameters to achieve the following:\n\n1. **Try all possible combinations of parameter values.**\n2. **Return to the initial parameter values.**\n\nYou can make changes by increasing or decreasing a parameter by 1.\n\n* **If it's possible to achieve both 1 and 2 with exactly $p$ changes, output \"Cycle\" followed by the sequence of changes.**\n* **If it's possible to achieve both 1 and 2 with exactly $p-1$ changes, output \"Path\" followed by the sequence of changes.**\n* **If it's not possible to achieve both 1 and 2 with either $p$ or $p-1$ changes, output \"No\".** \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem!"}, {"prompt_md5": "8fbb1a23", "template_md5": "465699a0", "result": "You have a set of parameters, each with a minimum and maximum value. You can change each parameter by 1.  You want to try all possible combinations of parameter values.  \n\nYou can either make exactly *p* changes to return to the original settings, or exactly *p-1* changes and keep the final setting different from the original.  \n\nOutput the sequence of changes needed to achieve either of these goals. If it's impossible, output \"No\"."}]}