{"uid": "863-C", "url": "https://codeforces.com/contest/863/problem/C", "tags": ["graphs", " implementation"], "title": "863-C", "statement": "C. 1-2-3time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIlya is working for the company that constructs robots. Ilya writes programs for entertainment robots, and his current project is \"Bob\", a new-generation game robot. Ilya's boss wants to know his progress so far. Especially he is interested if Bob is better at playing different games than the previous model, \"Alice\".So now Ilya wants to compare his robots' performance in a simple game called \"1-2-3\". This game is similar to the \"Rock-Paper-Scissors\" game: both robots secretly choose a number from the set{1, 2, 3}and say it at the same moment. If both robots choose the same number, then it's a draw and noone gets any points. But if chosen numbers are different, then one of the robots gets a point:3beats2,2beats1and1beats3.Both robots' programs make them choose their numbers in such a way that their choice in(i+ 1)-th game depends only on the numbers chosen by them ini-th game.Ilya knows that the robots will playkgames, Alice will choose numberain the first game, and Bob will choosebin the first game. He also knows both robots' programs and can tell what each robot will choose depending on their choices in previous game. Ilya doesn't want to wait until robots play allkgames, so he asks you to predict the number of points they will have after the final game.InputThe first line contains three numbersk,a,b(1 ≤k≤ 1018,1 ≤a,b≤ 3).Then3lines follow,i-th of them containing3numbersAi, 1,Ai, 2,Ai, 3, whereAi,jrepresents Alice's choice in the game if Alice choseiin previous game and Bob chosej(1 ≤Ai,j≤ 3).Then3lines follow,i-th of them containing3numbersBi, 1,Bi, 2,Bi, 3, whereBi,jrepresents Bob's choice in the game if Alice choseiin previous game and Bob chosej(1 ≤Bi,j≤ 3).OutputPrint two numbers. First of them has to be equal to the number of points Alice will have, and second of them must be Bob's score afterkgames.ExamplesInput10 2 11 1 11 1 11 1 12 2 22 2 22 2 2Output1 9Input8 1 12 2 13 3 13 1 31 1 12 1 11 2 3Output5 2Input5 1 11 2 22 2 22 2 21 2 22 2 22 2 2Output0 0NoteIn the second example game goes like this:The fourth and the seventh game are won by Bob, the first game is draw and the rest are won by Alice.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d5d0749c", "template_md5": "35d339e4", "result": "Two players, A and B, play a game where they each choose a number from the set {1, 2, 3}. The rules are:\n\n* 3 beats 2\n* 2 beats 1\n* 1 beats 3\n\nIf both players choose the same number, it's a draw. If the numbers are different, the player with the winning number gets a point.\n\nThe players' choices in each round depend only on the numbers they chose in the previous round.  \n\nYou are given:\n\n*  $k$: the number of rounds the players will play\n*  $a$: the number player A chooses in the first round\n*  $b$: the number player B chooses in the first round\n*  Tables describing how each player chooses their number in each subsequent round based on the previous round's choices.\n\nYour task is to determine the number of points each player will have after all $k$ rounds."}, {"prompt_md5": "157d44fb", "template_md5": "465699a0", "result": "Two players take turns choosing a number from 1 to 3. The rules determine who wins based on the chosen numbers.  You are given the rules for each player's choices in each round based on the previous round's choices. Determine the number of points each player will have after a set number of rounds."}]}