{"uid": "863-B", "url": "https://codeforces.com/contest/863/problem/B", "tags": ["brute force", " greedy", " sortings"], "title": "863-B", "statement": "B. Kayakingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVadim is really keen on travelling. Recently he heard about kayaking activity near his town and became very excited about it, so he joined a party of kayakers.Now the party is ready to start its journey, but firstly they have to choose kayaks. There are2·npeople in the group (including Vadim), and they have exactlyn- 1tandem kayaks (each of which, obviously, can carry two people) and2single kayaks.i-th person's weight iswi, and weight is an important matter in kayaking — if the difference between the weights of two people that sit in the same tandem kayak is too large, then it can crash. And, of course, people want to distribute their seats in kayaks in order to minimize the chances that kayaks will crash.Formally, the instability of a single kayak is always0, and the instability of a tandem kayak is the absolute difference between weights of the people that are in this kayak. Instability of the whole journey is the total instability of all kayaks.Help the party to determine minimum possible total instability!InputThe first line contains one numbern(2 ≤n≤ 50).The second line contains2·ninteger numbersw1,w2, ...,w2n, wherewiis weight of personi(1 ≤wi≤ 1000).OutputPrint minimum possible total instability.ExamplesInput21 2 3 4Output1Input41 3 4 6 3 4 100 200Output5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6bbb63a8", "template_md5": "35d339e4", "result": "There are $n$ pairs of people who want to go kayaking.  There are $n-1$ tandem kayaks (each holding two people) and 2 single kayaks.  The $i$-th person weighs $w_i$ pounds.  \n\nYou need to pair the people up in kayaks so that the difference in weight between the two people in a tandem kayak is as small as possible.  The total instability of a journey is the sum of the absolute differences in weight for all the kayaks.\n\nFind the minimum possible total instability. \n\nInput:\n\n* The first line contains the number of pairs of people, $n$.\n* The second line contains the weights of all $2n$ people.\n\nOutput:\n\n* The minimum possible total instability."}, {"prompt_md5": "7425813b", "template_md5": "465699a0", "result": "You have a group of people who need to be placed into kayaks. There are tandem kayaks (for two people) and single kayaks (for one person).  Each tandem kayak has a weight limit, and the difference in weight between the two people in a tandem kayak cannot be too large.  Find the way to arrange the people in the kayaks that results in the smallest total weight difference across all kayaks."}]}