{"uid": "864-B", "url": "https://codeforces.com/contest/864/problem/B", "tags": ["brute force", " implementation", " strings"], "title": "864-B", "statement": "B. Polycarp and Letterstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp loves lowercase letters and dislikes uppercase ones. Once he got a stringsconsisting only of lowercase and uppercase Latin letters.LetAbe a set of positions in the string. Let's call itprettyif following conditions are met:letters on positions fromAin the string are all distinct and lowercase;there are no uppercase letters in the string which are situated between positions fromA(i.e. there is no suchjthats[j]is an uppercase letter, anda1<j<a2for somea1anda2fromA).Write a program that will determine the maximum number of elements in aprettyset of positions.InputThe first line contains a single integern(1 ≤n≤ 200) — length of strings.The second line contains a stringsconsisting of lowercase and uppercase Latin letters.OutputPrint maximum number of elements inprettyset of positions for strings.ExamplesInput11aaaaBaabAbAOutput2Input12zACaAbbaazzCOutput3Input3ABCOutput0NoteIn the first example the desired positions might be6and8or7and8. Positions6and7contain letters 'a', position8contains letter 'b'. The pair of positions1and8is not suitable because there is an uppercase letter 'B' between these position.In the second example desired positions can be7,8and11. There are other ways to chooseprettyset consisting of three elements.In the third example the given stringsdoes not contain any lowercase letters, so the answer is0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8cdedc9b", "template_md5": "35d339e4", "result": "You are given a string consisting of lowercase and uppercase letters.  Find the largest number of positions in the string where:\n\n* All the letters at those positions are lowercase.\n* There are no uppercase letters between any two of the chosen positions. \n\nOutput this largest number."}, {"prompt_md5": "b74b62a2", "template_md5": "465699a0", "result": "Given a string of lowercase and uppercase letters, find the largest number of positions in the string where the letters at those positions are all lowercase and there are no uppercase letters between them."}]}