{"uid": "865-G", "url": "https://codeforces.com/contest/865/problem/G", "tags": ["combinatorics", " math", " matrices"], "title": "865-G", "statement": "G. Flowers and Chocolatetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIt's Piegirl's birthday soon, and Pieguy has decided to buy her a bouquet of flowers and a basket of chocolates.The flower shop hasFdifferent types of flowers available. Thei-th type of flower always has exactlypipetals. Pieguy has decided to buy a bouquet consisting of exactlyNflowers. He may buy the same type of flower multiple times. TheNflowers are then arranged into a bouquet. The position of the flowers within a bouquet matters. You can think of a bouquet as an ordered list of flower types.The chocolate shop sells chocolates in boxes. There areBdifferent types of boxes available. Thei-th type of box containscipieces of chocolate. Pieguy can buy any number of boxes, and can buy the same type of box multiple times. He will then place these boxes into a basket. The position of the boxes within the basket matters. You can think of the basket as an ordered list of box types.Pieguy knows that Piegirl likes to pluck a petal from a flower before eating each piece of chocolate. He would like to ensure that she eats the last piece of chocolate from the last box just after plucking the last petal from the last flower. That is, the total number of petals on all the flowers in the bouquet should equal the total number of pieces of chocolate in all the boxes in the basket.How many different bouquet+basket combinations can Pieguy buy? The answer may be very large, so compute it modulo1000000007 = 109+ 7.InputThe first line of input will contain integersF,B, andN(1 ≤F≤ 10, 1 ≤B≤ 100, 1 ≤N≤ 1018), the number of types of flowers, the number of types of boxes, and the number of flowers that must go into the bouquet, respectively.The second line of input will containFintegersp1,p2, ...,pF(1 ≤pi≤ 109), the numbers of petals on each of the flower types.The third line of input will containBintegersc1,c2, ...,cB(1 ≤ci≤ 250), the number of pieces of chocolate in each of the box types.OutputPrint the number of bouquet+basket combinations Pieguy can buy, modulo1000000007 = 109+ 7.ExamplesInput2 3 33 510 3 7Output17Input6 5 109 3 3 4 9 99 9 1 6 4Output31415926NoteIn the first example, there is1way to make a bouquet with9petals(3 + 3 + 3), and1way to make a basket with9pieces of chocolate(3 + 3 + 3), for1possible combination. There are3ways to make a bouquet with13petals(3 + 5 + 5, 5 + 3 + 5, 5 + 5 + 3), and5ways to make a basket with13pieces of chocolate(3 + 10, 10 + 3, 3 + 3 + 7, 3 + 7 + 3, 7 + 3 + 3), for15more combinations. Finally there is1way to make a bouquet with15petals(5 + 5 + 5)and1way to make a basket with15pieces of chocolate(3 + 3 + 3 + 3 + 3), for1more combination.Note that it is possible for multiple types of flowers to have the same number of petals. Such types are still considered different. Similarly different types of boxes may contain the same number of pieces of chocolate, but are still considered different.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d158b07a", "template_md5": "35d339e4", "result": "There are $F$ types of flowers, each with a different number of petals ($p_1, p_2, ..., p_F$). There are $B$ types of chocolate boxes, each containing a different number of chocolates ($c_1, c_2, ..., c_B$). \n\nYou need to buy a bouquet of $N$ flowers and a basket of chocolate boxes so that the total number of petals in the bouquet equals the total number of chocolates in the basket.\n\nFind the number of different combinations of bouquets and baskets that satisfy this condition. The answer should be modulo $10^9 + 7$."}, {"prompt_md5": "ea25c081", "template_md5": "465699a0", "result": "You have a set of items with different weights and a target weight.  You need to find the number of ways to choose items from the set so that their total weight equals the target weight."}]}