{"uid": "867-A", "url": "https://codeforces.com/contest/867/problem/A", "tags": ["implementation"], "title": "867-A", "statement": "A. Between the Officestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAs you may know, MemSQL has American offices in both San Francisco and Seattle. Being a manager in the company, you travel a lot between the two cities, always by plane.You prefer flying from Seattle to San Francisco than in the other direction, because it's warmer in San Francisco. You are so busy that you don't remember the number of flights you have made in either direction. However, for each of the lastndays you know whether you were in San Francisco office or in Seattle office. You always fly at nights, so you never were at both offices on the same day. Given this information, determine if you flew more times from Seattle to San Francisco during the lastndays, or not.InputThe first line of input contains single integern(2 ≤n≤ 100) — the number of days.The second line contains a string of lengthnconsisting of only capital 'S' and 'F' letters. If thei-th letter is 'S', then you were in Seattle office on that day. Otherwise you were in San Francisco. The days are given in chronological order, i.e. today is the last day in this sequence.OutputPrint \"YES\" if you flew more times from Seattle to San Francisco, and \"NO\" otherwise.You can print each letter in any case (upper or lower).ExamplesInput4FSSFOutputNOInput2SFOutputYESInput10FFFFFFFFFFOutputNOInput10SSFFSFFSFFOutputYESNoteIn the first example you were initially at San Francisco, then flew to Seattle, were there for two days and returned to San Francisco. You made one flight in each direction, so the answer is \"NO\".In the second example you just flew from Seattle to San Francisco, so the answer is \"YES\".In the third example you stayed the whole period in San Francisco, so the answer is \"NO\".In the fourth example if you replace 'S' with ones, and 'F' with zeros, you'll get the first few digits ofπin binary representation. Not very useful information though.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "69ec8c0e", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ days ($2 \\le n \\le 100$) represented by 'S' for Seattle and 'F' for San Francisco.  Determine if you traveled from Seattle to San Francisco more times than the other way around during these $n$ days."}, {"prompt_md5": "28c93db2", "template_md5": "465699a0", "result": "You are given a sequence of days where each day is either 'S' (Seattle) or 'F' (San Francisco). Determine if you traveled from Seattle to San Francisco more times than the other way around."}]}