{"uid": "868-G", "url": "https://codeforces.com/contest/868/problem/G", "tags": ["math"], "title": "868-G", "statement": "G. El Toll Cavestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe prehistoric caves of El Toll are located in Moià (Barcelona). You have heard that there is a treasure hidden in one ofnpossible spots in the caves. You assume that each of the spots has probability1 /nto contain a treasure.You cannot get into the caves yourself, so you have constructed a robot that can search the caves for treasure. Each day you can instruct the robot to visit exactlykdistinct spots in the caves. If none of these spots contain treasure, then the robot will obviously return with empty hands. However, the caves are dark, and the robot may miss the treasure even when visiting the right spot. Formally, if one of the visited spots does contain a treasure, the robot will obtain it with probability1 / 2, otherwise it will return empty. Each time the robot searches the spot with the treasure, his success probability is independent of all previous tries (that is, the probability to miss the treasure after searching the right spotxtimes is1 / 2x).What is the expected number of days it will take to obtain the treasure if you choose optimal scheduling for the robot? Output the answer as a rational number modulo109+ 7. Formally, let the answer be an irreducible fractionP/Q, then you have to output. It is guaranteed thatQis not divisible by109+ 7.InputThe first line contains the number of test casesT(1 ≤T≤ 1000).Each of the nextTlines contains two integersnandk(1 ≤k≤n≤ 5·108).OutputFor each test case output the answer in a separate line.ExampleInput31 12 13 2Output2500000007777777786NoteIn the first case the robot will repeatedly search in the only spot. The expected number of days in this case is 2. Note that in spite of the fact that we know the treasure spot from the start, the robot still has to search there until he succesfully recovers the treasure.In the second case the answer can be shown to be equal to7 / 2if we search the two spots alternatively. In the third case the answer is25 / 9.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e0263675", "template_md5": "35d339e4", "result": "You have $n$ possible locations to search for a treasure. Each location has an equal chance of containing the treasure.\n\nYou have a robot that can visit $k$ distinct locations each day. \n\n* If the robot visits a location with the treasure, it has a 1/2 chance of finding it.\n* If the robot visits a location without the treasure, it will not find anything.\n* The robot's success probability is independent for each visit to a location.\n\nWhat is the average number of days it will take to find the treasure if you choose the best possible way to schedule the robot's visits? \n\nExpress your answer as a fraction $P/Q$ where $Q$ is not divisible by $10^9 + 7$."}, {"prompt_md5": "91c6223a", "template_md5": "465699a0", "result": "You have a set of locations to search. Each location has an equal chance of containing a hidden item. You can send a robot to search multiple locations each day. The robot has a 50% chance of finding the item if it's at the searched location. What is the average number of days it will take to find the item if you choose the best search strategy?"}]}