{"uid": "869-A", "url": "https://codeforces.com/contest/869/problem/A", "tags": ["brute force", " implementation"], "title": "869-A", "statement": "A. The Artful Expedienttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRock... Paper!After Karen have found the deterministic winning (losing?) strategy for rock-paper-scissors, her brother, Koyomi, comes up with a new game as a substitute. The game works as follows.A positive integernis decided first. Both Koyomi and Karen independently choosendistinct positive integers, denoted byx1,x2, ...,xnandy1,y2, ...,ynrespectively. They reveal their sequences, and repeat untilall of2nintegers become distinct, which is the only final state to be kept and considered.Then they count the number of ordered pairs(i,j)(1 ≤i,j≤n) such that the valuexixoryjequals to one of the2nintegers. Herexormeans thebitwise exclusive oroperation on two integers, and is denoted by operators^and/orxorin most programming languages.Karen claims a win if the number of such pairs is even, and Koyomi does otherwise. And you're here to help determine the winner of their latest game.InputThe first line of input contains a positive integern(1 ≤n≤ 2 000) — the length of both sequences.The second line containsnspace-separated integersx1,x2, ...,xn(1 ≤xi≤ 2·106) — the integers finally chosen by Koyomi.The third line containsnspace-separated integersy1,y2, ...,yn(1 ≤yi≤ 2·106) — the integers finally chosen by Karen.Input guarantees thatthe given2nintegers are pairwise distinct, that is, no pair(i,j)(1 ≤i,j≤n) exists such that one of the following holds:xi=yj;i≠jandxi=xj;i≠jandyi=yj.OutputOutput one line — the name of the winner, that is, \"Koyomi\" or \"Karen\" (without quotes). Please be aware of the capitalization.ExamplesInput31 2 34 5 6OutputKarenInput52 4 6 8 109 7 5 3 1OutputKarenNoteIn the first example, there are6pairs satisfying the constraint:(1, 1),(1, 2),(2, 1),(2, 3),(3, 2)and(3, 3). Thus, Karen wins since6is an even number.In the second example, there are16such pairs, and Karen wins again.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "34c210d6", "template_md5": "35d339e4", "result": "Given two sequences of $n$ distinct positive integers each, determine the winner of a game based on the following rules:\n\n1.  Calculate the bitwise XOR ($^$) of each pair of integers from the two sequences.\n2.  Count the number of pairs $(i, j)$ where $1 \\le i, j \\le n$ and either $x_i$ or $y_j$ equals one of the XOR results from step 1.\n3.  If the count of pairs is even, Player 1 wins. Otherwise, Player 2 wins.\n\n**Input:**\n\n*   The first line contains an integer $n$ (1 ≤ $n$ ≤ 2000).\n*   The second line contains $n$ space-separated integers $x_1, x_2, ..., x_n$ (1 ≤ $x_i$ ≤ 2 * 10⁶).\n*   The third line contains $n$ space-separated integers $y_1, y_2, ..., y_n$ (1 ≤ $y_i$ ≤ 2 * 10⁶).\n\n**Output:**\n\n*   Print the name of the winner (\"Player 1\" or \"Player 2\")."}, {"prompt_md5": "2cca8b1c", "template_md5": "465699a0", "result": "Two players choose lists of numbers. They combine the lists and count how many pairs of numbers from the combined list have the same value when using the XOR operation. If the count is even, one player wins, otherwise the other player wins. Determine the winner based on the given lists of numbers."}]}