{"uid": "87-C", "url": "https://codeforces.com/contest/87/problem/C", "tags": ["dp", " games", " math"], "title": "87-C", "statement": "C. Interesting Gametime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutTwo best friends Serozha and Gena play a game.Initially there is one pile consisting ofnstones on the table. During one move one pile should be taken and divided into an arbitrary number of piles consisting ofa1>a2> ... >ak> 0stones. The piles should meet the conditiona1-a2=a2-a3= ... =ak- 1-ak= 1. Naturally, the number of pileskshould be no less than two.The friends play in turns. The player who cannot make a move loses. Serozha makes the first move. Who will win if both players play in the optimal way?InputThe single line contains a single integern(1 ≤n≤ 105).OutputIf Serozha wins, printk, which represents the minimal number of piles into which he can split the initial one during the first move in order to win the game.If Gena wins, print \"-1\" (without the quotes).ExamplesInput3Output2Input6Output-1Input100Output8", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "59c42492", "template_md5": "35d339e4", "result": "There is a pile of $n$ stones. Two players take turns. On each turn, a player can divide the pile into any number of smaller piles, as long as:\n\n* There are at least two piles.\n* The difference between the number of stones in each consecutive pair of piles is 1.\n\nFor example, a pile of 5 stones could be divided into piles of 3, 2, and 0 stones.\n\nThe first player to be unable to make a move loses. Determine which player will win if both players play optimally. If the first player can win, output the minimum number of piles they can split the initial pile into to guarantee a win. Otherwise, output -1."}, {"prompt_md5": "1bdf59b4", "template_md5": "465699a0", "result": "You start with a pile of stones.  You can split the pile into multiple smaller piles, where each pile is one stone smaller than the one before it.  The goal is to split the pile in a way that forces your opponent to lose.  If you can win, output the minimum number of piles you need to split into. If you can't win, output -1."}]}