{"uid": "870-E", "url": "https://codeforces.com/contest/870/problem/E", "tags": ["dfs and similar", " dsu", " graphs", " trees"], "title": "870-E", "statement": "E. Points, Lines and Ready-made Titlestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are givenndistinct points on a plane with integral coordinates. For each point you can either draw a vertical line through it, draw a horizontal line through it, or do nothing.You consider several coinciding straight lines as a single one. How many distinct pictures you can get? Print the answer modulo109+ 7.InputThe first line contains single integern(1 ≤n≤ 105) — the number of points.nlines follow. The (i+ 1)-th of these lines contains two integersxi,yi(- 109≤xi,yi≤ 109) — coordinates of thei-th point.It is guaranteed that all points are distinct.OutputPrint the number of possible distinct pictures modulo109+ 7.ExamplesInput41 11 22 12 2Output16Input2-1 -10 1Output9NoteIn the first example there are two vertical and two horizontal lines passing through the points. You can get pictures with any subset of these lines. For example, you can get the picture containing all four lines in two ways (each segment represents a line containing it).The first way:The second way:In the second example you can work with two points independently. The number of pictures is32= 9.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ee9a2056", "template_md5": "35d339e4", "result": "You are given $n$ distinct points on a plane with integer coordinates. For each point, you can choose to draw a vertical line through it, a horizontal line through it, or no line at all.  \n\nConsider any lines that overlap as a single line. How many unique arrangements of lines can you create?  Print your answer modulo $10^9 + 7$.\n\n**Input:**\n\n* The first line contains a single integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the number of points.\n* The following $n$ lines each contain two integers $x_i$, $y_i$ (-10⁹ ≤ $x_i$, $y_i$ ≤ 10⁹) representing the coordinates of each point.\n\n**Output:**\n\n* Print the number of possible unique arrangements of lines modulo $10^9 + 7$."}, {"prompt_md5": "b2edc24c", "template_md5": "465699a0", "result": "You have a set of points on a grid. You can draw a vertical or horizontal line through each point, or do nothing.  How many unique arrangements of lines can you make?"}]}