{"uid": "873-A", "url": "https://codeforces.com/contest/873/problem/A", "tags": ["implementation"], "title": "873-A", "statement": "A. Chorestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLuba has to donchores today.i-th chore takesaiunits of time to complete. It is guaranteed that for everythe conditionai≥ai- 1is met, so the sequence is sorted.Also Luba can work really hard on some chores. She can choose not more thankany chores and do each of them inxunits of time instead ofai().Luba is very responsible, so she has to do allnchores, and now she wants to know the minimum time she needs to do everything. Luba cannot do two chores simultaneously.InputThe first line contains three integersn,k,x(1 ≤k≤n≤ 100, 1 ≤x≤ 99) — the number of chores Luba has to do, the number of chores she can do inxunits of time, and the numberxitself.The second line containsninteger numbersai(2 ≤ai≤ 100)— the time Luba has to spend to doi-th chore.It is guaranteed that, and for eachai≥ai- 1.OutputPrint one number — minimum time Luba needs to do allnchores.ExamplesInput4 2 23 6 7 10Output13Input5 2 1100 100 100 100 100Output302NoteIn the first example the best option would be to do the third and the fourth chore, spendingx= 2time on each instead ofa3anda4, respectively. Then the answer is3 + 6 + 2 + 2 = 13.In the second example Luba can choose any two chores to spendxtime on them instead ofai. So the answer is100·3 + 2·1 = 302.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d94fb874", "template_md5": "35d339e4", "result": "You are given $n$ chores, where the $i$-th chore takes $a_i$ units of time to complete.  It is guaranteed that $a_i \\ge a_{i-1}$ for all $i$. You can choose up to $k$ chores to complete in $x$ units of time instead of their original time.  Find the minimum time required to complete all $n$ chores.\n\nInput:\n\n* The first line contains three integers $n$, $k$, and $x$ ($1 \\le k \\le n \\le 100$, $1 \\le x \\le 99$).\n* The second line contains $n$ integers $a_i$ ($2 \\le a_i \\le 100$).\n\nOutput:\n\n* Print one integer representing the minimum time required to complete all chores."}, {"prompt_md5": "c3e94723", "template_md5": "465699a0", "result": "You have a list of tasks that take a certain amount of time to complete. You can choose a number of tasks to complete in a shorter amount of time. Find the minimum total time to complete all tasks."}]}