{"uid": "875-C", "url": "https://codeforces.com/contest/875/problem/C", "tags": ["2-sat", " dfs and similar", " graphs", " implementation"], "title": "875-C", "statement": "C. National Propertytime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou all know that the Library of Bookland is the largest library in the world. There are dozens of thousands of books in the library.Some long and uninteresting story was removed...The alphabet of Bookland is so large that its letters are denoted by positive integers. Each letter can be small or large, the large version of a letterxis denoted byx'. BSCII encoding, which is used everywhere in Bookland, is made in that way so that large letters are presented in the order of the numbers they are denoted by, and small letters are presented in the order of the numbers they are denoted by, but all large letters arebeforeall small letters. For example, the following conditions hold:2 < 3,2' < 3',3' < 2.A wordx1,x2, ...,xais notlexicographicallygreater thany1,y2, ...,ybif one of the two following conditions holds:a≤bandx1=y1, ...,xa=ya, i.e. the first word is the prefix of the second word;there is a position1 ≤j≤min(a,b), such thatx1=y1, ...,xj- 1=yj- 1andxj<yj, i.e. at the first position where the words differ the first word has a smaller letter than the second word has.For example, the word \"3'75\" is before the word \"24'6\" in lexicographical order. It is said that sequence of words is in lexicographical order if each word is not lexicographically greater than the next word in the sequence.Denis has a sequence of words consisting of small letters only. He wants to change some letters to large (let's call this process acapitalization) in such a way that the sequence of words is in lexicographical order. However, he soon realized that for some reason he can't change a single letter in a single word. He only can choose a letter and change all of its occurrences inallwords to large letters. He can perform this operation any number of times with arbitrary letters of Bookland's alphabet.Help Denis to choose which letters he needs to capitalize (make large) in order to make the sequence of words lexicographically ordered, or determine that it is impossible.Note that some words can beequal.InputThe first line contains two integersnandm(2 ≤n≤ 100 000,1 ≤m≤ 100 000) — the number of words and the number of letters in Bookland's alphabet, respectively. The letters of Bookland's alphabet are denoted by integers from1tom.Each of the nextnlines contains a description of one word in formatli,si, 1,si, 2, ...,si,li(1 ≤li≤ 100 000,1 ≤si,j≤m), whereliis the length of the word, andsi,jis the sequence of letters in the word. The words are given in the order Denis has them in the sequence.It is guaranteed that the total length of all words is not greater than100 000.OutputIn the first line print \"Yes\" (without quotes), if it is possible to capitalize some set of letters in such a way that the sequence of words becomes lexicographically ordered. Otherwise, print \"No\" (without quotes).If the required is possible, in the second line printk— the number of letters Denis has to capitalize (make large), and in the third line printkdistinct integers — these letters. Note that youdon't need to minimizethe valuek.You can print the letters in any order. If there are multiple answers, print any of them.ExamplesInput4 31 21 13 1 3 22 1 1OutputYes22 3Input6 52 1 22 1 23 1 2 32 1 52 4 42 4 4OutputYes0Input4 34 3 2 2 13 1 1 33 2 3 32 3 1OutputNoNoteIn the first example after Denis makes letters2and3large, the sequence looks like the following:2'113'2'11The condition2' < 1holds, so the first word is not lexicographically larger than the second word. The second word is the prefix of the third word, so the are in lexicographical order. As the first letters of the third and the fourth words are the same, and3' < 1, then the third word is not lexicographically larger than the fourth word.In the second example the words are in lexicographical order from the beginning, so Denis can do nothing.In the third example there is no set of letters such that if Denis capitalizes them, the sequence becomes lexicographically ordered.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7950620f", "template_md5": "35d339e4", "result": "You are given a list of words. Each word is made up of letters from a set of $m$ letters, where each letter is represented by a unique integer from 1 to $m$.  \n\nThe order of the letters is defined as follows:\n\n*  Letters 1 to $m/2$ are small.\n*  Letters $m/2 + 1$ to $m$ are large.\n\nThe order of the letters within each group (small or large) is the same as their numerical value. For example, 2 is smaller than 3, and 2' is smaller than 3'.\n\nYou can change any letter in all the words to its uppercase version (e.g., 2 to 2'). You can only change all occurrences of a single letter at once.\n\nDetermine if it is possible to change some letters to uppercase so that the list of words is in lexicographical order. If it is possible, output the number of letters to change and the list of those letters. If it is not possible, output \"No\".\n\n**Lexicographical Order:**\n\nA list of words is in lexicographical order if for every pair of consecutive words, one of the following is true:\n\n* The first word is a prefix of the second word.\n* There is a position where the first word has a smaller letter than the second word."}, {"prompt_md5": "35844016", "template_md5": "465699a0", "result": "You are given a list of words. You can change any letter in all the words to uppercase.  Determine if you can rearrange the words so they are in alphabetical order using this operation, and if so, how many letters you need to change."}]}