{"uid": "875-F", "url": "https://codeforces.com/contest/875/problem/F", "tags": ["dsu", " graphs", " greedy"], "title": "875-F", "statement": "F. Royal Questionstime limit per test1.5 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputIn a medieval kingdom, the economic crisis is raging. Milk drops fall, Economic indicators are deteriorating every day, money from the treasury disappear. To remedy the situation, King Charles Sunnyface decided make hisnsons-princes marry the brides with as big dowry as possible.In search of candidates, the king asked neighboring kingdoms, and after a while several delegations arrived withmunmarried princesses. Receiving guests, Karl learned that the dowry of theith princess iswiof golden coins.Although the action takes place in the Middle Ages, progressive ideas are widespread in society, according to which no one can force a princess to marry a prince whom she does not like. Therefore, each princess has an opportunity to choose two princes, for each of which she is ready to become a wife. The princes were less fortunate, they will obey the will of their father in the matter of choosing a bride.Knowing the value of the dowry and the preferences of each princess, Charles wants to play weddings in such a way that the total dowry of the brides of all his sons would be as great as possible. At the same time to marry all the princes or princesses is not necessary. Each prince can marry no more than one princess, and vice versa, each princess can marry no more than one prince.Help the king to organize the marriage of his sons in the most profitable way for the treasury.InputThe first line contains two integersn,m(2 ≤n≤ 200 000,1 ≤m≤ 200 000) — number of princes and princesses respectively.Each of followingmlines contains three integersai,bi,wi(1 ≤ai,bi≤n,ai≠bi,1 ≤wi≤ 10 000) — number of princes, whichi-th princess is ready to marry and the value of her dowry.OutputPrint the only integer — the maximum number of gold coins that a king can get by playing the right weddings.ExamplesInput2 31 2 51 2 12 1 10Output15Input3 21 2 103 2 20Output30", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d198c6c7", "template_md5": "35d339e4", "result": "You are given two sets of numbers:\n\n*  $n$ represents the number of princes.\n*  $m$ represents the number of princesses.\n\nEach princess has a dowry value ($w_i$) and two princes ($a_i$ and $b_i$) she is willing to marry.\n\nFind the maximum total dowry the king can obtain by marrying his sons to princesses, where each prince can marry only one princess and each princess can marry only one prince."}, {"prompt_md5": "1cb9b7c2", "template_md5": "465699a0", "result": "You are given a list of people and their preferences. Each person can choose up to two other people they would like to be paired with.  Find the maximum total value you can achieve by pairing people, where the value is determined by a given number associated with each person.  Each person can only be paired with one other person."}]}