{"uid": "876-B", "url": "https://codeforces.com/contest/876/problem/B", "tags": ["implementation", " math", " number theory"], "title": "876-B", "statement": "B. Divisiblity of Differencestime limit per test1 secondmemory limit per test512 megabytesinputstandard inputoutputstandard outputYou are given a multiset ofnintegers. You should select exactlykof them in a such way that the difference between any two of them is divisible bym, or tell that it is impossible.Numbers can be repeated in the original multiset and in the multiset of selected numbers, but number of occurrences of any number in multiset of selected numbers should not exceed the number of its occurrences in the original multiset.InputFirst line contains three integersn,kandm(2 ≤k≤n≤ 100 000,1 ≤m≤ 100 000) — number of integers in the multiset, number of integers you should select and the required divisor of any pair of selected integers.Second line containsnintegersa1,a2, ...,an(0 ≤ai≤ 109) — the numbers in the multiset.OutputIf it is not possible to selectknumbers in the desired way, output «No» (without the quotes).Otherwise, in the first line of output print «Yes» (without the quotes). In the second line printkintegersb1,b2, ...,bk— the selected numbers. If there are multiple possible solutions, print any of them.ExamplesInput3 2 31 8 4OutputYes1 4Input3 3 31 8 4OutputNoInput4 3 52 7 7 7OutputYes2 7 7", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "10a62676", "template_md5": "35d339e4", "result": "You are given a set of $n$ numbers. You need to choose exactly $k$ of these numbers ($2 \\le k \\le n \\le 100,000$) such that the difference between any two of the chosen numbers is divisible by $m$ ($1 \\le m \\le 100,000$). \n\nIf you can find such a set of $k$ numbers, print \"Yes\" followed by the $k$ numbers. If it's impossible to find such a set, print \"No\". \n\nYou can use the same number multiple times in your chosen set, but the number of times you use a number can't be more than the number of times it appears in the original set."}, {"prompt_md5": "bdc290af", "template_md5": "465699a0", "result": "You are given a list of numbers. Choose a subset of  'k' numbers from the list so that the difference between any two chosen numbers is divisible by 'm'. If this is possible, output \"Yes\" followed by the chosen numbers. Otherwise, output \"No\"."}]}