{"uid": "877-E", "url": "https://codeforces.com/contest/877/problem/E", "tags": ["bitmasks", " data structures", " trees"], "title": "877-E", "statement": "E. Danil and a Part-time Jobtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputDanil decided to earn some money, so he had found a part-time job. The interview have went well, so now he is a light switcher.Danil works in a rooted tree (undirected connected acyclic graph) withnvertices, vertex1is the root of the tree. There is a room in each vertex, light can be switched on or off in each room. Danil's duties include switching light in all rooms of the subtree of the vertex. It means that if light is switched on in some room of the subtree, he should switch it off. Otherwise, he should switch it on.Unfortunately (or fortunately), Danil is very lazy. He knows that his boss is not going to personally check the work. Instead, he will send Danil tasks usingWorkforcespersonal messages.There are two types of tasks:pow vdescribes a task to switch lights in the subtree of vertexv.get vdescribes a task to count the number of rooms in the subtree ofv, in which the light is turned on. Danil should send the answer to his boss usingWorkforcesmessages.A subtree of vertexvis a set of vertices for which the shortest path from them to the root passes throughv. In particular, the vertexvis in the subtree ofv.Danil is not going to perform his duties. He asks you to write a program, which answers the boss instead of him.InputThe first line contains a single integern(1 ≤n≤ 200 000) — the number of vertices in the tree.The second line containsn- 1space-separated integersp2,p3, ...,pn(1 ≤pi<i), wherepiis the ancestor of vertexi.The third line containsnspace-separated integerst1,t2, ...,tn(0 ≤ti≤ 1), wheretiis1, if the light is turned on in vertexiand0otherwise.The fourth line contains a single integerq(1 ≤q≤ 200 000) — the number of tasks.The nextqlines areget vorpow v(1 ≤v≤n) — the tasks described above.OutputFor each taskget vprint the number of rooms in the subtree ofv, in which the light is turned on.ExampleInput41 1 11 0 0 19get 1get 2get 3get 4pow 1get 1get 2get 3get 4Output20012110NoteThe tree before the taskpow 1.The tree after the taskpow 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aada7157", "template_md5": "35d339e4", "result": "You are given a rooted tree with $n$ vertices. Each vertex has a light that can be either on or off.  \n\nThere are two types of queries:\n\n* **pow v:** Toggle the state of all lights in the subtree rooted at vertex $v$.\n* **get v:** Count the number of lights that are on in the subtree rooted at vertex $v$.\n\nYou need to process $q$ queries. \n\n**Input:**\n\n* The first line contains $n$ (the number of vertices).\n* The second line contains $n-1$ integers representing the parent of each vertex (except the root, which is vertex 1).\n* The third line contains $n$ integers representing the initial state of each light (0 for off, 1 for on).\n* The fourth line contains $q$ (the number of queries).\n* The following $q$ lines contain either \"pow v\" or \"get v\", where $v$ is the vertex index.\n\n**Output:**\n\nFor each \"get v\" query, print the number of lights that are on in the subtree rooted at vertex $v$."}, {"prompt_md5": "2245de8f", "template_md5": "465699a0", "result": "You are given a tree with nodes, each node having a light that can be on or off.  You need to answer queries of two types:\n\n1. **pow v:** Toggle the state of all lights in the subtree rooted at node *v*.\n2. **get v:** Count the number of lights that are on in the subtree rooted at node *v*."}]}