{"uid": "877-B", "url": "https://codeforces.com/contest/877/problem/B", "tags": ["brute force", " dp"], "title": "877-B", "statement": "B. Nikita and stringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOne day Nikita found the string containing letters \"a\" and \"b\" only.Nikita thinks that string is beautiful if it can be cut into3strings (possibly empty) without changing the order of the letters, where the1-st and the3-rd one contain only letters \"a\" and the2-nd contains only letters \"b\".Nikita wants to make the string beautiful by removing some (possibly none) of its characters, but without changing their order. What is the maximum length of the string he can get?InputThe first line contains a non-empty string of length not greater than5 000containing only lowercase English letters \"a\" and \"b\".OutputPrint a single integer — the maximum possible size of beautiful string Nikita can get.ExamplesInputabbaOutput4InputbabOutput2NoteIt the first sample the string is already beautiful.In the second sample he needs to delete one of \"b\" to make it beautiful.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3028b675", "template_md5": "35d339e4", "result": "You are given a string consisting only of the letters 'a' and 'b'.  \n\nDetermine the longest possible length of a substring that can be divided into three parts:\n\n* The first and third parts must contain only the letter 'a'.\n* The second part must contain only the letter 'b'.\n\nYou can remove some (or no) characters from the original string to achieve this division, but the order of the remaining characters must be preserved."}, {"prompt_md5": "e2a7eecb", "template_md5": "465699a0", "result": "Given a string made up of only 'a's and 'b's, find the longest possible string you can make by removing some characters, so that the remaining string can be divided into three parts: the first and third parts contain only 'a's, and the second part contains only 'b's."}]}