{"uid": "879-A", "url": "https://codeforces.com/contest/879/problem/A", "tags": ["implementation"], "title": "879-A", "statement": "A. Borya's Diagnosistime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIt seems that Borya is seriously sick. He is going visitndoctors to find out the exact diagnosis. Each of the doctors needs the information about all previous visits, so Borya has to visit them in the prescribed order (i.e. Borya should first visit doctor1, then doctor2, then doctor3and so on). Borya will get the information about his health from the last doctor.Doctors have a strange working schedule. The doctorigoes to work on thesi-th day and works everydiday. So, he works on dayssi,si+di,si+ 2di, ....The doctor's appointment takes quite a long time, so Borya can not see more than one doctor per day. What is the minimum time he needs to visit all doctors?InputFirst line contains an integern— number of doctors (1 ≤n≤ 1000).Nextnlines contain two numberssianddi(1 ≤si,di≤ 1000).OutputOutput a single integer — the minimum day at which Borya can visit the last doctor.ExamplesInput32 21 22 2Output4Input210 16 5Output11NoteIn the first sample case, Borya can visit all doctors on days2,3and4.In the second sample case, Borya can visit all doctors on days10and11.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "79fafbf9", "template_md5": "35d339e4", "result": "There are $n$ doctors. Each doctor has a starting day ($s_i$) and a work interval ($d_i$).  A doctor works every $d_i$ days, starting on day $s_i$.  \n\nYou must visit the doctors in order.  \n\nFind the minimum day on which you can visit the last doctor. \n\n\nInput:\n\n* The first line contains an integer $n$ (the number of doctors).\n* The next $n$ lines each contain two integers $s_i$ and $d_i$ (the starting day and work interval for doctor $i$).\n\nOutput:\n\n* Output a single integer representing the minimum day you can visit the last doctor."}, {"prompt_md5": "45567178", "template_md5": "465699a0", "result": "You are given a list of doctors and their working schedules. Each doctor works on a specific starting day and then every 'd' days after that.  Find the minimum number of days needed to visit all doctors, visiting them in order."}]}