{"uid": "883-J", "url": "https://codeforces.com/contest/883/problem/J", "tags": ["constructive algorithms", " greedy", " sortings"], "title": "883-J", "statement": "J. Renovationtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe mayor of the Berland city S sees the beauty differently than other city-dwellers. In particular, he does not understand at all, how antique houses can be nice-looking. So the mayor wants to demolish all ancient buildings in the city.The city S is going to host the football championship very soon. In order to make the city beautiful, every month the Berland government provides mayor a money tranche. The money has to be spent on ancient buildings renovation.There arenmonths before the championship and thei-th month tranche equals toaiburles. The city S hasmantique buildings and the renovation cost of thej-th building isbjburles.The mayor has his own plans for spending the money. As he doesn't like antique buildings he wants to demolish as much of them as possible. For thej-th building he calculated its demolishing costpj.The mayor decided to act according to the following plan.Each month he chooses several (possibly zero) ofmbuildings to demolish in such a way that renovation cost ofeach of them separatelyis not greater than the money trancheaiof this month (bj≤ai) — it will allow to deceive city-dwellers that exactly this building will be renovated.Then the mayor has to demolish all selected buildings during the current month as otherwise the dwellers will realize the deception and the plan will fail. Definitely the total demolishing cost can not exceed amount of money the mayor currently has. The mayor is not obliged to spend all the money on demolishing. If some money is left, the mayor puts it to the bank account and can use it in any subsequent month. Moreover, at any month he may choose not to demolish any buildings at all (in this case all the tranche will remain untouched and will be saved in the bank).Your task is to calculate the maximal number of buildings the mayor can demolish.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 100 000)— the number of months before the championship and the number of ancient buildings in the city S.The second line containsnintegersa1,a2, ...,an(1 ≤ai≤ 109), whereaiis the tranche of thei-th month.The third line containsmintegersb1,b2, ...,bm(1 ≤bj≤ 109), wherebjis renovation cost of thej-th building.The fourth line containsmintegersp1,p2, ...,pm(1 ≤pj≤ 109), wherepjis the demolishing cost of thej-th building.OutputOutput single integer — the maximal number of buildings the mayor can demolish.ExamplesInput2 32 46 2 31 3 2Output2Input3 55 3 15 2 9 1 104 2 1 3 10Output3Input5 66 3 2 4 33 6 4 5 4 21 4 3 2 5 3Output6NoteIn the third example the mayor acts as follows.In the first month he obtains6burles tranche and demolishes buildings#2(renovation cost6, demolishing cost4) and#4(renovation cost5, demolishing cost2). He spends all the money on it.After getting the second month tranche of3burles, the mayor selects only building#1(renovation cost3, demolishing cost1) for demolishing. As a result, he saves2burles for the next months.In the third month he gets2burle tranche, but decides not to demolish any buildings at all. As a result, he has2 + 2 = 4burles in the bank.This reserve will be spent on the fourth month together with the4-th tranche for demolishing of houses#3and#5(renovation cost is4for each, demolishing costs are3and5correspondingly). After this month his budget is empty.Finally, after getting the last tranche of3burles, the mayor demolishes building#6(renovation cost2, demolishing cost3).As it can be seen, he demolished all6buildings.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "416bb338", "template_md5": "35d339e4", "result": "There are $n$ months before an event and $m$ buildings. Each month, a sum of money $a_i$ is available to spend.  Each building has a renovation cost $b_j$ and a demolition cost $p_j$.\n\nThe goal is to maximize the number of buildings that can be demolished.  \n\nHere are the rules:\n\n* In each month, you can choose to demolish zero or more buildings.\n* The demolition cost of the buildings chosen in a month must be less than or equal to the money available that month ($a_i$).\n* You can save money from one month to use in a later month.\n* You do not have to spend all the money available in a month.\n\n\nOutput the maximum number of buildings that can be demolished."}, {"prompt_md5": "d7fb5253", "template_md5": "465699a0", "result": "You have a limited amount of money given to you each month.  You can spend this money to demolish buildings. Each building has a cost to demolish and a cost to renovate. You want to demolish as many buildings as possible.  You can save money from one month to use in a later month. \n\n\nWhat is the maximum number of buildings you can demolish?"}]}