{"uid": "883-C", "url": "https://codeforces.com/contest/883/problem/C", "tags": ["binary search", " implementation"], "title": "883-C", "statement": "C. Downloading B++time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputOnlyTmilliseconds left before the start of well-known online programming contest Codehorses Round 2017.Polycarp needs to download B++ compiler to take part in the contest. The size of the file isfbytes.Polycarp's internet tariff allows to download data at the rate of one byte pert0milliseconds. This tariff is already prepaid, and its use does not incur any expense for Polycarp. In addition, the Internet service provider offers two additional packages:downloada1bytes at the rate of one byte pert1milliseconds, payingp1burles for the package;downloada2bytes at the rate of one byte pert2milliseconds, payingp2burles for the package.Polycarp can buy any package many times. When buying a package, its price (p1orp2) is prepaid before usage. Once a package is bought it replaces the regular tariff until package data limit is completely used. After a package is consumed Polycarp can immediately buy a new package or switch to the regular tariff without loosing any time. While a package is in use Polycarp can't buy another package or switch back to the regular internet tariff.Find the minimum amount of money Polycarp has to spend to download anfbytes file no more than inTmilliseconds.Note that because of technical reasons Polycarp can download only integer number of bytes using regular tariff and both packages. I.e. in each of three downloading modes the number of downloaded bytes will be integer. It means that Polycarp can't download a byte partially using the regular tariff or/and both packages.InputThe first line contains three integer numbersf,Tandt0(1 ≤f,T,t0≤ 107) — size of the file to download (in bytes), maximal time to download the file (in milliseconds) and number of milliseconds to download one byte using the regular internet tariff.The second line contains a description of the first additional package. The line contains three integer numbersa1,t1andp1(1 ≤a1,t1,p1≤ 107), wherea1is maximal sizes of downloaded data (in bytes),t1is time to download one byte (in milliseconds),p1is price of the package (in burles).The third line contains a description of the second additional package. The line contains three integer numbersa2,t2andp2(1 ≤a2,t2,p2≤ 107), wherea2is maximal sizes of downloaded data (in bytes),t2is time to download one byte (in milliseconds),p2is price of the package (in burles).Polycarp can buy any package many times. Once package is bought it replaces the regular tariff until package data limit is completely used. While a package is in use Polycarp can't buy another package or switch back to the regular internet tariff.OutputPrint the minimum amount of money that Polycarp needs to pay to download B++ compiler no more than inTmilliseconds. If there is no solution, print the only integer-1.ExamplesInput120 964 2026 8 813 10 4Output40Input10 200 201 1 12 2 3Output0Input8 81 114 10 163 10 12Output28Input8 79 114 10 163 10 12Output-1NoteIn the first example Polycarp has to buy the first additional package 5 times and do not buy the second additional package. He downloads 120 bytes (of total26·5 = 130bytes) in120·8 = 960milliseconds (960 ≤ 964). He spends8·5 = 40burles on it.In the second example Polycarp has enough time to download10bytes. It takes10·20 = 200milliseconds which equals to upper constraint on download time.In the third example Polycarp has to buy one first additional package and one second additional package.In the fourth example Polycarp has no way to download the file on time.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "971bcdeb", "template_md5": "35d339e4", "result": "You are given a file of size $f$ bytes that needs to be downloaded. There are three download speeds available:\n\n* **Regular tariff:** Downloads 1 byte every $t_0$ milliseconds.\n* **Package 1:** Downloads 1 byte every $t_1$ milliseconds for a price of $p_1$ burles.\n* **Package 2:** Downloads 1 byte every $t_2$ milliseconds for a price of $p_2$ burles.\n\nYou can buy packages multiple times, and each package replaces the regular tariff until its data limit is exhausted. Once a package is used, you can immediately buy a new one or switch back to the regular tariff.\n\nFind the minimum amount of money you need to spend to download the entire file within a maximum time of $T$ milliseconds. If it's impossible to download the file within the time limit, output -1."}, {"prompt_md5": "db69813f", "template_md5": "465699a0", "result": "You have a file to download of a certain size. You have a base download speed, and two paid options with faster speeds but limited data.  You need to find the cheapest way to download the entire file within a time limit.  You can buy multiple copies of each paid option."}]}