{"uid": "883-A", "url": "https://codeforces.com/contest/883/problem/A", "tags": ["implementation"], "title": "883-A", "statement": "A. Automatic Doortime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is an automatic door at the entrance of a factory. The door works in the following way:when one or several people come to the door and it is closed, the door immediately opens automatically and all people immediately come inside,when one or several people come to the door and it is open, all people immediately come inside,opened door immediately closes indseconds after its opening,if the door is closing and one or several people are coming to the door at the same moment, then all of them will have enough time to enter and only after that the door will close.For example, ifd= 3and four people are coming at four different moments of timet1= 4,t2= 7,t3= 9andt4= 13then the door will open three times: at moments4,9and13. It will close at moments7and12.It is known thatnemployees will enter at momentsa, 2·a, 3·a, ...,n·a(the valueais positive integer). Alsomclients will enter at momentst1,t2, ...,tm.Write program to find the number of times the automatic door will open. Assume that the door is initially closed.InputThe first line contains four integersn,m,aandd(1 ≤n,a≤ 109,1 ≤m≤ 105,1 ≤d≤ 1018) — the number of the employees, the number of the clients, the moment of time when the first employee will come and the period of time in which the door closes.The second line contains integer sequencet1,t2, ...,tm(1 ≤ti≤ 1018) — moments of time when clients will come. The valuestiare given in non-decreasing order.OutputPrint the number of times the door will open.ExamplesInput1 1 3 47Output1Input4 3 4 27 9 11Output4NoteIn the first example the only employee will come at moment3. At this moment the door will open and will stay open until the moment7. At the same moment of time the client will come, so at first he will enter and only after it the door will close. Thus the door will open one time.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c6e06e30", "template_md5": "35d339e4", "result": "An automatic door opens when people approach it and closes after a fixed time.  \n\n**Here's how it works:**\n\n* **Initial state:** The door is closed.\n* **People approaching:**\n    * If the door is closed, it opens immediately when people arrive.\n    * If the door is open, people enter immediately.\n* **Closing:** The door closes  $d$ time units after opening.\n* **Overlapping events:** If people arrive while the door is closing, they still have time to enter before the door fully closes.\n\n**Input:**\n\n* $n$: The number of employees.\n* $m$: The number of clients.\n* $a$: The time (in some units) when the first employee arrives.\n* $d$: The closing time (in the same units) for the door.\n* $t_1, t_2, ..., t_m$: The times (in the same units) when clients arrive.\n\n**Output:**\n\nThe number of times the door opens.\n\n**Employee arrivals:** Employees arrive at times $a$, $2a$, $3a$, ..., $na$.\n\n**Example:**\n\nIf $n = 4$, $m = 3$, $a = 4$, $d = 2$, $t_1 = 7$, $t_2 = 9$, $t_3 = 11$, the door will open 4 times."}, {"prompt_md5": "5cd4f792", "template_md5": "465699a0", "result": "A door automatically opens when someone approaches and closes after a fixed delay.  People arrive at specific times.  Find how many times the door opens."}]}