{"uid": "884-C", "url": "https://codeforces.com/contest/884/problem/C", "tags": ["dfs and similar", " greedy", " math"], "title": "884-C", "statement": "C. Bertown Subwaytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe construction of subway in Bertown is almost finished! The President of Berland will visit this city soon to look at the new subway himself.There arenstations in the subway. It was built according to theBertown Transport Law:For each stationithere exists exactly one train that goes from this station. Its destination station ispi, possiblypi=i;For each stationithere exists exactly one stationjsuch thatpj=i.The President will consider theconvenienceof subway after visiting it. Theconvenienceis the number of ordered pairs(x,y)such that person can start at stationxand, after taking some subway trains (possibly zero), arrive at stationy(1 ≤x,y≤n).The mayor of Bertown thinks that if the subway is notconvenientenough, then the President might consider installing a new mayor (and, of course, the current mayor doesn't want it to happen). Before President visits the city mayor has enough time to rebuild some paths of subway, thus changing the values ofpifornot more than two subway stations. Of course, breaking theBertown Transport Lawis really bad, so the subway must be built according to theLaweven after changes.The mayor wants to do these changes in such a way that theconvenienceof the subway is maximized. Help him to calculate the maximum possibleconveniencehe can get!InputThe first line contains one integer numbern(1 ≤n≤ 100000) — the number of stations.The second line containsninteger numbersp1,p2, ...,pn(1 ≤pi≤n) — the current structure of the subway. All these numbers are distinct.OutputPrint one number — the maximum possible value ofconvenience.ExamplesInput32 1 3Output9Input51 5 4 3 2Output17NoteIn the first example the mayor can changep2to3andp3to1, so there will be9pairs:(1, 1),(1, 2),(1, 3),(2, 1),(2, 2),(2, 3),(3, 1),(3, 2),(3, 3).In the second example the mayor can changep2to4andp3to5.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7470102c", "template_md5": "35d339e4", "result": "There are $n$ stations in a subway system. Each station has a destination station, represented by a number $p_i$ where $p_i$ is the destination station for station $i$.  \n\nThe goal is to maximize the number of pairs of stations $(x, y)$ where a person can travel from station $x$ to station $y$ using the subway. \n\nThe mayor can change the destination station for up to two stations.  The changes must still follow the rule that each station has exactly one destination station.\n\nFind the maximum number of possible pairs $(x, y)$ after making the changes."}, {"prompt_md5": "6ff01186", "template_md5": "465699a0", "result": "You are given a list of destinations for trains at each station. You can change the destinations of two stations.  Find the maximum number of pairs of stations that can be reached from each other by taking trains."}]}