{"uid": "884-F", "url": "https://codeforces.com/contest/884/problem/F", "tags": ["flows", " graphs", " greedy"], "title": "884-F", "statement": "F. Anti-Palindromizetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA stringaof lengthmis calledantipalindromiciffmis even, and for eachi(1 ≤i≤m)ai≠am-i+ 1.Ivan has a stringsconsisting ofnlowercase Latin letters;nis even. He wants to form some stringtthat will be anantipalindromicpermutation ofs. Also Ivan has denoted thebeautyof indexiasbi, and thebeautyoftas the sum ofbiamong all indicesisuch thatsi=ti.Help Ivan to determine maximum possiblebeautyofthe can get.InputThe first line contains one integern(2 ≤n≤ 100,nis even) — the number of characters ins.The second line contains the stringsitself. It consists of only lowercase Latin letters, and it is guaranteed that its letters can be reordered to form anantipalindromicstring.The third line containsninteger numbersb1,b2, ...,bn(1 ≤bi≤ 100), wherebiis thebeautyof indexi.OutputPrint one number — the maximum possiblebeautyoft.ExamplesInput8abacabac1 1 1 1 1 1 1 1Output8Input8abaccaba1 2 3 4 5 6 7 8Output26Input8abacabca1 2 3 4 4 3 2 1Output17", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4ae6c8b5", "template_md5": "35d339e4", "result": "You are given a string of even length $n$ consisting of lowercase letters.  You can rearrange the letters to form a new string that is antipalindromic (meaning the first and last letters are different, the second and second-to-last letters are different, and so on).  Each letter in the original string has a beauty value associated with it.  \n\nFind the maximum possible sum of beauty values for a valid antipalindromic rearrangement of the string."}, {"prompt_md5": "a2fbc8bf", "template_md5": "465699a0", "result": "You are given a string of even length that can be rearranged to form a special type of palindrome.  The \"special\" part is that the first and last characters, the second and second-to-last characters, and so on, must be different.  \n\nYou are also given a list of values associated with each character in the string.  \n\nFind the arrangement of the string that results in the highest possible sum of these values."}]}