{"uid": "887-F", "url": "https://codeforces.com/contest/887/problem/F", "tags": ["greedy", " sortings"], "title": "887-F", "statement": "F. Row of Modelstime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputDuring the final part of fashion show all models come to the stage and stay in one row and fashion designer stays to right to model on the right. During the rehearsal, Izabella noticed, that row isn't nice, but she can't figure out how to fix it.Like many other creative people, Izabella has a specific sense of beauty. Evaluating beauty of row of models Izabella looks at heights of models. She thinks that row is nice if for each model distance to nearest model with less height (model or fashion designer) to the right of her doesn't exceedk(distance between adjacent people equals 1, the distance between people with exactly one man between them equals 2, etc).She wants to make row nice, but fashion designer has his own sense of beauty, so she can at most one time select two models from the row and swap their positions if the left model from this pair is higher than the right model from this pair.Fashion designer (man to the right of rightmost model) has less height than all models and can't be selected for exchange.You should tell if it's possible to make at most one exchange in such a way that row becomes nice for Izabella.InputIn first line there are two integersnandk(1 ≤n≤ 5·105,1 ≤k≤n) — number of models and required distance.Second line containsnspace-separated integersai(1 ≤ai≤ 109) — height of each model. Pay attention that height of fashion designer is not given and can be less than 1.OutputPrint «YES» (without quotes) if it's possible to make row nice using at most one exchange, and «NO» (without quotes) otherwise.ExamplesInput5 42 3 5 2 5OutputNOInput5 23 6 2 2 1OutputYESInput5 25 3 6 5 2OutputYES", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2b7e2767", "template_md5": "35d339e4", "result": "You are given a row of $n$ people with known heights ($a_1, a_2, ..., a_n$). The rightmost person is shorter than all the others.  \n\nYou can swap the positions of two people in the row at most once. The goal is to make the row \"nice\" according to the following rule:\n\nFor each person, the distance to the nearest person with a smaller height to their right must be at most $k$.  \n\nDetermine if it is possible to make the row \"nice\" by swapping people at most once."}, {"prompt_md5": "367896bb", "template_md5": "465699a0", "result": "You are given a line of people with different heights.  You can swap the positions of two people at most once.  Determine if it is possible to arrange the people so that for each person, the distance to the next shorter person to their right is at most a given value."}]}