{"uid": "891-B", "url": "https://codeforces.com/contest/891/problem/B", "tags": ["constructive algorithms", " greedy"], "title": "891-B", "statement": "B. Gluttonytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an arrayawithndistinct integers. Construct an arraybby permutingasuch that for every non-empty subset of indicesS= {x1,x2, ...,xk}(1 ≤xi≤n,0 <k<n) the sums of elements on that positions inaandbare different, i. e.InputThe first line contains one integern(1 ≤n≤ 22) — the size of the array.The second line containsnspace-separated distinct integersa1,a2, ...,an(0 ≤ai≤ 109) — the elements of the array.OutputIf there is no such arrayb, print-1.Otherwise in the only line printnspace-separated integersb1,b2, ...,bn. Note thatbmust be a permutation ofa.If there are multiple answers, print any of them.ExamplesInput21 2Output2 1Input41000 100 10 1Output100 1 1000 10NoteAn arrayxis a permutation ofy, if we can shuffle elements ofysuch that it will coincide withx.Note that the empty subset and the subset containing all indices are not counted.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f3f3137a", "template_md5": "35d339e4", "result": "You are given an array $a$ with $n$ distinct integers.  You need to create a new array $b$ by rearranging the elements of $a$ (a permutation of $a$).  \n\nThe rule is that for any non-empty subset of indices $S = \\{x_1, x_2, ..., x_k\\}$  (where $1 \\le x_i \\le n$ and $0 < k < n$), the sum of the elements in $a$ at those indices must be different from the sum of the elements in $b$ at those same indices.\n\n* **Input:**\n    * The first line contains an integer $n$ (1 ≤ $n$ ≤ 22), the size of the array.\n    * The second line contains $n$ space-separated distinct integers $a_1, a_2, ..., a_n$ (0 ≤ $a_i$ ≤ 10⁹) - the elements of the array.\n\n* **Output:**\n    * If it's impossible to create such an array $b$, print -1.\n    * Otherwise, print $n$ space-separated integers $b_1, b_2, ..., b_n$ - a permutation of $a$ that satisfies the rule. If there are multiple solutions, print any one. \n\n\n\nLet me know if you'd like help with solving this problem!"}, {"prompt_md5": "bc01d3a3", "template_md5": "465699a0", "result": "You are given a list of distinct numbers. Rearrange the numbers into a new list so that the sum of any smaller subset of the original list is different from the sum of any other smaller subset. If this is impossible, print -1. Otherwise, print the rearranged list."}]}