{"uid": "893-D", "url": "https://codeforces.com/contest/893/problem/D", "tags": ["data structures", " dp", " greedy", " implementation"], "title": "893-D", "statement": "D. Credit Cardtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecenlty Luba got a credit card and started to use it. Let's considernconsecutive days Luba uses the card.She starts with0money on her account.In theeveningofi-th day a transactionaioccurs. Ifai> 0, thenaibourles are deposited to Luba's account. Ifai< 0, thenaibourles are withdrawn. And ifai= 0, then the amount of money on Luba's account is checked.In themorningof any ofndays Luba can go to the bank and deposit anypositiveinteger amount of burles to her account. But there is a limitation: the amount of money on the account can never exceedd.It can happen that the amount of money goes greater thandby some transaction in the evening. In this case answer will be «-1».Luba must not exceed this limit, and also she wants thatevery day her account is checked(the days whenai= 0) the amount of money on her account is non-negative. It takes a lot of time to go to the bank, so Luba wants to know the minimum number of days she needs to deposit some money to her account (if it is possible to meet all the requirements). Help her!InputThe first line contains two integersn,d(1 ≤n≤ 105,1 ≤d≤ 109) —the number of days and the money limitation.The second line containsninteger numbersa1,a2, ...an(- 104≤ai≤ 104), whereairepresents the transaction ini-th day.OutputPrint-1if Luba cannot deposit the money to her account in such a way that the requirements are met. Otherwise print the minimum number of days Luba has to deposit money.ExamplesInput5 10-1 5 0 -5 3Output0Input3 4-10 0 20Output-1Input5 10-5 0 10 -11 0Output2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fa9d0be2", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $d$, representing the number of days and a money limit, respectively. \n\nYou are also given $n$ integers, $a_1, a_2, ..., a_n$, where $a_i$ represents the transaction on the $i$-th day. If $a_i > 0$, then $a_i$ burles are deposited to the account. If $a_i < 0$, then $a_i$ burles are withdrawn. If $a_i = 0$, the amount of money in the account is checked.\n\nOn any day, you can deposit any positive integer amount of burles to the account, but the total amount in the account can never exceed $d$.\n\nThe goal is to find the minimum number of days you need to deposit money to the account to satisfy the following conditions:\n\n* The account balance never goes below zero.\n* The account balance never exceeds $d$.\n\n\n\nLet me know if you'd like me to clarify any part of the problem."}, {"prompt_md5": "86950719", "template_md5": "465699a0", "result": "You are given a sequence of numbers representing daily changes to an account balance. Some numbers are positive (deposits), some are negative (withdrawals), and some are zero (check the balance). The balance can never exceed a given limit.  Find the minimum number of days you need to make a deposit to ensure the balance is never negative on a check day, or report -1 if it's impossible."}]}