{"uid": "893-A", "url": "https://codeforces.com/contest/893/problem/A", "tags": ["implementation"], "title": "893-A", "statement": "A. Chess For Threetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlex, Bob and Carl will soon participate in a team chess tournament. Since they are all in the same team, they have decided to practise really hard before the tournament. But it's a bit difficult for them because chess is a game for two players, not three.So they play with each other according to following rules:Alex and Bob play the first game, and Carl is spectating;When the game ends, the one who lost the game becomes the spectator in the next game, and the one who was spectating plays against the winner.Alex, Bob and Carl play in such a way that there are no draws.Today they have playedngames, and for each of these games they remember who was the winner. They decided to make up a log of games describing who won each game. But now they doubt if the information in the log is correct, and they want to know if the situation described in the log they made up was possible (that is, no game is won by someone who is spectating if Alex, Bob and Carl play according to the rules). Help them to check it!InputThe first line contains one integern(1 ≤n≤ 100) — the number of games Alex, Bob and Carl played.Thennlines follow, describing the game log.i-th line contains one integerai(1 ≤ai≤ 3) which is equal to1if Alex woni-th game, to2if Bob woni-th game and3if Carl woni-th game.OutputPrintYESif the situation described in the log was possible. Otherwise printNO.ExamplesInput3112OutputYESInput212OutputNONoteIn the first example the possible situation is:Alex wins, Carl starts playing instead of Bob;Alex wins, Bob replaces Carl;Bob wins.The situation in the second example is impossible because Bob loses the first game, so he cannot win the second one.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3c3dbc4c", "template_md5": "35d339e4", "result": "Given a sequence of $n$ integers ($1 \\le n \\le 100$) where each integer represents the winner of a game (1, 2, or 3), determine if it's possible for these games to have occurred under the following rules:\n\n* Three players participate in a round-robin tournament.\n* Only two players play each game.\n* The loser of a game becomes the spectator in the next game, and the spectator plays against the winner.\n* There are no draws. \n\nIf it's possible, output \"YES\". Otherwise, output \"NO\"."}, {"prompt_md5": "ac2a3f14", "template_md5": "465699a0", "result": "Three people play a game in a cycle.  Each game has one winner.  Given a record of the winners of multiple games, determine if the record is possible under the rules."}]}