{"uid": "893-C", "url": "https://codeforces.com/contest/893/problem/C", "tags": ["dfs and similar", " graphs", " greedy"], "title": "893-C", "statement": "C. Rumortime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVova promised himself that he would never play computer games... But recently Firestorm — a well-known game developing company — published their newest game, World of Farcraft, and it became really popular. Of course, Vova started playing it.Now he tries to solve a quest. The task is to come to a settlement named Overcity and spread a rumor in it.Vova knows that there arencharacters in Overcity. Some characters are friends to each other, and they share information they got. Also Vova knows that he can bribe each character so he or she starts spreading the rumor;i-th character wantscigold in exchange for spreading the rumor. When a character hears the rumor, he tells it to all his friends, and they start spreading the rumor to their friends (for free), and so on.The quest is finished when allncharacters know the rumor. What is the minimum amount of gold Vova needs to spend in order to finish the quest?Take a look at the notes if you think you haven't understood the problem completely.InputThe first line contains two integer numbersnandm(1 ≤n≤ 105, 0 ≤m≤ 105) — the number of characters in Overcity and the number of pairs of friends.The second line containsninteger numbersci(0 ≤ci≤ 109) — the amount of goldi-th character asks to start spreading the rumor.Thenmlines follow, each containing a pair of numbers (xi,yi) which represent that charactersxiandyiare friends (1 ≤xi,yi≤n,xi≠yi). It is guaranteed that each pair is listed at most once.OutputPrint one number — the minimum amount of gold Vova has to spend in order to finish the quest.ExamplesInput5 22 5 3 4 81 44 5Output10Input10 01 2 3 4 5 6 7 8 9 10Output55Input10 51 6 2 7 3 8 4 9 5 101 23 45 67 89 10Output15NoteIn the first example the best decision is to bribe the first character (he will spread the rumor to fourth character, and the fourth one will spread it to fifth). Also Vova has to bribe the second and the third characters, so they know the rumor.In the second example Vova has to bribe everyone.In the third example the optimal decision is to bribe the first, the third, the fifth, the seventh and the ninth characters.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "88862aed", "template_md5": "35d339e4", "result": "There are $n$ people in a city. Some people are friends with each other. You want to spread a rumor to everyone in the city.  You can bribe each person to start spreading the rumor. The $i$-th person wants $c_i$ gold to start spreading the rumor. Once a person hears the rumor, they will tell all their friends.\n\nWhat is the minimum amount of gold you need to spend to make sure everyone in the city knows the rumor?\n\nInput:\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n \\le 10^5$, $0 \\le m \\le 10^5$), representing the number of people and the number of friendships.\n* The second line contains $n$ integers, $c_1, c_2, ..., c_n$ ($0 \\le c_i \\le 10^9$), representing the bribe amount for each person.\n* The next $m$ lines each contain two integers, $x_i$ and $y_i$ ($1 \\le x_i, y_i \\le n$, $x_i \\neq y_i$), representing a friendship between person $x_i$ and person $y_i$.\n\nOutput:\n\n* Print a single integer, the minimum amount of gold needed to spread the rumor."}, {"prompt_md5": "5b5438ae", "template_md5": "465699a0", "result": "You have a group of people. Some people are friends. You can pay each person a certain amount of money to tell a secret. Once someone knows the secret, they tell all their friends for free. What is the least amount of money you need to spend so that everyone knows the secret?"}]}