{"uid": "893-E", "url": "https://codeforces.com/contest/893/problem/E", "tags": ["combinatorics", " dp", " math", " number theory"], "title": "893-E", "statement": "E. Counting Arraystime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two positive integer numbersxandy. An arrayFis called any-factorizationofxiff the following conditions are met:There areyelements inF, and all of them are integer numbers;.You have to count the number of pairwise distinct arrays that arey-factorizations ofx. Two arraysAandBare considered different iff there exists at least one indexi(1 ≤i≤y) such thatAi≠Bi. Since the answer can be very large, print it modulo109+ 7.InputThe first line contains one integerq(1 ≤q≤ 105) — the number of testcases to solve.Thenqlines follow, each containing two integersxiandyi(1 ≤xi,yi≤ 106). Each of these lines represents a testcase.OutputPrintqintegers.i-th integer has to be equal to the number ofyi-factorizations ofximodulo109+ 7.ExampleInput26 34 2Output366NoteIn the second testcase of the example there are sixy-factorizations:{ - 4,  - 1};{ - 2,  - 2};{ - 1,  - 4};{1, 4};{2, 2};{4, 1}.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ba789ebc", "template_md5": "35d339e4", "result": "You are given two positive integers $x$ and $y$.  Find the number of ways to write $x$ as a product of $y$ integers.  Two ways are considered different if there is at least one integer that is different in the two ways.  The answer may be very large, so print it modulo $10^9 + 7$. \n\nFor example, if $x = 12$ and $y = 2$, the possible factorizations are:\n\n* $(1, 12)$\n* $(2, 6)$\n* $(3, 4)$\n* $(12, 1)$\n* $(6, 2)$\n* $(4, 3)$\n\n\n\nThere are 6 ways to write 12 as a product of 2 integers."}, {"prompt_md5": "9144d903", "template_md5": "465699a0", "result": "You are given a number x and a number y.  Find how many ways you can split x into y different factors, where the order of the factors doesn't matter.  The answer can be very large, so give the result after dividing by 10^9 + 7."}]}