{"uid": "894-B", "url": "https://codeforces.com/contest/894/problem/B", "tags": ["combinatorics", " constructive algorithms", " math", " number theory"], "title": "894-B", "statement": "B. Ralph And His Magic Fieldtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRalph has a magic field which is divided inton×mblocks. That is to say, there arenrows andmcolumns on the field. Ralph can put an integer in each block. However, the magic field doesn't always work properly. It works only if the product of integers in each row and each column equals tok, wherekis either1or-1.Now Ralph wants you to figure out the number of ways to put numbers in each block in such a way that the magic field works properly. Two ways are considered different if and only if there exists at least one block where the numbers in the first way and in the second way are different. You are asked to output the answer modulo1000000007 = 109+ 7.Note that there is no range of the numbers to put in the blocks, but we can prove that the answer is not infinity.InputThe only line contains three integersn,mandk(1 ≤n,m≤ 1018,kis either1or-1).OutputPrint a single number denoting the answer modulo1000000007.ExamplesInput1 1 -1Output1Input1 3 1Output1Input3 3 -1Output16NoteIn the first example the only way is to put-1into the only block.In the second example the only way is to put1into every block.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "650bdf1c", "template_md5": "35d339e4", "result": "You are given a grid of $n$ rows and $m$ columns.  You need to fill each cell of the grid with either 1 or -1.  The grid satisfies a \"magic\" property if the product of the numbers in each row and each column is equal to $k$, where $k$ is either 1 or -1.\n\nFind the number of ways to fill the grid so that the magic property is satisfied. Two ways are considered different if there is at least one cell where the numbers are different.  The answer should be given modulo $10^9 + 7$."}, {"prompt_md5": "cba9f143", "template_md5": "465699a0", "result": "You are given a grid of squares.  Each square can have a number in it.  The grid works correctly if the product of the numbers in each row and each column is either 1 or -1.  Find the number of ways to fill the grid so that it works correctly."}]}