{"uid": "895-A", "url": "https://codeforces.com/contest/895/problem/A", "tags": ["brute force", " implementation"], "title": "895-A", "statement": "A. Pizza Separationtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputStudents Vasya and Petya are studying at the BSU (Byteland State University). At one of the breaks they decided to order a pizza. In this problem pizza is a circle of some radius. The pizza was delivered already cut intonpieces. Thei-th piece is a sector of angle equal toai. Vasya and Petya want to divide all pieces of pizza into twocontinuoussectors in such way that the difference between angles of these sectors is minimal. Sector angle is sum of angles of all pieces in it. Pay attention, that one of sectors can be empty.InputThe first line contains one integern(1 ≤n≤ 360)  — the number of pieces into which the delivered pizza was cut.The second line containsnintegersai(1 ≤ai≤ 360)  — the angles of the sectors into which the pizza was cut. The sum of allaiis 360.OutputPrint one integer  — the minimal difference between angles of sectors that will go to Vasya and Petya.ExamplesInput490 90 90 90Output0Input3100 100 160Output40Input1360Output360Input4170 30 150 10Output0NoteIn first sample Vasya can take1and2pieces, Petya can take3and4pieces. Then the answer is|(90 + 90) - (90 + 90)| = 0.In third sample there is only one piece of pizza that can be taken by only one from Vasya and Petya. So the answer is|360 - 0| = 360.In fourth sample Vasya can take1and4pieces, then Petya will take2and3pieces. So the answer is|(170 + 10) - (30 + 150)| = 0.Picture explaning fourth sample:Both red and green sectors consist of two adjacent pieces of pizza. So Vasya can take green sector, then Petya will take red sector.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2c54d0f9", "template_md5": "35d339e4", "result": "A pizza is cut into $n$ pieces, where each piece is a sector of a circle. The $i$-th piece has an angle of $a_i$ degrees.  \n\nFind the smallest difference in degrees between the angles of the two sets of pieces that can be formed by dividing the pizza.  \n\n**Input:**\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 360) representing the number of pizza pieces.\n* The second line contains $n$ integers $a_i$ (1 ≤ $a_i$ ≤ 360) representing the angles of each pizza piece. The sum of all $a_i$ is 360.\n\n**Output:**\n\n* Print a single integer representing the minimum difference in degrees between the angles of the two sets of pizza pieces."}, {"prompt_md5": "82ca7f49", "template_md5": "465699a0", "result": "You are given a circle divided into several slices. Each slice has a certain size.  Find the smallest difference in size between the two groups of slices you can make."}]}