{"uid": "895-D", "url": "https://codeforces.com/contest/895/problem/D", "tags": ["combinatorics", " math", " strings"], "title": "895-D", "statement": "D. String Marktime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAt the Byteland State University marks are strings of the same length. Markxis considered better thanyif stringyis lexicographically smaller thanx.Recently at the BSU was an important test work on which Vasya recived the marka. It is very hard for the teacher to remember the exact mark of every student, but he knows the markb, such that every student recieved mark strictly smaller thanb.Vasya isn't satisfied with his mark so he decided to improve it. He can swap characters in the string corresponding to his mark as many times as he like. Now he want to know only the number of different ways to improve his mark so that his teacher didn't notice something suspicious.More formally: you are given two stringsa,bof the same length and you need to figure out the number of different stringscsuch that:1)ccan be obtained fromaby swapping some characters, in other wordscis a permutation ofa.2) Stringais lexicographically smaller thanc.3) Stringcis lexicographically smaller thanb.For two stringsxandyof the same length it is true thatxis lexicographically smaller thanyif there exists suchi, thatx1=y1,x2=y2, ...,xi- 1=yi- 1,xi<yi.Since the answer can be very large, you need to find answer modulo109+ 7.InputFirst line contains stringa, second line contains stringb. Stringsa,bconsist of lowercase English letters. Their lengths are equal and don't exceed106.It is guaranteed thatais lexicographically smaller thanb.OutputPrint one integer  — the number of different strings satisfying the condition of the problem modulo109+ 7.ExamplesInputabcdddOutput5InputabcdefabcdegOutput0InputabacabaubudubaOutput64NoteIn first sample from stringabccan be obtained stringsacb,bac,bca,cab,cba, all of them are larger thanabc, but smaller thanddd. So the answer is5.In second sample any string obtained fromabcdefis larger thanabcdeg. So the answer is0.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ef0f937b", "template_md5": "35d339e4", "result": "You are given two strings, $a$ and $b$, of the same length.  String $a$ is lexicographically smaller than string $b$.  \n\nYou need to find the number of different strings $c$ that meet the following conditions:\n\n1. $c$ can be obtained by swapping characters in string $a$ (i.e., $c$ is a permutation of $a$).\n2. String $a$ is lexicographically smaller than string $c$.\n3. String $c$ is lexicographically smaller than string $b$.\n\nSince the answer can be very large, find the answer modulo $10^9 + 7$. \n\n\n\nLet me know if you'd like help with the solution as well!"}, {"prompt_md5": "0683b5a0", "template_md5": "465699a0", "result": "You are given two strings of the same length.  Find the number of ways to rearrange the first string to create a new string that is:\n\n1.  Different from the original string.\n2.  Larger than the original string.\n3.  Smaller than the second string. \n\n\n\nThe answer should be the number of possible strings that meet all three conditions."}]}