{"uid": "898-F", "url": "https://codeforces.com/contest/898/problem/F", "tags": ["brute force", " hashing", " math"], "title": "898-F", "statement": "F. Restoring the Expressiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputA correct expression of the forma+b=cwas written;a,bandcare non-negative integers without leading zeros. In this expression, the plus and equally signs were lost. The task is to restore the expression. In other words, one character '+' and one character '=' should be inserted into given sequence of digits so that:character'+' is placed on the left of character '=',characters '+' and '=' split the sequence into three non-empty subsequences consisting of digits (let's call the left parta, the middle part —band the right part —c),all the three partsa,bandcdo not contain leading zeros,it is true thata+b=c.It is guaranteed that in given tests answer always exists.InputThe first line contains a non-empty string consisting of digits. The length of the string does not exceed106.OutputOutput the restored expression. If there are several solutions, you can print any of them.Note that the answerat firstshould contain two terms (divided with symbol '+'), and then the result of their addition, before which symbol'=' should be.Do not separate numbers and operation signs with spaces. Strictly follow the output format given in the examples.If you remove symbol '+' and symbol '=' from answer string you should get a string,same asstring from the input data.ExamplesInput12345168Output123+45=168Input099Output0+9=9Input199100Output1+99=100Input123123123456456456579579579Output123123123+456456456=579579579", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4834954f", "template_md5": "35d339e4", "result": "You are given a string of digits.  Your task is to insert a \"+\" and an \"=\" into the string to create a valid mathematical expression of the form $a + b = c$ where:\n\n*  $a$, $b$, and $c$ are non-negative integers without leading zeros.\n* The \"+\" is placed to the left of the \"=\".\n* The \"+\" and \"=\" divide the string into three non-empty subsequences. \n\nIt is guaranteed that a solution exists. \n\nOutput the restored expression in the format  $a + b = c$."}, {"prompt_md5": "85c2efdf", "template_md5": "465699a0", "result": "You are given a string of digits.  Your task is to insert a \"+\" and an \"=\" into the string to create a valid mathematical expression where the sum of the two numbers on the left side of the \"=\" equals the number on the right side."}]}