{"uid": "898-E", "url": "https://codeforces.com/contest/898/problem/E", "tags": ["constructive algorithms", " greedy"], "title": "898-E", "statement": "E. Squares and not squarestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAnn and Borya havenpiles with candies andnis even number. There areaicandies in pile with numberi.Ann likes numbers which are square of some integer and Borya doesn't like numbers which are square of any integer. During one move guys can select some pile with candies and add one candy to it (this candy is new and doesn't belong to any other pile) or remove one candy (if there is at least one candy in this pile).Find out minimal number of moves that is required to make exactlyn/ 2piles contain number of candies that is a square of some integer and exactlyn/ 2piles contain number of candies that is not a square of any integer.InputFirst line contains oneevenintegern(2 ≤n≤ 200 000) — number of piles with candies.Second line contains sequence of integersa1,a2, ...,an(0 ≤ai≤ 109) — amounts of candies in each pile.OutputOutput minimal number of steps required to make exactlyn/ 2piles contain number of candies that is a square of some integer and exactlyn/ 2piles contain number of candies that is not a square of any integer. If condition is already satisfied output0.ExamplesInput412 14 30 4Output2Input60 0 0 0 0 0Output6Input6120 110 23 34 25 45Output3Input10121 56 78 81 45 100 1 0 54 78Output0NoteIn first example you can satisfy condition in two moves. During each move you should add one candy to second pile. After it size of second pile becomes16. After that Borya and Ann will have two piles with number of candies which is a square of integer (second and fourth pile) and two piles with number of candies which is not a square of any integer (first and third pile).In second example you should add two candies to any three piles.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d7b8102f", "template_md5": "35d339e4", "result": "There are $n$ piles of candies, where $n$ is an even number. Each pile has a certain number of candies.  \n\nYou can perform the following operation on a pile:\n\n* Add one candy to the pile.\n* Remove one candy from the pile (if there is at least one candy in the pile).\n\nThe goal is to find the minimum number of operations needed to have exactly $n/2$ piles with a number of candies that is a perfect square, and exactly $n/2$ piles with a number of candies that is not a perfect square. \n\nIf this condition is already satisfied, output 0."}, {"prompt_md5": "db05ebc2", "template_md5": "465699a0", "result": "You have a number of piles, each with a number of items.  You can add or remove one item from any pile at a time.  The goal is to find the fewest moves needed to have half the piles with a number of items that is a perfect square, and half the piles with a number of items that is not a perfect square."}]}