{"uid": "9-E", "url": "https://codeforces.com/contest/9/problem/E", "tags": ["dfs and similar", " dsu", " graphs"], "title": "9-E", "statement": "E. Interesting Graph and Applestime limit per test1 secondmemory limit per test64 megabytesinputstdinoutputstdoutHexadecimal likes drawing. She has drawn many graphs already, both directed and not. Recently she has started to work on a still-life «interesting graph and apples». An undirected graph is called interesting, if each of its vertices belongs to one cycle only — a funny ring — and does not belong to any other cycles. A funny ring is a cycle that goes through all the vertices just once. Moreover, loops are funny rings too.She has already drawn the apples and some of the graph edges. But now it is not clear, how to connect the rest of the vertices to get an interesting graph as a result. The answer should contain the minimal amount of added edges. And furthermore, the answer should be the lexicographically smallest one. The set of edges(x1,y1), (x2,y2), ..., (xn,yn), wherexi≤yi, is lexicographically smaller than the set(u1,v1), (u2,v2), ..., (un,vn), whereui≤vi, provided that the sequence of integersx1,y1,x2,y2, ...,xn,ynis lexicographically smaller than the sequenceu1,v1,u2,v2, ...,un,vn. If you do not cope, Hexadecimal will eat you. ...eat you alive.InputThe first line of the input data contains a pair of integersnandm(1 ≤n≤ 50,0 ≤m≤ 2500) — the amount of vertices and edges respectively. The following lines contain pairs of numbersxiandyi(1 ≤xi,yi≤n) — the vertices that are already connected by edges. The initial graph may contain multiple edges and loops.OutputIn the first line output «YES» or «NO»: if it is possible or not to construct an interesting graph. If the answer is «YES», in the second line outputk— the amount of edges that should be added to the initial graph. Finally, outputklines: pairs of verticesxjandyj, between which edges should be drawn. The result may contain multiple edges and loops.kcan be equal to zero.ExamplesInput3 21 22 3OutputYES11 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cf913a1b", "template_md5": "35d339e4", "result": "You are given an undirected graph with $n$ vertices and $m$ edges.  \n\nA graph is considered \"interesting\" if each vertex belongs to exactly one cycle (a closed path that visits each vertex exactly once).  Loops (edges connecting a vertex to itself) are also considered cycles.\n\nYour task is to determine if it's possible to add the minimum number of edges to the given graph to make it interesting. If possible, output \"YES\" and:\n\n1. The number of edges ($k$) that need to be added.\n2. A list of $k$ edges, where each edge is a pair of vertices, that should be added to the graph.\n\nIf it's not possible to make the graph interesting, output \"NO\".\n\nThe added edges should be chosen lexicographically smallest.  Lexicographically smallest means that if we list the vertices of the added edges in increasing order, the list should be as small as possible alphabetically."}, {"prompt_md5": "643b55a1", "template_md5": "465699a0", "result": "You are given a graph with some edges.  Determine if you can add edges to the graph to create a graph where each node is part of exactly one cycle (a closed loop). If possible, output the minimum number of edges needed and the specific edges to add."}]}