{"uid": "90-B", "url": "https://codeforces.com/contest/90/problem/B", "tags": ["implementation", " strings"], "title": "90-B", "statement": "B. African Crosswordtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutAn African crossword is a rectangular tablen×min size. Each cell of the table contains exactly one letter. This table (it is also referred to as grid) contains some encrypted word that needs to be decoded.To solve the crossword you should cross out all repeated letters in rows and columns. In other words, a letter should only be crossed out if and only if the corresponding column or row contains at least one more letter that is exactly the same. Besides, all such letters are crossed out simultaneously.When all repeated letters have been crossed out, we should write the remaining letters in a string. The letters that occupy a higher position follow before the letters that occupy a lower position. If the letters are located in one row, then the letter to the left goes first. The resulting word is the answer to the problem.You are suggested to solve an African crossword and print the word encrypted there.InputThe first line contains two integersnandm(1 ≤n,m≤ 100). Nextnlines containmlowercase Latin letters each. That is the crossword grid.OutputPrint the encrypted word on a single line. It is guaranteed that the answer consists of at least one letter.ExamplesInput3 3cbabcdcbcOutputabcdInput5 5fcofdooedoafaoardcdfeofsfOutputcodeforces", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "912747fe", "template_md5": "35d339e4", "result": "You are given a rectangular grid of letters.  The grid has $n$ rows and $m$ columns ($1 \\le n, m \\le 100$).  \n\nThe goal is to find a word hidden in the grid. To do this:\n\n1. **Cross out** any letter that appears more than once in its row or column. \n2. **Read** the remaining letters, starting from the top left corner and moving right, then down.\n\nPrint the resulting word."}, {"prompt_md5": "b28b8ee0", "template_md5": "465699a0", "result": "You are given a grid of letters.  Find the unique letters in each row and column, and arrange them in order from top to bottom, left to right.  Print the resulting string."}]}