{"uid": "901-B", "url": "https://codeforces.com/contest/901/problem/B", "tags": ["constructive algorithms", " math"], "title": "901-B", "statement": "B. GCD of Polynomialstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSuppose you have two polynomialsand. Then polynomialcan be uniquely represented in the following way:This can be done usinglong division. Here,denotes the degree of polynomialP(x).is called the remainder of division of polynomialby polynomial, it is also denoted as.Since there is a way to divide polynomials with remainder, we can define Euclid's algorithm of finding the greatest common divisor of two polynomials. The algorithm takes two polynomials. If the polynomialis zero, the result is, otherwise the result is the value the algorithm returns for pair. On each step the degree of the second argument decreases, so the algorithm works in finite number of steps. But how large that number could be? You are to answer this question.You are given an integern. You have to build two polynomials with degrees not greater thann, such that their coefficients are integers not exceeding1by their absolute value, the leading coefficients (ones with the greatest power ofx) are equal to one, and the described Euclid's algorithm performs exactlynsteps finding their greatest common divisor. Moreover, the degree of the first polynomial should be greater than the degree of the second. By a step of the algorithm we mean the transition from pairto pair.InputYou are given a single integern(1 ≤n≤ 150) — the number of steps of the algorithm you need to reach.OutputPrint two polynomials in the following format.In the first line print a single integerm(0 ≤m≤n) — the degree of the polynomial.In the second line printm+ 1integers between- 1and1— the coefficients of the polynomial, from constant to leading.The degree of the first polynomial should be greater than the degree of the second polynomial, the leading coefficients should be equal to1. Euclid's algorithm should perform exactlynsteps when called using these polynomials.If there is no answer for the givenn, print-1.If there are multiple answer, print any of them.ExamplesInput1Output10 101Input2Output2-1 0 110 1NoteIn the second example you can print polynomialsx2- 1andx. The sequence of transitions is(x2- 1,x) → (x,  - 1) → ( - 1, 0).There are two steps in it.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "638f7fbb", "template_md5": "35d339e4", "result": "You are given an integer $n$.  Find two polynomials, $P(x)$ and $Q(x)$, that meet the following conditions:\n\n* The degree of $P(x)$ is greater than the degree of $Q(x)$.\n* The leading coefficients of both polynomials are 1.\n* The absolute value of all coefficients in both polynomials is less than or equal to 1.\n* When you apply Euclid's algorithm for finding the greatest common divisor (GCD) of $P(x)$ and $Q(x)$, the algorithm takes exactly $n$ steps.\n\nOutput the polynomials in the format:\n\n* The degree of the first polynomial.\n* The coefficients of the first polynomial, from the constant term to the leading term.\n\nIf no such polynomials exist, output -1. If multiple solutions exist, output any one."}, {"prompt_md5": "76f907e9", "template_md5": "465699a0", "result": "You are given a number *n*.  Find two polynomials with integer coefficients (between -1 and 1) where the first polynomial has a higher degree than the second. The leading coefficient of both polynomials should be 1.  The Euclidean algorithm, when applied to these two polynomials, should take exactly *n* steps to find their greatest common divisor. \n\nIf no such polynomials exist, output -1. If multiple solutions exist, output any one."}]}