{"uid": "902-B", "url": "https://codeforces.com/contest/902/problem/B", "tags": ["dfs and similar", " dsu", " greedy"], "title": "902-B", "statement": "B. Coloring a Treetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a rooted tree withnvertices. The vertices are numbered from1ton, the root is the vertex number1.Each vertex has a color, let's denote the color of vertexvbycv. Initiallycv= 0.You have to color the tree into the given colors using the smallest possible number of steps. On each step you can choose a vertexvand a colorx, and then color all vectices in the subtree ofv(includingvitself) in colorx. In other words, for every vertexu, such that the path from root toupasses throughv, setcu=x.It is guaranteed that you have to color each vertex in a color different from0.You can learn what a rooted tree is using the link:https://en.wikipedia.org/wiki/Tree_(graph_theory).InputThe first line contains a single integern(2 ≤n≤ 104) — the number of vertices in the tree.The second line containsn- 1integersp2,p3, ...,pn(1 ≤pi<i), wherepimeans that there is an edge between verticesiandpi.The third line containsnintegersc1,c2, ...,cn(1 ≤ci≤n), whereciis the color you should color thei-th vertex into.It is guaranteed that the given graph is a tree.OutputPrint a single integer — the minimum number of steps you have to perform to color the tree into given colors.ExamplesInput61 2 2 1 52 1 1 1 1 1Output3Input71 1 2 3 1 43 3 1 1 1 2 3Output5NoteThe tree from the first sample is shown on the picture (numbers are vetices' indices):On first step we color all vertices in the subtree of vertex1into color2(numbers are colors):On seond step we color all vertices in the subtree of vertex5into color1:On third step we color all vertices in the subtree of vertex2into color1:The tree from the second sample is shown on the picture (numbers are vetices' indices):On first step we color all vertices in the subtree of vertex1into color3(numbers are colors):On second step we color all vertices in the subtree of vertex3into color1:On third step we color all vertices in the subtree of vertex6into color2:On fourth step we color all vertices in the subtree of vertex4into color1:On fith step we color all vertices in the subtree of vertex7into color3:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7b157d8c", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices, numbered from 1 to $n$. The root of the tree is vertex 1. Each vertex has a target color, denoted by $c_i$, where $c_i$ is the color you want to color the $i$-th vertex. Initially, all vertices are uncolored (color 0).\n\nYou can color the tree in the following way:\n\n* Choose a vertex $v$ and a color $x$.\n* Color all vertices in the subtree of $v$ (including $v$ itself) with color $x$.\n\nFind the minimum number of steps required to color the entire tree according to the given target colors. \n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 10⁴), the number of vertices.\n* The second line contains $n-1$ integers $p_2$, $p_3$, ..., $p_n$ (1 ≤ $p_i$ < $i$), representing the edges of the tree. $p_i$ means there is an edge between vertices $i$ and $p_i$.\n* The third line contains $n$ integers $c_1$, $c_2$, ..., $c_n$ (1 ≤ $c_i$ ≤ $n$), representing the target colors for each vertex.\n\n**Output:**\n\n* Print a single integer, the minimum number of steps required to color the tree."}, {"prompt_md5": "b8021282", "template_md5": "465699a0", "result": "You have a tree-shaped structure with numbered nodes. Each node has a target color. You can color an entire subtree (including the node itself) with a single color in one step. Find the fewest steps needed to color all nodes with their target colors."}]}