{"uid": "903-B", "url": "https://codeforces.com/contest/903/problem/B", "tags": ["greedy", " implementation"], "title": "903-B", "statement": "B. The Modcrabtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputVova is again playing some computer game, now an RPG. In the game Vova's character received a quest: to slay the fearsome monster called Modcrab.After two hours of playing the game Vova has tracked the monster and analyzed its tactics. The Modcrab hash2health points and an attack power ofa2. Knowing that, Vova has decided to buy a lot of strong healing potions and to prepare for battle.Vova's character hash1health points and an attack power ofa1. Also he has a large supply of healing potions, each of which increases his current amount of health points byc1when Vova drinks a potion. All potions are identical to each other. It is guaranteed thatc1>a2.The battle consists of multiple phases. In the beginning of each phase, Vova can either attack the monster (thus reducing its health bya1) or drink a healing potion (it increases Vova's health byc1;Vova's health can exceedh1). Then,if the battle is not over yet, the Modcrab attacks Vova, reducing his health bya2. The battle ends when Vova's (or Modcrab's) health drops to0or lower. It is possible that the battle ends in a middle of a phase after Vova's attack.Of course, Vova wants to win the fight. But also he wants to do it as fast as possible. So he wants to make up a strategy that will allow him to win the fight after the minimum possible number of phases.Help Vova to make up a strategy! You may assume that Vova never runs out of healing potions, and that he can always win.InputThe first line contains three integersh1,a1,c1(1 ≤h1,a1≤ 100,2 ≤c1≤ 100) — Vova's health, Vova's attack power and the healing power of a potion.The second line contains two integersh2,a2(1 ≤h2≤ 100,1 ≤a2<c1) — the Modcrab's health and his attack power.OutputIn the first line print one integerndenoting the minimum number of phases required to win the battle.Then printnlines.i-th line must be equal toHEALif Vova drinks a potion ini-th phase, orSTRIKEif he attacks the Modcrab.The strategy must be valid: Vova's character must not be defeated before slaying the Modcrab, and the monster's health must be0or lower after Vova's last action.If there are multiple optimal solutions, print any of them.ExamplesInput10 6 10017 5Output4STRIKEHEALSTRIKESTRIKEInput11 6 10012 5Output2STRIKESTRIKENoteIn the first example Vova's character must heal before or after his first attack. Otherwise his health will drop to zero in2phases while he needs3strikes to win.In the second example no healing needed, two strikes are enough to get monster to zero health and win with6health left.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c44d17a7", "template_md5": "35d339e4", "result": "You are given two integers, $h_1$ and $a_1$, representing the starting health and attack power of a player. You are also given an integer $c_1$, representing the amount of health restored by a healing potion.\n\nYou are also given two integers, $h_2$ and $a_2$, representing the starting health and attack power of an enemy.\n\nThe player and the enemy take turns attacking each other. In each turn, the player can either attack the enemy, reducing its health by $a_1$, or drink a healing potion, increasing their health by $c_1$. The enemy always attacks the player, reducing their health by $a_2$.\n\nThe game ends when either the player or the enemy's health reaches 0 or lower.\n\nYour task is to determine the minimum number of turns required for the player to defeat the enemy, and output a sequence of actions (either \"HEAL\" or \"STRIKE\") that the player should take in each turn to achieve this. \n\nYou can assume that the player has an unlimited supply of healing potions and will always win if they follow your strategy."}, {"prompt_md5": "ce82d042", "template_md5": "465699a0", "result": "You have a certain amount of health and attack power. You fight an enemy with a certain amount of health and attack power. You can either attack the enemy or heal yourself each turn. Healing restores a fixed amount of health. The enemy attacks you each turn, reducing your health.  \n\nYour goal is to find the fastest way to defeat the enemy."}]}