{"uid": "906-B", "url": "https://codeforces.com/contest/906/problem/B", "tags": ["brute force", " constructive algorithms", " math"], "title": "906-B", "statement": "B. Seating of Studentstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputStudents went into a class to write a test and sat in some way. The teacher thought: \"Probably they sat in this order to copy works of each other. I need to rearrange them in such a way that students that were neighbors are not neighbors in a new seating.\"The class can be represented as a matrix withnrows andmcolumns with a student in each cell. Two students are neighbors if cells in which they sit have a common side.Let's enumerate students from1ton·min order of rows. So a student who initially sits in the cell in rowiand columnjhas a number(i- 1)·m+j. You have to find a matrix withnrows andmcolumns in which all numbers from1ton·mappear exactly once and adjacent numbers in the original matrix are not adjacent in it, or determine that there is no such matrix.InputThe only line contains two integersnandm(1 ≤n,m≤ 105;n·m≤ 105) — the number of rows and the number of columns in the required matrix.OutputIf there is no such matrix, output \"NO\" (without quotes).Otherwise in the first line output \"YES\" (without quotes), and in the nextnlines outputmintegers which form the required matrix.ExamplesInput2 4OutputYES5 4 7 23 6 1 8Input2 1OutputNONoteIn the first test case the matrix initially looks like this:1 2 3 45 6 7 8It's easy to see that there are no two students that are adjacent in both matrices.In the second test case there are only two possible seatings and in both of them students with numbers 1 and 2 are neighbors.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "948c0b8d", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $m$ (where $1 \\le n, m \\le 10^5$ and $n \\cdot m \\le 10^5$).  You need to determine if it is possible to arrange $n \\cdot m$ students in an $n \\times m$ matrix such that:\n\n* Each student is assigned a unique number from 1 to $n \\cdot m$.\n* No two students who were originally sitting next to each other in the original matrix are sitting next to each other in the new matrix.\n\nIf such a matrix can be created, output \"YES\" followed by the arrangement of the students in the new matrix. Otherwise, output \"NO\"."}, {"prompt_md5": "a81314db", "template_md5": "465699a0", "result": "You are given a grid of numbers.  Rearrange the numbers into a new grid so that no two numbers that were next to each other in the original grid are next to each other in the new grid.  If this is impossible, say so."}]}