{"uid": "908-D", "url": "https://codeforces.com/contest/908/problem/D", "tags": ["dp", " math", " probabilities"], "title": "908-D", "statement": "D. New Year and Arbitrary Arrangementtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given three integersk,paandpb.You will construct a sequence with the following algorithm: Initially, start with the empty sequence. Each second, you do the following. With probabilitypa/ (pa+pb), add 'a' to the end of the sequence. Otherwise (with probabilitypb/ (pa+pb)), add 'b' to the end of the sequence.You stop once there are at leastksubsequences that form 'ab'. Determine the expected number of times 'ab' is a subsequence in the resulting sequence. It can be shown that this can be represented byP/Q, wherePandQare coprime integers, and. Print the value of.InputThe first line will contain three integers integerk,pa,pb(1 ≤k≤ 1 000,1 ≤pa,pb≤ 1 000 000).OutputPrint a single integer, the answer to the problem.ExamplesInput1 1 1Output2Input3 1 4Output370000006NoteThe first sample, we will keep appending to our sequence until we get the subsequence 'ab' at least once. For instance, we get the sequence 'ab' with probability 1/4, 'bbab' with probability 1/16, and 'aab' with probability 1/8. Note, it's impossible for us to end with a sequence like 'aabab', since we would have stopped our algorithm once we had the prefix 'aab'.The expected amount of times that 'ab' will occur across all valid sequences is 2.For the second sample, the answer is equal to.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c9cf1437", "template_md5": "35d339e4", "result": "You are given three integers $k$, $p_a$, and $p_b$.\n\nYou will create a sequence of characters ('a' and 'b') using the following rules:\n\n1. Start with an empty sequence.\n2. In each step, choose to add either 'a' or 'b' to the end of the sequence.\n   - The probability of adding 'a' is $p_a / (p_a + p_b)$.\n   - The probability of adding 'b' is $p_b / (p_a + p_b)$.\n3. Continue adding characters until there are at least $k$ subsequences that form 'ab'.\n\nCalculate the expected number of times the subsequence 'ab' appears in the resulting sequence.  The answer can be expressed as a fraction $P/Q$, where $P$ and $Q$ are coprime integers. Print the value of $P$."}, {"prompt_md5": "7ab6267e", "template_md5": "465699a0", "result": "You have a process that adds either 'a' or 'b' to a sequence, with probabilities pa and pb respectively. You stop when there are at least k sequences containing 'ab'.  What is the average number of times 'ab' appears in all possible resulting sequences?"}]}