{"uid": "909-D", "url": "https://codeforces.com/contest/909/problem/D", "tags": ["data structures", " greedy", " implementation"], "title": "909-D", "statement": "D. Colorful Pointstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a set of points on a straight line. Each point has a color assigned to it. For pointa, its neighbors are the points which don't have any other points between them anda. Each point has at most two neighbors - one from the left and one from the right.You perform a sequence of operations on this set of points. In one operation, you delete all points which have a neighbor point of a different color than the point itself. Points are deleted simultaneously, i.e. first you decide which points have to be deleted and then delete them. After that you can perform the next operation etc. If an operation would not delete any points, you can't perform it.How many operations will you need to perform until the next operation does not have any points to delete?InputInput contains a single string of lowercase English letters 'a'-'z'. The letters give the points' colors in the order in which they are arranged on the line: the first letter gives the color of the leftmost point, the second gives the color of the second point from the left etc.The number of the points is between 1 and106.OutputOutput one line containing an integer - the number of operations which can be performed on the given set of points until there are no more points to delete.ExamplesInputaabbOutput2InputaabcaaOutput1NoteIn the first test case, the first operation will delete two middle points and leave points \"ab\", which will be deleted with the second operation. There will be no points left to apply the third operation to.In the second test case, the first operation will delete the four points in the middle, leaving points \"aa\". None of them have neighbors of other colors, so the second operation can't be applied.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c793628c", "template_md5": "35d339e4", "result": "You are given a line with points, each having a unique color.  Each point has at most two neighbors, one to its left and one to its right.\n\nYou can perform operations on the points. In one operation, you delete all points that have a neighbor of a different color.  \n\nWhat is the minimum number of operations needed until no more points can be deleted in a single operation?\n\n**Input:**\n\nA string of lowercase letters representing the colors of the points, where the order of the letters corresponds to their position on the line.\n\n**Output:**\n\nAn integer representing the minimum number of operations."}, {"prompt_md5": "8fdb3a4f", "template_md5": "465699a0", "result": "You have a line of colored objects. Each object can have at most one object on either side of it. You can remove objects if they have a differently colored object next to them.  How many times can you remove objects until no more can be removed?"}]}