{"uid": "91-B", "url": "https://codeforces.com/contest/91/problem/B", "tags": ["binary search", " data structures"], "title": "91-B", "statement": "B. Queuetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arenwalruses standing in a queue in an airport. They are numbered starting from the queue's tail: the1-st walrus stands at the end of the queue and then-th walrus stands at the beginning of the queue. Thei-th walrus has the age equal toai.Thei-th walrus becomes displeased if there's a younger walrus standing in front of him, that is, if exists suchj(i<j), thatai>aj. Thedispleasureof thei-th walrus is equal to the number of walruses between him and the furthest walrus ahead of him, which is younger than thei-th one. That is, the further that young walrus stands from him, the stronger the displeasure is.The airport manager asked you to count for each ofnwalruses in the queue his displeasure.InputThe first line contains an integern(2 ≤n≤ 105) — the number of walruses in the queue. The second line contains integersai(1 ≤ai≤ 109).Note that some walruses can have the same age but for the displeasure to emerge the walrus that is closer to the head of the queue needs to bestrictly youngerthan the other one.OutputPrintnnumbers: if thei-th walrus is pleased with everything, print \"-1\" (without the quotes). Otherwise, print thei-th walrus's displeasure: the number of other walruses that stand between him and the furthest from him younger walrus.ExamplesInput610 8 5 3 50 45Output2 1 0 -1 0 -1Input710 4 6 3 2 8 15Output4 2 1 0 -1 -1 -1Input510 3 1 10 11Output1 0 -1 -1 -1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2cb2ee06", "template_md5": "35d339e4", "result": "You are given a queue of $n$ people, numbered from the back of the queue ($1$st person) to the front ($n$th person). Each person has an age, $a_i$, where $i$ is their position in the queue.\n\nA person is displeased if there is a younger person in front of them in the queue. The displeasure of a person is the number of people between them and the youngest person in front of them who is younger than them. If there is no younger person in front of them, their displeasure is $-1$.\n\nYour task is to determine the displeasure of each person in the queue. \n\n\nInput:\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 10⁵) representing the number of people in the queue.\n* The second line contains $n$ integers, $a_1$, $a_2$, ..., $a_n$ (1 ≤ $a_i$ ≤ 10⁹), representing the ages of the people in the queue.\n\nOutput:\n\nPrint $n$ numbers, where the $i$-th number is the displeasure of the $i$-th person in the queue. If a person is not displeased, print $-1$."}, {"prompt_md5": "e435febc", "template_md5": "465699a0", "result": "You are given a list of ages of people in a line.  For each person, count how many people are in front of them who are younger."}]}