{"uid": "91-C", "url": "https://codeforces.com/contest/91/problem/C", "tags": ["combinatorics", " dsu", " graphs"], "title": "91-C", "statement": "C. Ski Basetime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutA ski base is planned to be built in Walrusland. Recently, however, the project is still in the constructing phase. A large land lot was chosen for the construction. It containsnski junctions, numbered from1ton. Initially the junctions aren't connected in any way.In the constructing processmbidirectional ski roads will be built. The roads are built one after another: first the road number1will be built, then the road number2, and so on. Thei-th road connects the junctions with numbersaiandbi.Trackis the route with the following properties:The route is closed, that is, it begins and ends in one and the same junction.The route contains at least one road.The route doesn't go on one road more than once, however it can visit any junction any number of times.Let's consider theski baseas a non-empty set of roads that can be divided into one or more tracks so that exactly one track went along each road of the chosen set. Besides, each track can consist only of roads from the chosen set. Ski base doesn't have to be connected.Two ski bases are considered different if they consist of different road sets.After building each new road the Walrusland government wants to know the number of variants of choosing a ski base based on some subset of the already built roads. The government asks you to help them solve the given problem.InputThe first line contains two integersnandm(2 ≤n≤ 105, 1 ≤m≤ 105). They represent the number of junctions and the number of roads correspondingly. Then onmlines follows the description of the roads in the order in which they were built. Each road is described by a pair of integersaiandbi(1 ≤ai,bi≤n,ai≠bi) — the numbers of the connected junctions. There could be more than one road between a pair of junctions.OutputPrintmlines: thei-th line should represent the number of ways to build a ski base after the end of construction of the road numberi. The numbers should be printed modulo1000000009(109+ 9).ExamplesInput3 41 32 31 21 2Output0013NoteLet us have 3 junctions and 4 roads between the junctions have already been built (as after building all the roads in the sample): 1 and 3, 2 and 3, 2 roads between junctions 1 and 2. The land lot for the construction will look like this:The land lot for the construction will look in the following way:We can choose a subset of roads in three ways:In the first and the second ways you can choose one path, for example, 1 - 2 - 3 - 1. In the first case you can choose one path 1 - 2 - 1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dacb7ce8", "template_md5": "35d339e4", "result": "You are given $n$ junctions and $m$ roads. Each road connects two distinct junctions. The roads are built one by one, and after each road is built, you need to find the number of ways to choose a set of roads to form a \"ski base\". \n\nHere are the rules for a ski base:\n\n* It must consist of a set of roads.\n* The roads in the set can be divided into one or more \"tracks\".\n* Each track must use exactly one road from the set.\n* Each track must be a closed loop (start and end at the same junction).\n* A track can visit a junction multiple times.\n* Two ski bases are different if they use different sets of roads.\n\nYou need to output the number of possible ski bases after each road is built, modulo $10^9 + 9$. \n\n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "f15bcdb5", "template_md5": "465699a0", "result": "You are given a number of points and roads connecting them. Roads are built one by one. After each road is built, you need to find the number of ways to choose a set of roads to form a closed loop that visits each road in the set exactly once.  The number of ways to form a loop must be calculated modulo 1000000009."}]}