{"uid": "911-F", "url": "https://codeforces.com/contest/911/problem/F", "tags": ["constructive algorithms", " dfs and similar", " graphs", " greedy", " trees"], "title": "911-F", "statement": "F. Tree Destructiontime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an unweighted tree withnvertices. Thenn- 1following operations are applied to the tree. A single operation consists of the following steps:choose two leaves;add the length of the simple path between them to the answer;remove one of the chosen leaves from the tree.Initial answer (before applying operations) is0. Obviously aftern- 1such operations the tree will consist of a single vertex.Calculate the maximal possible answer you can achieve, and construct a sequence of operations that allows you to achieve this answer!InputThe first line contains one integer numbern(2 ≤n≤ 2·105) — the number of vertices in the tree.Nextn- 1lines describe the edges of the tree in formai,bi(1 ≤ai,bi≤n,ai≠bi). It is guaranteed that given graph is a tree.OutputIn the first line print one integer number — maximal possible answer.In the nextn- 1lines print the operations in order of their applying in formatai,bi,ci, whereai,bi— pair of the leaves that are chosen in the current operation (1 ≤ai,bi≤n),ci(1 ≤ci≤n,ci=aiorci=bi) — choosen leaf that is removed from the tree in the current operation.See the examples for better understanding.ExamplesInput31 21 3Output32 3 32 1 1Input51 21 32 42 5Output93 5 54 3 34 1 14 2 2", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "988213fb", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices.  You can perform the following operation $n-1$ times:\n\n1. Choose two leaves (vertices with degree 1) in the tree.\n2. Add the length of the path between these two leaves to a running total.\n3. Remove one of the chosen leaves from the tree.\n\nThe initial total is 0.  \n\nFind the maximum possible total you can achieve after performing these operations. Also, provide a sequence of operations that achieves this maximum total.\n\nThe input will list the edges of the tree. The output should first list the maximum total, followed by $n-1$ lines describing each operation in the order you would perform them. Each operation will list the two leaves chosen and the leaf that is removed."}, {"prompt_md5": "8646f439", "template_md5": "465699a0", "result": "You have a tree with a certain number of nodes. You repeatedly choose two leaves of the tree, add the distance between them to a total, and remove one of the leaves.  What is the largest total you can achieve before the tree is reduced to a single node?  Also, list the steps you took to get that total."}]}