{"uid": "912-B", "url": "https://codeforces.com/contest/912/problem/B", "tags": ["bitmasks", " constructive algorithms", " number theory"], "title": "912-B", "statement": "B. New Year's Evetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputSince Grisha behaved well last year, at New Year's Eve he was visited by Ded Moroz who brought an enormous bag of gifts with him! The bag containsnsweet candies fromthe good ol' bakery, each labeled from1toncorresponding to its tastiness. No two candies have the same tastiness.The choice of candies has a direct effect on Grisha's happiness. One can assume that he should take the tastiest ones — but no, the holiday magic turns things upside down. It is the xor-sum of tastinesses that matters, not the ordinary sum!A xor-sum of a sequence of integersa1,a2, ...,amis defined as the bitwise XOR of all its elements:, heredenotes the bitwise XOR operation; more about bitwise XOR can be foundhere.Ded Moroz warned Grisha he has more houses to visit, so Grisha can takeno more thankcandies from the bag. Help Grisha determine the largest xor-sum (largest xor-sum means maximum happiness!) he can obtain.InputThe sole string contains two integersnandk(1 ≤k≤n≤ 1018).OutputOutput one number — the largest possible xor-sum.ExamplesInput4 3Output7Input6 6Output7NoteIn the first sample case, one optimal answer is1,2and4, giving the xor-sum of7.In the second sample case, one can, for example, take all six candies and obtain the xor-sum of7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "069c2f24", "template_md5": "35d339e4", "result": "You are given a set of $n$ distinct positive integers, each representing the \"tastiness\" of a candy. You can choose at most $k$ candies from the set.  What is the largest possible sum of the candies' tastiness values calculated using the bitwise XOR operation? \n\nLet $a_1, a_2, ..., a_n$ represent the tastiness values of the candies. The XOR sum of a subset of these values is calculated as:\n\n$a_1 \\oplus a_2 \\oplus ... \\oplus a_i$\n\nwhere $\\oplus$ represents the bitwise XOR operation. \n\n\nYour task is to find the maximum possible XOR sum you can achieve by selecting at most $k$ candies from the set."}, {"prompt_md5": "f70dc25b", "template_md5": "465699a0", "result": "You have a set of items, each with a unique value. You can choose at most k items.  Find the largest possible sum of the values of the chosen items, where the sum is calculated using the bitwise XOR operation."}]}