{"uid": "912-C", "url": "https://codeforces.com/contest/912/problem/C", "tags": ["brute force", " greedy", " sortings"], "title": "912-C", "statement": "C. Perun, Ult!time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA lot of students spend their winter holidays productively. Vlad has advanced very well in doing so! For three days already, fueled by salads and tangerines — the leftovers from New Year celebration — he has been calibrating his rating in his favorite MOBA game, playing as a hero named Perun.Perun has an ultimate ability called \"Thunderwrath\". At the instant of its activation, each enemy on the map (nof them in total) loseshealth points as a single-time effect. It also has a restriction: it can only activated when the moment of time is aninteger. The initial bounty for killing an enemy is. Additionally, it increases byeach second. Formally, if at some secondtthe ability is activated and thei-th enemy is killed as a result (i.e. his health drops to zero or lower), Vlad earnsunits of gold.Every enemy can receive damage, as well as be healed. There are multiple ways of doing so, but Vlad is not interested in details. For each ofnenemies he knows:— maximum number of health points for thei-th enemy;— initial health of the enemy (on the0-th second);— the amount of health thei-th enemy can regenerate per second.There alsomhealth updates Vlad knows about:— time when the health was updated;— the enemy whose health was updated;— updated health points forenemyj.Obviously, Vlad wants to maximize his profit. If it's necessary, he could even wait for years to activate his ability at the right second. Help him determine the exact second (note that it must bean integer) from0(inclusively) to+ ∞so that a single activation of the ability would yield Vlad the maximum possible amount of gold, and print this amount.InputIn the first line, two integers are given (separated by spaces) —nandm(1 ≤n≤ 105,0 ≤m≤ 105).In the second line, there are three integers:,and(,).Each of the followingnlines has three integers —,,(,).The nextmlines contain three integers each —,,(,,). It is guaranteed that there is no more than one hearth change per second for each enemy: more formally, for eacha,bso that1 ≤a,b≤m,a≠bholds that if, then.OutputOutput the single integer — the maximum amount of gold Vlad can obtain if he applies \"Thunderwrath\" exactly once, or-1if this amount can beinfinitelylarge.ExamplesInput3 21000 10 5070 5 590 70 1110 20 220 2 1030 3 10Output3000Input1 1500 50 1000750 750 2010 1 300Output-1NoteOn the pictures you can see health points of each enemy versus time in sample cases.Periods when Vlad can kill one enemy are marked with yellow color.Periods when Vlad can kill two enemies are marked with purple color.In the first sample case, Vlad can activate the ability at the50-th second: the enemies2and3will die since they would have40and50health points correspondingly. Vlad will earn2·(1000 + 50·10) = 3000gold.In the second sample case, the maximum amount of health for the enemy1is less than the damage dealt by the ability. Hence, the enemy could be killed anytime. As the bounty increases by50over the time, the maximum possible amount of gold is infinite.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "2d69d599", "template_md5": "35d339e4", "result": "You are given $n$ enemies, each with a maximum health, initial health, and a health regeneration rate per second. There are also $m$ health updates for these enemies, specifying the time, enemy, and new health at each update.\n\nYou have a special ability that deals damage to all enemies at a specific time. The damage is enough to kill an enemy if their health is below or equal to the damage. The bounty for killing an enemy increases by a fixed amount each second.\n\nYour goal is to find the best time to activate your ability to maximize the total gold earned from killing enemies.  \n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of enemies and health updates, respectively.\n* The second line contains three integers: $maxHealth$, $initialHealth$, and $regenerationRate$.\n* The next $n$ lines each contain three integers: $maxHealth$, $initialHealth$, and $regenerationRate$ for each enemy.\n* The next $m$ lines each contain three integers: $time$, $enemy$, and $newHealth$ for each health update.\n\n**Output:**\n\n* Output a single integer representing the maximum gold you can earn by activating your ability at the optimal time. If the maximum gold is infinite, output -1."}, {"prompt_md5": "c4e795e7", "template_md5": "465699a0", "result": "You are given information about the health of multiple enemies over time.  Each enemy has a maximum health, starting health, and a health regeneration rate. You can deal damage to all enemies at a specific point in time. The damage value is fixed, but the gold reward for killing an enemy increases over time.  Find the time at which you can deal damage to maximize the total gold earned from killing enemies."}]}