{"uid": "913-G", "url": "https://codeforces.com/contest/913/problem/G", "tags": ["math", " number theory"], "title": "913-G", "statement": "G. Power Substringtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are givennpositive integersa1,a2, ...,an.For everyaiyou need to find a positive integerkisuch that the decimal notation of2kicontains the decimal notation ofaias a substring among its lastmin(100,length(2ki))digits. Herelength(m)is the length of the decimal notation ofm.Note that you don't have to minimizeki. The decimal notations in this problem do not contain leading zeros.InputThe first line contains a single integern(1 ≤n≤ 2 000) — the number of integersai.Each of the nextnlines contains a positive integerai(1 ≤ai< 1011).OutputPrintnlines. Thei-th of them should contain a positive integerkisuch that the lastmin(100,length(2ki))digits of2kicontain the decimal notation ofaias a substring. Integerskimust satisfy1 ≤ki≤ 1050.It can be shown that the answer always exists under the given constraints. If there are multiple answers, print any of them.ExamplesInput282Output31Input234857Output520", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "792da0c0", "template_md5": "35d339e4", "result": "You are given $n$ positive integers $a_1, a_2, ..., a_n$.  For each $a_i$, find the smallest positive integer $k$ such that the last $\\min(100, \\text{length}(2^k))$ digits of $2^k$ contain the decimal representation of $a_i$ as a substring.\n\n**Example:**\n\n* Input: $n = 2$, $a_1 = 8$, $a_2 = 2$\n* Output: $k_1 = 3$, $k_2 = 5$ \n\n**Explanation:**\n\n* The last 100 digits of $2^3$ are \"8\".\n* The last 100 digits of $2^5$ are \"1024\".\n\n\n\nLet me know if you'd like me to clarify anything further!"}, {"prompt_md5": "ce3215e7", "template_md5": "465699a0", "result": "You are given a list of numbers. For each number, find the smallest power of 2 that, when written out as a decimal, has that number as a substring within its last 100 digits (or fewer if the power of 2 is shorter)."}]}