{"uid": "913-F", "url": "https://codeforces.com/contest/913/problem/F", "tags": ["dp", " graphs", " math", " probabilities"], "title": "913-F", "statement": "F. Strongly Connected Tournamenttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is a chess tournament in All-Right-City.nplayers were invited to take part in the competition. The tournament is held by the following rules:Initially, each player plays one game with every other player. There are no ties;After that, the organizers build a complete directed graph with players as vertices. For every pair of players there is exactly one directed edge between them: the winner of their game is the startpoint of this edge and the loser is the endpoint;After that, the organizers build a condensation of this graph. The condensation of this graph is an acyclic complete graph, therefore it has the only Hamiltonian path which consists of strongly connected components of initial graphA1→A2→ ... →Ak.The players from the first componentA1are placed on the firstplaces, the players from the componentA2are placed on the nextplaces, and so on.To determine exact place of each player in a strongly connected component, all the procedures from 1 to 5 are repeated recursively inside each component, i.e. for everyi= 1, 2, ...,kplayers from the componentAiplay games with each other again, and so on;If a component consists of a single player, then he has no more rivals, his place is already determined and the process stops.The players are enumerated with integers from1ton. The enumeration was made using results of a previous tournament. It is known that playeriwins playerj(i<j) with probabilityp.You need to help to organize the tournament. Find the expected value of total number of games played by all the players.It can be shown that the answer can be represented as, wherePandQare coprime integers and. Print the value ofP·Q- 1modulo998244353.If you are not familiar with any of the terms above, you can read about themhere.InputThe first line of input contains a single integern(2 ≤n≤ 2000) — the number of players.The second line contains two integersaandb(1 ≤a<b≤ 100) — the numerator and the denominator of fraction.OutputIn the only line print the expected value of total number of games played by all the players. Print the answer using the format above.ExamplesInput31 2Output4Input34 6Output142606340Input41 2Output598946623NoteIn the first example the expected value is4.In the second example the expected value is.In the third example the expected value is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6a4c7628", "template_md5": "35d339e4", "result": "There are $n$ players participating in a chess tournament.  Each player plays a single game against every other player. The winner of each game is recorded as a directed edge from the loser to the winner in a graph.\n\nThis graph is then condensed into a new graph where each strongly connected component (a group of players where everyone can reach everyone else) becomes a single node.  \n\nThe players within each strongly connected component are then ranked based on their performance within that component, using the same tournament rules. This process is recursively applied to each strongly connected component until all players have a final ranking.\n\nGiven the probability $p$ that player $i$ wins against player $j$ ($i<j$), find the expected total number of games played in this tournament. The answer can be expressed as $\\frac{P}{Q}$ where $P$ and $Q$ are coprime integers. Print the value of $P \\cdot Q - 1 \\pmod{998244353}$."}, {"prompt_md5": "086f5ce5", "template_md5": "465699a0", "result": "You have a tournament with 'n' players. Each player plays every other player once. The winner of each game goes to a higher rank.  The tournament is divided into groups based on who beats who.  \n\nYou need to find the average number of games played by all the players in the entire tournament."}]}