{"uid": "913-E", "url": "https://codeforces.com/contest/913/problem/E", "tags": ["bitmasks", " dp", " shortest paths"], "title": "913-E", "statement": "E. Logical Expressiontime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a boolean function of three variables which is defined by its truth table. You need to find an expression of minimum length that equals to this function. The expression may consist of:OperationAND('&', ASCII code 38)OperationOR('|', ASCII code 124)OperationNOT('!', ASCII code 33)Variablesx,yandz(ASCII codes 120-122)Parentheses ('(', ASCII code 40, and ')', ASCII code 41)If more than one expression of minimum length exists, you should find the lexicographically smallest one.Operations have standard priority.NOThas the highest priority, thenANDgoes, andORhas the lowest priority. The expression should satisfy the following grammar:E ::= E '|' T | TT ::= T '&' F | FF ::= '!' F | '(' E ')' | 'x' | 'y' | 'z'InputThe first line contains one integern— the number of functions in the input (1 ≤n≤ 10 000).The followingnlines contain descriptions of functions, thei-th of them contains a string of length8that consists of digits0and1— the truth table of thei-th function. The digit on positionj(0 ≤j< 8) equals to the value of the function in case of,and.OutputYou should outputnlines, thei-th line should contain the expression of minimum length which equals to thei-th function. If there is more than one such expression, output the lexicographically smallest of them. Expressions should satisfy the given grammar and shouldn't contain white spaces.ExampleInput400110011000001111111000000011111Outputy(y|z)&x!xx|y&zNoteThe truth table for the second function:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b270e886", "template_md5": "35d339e4", "result": "You are given the truth table for a boolean function of three variables (x, y, and z).  Your task is to find the shortest possible boolean expression that represents this function. \n\nThe expression can use the following:\n\n* AND operator (&)\n* OR operator (|)\n* NOT operator (!)\n* Parentheses ()\n\nThe order of operations is: NOT, AND, then OR.\n\nYou should output the shortest expression that is lexicographically smallest (comes first alphabetically) if there are multiple shortest expressions. \n\n\n\nFor example, if the truth table is:\n\n| x | y | z | Output |\n|---|---|---|---|\n| 0 | 0 | 0 | 0 |\n| 0 | 0 | 1 | 0 |\n| 0 | 1 | 0 | 0 |\n| 0 | 1 | 1 | 1 |\n| 1 | 0 | 0 | 0 |\n| 1 | 0 | 1 | 1 |\n| 1 | 1 | 0 | 1 |\n| 1 | 1 | 1 | 1 |\n\nA possible output could be:  `(x & !y) | z`"}, {"prompt_md5": "47e4d4b7", "template_md5": "465699a0", "result": "You are given a truth table for a function with three inputs.  Your task is to find the shortest possible expression, using only the logical operators AND, OR, NOT, and the inputs themselves, that produces the same output as the truth table."}]}