{"uid": "914-E", "url": "https://codeforces.com/contest/914/problem/E", "tags": ["bitmasks", " data structures", " divide and conquer", " trees"], "title": "914-E", "statement": "E. Palindromes in a Treetime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a tree (a connected acyclic undirected graph) ofnvertices. Vertices are numbered from1tonand each vertex is assigned a character fromatot.A path in the tree is said to be palindromic if at least one permutation of the labels in the path is a palindrome.For each vertex, output the number of palindromic paths passing through it.Note:The path from vertexuto vertexvis considered to be the same as the path from vertexvto vertexu, and this path will be counted only once for each of the vertices it passes through.InputThe first line contains an integern(2 ≤n≤ 2·105)  — the number of vertices in the tree.The nextn- 1lines each contain two integersuandv(1  ≤u,v≤n,u≠v) denoting an edge connecting vertexuand vertexv. It is guaranteed that the given graph is a tree.The next line contains a string consisting ofnlowercase characters fromatotwhere thei-th (1 ≤i≤n) character is the label of vertexiin the tree.OutputPrintnintegers in a single line, thei-th of which is the number of palindromic paths passing through vertexiin the tree.ExamplesInput51 22 33 43 5abcbbOutput1 3 4 3 3Input76 24 33 75 27 21 4afefdfsOutput1 4 1 1 2 4 2NoteIn the first sample case, the following paths are palindromic:2 - 3 - 42 - 3 - 54 - 3 - 5Additionally, all paths containing only one vertex are palindromic. Listed below are a few paths in the first sample that are not palindromic:1 - 2 - 31 - 2 - 3 - 41 - 2 - 3 - 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "999b8f3d", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices. Each vertex has a lowercase letter assigned to it.  \n\nA path in the tree is considered palindromic if you can rearrange the letters along the path to form a palindrome.\n\nFor each vertex, count the number of palindromic paths that pass through it.  \n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 2⋅10⁵) representing the number of vertices.\n* The next $n-1$ lines each contain two integers $u$ and $v$ (1 ≤ $u$, $v$ ≤ $n$, $u$ ≠ $v$) representing an edge between vertices $u$ and $v$.\n* The next line contains a string of $n$ lowercase letters, where the $i$-th letter represents the label of the $i$-th vertex.\n\n**Output:**\n\nPrint $n$ integers, where the $i$-th integer is the number of palindromic paths passing through the $i$-th vertex."}, {"prompt_md5": "d7f5d281", "template_md5": "465699a0", "result": "You are given a tree-like structure with numbered nodes. Each node has a letter assigned to it.  Count how many paths through the tree, where a path is a sequence of connected nodes, are palindromes (read the same backward as forward)."}]}