{"uid": "915-A", "url": "https://codeforces.com/contest/915/problem/A", "tags": ["implementation"], "title": "915-A", "statement": "A. Gardentime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLuba thinks about watering her garden. The garden can be represented as a segment of lengthk. Luba has gotnbuckets, thei-th bucket allows her to water some continuous subsegment of garden of lengthexactlyaieach hour.Luba can't water any parts of the garden that were already watered, also she can't water the ground outside the garden.Luba has to chooseoneof the buckets in order to water the garden as fast as possible (as mentioned above, each hour she will water some continuous subsegment of lengthaiif she chooses thei-th bucket). Help her to determine the minimum number of hours she has to spend watering the garden. It is guaranteed that Luba can always choose a bucket so it is possible water the garden.See the examples for better understanding.InputThe first line of input contains two integer numbersnandk(1 ≤n,k≤ 100) — the number of buckets and the length of the garden, respectively.The second line of input containsninteger numbersai(1 ≤ai≤ 100) — the length of the segment that can be watered by thei-th bucket in one hour.It is guaranteed that there is at least one bucket such that it is possible to water the garden in integer number of hours using only this bucket.OutputPrint one integer number — the minimum number of hours required to water the garden.ExamplesInput3 62 3 5Output2Input6 71 2 3 4 5 6Output7NoteIn the first test the best option is to choose the bucket that allows to water the segment of length3. We can't choose the bucket that allows to water the segment of length5because then we can't water the whole garden.In the second test we can choose only the bucket that allows us to water the segment of length1.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "018b0520", "template_md5": "35d339e4", "result": "You are given a garden of length $k$ and $n$ buckets. Each bucket can water a continuous segment of the garden of length $a_i$ in one hour.  You can only use one bucket to water the entire garden.  Find the minimum number of hours required to water the entire garden. \n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ (1 ≤ $n$, $k$ ≤ 100), representing the number of buckets and the length of the garden.\n* The second line contains $n$ integers, $a_1$, $a_2$, ..., $a_n$ (1 ≤ $a_i$ ≤ 100), representing the watering lengths of each bucket.\n\n**Output:**\n\n* Print a single integer representing the minimum number of hours required to water the entire garden."}, {"prompt_md5": "17a32be1", "template_md5": "465699a0", "result": "You have several tools that can cover a certain length of ground each hour. You need to find the fastest way to cover a fixed length of ground using only one tool."}]}