{"uid": "915-E", "url": "https://codeforces.com/contest/915/problem/E", "tags": ["data structures", " implementation", " sortings"], "title": "915-E", "statement": "E. Physical Education Lessonstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis year Alex has finished school, and now he is a first-year student of Berland State University. For him it was a total surprise that even though he studies programming, he still has to attend physical education lessons. The end of the term is very soon, but, unfortunately, Alex still hasn't attended a single lesson!Since Alex doesn't want to get expelled, he wants to know the number of working days left until the end of the term, so he can attend physical education lessons during these days. But in BSU calculating the number of working days is a complicated matter:There arendays left before the end of the term (numbered from1ton), and initially all of them are working days. Then the university staff sequentially publishesqorders, one after another. Each order is characterised by three numbersl,randk:Ifk= 1, then all days fromltor(inclusive) become non-working days. If some of these days are made working days by some previous order, then these days still become non-working days;Ifk= 2, then all days fromltor(inclusive) become working days. If some of these days are made non-working days by some previous order, then these days still become working days.Help Alex to determine the number of working days left after each order!InputThe first line contains one integern, and the second line — one integerq(1 ≤n≤ 109,1 ≤q≤ 3·105) — the number of days left before the end of the term, and the number of orders, respectively.Thenqlines follow,i-th line containing three integersli,riandkirepresentingi-th order (1 ≤li≤ri≤n,1 ≤ki≤ 2).OutputPrintqintegers.i-th of them must be equal to the number of working days left until the end of the term after the firstiorders are published.ExampleInput461 2 13 4 12 3 21 3 22 4 11 4 2Output202314", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b74deadd", "template_md5": "35d339e4", "result": "There are $n$ days left until the end of a term. Initially, all days are working days.  There are $q$ orders that will be issued, one after another. Each order is characterized by three numbers $l$, $r$, and $k$:\n\n* If $k=1$, then all days from day $l$ to day $r$ (inclusive) become non-working days.\n* If $k=2$, then all days from day $l$ to day $r$ (inclusive) become working days.\n\nAfter each order is issued, determine the number of working days remaining. \n\n**Input:**\n\n* The first line contains an integer $n$ (the number of days left).\n* The second line contains an integer $q$ (the number of orders).\n* Each of the next $q$ lines contains three integers $l$, $r$, and $k$ (describing an order).\n\n**Output:**\n\nPrint $q$ integers. The $i$-th integer should be the number of working days remaining after the first $i$ orders have been issued."}, {"prompt_md5": "5364cc68", "template_md5": "465699a0", "result": "You are given a number of days and a series of orders. Each order specifies a range of days and whether to mark them as working or non-working.  After each order, determine the number of remaining working days."}]}