{"uid": "916-A", "url": "https://codeforces.com/contest/916/problem/A", "tags": ["brute force", " implementation", " math"], "title": "916-A", "statement": "A. Jamie and Alarm Snoozetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJamie loves sleeping. One day, he decides that he needs to wake up at exactlyhh:mm. However, he hates waking up, so he wants to make waking up less painful by setting the alarm at aluckytime. He will then press the snooze button everyxminutes untilhh:mmis reached, and only then he will wake up. He wants to know what is the smallest number of times he needs to press the snooze button.A time is consideredluckyif it contains a digit '7'. For example,13: 07and17: 27arelucky, while00: 48and21: 34are notlucky.Note that it is not necessary that the time set for the alarm and the wake-up time are on the same day. It is guaranteed that there is aluckytime Jamie can set so that he can wake athh:mm.Formally, find the smallest possible non-negative integerysuch that the time representation of the timex·yminutes beforehh:mmcontains the digit '7'.Jamie uses 24-hours clock, so after23: 59comes00: 00.InputThe first line contains a single integerx(1 ≤x≤ 60).The second line contains two two-digit integers,hhandmm(00 ≤hh≤ 23, 00 ≤mm≤ 59).OutputPrint the minimum number of times he needs to press the button.ExamplesInput311 23Output2Input501 07Output0NoteIn the first sample, Jamie needs to wake up at 11:23. So, he can set his alarm at 11:17. He would press the snooze button when the alarm rings at 11:17 and at 11:20.In the second sample, Jamie can set his alarm at exactly at 01:07 which islucky.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a1f7aee4", "template_md5": "35d339e4", "result": "Given an integer $x$ (1 ≤ $x$ ≤ 60) representing the number of minutes the alarm snoozes for each press, and a time $hh:mm$ (00 ≤ $hh$ ≤ 23, 00 ≤ $mm$ ≤ 59) representing the target wake-up time, find the smallest number of times the snooze button needs to be pressed to reach the target time. A time is considered \"lucky\" if it contains the digit '7'."}, {"prompt_md5": "81bff2ff", "template_md5": "465699a0", "result": "Given a time to wake up and an interval in minutes, find the minimum number of times you need to snooze an alarm set to a time containing the digit '7' to reach the wake-up time."}]}