{"uid": "916-C", "url": "https://codeforces.com/contest/916/problem/C", "tags": ["constructive algorithms", " graphs", " shortest paths"], "title": "916-C", "statement": "C. Jamie and Interesting Graphtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJamie has recently found undirected weighted graphs with the following properties veryinteresting:The graph is connected and contains exactlynvertices andmedges.All edge weights are integers and are in range[1, 109]inclusive.The length of shortest path from1tonis a prime number.The sum of edges' weights in the minimum spanning tree (MST) of the graph is a prime number.The graph contains no loops or multi-edges.If you are not familiar with some terms from the statement you can find definitions of them in notes section.Help Jamie construct any graph with given number of vertices and edges that isinteresting!InputFirst line of input contains 2 integersn,m— the required number of vertices and edges.OutputIn the first line output 2 integerssp,mstw(1 ≤sp,mstw≤ 1014)— the length of the shortest path and the sum of edges' weights in the minimum spanning tree.In the nextmlines output the edges of the graph. In each line output 3 integersu,v,w(1 ≤u,v≤n, 1 ≤w≤ 109)describing the edge connectinguandvand having weightw.ExamplesInput4 4Output7 71 2 32 3 23 4 22 4 4Input5 4Output7 131 2 21 3 41 4 34 5 4NoteThe graph of sample 1:Shortest path sequence:{1, 2, 3, 4}. MST edges are marked with an asterisk (*).Definition of terms used in the problem statement:Ashortest pathin an undirected graph is a sequence of vertices(v1,v2, ... ,vk)such thatviis adjacent tovi+ 11 ≤i<kand the sum of weightis minimized wherew(i,j)is the edge weight betweeniandj. (https://en.wikipedia.org/wiki/Shortest_path_problem)Aprime numberis a natural number greater than 1 that has no positive divisors other than 1 and itself. (https://en.wikipedia.org/wiki/Prime_number)Aminimum spanning tree (MST)is a subset of the edges of a connected, edge-weighted undirected graph that connects all the vertices together, without any cycles and with the minimum possible total edge weight. (https://en.wikipedia.org/wiki/Minimum_spanning_tree)https://en.wikipedia.org/wiki/Multiple_edges", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a9de2896", "template_md5": "35d339e4", "result": "You are given two integers, $n$ and $m$.  You need to construct a connected undirected weighted graph with $n$ vertices and $m$ edges that satisfies the following conditions:\n\n* All edge weights are integers between 1 and $10^9$ inclusive.\n* The shortest path from vertex 1 to vertex $n$ has a length that is a prime number.\n* The sum of the weights of the edges in the minimum spanning tree of the graph is a prime number.\n* The graph contains no loops or multiple edges.\n\nOutput the length of the shortest path from vertex 1 to vertex $n$ and the sum of the weights of the edges in the minimum spanning tree. Then, output the edges of the graph."}, {"prompt_md5": "3660394e", "template_md5": "465699a0", "result": "You are given a number of vertices and edges.  You need to create a connected graph with those vertices and edges where:\n\n* The shortest path between vertex 1 and the last vertex is a prime number.\n* The sum of the weights of the edges in the minimum spanning tree is a prime number. \n\n\n\nOutput the shortest path length and the sum of the minimum spanning tree edge weights."}]}