{"uid": "916-B", "url": "https://codeforces.com/contest/916/problem/B", "tags": ["bitmasks", " greedy", " math"], "title": "916-B", "statement": "B. Jamie and Binary Sequence (changed after round)time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputJamie is preparing a Codeforces round. He has got an idea for a problem, but does not know how to solve it. Help him write a solution to the following problem:Findkintegers such that the sum of two to the power of each number equals to the numbernand the largest integer in the answer is as small as possible. As there may be multiple answers, you are asked to output the lexicographically largest one.To be more clear, consider all integer sequence with lengthk(a1,a2, ...,ak)with. Give a valueto each sequence. Among all sequence(s) that have the minimumyvalue, output the one that is the lexicographically largest.For definitions of powers and lexicographical order see notes.InputThe first line consists of two integersnandk(1 ≤n≤ 1018, 1 ≤k≤ 105)— the required sum and the length of the sequence.OutputOutput \"No\" (without quotes) in a single line if there does not exist such sequence. Otherwise, output \"Yes\" (without quotes) in the first line, andknumbers separated by space in the second line — the required sequence.It is guaranteed that the integers in the answer sequence fit the range[ - 1018, 1018].ExamplesInput23 5OutputYes3 3 2 1 0Input13 2OutputNoInput1 2OutputYes-1 -1NoteSample 1:23+ 23+ 22+ 21+ 20= 8 + 8 + 4 + 2 + 1 = 23Answers like(3, 3, 2, 0, 1)or(0, 1, 2, 3, 3)are not lexicographically largest.Answers like(4, 1, 1, 1, 0)do not have the minimumyvalue.Sample 2:It can be shown there does not exist a sequence with length 2.Sample 3:Powers of 2:Ifx> 0, then2x= 2·2·2·...·2(xtimes).Ifx= 0, then2x= 1.Ifx< 0, then.Lexicographical order:Given two different sequences of the same length,(a1,a2, ... ,ak)and(b1,b2, ... ,bk), the first one is smaller than the second one for the lexicographical order, if and only ifai<bi, for the firstiwhereaiandbidiffer.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ba94b7c8", "template_md5": "35d339e4", "result": "Given a positive integer $n$ and a positive integer $k$, find the lexicographically largest sequence of $k$ integers $(a_1, a_2, ..., a_k)$ such that:\n\n $$2^{a_1} + 2^{a_2} + ... + 2^{a_k} = n$$\n\nIf no such sequence exists, output \"No\". Otherwise, output \"Yes\" followed by the sequence. \n\nThe integers in the sequence must be within the range $[-10^{18}, 10^{18}]$."}, {"prompt_md5": "659fb082", "template_md5": "465699a0", "result": "Find the smallest set of numbers whose sum of 2 raised to the power of each number equals a given target number. If there are multiple solutions, output the one that is largest in alphabetical order. If no solution exists, output \"No\"."}]}