{"uid": "92-A", "url": "https://codeforces.com/contest/92/problem/A", "tags": ["implementation", " math"], "title": "92-A", "statement": "A. Chipstime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutThere arenwalruses sitting in a circle. All of them are numbered in the clockwise order: the walrus number2sits to the left of the walrus number1, the walrus number3sits to the left of the walrus number2, ..., the walrus number1sits to the left of the walrus numbern.The presenter hasmchips. The presenter stands in the middle of the circle and starts giving the chips to the walruses starting from walrus number1and moving clockwise. The walrus numberigetsichips. If the presenter can't give the current walrus the required number of chips, then the presenter takes the remaining chips and the process ends. Determine by the givennandmhow many chips the presenter will get in the end.InputThe first line contains two integersnandm(1 ≤n≤ 50,1 ≤m≤ 104) — the number of walruses and the number of chips correspondingly.OutputPrint the number of chips the presenter ended up with.ExamplesInput4 11Output0Input17 107Output2Input3 8Output1NoteIn the first sample the presenter gives one chip to the walrus number1, two chips to the walrus number2, three chips to the walrus number3, four chips to the walrus number4, then again one chip to the walrus number1. After that the presenter runs out of chips. He can't give anything to the walrus number2and the process finishes.In the third sample the presenter gives one chip to the walrus number1, two chips to the walrus number2, three chips to the walrus number3, then again one chip to the walrus number1. The presenter has one chip left and he can't give two chips to the walrus number2, that's why the presenter takes the last chip.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c782f248", "template_md5": "35d339e4", "result": "There are $n$ walruses arranged in a circle.  A presenter has $m$ chips to distribute to the walruses. The presenter starts at walrus number 1 and gives each walrus $i$ chips, where $i$ is the walrus's number. If the presenter runs out of chips before reaching all the walruses, the process stops and the presenter keeps any remaining chips. \n\nDetermine how many chips the presenter will have left."}, {"prompt_md5": "e78cc781", "template_md5": "465699a0", "result": "You have a set number of items to distribute among a circle of people. Each person gets a different number of items. If you run out of items before giving to everyone, you keep the remaining items. How many items do you keep?"}]}