{"uid": "920-D", "url": "https://codeforces.com/contest/920/problem/D", "tags": ["dp", " greedy", " implementation"], "title": "920-D", "statement": "D. Tankstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPetya sometimes has to water his field. To water the field, Petya needs a tank with exactlyVml of water.Petya has gotNtanks,i-th of them initially containingaiml of water. The tanks are really large, any of them can contain any amount of water (no matter how large this amount is).Also Petya has got a scoop that can contain up toKml of water (initially the scoop is empty). This scoop can be used to get some water from some tank, and after that pour it all into some tank (it is impossible to get water from multiple tanks without pouring it, or leave some water in the scoop when pouring it). When Petya tries to get some water from a tank, he getsmin(v,K)water, wherevis the current volume of water in the tank.Is it possible to obtain a tank with exactlyVml of water using these operations? If it is possible, print a sequence of operations that allows to do it. If there are multiple ways to obtain needed amount of water in some tank, print any of them.InputThe first line contains3integers:N(2 ≤N≤ 5000),K(1 ≤K≤ 5000), andV(0 ≤V≤ 109)— the number of tanks, the maximum volume of water the scoop can contain, and the required amount of water in some tank, respectively.The second line containsNintegersai(0 ≤ai≤ 105), whereaiis initial volume of water ini-th tank.OutputIf it is impossible to obtain a tank with exactlyVml of water, printNO.Otherwise printYESin the first line, and beginning from the second line, print the sequence of operations in the following format:Each line has to contain3numbers denoting a compressed operation: \"cntxy\"(1 ≤cnt≤ 109, 1 ≤x,y≤N), wherexis the index of the tank where we get water,yis the index of the tank where we pour water, andcntis the number of times we transfer water from tankxto tanky.The number of these linesmust not exceedN+ 5.ExamplesInput2 3 52 3OutputYES1 2 1Input2 3 42 3OutputNOInput5 2 01 3 5 7 9OutputYES2 2 13 3 14 4 15 5 1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cea3a02d", "template_md5": "35d339e4", "result": "You have $N$ tanks, each initially containing a certain amount of water ($a_i$). You also have a scoop that can hold up to $K$ units of water. You can transfer water between tanks using the scoop.  \n\nThe goal is to determine if it is possible to create a tank with exactly $V$ units of water using these operations. If it is possible, provide a sequence of operations describing how to achieve this.\n\n**Input:**\n\n* $N$: The number of tanks.\n* $K$: The maximum capacity of the scoop.\n* $V$: The desired amount of water in a tank.\n* $a_i$: The initial amount of water in the $i$-th tank.\n\n**Output:**\n\n* \"YES\" if it is possible to create a tank with $V$ units of water, followed by a sequence of operations.\n* \"NO\" if it is not possible.\n\n**Operations:**\n\nEach operation is represented as \"cnt xy\", where:\n\n* $cnt$: The number of times water is transferred.\n* $x$: The index of the tank water is taken from.\n* $y$: The index of the tank water is poured into."}, {"prompt_md5": "cb24a28a", "template_md5": "465699a0", "result": "You have multiple containers of varying amounts of water. You also have a scoop that can hold a fixed amount of water. You need to figure out if you can combine the water from the containers using the scoop to create one container with a specific target amount of water. If possible, show the steps to achieve this."}]}