{"uid": "920-A", "url": "https://codeforces.com/contest/920/problem/A", "tags": ["implementation"], "title": "920-A", "statement": "A. Water The Gardentime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIt is winter now, and Max decided it's about time he watered the garden.The garden can be represented asnconsecutive garden beds, numbered from1ton.kbeds contain water taps (i-th tap is located in the bedxi), which, if turned on, start delivering water to neighbouring beds. If the tap on the bedxiis turned on, then after one second has passed, the bedxiwill be watered; after two seconds have passed, the beds from the segment[xi- 1,xi+ 1]will be watered (if they exist); afterjseconds have passed(jis an integer number), the beds from the segment[xi- (j- 1),xi+ (j- 1)]will be watered (if they exist).Nothing changes during the seconds, so, for example, we can't say that the segment[xi- 2.5,xi+ 2.5]will be watered after2.5seconds have passed; only the segment[xi- 2,xi+ 2]will be watered at that moment.The garden from test1. White colour denotes a garden bed without a tap, red colour — a garden bed with a tap.The garden from test1after2seconds have passed after turning on the tap. White colour denotes an unwatered garden bed, blue colour — a watered bed.Max wants toturn on all the water taps at the same moment, and now he wonders, what is the minimum number of seconds that have to pass after he turns on some taps until the whole garden is watered. Help him to find the answer!InputThe first line contains one integert— the number of test cases to solve (1 ≤t≤ 200).Thenttest cases follow. The first line of each test case contains two integersnandk(1 ≤n≤ 200,1 ≤k≤n) — the number of garden beds and water taps, respectively.Next line containskintegersxi(1 ≤xi≤n) — the location ofi-th water tap. It is guaranteed that for eachconditionxi- 1<xiholds.It is guaranteed that the sum ofnover all test cases doesn't exceed200.Note that in hacks you have to sett= 1.OutputFor each test case print one integer — the minimum number of seconds that have to pass after Max turns on some of the water taps, until the whole garden is watered.ExampleInput35 133 31 2 34 11Output314NoteThe first example consists of3tests:There are5garden beds, and a water tap in the bed3. If we turn it on, then after1second passes, only bed3will be watered; after2seconds pass, beds[1, 3]will be watered, and after3seconds pass, everything will be watered.There are3garden beds, and there is a water tap in each one. If we turn all of them on, then everything will be watered after1second passes.There are4garden beds, and only one tap in the bed1. It will take4seconds to water, for example, bed4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6ef7e062", "template_md5": "35d339e4", "result": "You are given a garden with $n$ beds numbered from 1 to $n$. There are $k$ water taps located in beds $x_1, x_2, ..., x_k$.  Each tap, when turned on, waters the beds in a range around it.  \n\n* A tap in bed $x_i$ waters beds $x_i-j, x_i, x_i+j$ after $j$ seconds, where $j$ is a non-negative integer.\n\nFind the minimum number of seconds it takes to water the entire garden if all taps are turned on simultaneously. \n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains two integers, $n$ (number of beds) and $k$ (number of taps).\n    * The second line contains $k$ integers, $x_1, x_2, ..., x_k$ (locations of the taps).\n\nOutput:\n\n* For each test case, print the minimum number of seconds required to water the entire garden."}, {"prompt_md5": "85c66837", "template_md5": "465699a0", "result": "You are given a line of numbered spaces. Some spaces have water sources. Each source waters adjacent spaces for a certain number of seconds.  Find the minimum time it takes for all spaces to be watered."}]}