{"uid": "920-E", "url": "https://codeforces.com/contest/920/problem/E", "tags": ["data structures", " dfs and similar", " dsu", " graphs"], "title": "920-E", "statement": "E. Connected Components?time limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an undirected graph consisting ofnvertices andedges. Instead of giving you the edges that exist in the graph, we give youmunordered pairs (x,y) such that there is no edge betweenxandy, and if some pair of vertices is not listed in the input, then there is an edge between these vertices.You have to find the number of connected components in the graph and the size of each component. A connected component is a set of verticesXsuch that for every two vertices from this set there exists at least one path in the graph connecting these vertices, but adding any other vertex toXviolates this rule.InputThe first line contains two integersnandm(1 ≤n≤ 200000,).Thenmlines follow, each containing a pair of integersxandy(1 ≤x,y≤n,x≠y) denoting thatthere is no edgebetweenxandy. Each pair is listed at most once; (x,y) and (y,x) are considered the same (so they are never listed in the same test). If some pair of vertices is not listed in the input, then thereexistsan edge between those vertices.OutputFirstly printk— the number of connected components in this graph.Then printkintegers — the sizes of components. You should output these integers in non-descending order.ExampleInput5 51 23 43 24 22 5Output21 4", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "16e52801", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices and $m$ edges.  The edges are not explicitly listed, but you are given $m$ pairs of vertices $(x, y)$ where there is *no* edge between $x$ and $y$.  \n\nIf a pair of vertices is not listed, then there is an edge between them.\n\nYour task is to find:\n\n1. The number of connected components in the graph.\n2. The size of each connected component.\n\nA connected component is a group of vertices where you can reach any vertex in the group from any other vertex in the group by following edges."}, {"prompt_md5": "b1e427e0", "template_md5": "465699a0", "result": "You are given a list of pairs of numbers that are not connected.  You need to find the number of groups of connected numbers and the size of each group.  If two numbers are not in the list, they are connected."}]}