{"uid": "920-G", "url": "https://codeforces.com/contest/920/problem/G", "tags": ["binary search", " bitmasks", " brute force", " combinatorics", " math", " number theory"], "title": "920-G", "statement": "G. List Of Integerstime limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's denote asL(x,p)an infinite sequence of integersysuch thatgcd(p,y) = 1andy>x(wheregcdis the greatest common divisor of two integer numbers), sorted in ascending order. The elements ofL(x,p)are1-indexed; for example,9,13and15are the first, the second and the third elements ofL(7, 22), respectively.You have to processtqueries. Each query is denoted by three integersx,pandk, and the answer to this query isk-th element ofL(x,p).InputThe first line contains one integert(1 ≤t≤ 30000) — the number of queries to process.Thentlines follow.i-th line contains three integersx,pandkfori-th query (1 ≤x,p,k≤ 106).OutputPrinttintegers, wherei-th integer is the answer toi-th query.ExamplesInput37 22 17 22 27 22 3Output91315Input542 42 4243 43 4344 44 4445 45 4546 46 46Output18787139128141", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "996849e3", "template_md5": "35d339e4", "result": "You are given a function L(x, p) that generates an infinite sequence of integers.  \n\n* The sequence starts with an integer greater than x.\n* Each integer in the sequence is relatively prime to p (meaning their greatest common divisor is 1).\n* The sequence is sorted in ascending order.\n\nFor example, the first three numbers in L(7, 22) are 9, 13, and 15.\n\nYou will be given a series of queries, each consisting of three integers: x, p, and k. For each query, you need to find the k-th number in the sequence L(x, p).\n\n**Input:**\n\n* The first line contains the number of queries (t).\n* Each of the following t lines contains three integers: x, p, and k.\n\n**Output:**\n\n* Print t integers, where the i-th integer is the answer to the i-th query."}, {"prompt_md5": "c6272086", "template_md5": "465699a0", "result": "You are given a series of queries. Each query consists of three numbers: x, p, and k. For each query, find the k-th number in a specific sequence. This sequence starts with a number greater than x and is made up of all numbers greater than x that share no common divisors with p (other than 1). The numbers in the sequence are sorted in ascending order."}]}