{"uid": "920-B", "url": "https://codeforces.com/contest/920/problem/B", "tags": ["implementation"], "title": "920-B", "statement": "B. Tea Queuetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRecentlynstudents from city S moved to city P to attend a programming camp.They moved there by train. In the evening, all students in the train decided that they want to drink some tea. Of course, no two people can use the same teapot simultaneously, so the students had to form a queue to get their tea.i-th student comes to the end of the queue at the beginning ofli-th second. If there are multiple students coming to the queue in the same moment, then the student with greater index comes after the student with lesser index. Students in the queue behave as follows: if there is nobody in the queue before the student, then he uses the teapot for exactly one second and leaves the queue with his tea; otherwise the student waits for the people before him to get their tea. If at the beginning ofri-th second studentistill cannot get his tea (there is someone before him in the queue), then he leaves the queue without getting any tea.For each student determine the second he will use the teapot and get his tea (if he actually gets it).InputThe first line contains one integert— the number of test cases to solve (1 ≤t≤ 1000).Thenttest cases follow. The first line of each test case contains one integern(1 ≤n≤ 1000) — the number of students.Thennlines follow. Each line contains two integerli,ri(1 ≤li≤ri≤ 5000) — the secondi-th student comes to the end of the queue, and the second he leaves the queue if he still cannot get his tea.It is guaranteed that for everyconditionli- 1≤liholds.The sum ofnover all test cases doesn't exceed1000.Note that in hacks you have to sett= 1.OutputFor each test case printnintegers.i-th of them must be equal to the second wheni-th student gets his tea, or0if he leaves without tea.ExampleInput221 31 431 51 12 3Output1 21 0 2NoteThe example contains2tests:During1-st second, students1and2come to the queue, and student1gets his tea. Student2gets his tea during2-nd second.During1-st second, students1and2come to the queue, student1gets his tea, and student2leaves without tea. During2-nd second, student3comes and gets his tea.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d60aa5bc", "template_md5": "35d339e4", "result": "There are $n$ students who arrive at a tea queue at specific times. Each student wants to use a single teapot.  \n\n* Student $i$ arrives at time $l_i$.\n* Student $i$ will leave the queue at time $r_i$ if they haven't gotten tea by then.\n\nStudents follow these rules:\n\n* If no one is in front of a student, they use the teapot for one second and leave.\n* If someone is in front of a student, they wait their turn.\n\nDetermine the time each student gets tea, or 0 if they leave without tea.\n\n\nInput:\n\n* The first line contains the number of test cases, $t$.\n* For each test case:\n    * The first line contains the number of students, $n$.\n    * The next $n$ lines each contain two integers, $l_i$ and $r_i$.\n\nOutput:\n\n* For each test case, print $n$ integers. The $i$-th integer is the time student $i$ gets tea, or 0 if they leave without tea."}, {"prompt_md5": "e6f2178b", "template_md5": "465699a0", "result": "You are given a list of students who arrive at a tea station at different times. Each student wants to use the single available teapot. Students arrive in order of their index, and if a student arrives and the teapot is free, they use it for one second. If the teapot is in use, the student waits. If a student cannot use the teapot before a certain time, they leave without tea. Determine the time each student gets tea, or 0 if they leave without tea."}]}