{"uid": "922-F", "url": "https://codeforces.com/contest/922/problem/F", "tags": ["constructive algorithms", " dp", " greedy", " number theory"], "title": "922-F", "statement": "F. Divisibilitytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputImp is really pleased that you helped him. But it you solve the last problem, his gladness would raise even more.Let's definefor some set of integersas the number of pairsa,bin, such that:aisstrictly lessthanb;adividesbwithout a remainder.You are to find such a set, which is a subset of{1, 2, ...,n}(the set that contains all positive integers not greater thann), that.InputThe only line contains two integersnandk.OutputIf there is no answer, print \"No\".Otherwise, in the first line print \"Yes\", in the second — an integermthat denotes the size of the setyou have found, in the second line printmintegers — the elements of the set, in any order.If there are multiple answers, print any of them.ExamplesInput3 3OutputNoInput6 6OutputYes51 2 4 5 6Input8 3OutputYes42 4 5 8NoteIn the second sample, the valid pairs in the output set are(1, 2),(1, 4),(1, 5),(1, 6),(2, 4),(2, 6). Thus,.In the third example, the valid pairs in the output set are(2, 4),(4, 8),(2, 8). Thus,.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cbd7c928", "template_md5": "35d339e4", "result": "You are given two integers $n$ and $k$.  Find a subset of the integers from 1 to $n$ (inclusive) such that the number of pairs $(a, b)$ in the subset where $a$ divides $b$ without a remainder is equal to $k$.\n\nIf no such subset exists, print \"No\". Otherwise, print \"Yes\" followed by the size of the subset and then the elements of the subset."}, {"prompt_md5": "c5d60c4f", "template_md5": "465699a0", "result": "Given two numbers, *n* and *k*, find a subset of numbers from 1 to *n* that has *k* or more pairs where one number divides the other evenly. If no such subset exists, say \"No\". If a subset exists, output \"Yes\", the size of the subset, and the numbers in the subset."}]}