{"uid": "922-E", "url": "https://codeforces.com/contest/922/problem/E", "tags": ["dp"], "title": "922-E", "statement": "E. Birdstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputApart from plush toys, Imp is a huge fan of little yellow birds!To summon birds, Imp needs strong magic. There arentrees in a row on an alley in a park, there is a nest on each of the trees. In thei-th nest there arecibirds; to summon one bird from this nest Imp needs to stay under this tree and it costs himcostipoints of mana. However, for each bird summoned, Imp increases his mana capacity byBpoints. Imp summons birds one by one, he can summon any number from0tocibirds from thei-th nest.Initially Imp stands under the first tree and hasWpoints of mana, and his mana capacity equalsWas well. He can only go forward, and each time he moves from a tree to the next one, he restoresXpoints of mana (but it can't exceed his current mana capacity). Moving only forward, what is the maximum number of birds Imp can summon?InputThe first line contains four integersn,W,B,X(1 ≤n≤ 103, 0 ≤W,B,X≤ 109) — the number of trees, the initial points of mana, the number of points the mana capacity increases after a bird is summoned, and the number of points restored when Imp moves from a tree to the next one.The second line containsnintegersc1,c2, ...,cn(0 ≤ci≤ 104) — whereciis the number of birds living in thei-th nest. It is guaranteed that.The third line containsnintegerscost1,cost2, ...,costn(0 ≤costi≤ 109), wherecostiis the mana cost to summon a bird from thei-th nest.OutputPrint a single integer — the maximum number of birds Imp can summon.ExamplesInput2 12 0 43 44 2Output6Input4 1000 10 351 2 4 51000 500 250 200Output5Input2 10 7 112 106 1Output11NoteIn the first sample base amount of Imp's mana is equal to12(with maximum capacity also equal to12). After he summons two birds from the first nest, he loses8mana points, although his maximum capacity will not increase (sinceB= 0). After this step his mana will be4of12; during the move you will replenish4mana points, and hence own8mana out of12possible. Now it's optimal to take4birds from the second nest and spend8mana. The final answer will be —6.In the second sample the base amount of mana is equal to1000. The right choice will be to simply pick all birds from the last nest. Note that Imp's mana doesn't restore while moving because it's initially full.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e8ba6516", "template_md5": "35d339e4", "result": "There are $n$ trees in a row, each with a nest containing $c_i$ birds. To summon a bird from the $i$-th nest, it costs $cost_i$ mana.  \n\nEach time a bird is summoned, the mana capacity increases by $B$ points.  \n\nYou start at the first tree with $W$ mana and a maximum mana capacity of $W$. You can only move forward to the next tree, and each time you move, you restore $X$ mana (but not exceeding your current capacity).\n\nWhat is the maximum number of birds you can summon, moving only forward? \n\n\nInput:\n\n* Line 1: $n$, $W$, $B$, $X$ \n* Line 2: $c_1$, $c_2$, ..., $c_n$\n* Line 3: $cost_1$, $cost_2$, ..., $cost_n$\n\nOutput:\n\n* The maximum number of birds you can summon."}, {"prompt_md5": "ea84526d", "template_md5": "465699a0", "result": "You have a series of locations, each with a number of items and a cost to take an item. You start with a limited amount of resources and can gain more resources by taking items. You can only move forward, and each move restores some resources. What is the maximum number of items you can collect?"}]}