{"uid": "923-A", "url": "https://codeforces.com/contest/923/problem/A", "tags": ["math", " number theory"], "title": "923-A", "statement": "A. Primal Sporttime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAlice and Bob begin their day with a quick game. They first choose a starting numberX0≥ 3and try to reach one million by the process described below.Alice goes first and then they take alternating turns. In thei-th turn, the player whose turn it is selects a prime number smaller than the current number, and announces the smallest multiple of this prime number that is not smaller than the current number.Formally, he or she selects a primep<Xi- 1and then finds the minimumXi≥Xi- 1such thatpdividesXi. Note that if the selected primepalready dividesXi- 1, then the number does not change.Eve has witnessed the state of the game after two turns. GivenX2, help her determine what is the smallest possible starting numberX0. Note that the players don't necessarily play optimally. You should consider all possible game evolutions.InputThe input contains a single integerX2(4 ≤X2≤ 106). It is guaranteed that the integerX2is composite, that is, is not prime.OutputOutput a single integer — the minimum possibleX0.ExamplesInput14Output6Input20Output15Input8192Output8191NoteIn the first test, the smallest possible starting number isX0= 6. One possible course of the game is as follows:Alice picks prime 5 and announcesX1= 10Bob picks prime 7 and announcesX2= 14.In the second case, letX0= 15.Alice picks prime 2 and announcesX1= 16Bob picks prime 5 and announcesX2= 20.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cbc4c417", "template_md5": "35d339e4", "result": "Given a composite number $X_2$ (where $4 \\le X_2 \\le 10^6$), determine the smallest possible starting number $X_0$ such that the following process could lead to $X_2$ after two turns:\n\n1. **Turn 1:** A player chooses a prime number $p$ less than $X_0$ and announces a number $X_1$ which is the smallest multiple of $p$ that is greater than or equal to $X_0$.\n2. **Turn 2:** The other player chooses a prime number $q$ less than $X_1$ and announces a number $X_2$ which is the smallest multiple of $q$ that is greater than or equal to $X_1$. \n\n\n\nNote: Players do not necessarily play optimally."}, {"prompt_md5": "3fa01faf", "template_md5": "465699a0", "result": "Given a number, find the smallest possible starting number that could have resulted in that number after two turns of a game.  \n\nIn the game, players take turns choosing a prime number smaller than the current number and announcing the smallest multiple of that prime number that is greater than or equal to the current number."}]}