{"uid": "924-D", "url": "https://codeforces.com/contest/924/problem/D", "tags": [], "title": "924-D", "statement": "D. Contact ATCtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputArkady the air traffic controller is now working withnplanes in the air. All planes move along a straight coordinate axis with Arkady's station being at point0on it. Thei-th plane, small enough to be represented by a point, currently has a coordinate ofxiand is moving with speedvi. It's guaranteed thatxi·vi< 0, i.e., all planes are moving towards the station.Occasionally, the planes are affected by winds. With a wind of speedvwind(not necessarily positive or integral), the speed of thei-th plane becomesvi+vwind.According to weather report, the current wind has a steady speed falling inside the range[ -w,w](inclusive), but the exact value cannot be measured accurately since this value is rather small — smaller than the absolute value of speed of any plane.Each plane should contact Arkady at the exact moment it passes above his station. And you are to help Arkady count the number of pairs of planes(i,j)(i<j) there are such that there is a possible value of wind speed, under which planesiandjcontact Arkady at the same moment. This value needn't be the same across different pairs.The wind speed is the same for all planes. You may assume that the wind has a steady speed and lasts arbitrarily long.InputThe first line contains two integersnandw(1 ≤n≤ 100 000,0 ≤w< 105) — the number of planes and the maximum wind speed.Thei-th of the nextnlines contains two integersxiandvi(1 ≤ |xi| ≤ 105,w+ 1 ≤ |vi| ≤ 105,xi·vi< 0) — the initial position and speed of thei-th plane.Planes are pairwise distinct, that is, no pair of(i,j)(i<j) exists such that bothxi=xjandvi=vj.OutputOutput a single integer — the number of unordered pairs of planes that can contact Arkady at the same moment.ExamplesInput5 1-3 2-3 3-1 21 -33 -5Output3Input6 1-3 2-2 2-1 21 -22 -23 -2Output9NoteIn the first example, the following3pairs of planes satisfy the requirements:(2, 5)passes the station at time3 / 4withvwind= 1;(3, 4)passes the station at time2 / 5withvwind= 1 / 2;(3, 5)passes the station at time4 / 7withvwind=  - 1 / 4.In the second example, each of the3planes with negative coordinates can form a valid pair with each of the other3, totaling9pairs.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9b12482c", "template_md5": "35d339e4", "result": "You are given $n$ planes, each with an initial position $x_i$ and speed $v_i$ on a number line. All planes are moving towards the origin (0). The wind speed is unknown but is within the range $[-w, w]$.  \n\nThe wind speed affects all planes equally.  \n\nFind the number of pairs of planes $(i, j)$ where $i < j$ such that there exists a wind speed $v_{wind}$ that causes both planes to reach the origin at the same time. \n\n\nInput:\n\n* The first line contains two integers $n$ and $w$ ($1 \\le n \\le 100000$, $0 \\le w < 10^5$) - the number of planes and the maximum wind speed.\n* Each of the next $n$ lines contains two integers $x_i$ and $v_i$ ($1 \\le |x_i| \\le 10^5$, $w + 1 \\le |v_i| \\le 10^5$, $x_i \\cdot v_i < 0$) - the initial position and speed of the $i$-th plane.\n\nOutput:\n\n* Output a single integer - the number of pairs of planes that can reach the origin at the same time."}, {"prompt_md5": "8eca30b8", "template_md5": "465699a0", "result": "You are given a list of objects moving towards a point. Each object has a speed.  A wind can affect all objects, changing their speeds.  Find the number of pairs of objects that could arrive at the point at the same time, given that the wind speed can vary."}]}