{"uid": "926-E", "url": "https://codeforces.com/contest/926/problem/E", "tags": ["constructive algorithms", " data structures"], "title": "926-E", "statement": "E. Merge Equal Elementstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a sequence of positive integersa1,a2, ...,an.While possible, you perform the following operation: find a pair of equal consecutive elements. If there are more than one such pair, find the leftmost (with the smallest indices of elements). If the two integers are equal tox, delete both and insert a single integerx+ 1on their place. This way the number of elements in the sequence is decreased by1on each step.You stop performing the operation when there is no pair of equal consecutive elements.For example, if the initial sequence is[5, 2, 1, 1, 2, 2], then after the first operation you get[5, 2, 2, 2, 2], after the second —[5, 3, 2, 2], after the third —[5, 3, 3], and finally after the fourth you get[5, 4]. After that there are no equal consecutive elements left in the sequence, so you stop the process.Determine the final sequence after you stop performing the operation.InputThe first line contains a single integern(2 ≤n≤ 2·105) — the number of elements in the sequence.The second line contains the sequence of integersa1,a2, ...,an(1 ≤ai≤ 109).OutputIn the first line print a single integerk— the number of elements in the sequence after you stop performing the operation.In the second line printkintegers — the sequence after you stop performing the operation.ExamplesInput65 2 1 1 2 2Output25 4Input41000000000 1000000000 1000000000 1000000000Output11000000002Input74 10 22 11 12 5 6Output74 10 22 11 12 5 6NoteThe first example is described in the statements.In the second example the initial sequence is[1000000000, 1000000000, 1000000000, 1000000000]. After the first operation the sequence is equal to[1000000001, 1000000000, 1000000000]. After the second operation the sequence is[1000000001, 1000000001]. After the third operation the sequence is[1000000002].In the third example there are no two equal consecutive elements initially, so the sequence does not change.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "70116d22", "template_md5": "35d339e4", "result": "You are given a sequence of positive integers $a_1, a_2, ..., a_n$.  You can repeatedly perform the following operation:\n\n* Find the leftmost pair of consecutive equal elements in the sequence.\n* Delete those two elements and insert a single new element equal to the sum of the deleted elements plus 1.\n\nContinue this process until there are no more pairs of consecutive equal elements.\n\nOutput the final sequence of integers after all operations are complete."}, {"prompt_md5": "e54760ab", "template_md5": "465699a0", "result": "You are given a list of numbers. You can repeatedly find two identical, consecutive numbers and replace them with the next larger number.  Continue doing this until you can no longer find two identical, consecutive numbers. What is the final list of numbers?"}]}