{"uid": "926-F", "url": "https://codeforces.com/contest/926/problem/F", "tags": [], "title": "926-F", "statement": "F. Mobile Communicationstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA sum ofprubles is charged from Arkady's mobile phone account every day in the morning. Among the followingmdays, there arendays when Arkady will top up the account: in the daydihe will deposittirubles on his mobile phone account. Arkady will always top up the account before the daily payment will be done. There will be no other payments nor tops up in the followingmdays.Determine the number of days starting from the1-st to them-th such that the account will have a negative amount on it after the daily payment (i. e. in evening). Initially the account's balance is zero rubles.InputThe first line contains three integersn,pandm(1 ≤n≤ 100 000,1 ≤p≤ 109,1 ≤m≤ 109,n≤m) — the number of days Arkady will top up the account, the amount of the daily payment, and the number of days you should check.Thei-th of the followingnlines contains two integersdiandti(1 ≤di≤m,1 ≤ti≤ 109) — the index of the day when Arkady will make thei-th top up, and the amount he will deposit on this day. It is guaranteed that the indices of the days are distinct and are given in increasing order, i. e.di>di- 1for allifrom2ton.OutputPrint the number of days from the1-st to them-th such that the account will have a negative amount on it after the daily payment.ExamplesInput3 6 72 134 207 9Output3Input5 4 10010 7015 7621 1230 10067 85Output26NoteIn the first example the balance will change as following (remember, initially the balance is zero):in the first day6rubles will be charged, the balance in the evening will be equal to- 6;in the second day Arkady will deposit13rubles, then6rubles will be charged, the balance in the evening will be equal to1;in the third day6rubles will be charged, the balance in the evening will be equal to- 5;in the fourth day Arkady will deposit20rubles, then6rubles will be charged, the balance in the evening will be equal to9;in the fifth day6rubles will be charged, the balance in the evening will be equal to3;in the sixth day6rubles will be charged, the balance in the evening will be equal to- 3;in the seventh day Arkady will deposit9rubles, then6rubles will be charged, the balance in the evening will be equal to0.Thus, in the end of the first, third and sixth days the balance will be negative in the end of the day.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9e9a04f7", "template_md5": "35d339e4", "result": "You are given a daily payment amount $p$ and a number of days $m$ to check. There are $n$ days when a top-up of $t_i$ rubles will be made to an initially empty account on day $d_i$.  \n\nDetermine the number of days from day 1 to day $m$ where the account balance will be negative after the daily payment is deducted. \n\n**Input:**\n\n* The first line contains three integers: $n$, $p$, and $m$ ($1 \\le n \\le 100000$, $1 \\le p \\le 10^9$, $1 \\le m \\le 10^9$, $n \\le m$).\n* The next $n$ lines each contain two integers: $d_i$ and $t_i$ ($1 \\le d_i \\le m$, $1 \\le t_i \\le 10^9$) representing the day of the top-up and the amount deposited.\n\n**Output:**\n\n* Print the number of days from day 1 to day $m$ where the account balance is negative after the daily payment."}, {"prompt_md5": "91b5afcc", "template_md5": "465699a0", "result": "You are given a sequence of days and the amount of money added to an account on each day. You are also given a fixed amount of money that is deducted from the account each day. Determine the number of days where the account balance is negative after the daily deduction."}]}