{"uid": "926-B", "url": "https://codeforces.com/contest/926/problem/B", "tags": ["math", " number theory"], "title": "926-B", "statement": "B. Add Pointstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere arenpoints on a straight line, and thei-th point among them is located atxi. All these coordinates are distinct.Determine the numberm— the smallest number of points you should add on the line to make the distances between all neighboring points equal.InputThe first line contains a single integern(3 ≤n≤ 100 000) — the number of points.The second line contains a sequence of integersx1,x2, ...,xn(- 109≤xi≤ 109) — the coordinates of the points. All these coordinates are distinct. The points can be given in an arbitrary order.OutputPrint a single integerm— the smallest number of points you should add on the line to make the distances between all neighboring points equal.ExamplesInput3-5 10 5Output1Input6100 200 400 300 600 500Output0Input410 9 0 -1Output8NoteIn the first example you can add one point with coordinate0.In the second example the distances between all neighboring points are already equal, so you shouldn't add anything.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8cce9a08", "template_md5": "35d339e4", "result": "You are given $n$ distinct points on a straight line, with the $i$-th point located at $x_i$.  Determine the smallest number of additional points you need to add to the line so that the distance between every pair of neighboring points is equal. \n\nInput:\n\n* The first line contains an integer $n$ (3 ≤ $n$ ≤ 100,000), the number of points.\n* The second line contains $n$ integers $x_1$, $x_2$, ..., $x_n$ (-10⁹ ≤ $x_i$ ≤ 10⁹), the coordinates of the points.\n\nOutput:\n\n* Print a single integer, the smallest number of points you need to add."}, {"prompt_md5": "2d4874a9", "template_md5": "465699a0", "result": "You are given a list of distinct numbers representing points on a line.  Find the fewest additional numbers you need to add to the list so that the difference between any two consecutive numbers is the same."}]}