{"uid": "928-B", "url": "https://codeforces.com/contest/928/problem/B", "tags": ["*special", " dp"], "title": "928-B", "statement": "B. Chattime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are times you recall a good old friend and everything you've come through together. Luckily there are social networks — they store all your message history making it easy to know what you argued over 10 years ago.More formal, your message history is a sequence of messages ordered by time sent numbered from1tonwherenis the total number of messages in the chat.Each message might contain a link to an earlier message which it is a reply to. When opening a messagexor getting a link to it, the dialogue is shown in such a way thatkprevious messages, messagexandknext messages are visible (with respect to messagex). In case there are less thankmessages somewhere, they are yet all shown.Digging deep into your message history, you always read all visible messages and then go by the link in the current messagex(if there is one) and continue reading in the same manner.Determine the number of messages you'll read if your start from message numbertfor alltfrom1ton. Calculate these numbers independently. If you start with messagex, the initial configuration isxitself,kprevious andknext messages. Messages read multiple times are considered as one.InputThe first line contains two integersnandk(1 ≤n≤ 105,0 ≤k≤n) — the total amount of messages and the number of previous and next messages visible.The second line features a sequence of integersa1,a2, ...,an(0 ≤ai<i), whereaidenotes thei-th message link destination or zero, if there's no link fromi. All messages are listed in chronological order. It's guaranteed that the link from messagexgoes to message with number strictly less thanx.OutputPrintnintegers withi-th denoting the number of distinct messages you can read starting from messageiand traversing the links while possible.ExamplesInput6 00 1 1 2 3 2Output1 2 2 3 3 3Input10 10 1 0 3 4 5 2 3 7 0Output2 3 3 4 5 6 6 6 8 2Input2 20 1Output2 2NoteConsideri= 6in sample case one. You will read message6, then2, then1and then there will be no link to go.In the second sample casei= 6gives you messages5, 6, 7sincek= 1, then4, 5, 6, then2, 3, 4and then the link sequence breaks. The number of distinct messages here is equal to6.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f4411c15", "template_md5": "35d339e4", "result": "You have a list of messages numbered from 1 to $n$. Each message can have a link to a previous message in the list.  \n\nYou start reading messages from a given message number $t$. You read the current message and then $k$ messages before it and $k$ messages after it. If the current message has a link, you follow that link and continue reading in the same way.\n\nFor each message number $t$ from 1 to $n$, determine the total number of unique messages you will read by following the links.\n\n**Input:**\n\n* The first line contains two integers $n$ and $k$ ($1 \\le n \\le 10^5$, $0 \\le k \\le n$).\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 \\le a_i < i$).  $a_i$ represents the number of the message that message $i$ links to. If $a_i = 0$, there is no link from message $i$.\n\n**Output:**\n\nPrint $n$ integers. The $i$-th integer represents the number of unique messages you can read starting from message $i$."}, {"prompt_md5": "175acee1", "template_md5": "465699a0", "result": "You have a list of messages, each of which can link to a previous message.  You start at a given message and read it, then follow any links to read more messages. You can see a fixed number of messages before and after each message you read.  \n\nFind the total number of unique messages you can read starting from each message in the list."}]}