{"uid": "929-D", "url": "https://codeforces.com/contest/929/problem/D", "tags": [], "title": "929-D", "statement": "D. Пограничные вратаограничение по времени на тест1 секундаограничение по памяти на тест256 мегабайтвводстандартный вводвыводстандартный выводГерой Аркадий находится на узкой полоске земли, разделенной наnзон, пронумерованных от1доn. Изi-й зоны можно пройти лишь в(i- 1)-ю зону и в(i+ 1)-ю зону, если они существуют. При этом между каждой парой соседних зон находятся пограничные врата, которые могут быть разных цветов, цвет врат междуi-й и(i+ 1)-й зоной равенgi.Аркадий может пройти пограничные врата некоторого цвета, только если он перед этим побывал в одном из шатров хранителей ключей этого цвета и взял ключ. В каждой зоне находится ровно один шатер хранителя ключей некоторого цвета, цвет шатра вi-й зоне равенki. После посещения шатра определенного цвета Аркадий может неограниченное число раз проходить через любые врата этого цвета.На проход через одни врата Аркадий тратит один ход, на посещение шатра и другие перемещения ходы не требуются. За какое минимальное число ходов Аркадий может попасть из зоныaв зонуb, если изначально у него нет никаких ключей?Входные данныеПервая строка содержит три целых числаn,a,b(2 ≤n≤ 100 000,1 ≤a,b≤n,a≠b) — число зон, номер начальной зоны и номер конечной зоны, соответственно.Вторая строка содержитn- 1целое числоg1,g2, ...,gn- 1(1 ≤gi≤ 100 000), гдеgiозначает цвет пограничных врат между зонамиiиi+ 1.Третья строка содержитnцелых чиселk1,k2, ...,kn(1 ≤ki≤ 100 000), гдеkiозначает цвет шатра хранителя ключей вi-й зоне.Выходные данныеЕсли Аркадий не может попасть из зоныaв зонуb, не имея изначально ключей, выведите-1.Иначе выведите минимальное количество ходов, которое потребуется Аркадию.ПримерыВходные данные5 4 13 1 1 27 1 2 1 3Выходные данные7Входные данные5 1 54 3 2 14 3 2 5 5Выходные данные-1ПримечаниеВ первом примере, чтобы попасть из зоны4в зону1, Аркадию нужно сначала взять ключ цвета1, пройти в зону3, там взять ключ цвета2и пройти обратно в зону4и затем в зону5, взять там ключ цвета3и дойти до зоны1за четыре хода.Во втором примере Аркадий может дойти лишь до четвертой зоны, так как шатров хранителей ключей цвета1нет совсем.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6628379a", "template_md5": "35d339e4", "result": "You are given a line of $n$ zones, numbered from 1 to $n$.  Each zone has a gate connecting it to its neighboring zones (if they exist). The gates have different colors, with the color of the gate between zone $i$ and zone $i+1$ being $g_i$.\n\nThere is a hut in each zone containing a key of a specific color. The color of the key in zone $i$ is $k_i$.\n\nYou start in zone $a$ and want to reach zone $b$. You can only pass through a gate if you have the corresponding key.  \n\nYou can visit a hut once to obtain a key. After obtaining a key, you can pass through any gate of that color an unlimited number of times.\n\nFind the minimum number of steps required to reach zone $b$ from zone $a$, starting with no keys.\n\n**Input:**\n\n* The first line contains three integers: $n$, $a$, and $b$ ($2 \\le n \\le 100,000$, $1 \\le a, b \\le n$, $a \\neq b$).\n* The second line contains $n-1$ integers: $g_1$, $g_2$, ..., $g_{n-1}$ ($1 \\le g_i \\le 100,000$).\n* The third line contains $n$ integers: $k_1$, $k_2$, ..., $k_n$ ($1 \\le k_i \\le 100,000$).\n\n**Output:**\n\n* If it is impossible to reach zone $b$ from zone $a$ without any keys, output $-1$.\n* Otherwise, output the minimum number of steps required."}, {"prompt_md5": "712a5108", "template_md5": "465699a0", "result": "You are given a line with numbered segments. Each segment has a gate connecting it to its neighbors. Each gate has a color. There are also buildings in each segment, each containing a key of a specific color. You start at a given segment and need to reach another given segment. You can only pass through a gate if you have the corresponding key.  Find the minimum number of steps required to reach the destination segment, starting with no keys."}]}