{"uid": "929-B", "url": "https://codeforces.com/contest/929/problem/B", "tags": ["*special", " implementation"], "title": "929-B", "statement": "B. Места в самолётеограничение по времени на тест1 секундаограничение по памяти на тест256 мегабайтвводстандартный вводвыводстандартный выводВ самолёте естьnрядов мест. Если смотреть на ряды сверху, то в каждом ряду есть3места слева, затем проход между рядами, затем4центральных места, затем ещё один проход между рядами, а затем ещё3места справа.Известно, что некоторые места уже заняты пассажирами. Всего есть два вида пассажиров — статусные (те, которые часто летают) и обычные.Перед вами стоит задача рассадить ещёkобычныхпассажиров так, чтобы суммарное число соседей у статусных пассажиров было минимально возможным. Два пассажира считаются соседями, если они сидят в одном ряду и между ними нет других мест и прохода между рядами. Если пассажир является соседним пассажиром для двух статусных пассажиров, то его следует учитывать в сумме соседей дважды.Входные данныеВ первой строке следуют два целых числаnиk(1 ≤n≤ 100,1 ≤k≤ 10·n) — количество рядов мест в самолёте и количество пассажиров, которых нужно рассадить.Далее следует описание рядов мест самолёта по одному ряду в строке. Если очередной символ равен '-', то это проход между рядами. Если очередной символ равен '.', то это свободное место. Если очередной символ равен 'S', то на текущем месте будет сидеть статусный пассажир. Если очередной символ равен 'P', то на текущем месте будет сидеть обычный пассажир.Гарантируется, что количество свободных мест не меньшеk. Гарантируется, что все ряды удовлетворяют описанному в условии формату.Выходные данныеВ первую строку выведите минимальное суммарное число соседей у статусных пассажиров.Далее выведите план рассадки пассажиров, который минимизирует суммарное количество соседей у статусных пассажиров, в том же формате, что и во входных данных. Если в свободное место нужно посадить одного изkпассажиров, выведите строчную букву 'x' вместо символа '.'.ПримерыВходные данные1 2SP.-SS.S-S.SВыходные данные5SPx-SSxS-S.SВходные данные4 9PP.-PPPS-S.SPSP-PPSP-.S..S.-S..P-SS.P.S-P.PP-PSPВыходные данные15PPx-PPPS-S.SPSP-PPSP-xSxxSx-SxxP-SSxP.S-PxPP-PSPПримечаниеВ первом примере нужно посадить ещё двух обычных пассажиров. Для минимизации соседей у статусных пассажиров, нужно посадить первого из них на третье слева место, а второго на любое из оставшихся двух мест, так как независимо от выбора места он станет соседом двух статусных пассажиров.Изначально, у статусного пассажира, который сидит на самом левом месте уже есть сосед. Также на четвёртом и пятом местах слева сидят статусные пассажиры, являющиеся соседями друг для друга (что добавляет к сумме2).Таким образом, после посадки ещё двух обычных пассажиров, итоговое суммарное количество соседей у статусных пассажиров станет равно пяти.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "16b4df11", "template_md5": "35d339e4", "result": "There are $n$ rows of seats on an airplane. Each row has 3 seats on the left, an aisle, 4 seats in the middle, another aisle, and 3 seats on the right. Some seats are already occupied by passengers, either \"status\" (frequent flyers) or \"normal\".\n\nYou need to seat $k$ more normal passengers.  The goal is to minimize the total number of neighbors that the status passengers have. Two passengers are neighbors if they are in the same row and there are no other seats or aisles between them.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$ ($1 \\le n \\le 100$, $1 \\le k \\le 10n$), representing the number of rows and the number of passengers to seat.\n* The following $n$ lines describe each row of seats. \n    * '-' represents an aisle.\n    * '.' represents an empty seat.\n    * 'S' represents a status passenger.\n    * 'P' represents a normal passenger.\n\n**Output:**\n\n* The first line should contain the minimum total number of neighbors for the status passengers.\n* The second part of the output should be a representation of the seating arrangement after placing the $k$ new passengers, using the same format as the input.  Place an 'x' in an empty seat where a new passenger is seated."}, {"prompt_md5": "73db9da0", "template_md5": "465699a0", "result": "You are given a plane layout with rows of seats arranged in a specific pattern. Some seats are already occupied by \"important\" passengers. You need to place a certain number of new passengers in the remaining empty seats to minimize the total number of \"important\" passengers who have a neighbor. Two passengers are considered neighbors if they are in the same row and there are no empty seats between them."}]}