{"uid": "931-B", "url": "https://codeforces.com/contest/931/problem/B", "tags": ["constructive algorithms", " implementation"], "title": "931-B", "statement": "B. World Cuptime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe last stage of Football World Cup is played using the play-off system.There arenteams left in this stage, they are enumerated from1ton. Several rounds are held, in each round the remaining teams are sorted in the order of their ids, then the first in this order plays with the second, the third — with the fourth, the fifth — with the sixth, and so on. It is guaranteed that in each round there is even number of teams. The winner of each game advances to the next round, the loser is eliminated from the tournament, there are no draws. In the last round there is the only game with two remaining teams: the round is called the Final, the winner is called the champion, and the tournament is over.Arkady wants his two favorite teams to play in the Final. Unfortunately, the team ids are already determined, and it may happen that it is impossible for teams to meet in the Final, because they are to meet in some earlier stage, if they are strong enough. Determine, in which round the teams with idsaandbcan meet.InputThe only line contains three integersn,aandb(2 ≤n≤ 256,1 ≤a,b≤n) — the total number of teams, and the ids of the teams that Arkady is interested in.It is guaranteed thatnis such that in each round an even number of team advance, and thataandbare not equal.OutputIn the only line print \"Final!\" (without quotes), if teamsaandbcan meet in the Final.Otherwise, print a single integer — the number of the round in which teamsaandbcan meet. The round are enumerated from1.ExamplesInput4 1 2Output1Input8 2 6OutputFinal!Input8 7 5Output2NoteIn the first example teams1and2meet in the first round.In the second example teams2and6can only meet in the third round, which is the Final, if they win all their opponents in earlier rounds.In the third example the teams with ids7and5can meet in the second round, if they win their opponents in the first round.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f7f31080", "template_md5": "35d339e4", "result": "There are $n$ teams in a tournament. Teams are numbered from 1 to $n$.  In each round, the teams are paired up and play each other. The winner of each match advances to the next round. The tournament continues until only two teams remain, who play in the final.\n\nGiven two teams, $a$ and $b$, determine the round in which they will play each other, or \"Final!\" if they will play in the final. \n\nInput:\n\nThe first line contains three integers: $n$, $a$, and $b$ ($2 \\le n \\le 256$, $1 \\le a, b \\le n$).\n\nOutput:\n\nPrint the round in which teams $a$ and $b$ will play each other, or \"Final!\" if they will play in the final."}, {"prompt_md5": "4f8d13a1", "template_md5": "465699a0", "result": "You are given a number of teams and the IDs of two specific teams. Teams are paired up and play each other in a tournament. The winner of each match advances to the next round.  Determine the round in which the two specified teams will play each other, or if they will play in the final round."}]}