{"uid": "932-F", "url": "https://codeforces.com/contest/932/problem/F", "tags": ["data structures", " dp", " geometry"], "title": "932-F", "statement": "F. Escape Through Leaftime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a tree withnnodes (numbered from1ton) rooted at node1. Also, each node has two values associated with it. The values fori-th node areaiandbi.You can jump from a node to any node in its subtree. The cost of one jump from nodexto nodeyis the product ofaxandby. The total cost of a path formed by one or more jumps is sum of costs of individual jumps. For every node, calculate the minimum total cost to reach any leaf from that node. Pay attention, that root can never be leaf, even if it has degree1.Note that you cannot jump from a node to itself.InputThe first line of input contains an integern(2 ≤n≤ 105) — the number of nodes in the tree.The second line containsnspace-separated integersa1,a2,  ...,an( - 105≤ai≤  105).The third line containsnspace-separated integersb1,b2,  ...,bn( - 105≤bi≤  105).Nextn-  1lines contains two space-separated integersuiandvi(1 ≤ui,vi≤n) describing edge between nodesuiandviin the tree.OutputOutputnspace-separated integers,i-th of which denotes the minimum cost of a path from nodeito reach any leaf.ExamplesInput32 10 -17 -7 52 32 1Output10 50 0Input45 -10 5 7-8 -80 -3 -102 12 41 3Output-300 100 0 0NoteIn the first example, node3is already a leaf, so the cost is0. For node2, jump to node3with costa2×b3= 50. For node1, jump directly to node3with costa1×b3= 10.In the second example, node3and node4are leaves, so the cost is0. For node2, jump to node4with costa2×b4= 100. For node1, jump to node2with costa1×b2=  - 400followed by a jump from2to4with costa2×b4= 100.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "11946d2c", "template_md5": "35d339e4", "result": "You are given a tree with $n$ nodes (numbered from 1 to $n$) rooted at node 1. Each node has two values associated with it: $a_i$ and $b_i$. \n\nYou can jump from a node to any node in its subtree. The cost of one jump from node $x$ to node $y$ is the product of $a_x$ and $b_y$. The total cost of a path formed by one or more jumps is the sum of the costs of individual jumps.\n\nFor every node, calculate the minimum total cost to reach any leaf from that node.  \n\n**Input:**\n\n* The first line contains an integer $n$ (2 ≤ $n$ ≤ 10⁵) — the number of nodes in the tree.\n* The second line contains $n$ space-separated integers $a_1$, $a_2$, ..., $a_n$ (-10⁵ ≤ $a_i$ ≤ 10⁵).\n* The third line contains $n$ space-separated integers $b_1$, $b_2$, ..., $b_n$ (-10⁵ ≤ $b_i$ ≤ 10⁵).\n* The next $n-1$ lines contain two space-separated integers $u_i$ and $v_i$ (1 ≤ $u_i$, $v_i$ ≤ $n$) describing an edge between nodes $u_i$ and $v_i$ in the tree.\n\n**Output:**\n\nOutput $n$ space-separated integers, the $i$-th of which denotes the minimum cost of a path from node $i$ to reach any leaf."}, {"prompt_md5": "a8b0ec09", "template_md5": "465699a0", "result": "You have a tree-shaped structure with numbered nodes. Each node has two values. You can travel between nodes in the tree by \"jumping\" from a node to any node within its branch. The cost of a jump is the product of the two values of the starting and ending nodes.  Find the minimum total cost to reach any leaf (end node) from each node in the tree."}]}