{"uid": "932-A", "url": "https://codeforces.com/contest/932/problem/A", "tags": ["constructive algorithms"], "title": "932-A", "statement": "A. Palindromic Supersequencetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a stringA. Find a stringB, whereBis a palindrome andAis a subsequence ofB.A subsequence of a string is a string that can be derived from it by deleting some (not necessarily consecutive) characters without changing the order of the remaining characters. For example, \"cotst\" is a subsequence of \"contest\".A palindrome is a string that reads the same forward or backward.The length of stringBshould be at most104. It is guaranteed that there always exists such string.You do not need to find the shortest answer, the only restriction is that the length of stringBshould not exceed104.InputFirst line contains a stringA(1 ≤ |A| ≤ 103) consisting of lowercase Latin letters, where|A|is a length ofA.OutputOutput single line containingBconsisting of only lowercase Latin letters. You do not need to find the shortest answer, the only restriction is that the length of stringBshould not exceed104. If there are many possibleB, print any of them.ExamplesInputabaOutputabaInputabOutputaabaaNoteIn the first example, \"aba\" is a subsequence of \"aba\" which is a palindrome.In the second example, \"ab\" is a subsequence of \"aabaa\" which is a palindrome.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "35c793cc", "template_md5": "35d339e4", "result": "You are given a string $A$. Find a palindrome string $B$ where $A$ is a subsequence of $B$.  The length of $B$ should be at most $10^4$. \n\n**Example:**\n\n* **Input:** $A = \"aba\"$\n* **Output:** $B = \"aba\"$ \n\n\nLet me know if you'd like me to explain any part of this in more detail!"}, {"prompt_md5": "bea40d7a", "template_md5": "465699a0", "result": "Given a string, find a palindrome string that contains the original string as a subsequence.  The length of the palindrome string cannot exceed 100,000 characters."}]}