{"uid": "933-A", "url": "https://codeforces.com/contest/933/problem/A", "tags": ["dp"], "title": "933-A", "statement": "A. A Twisty Movementtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA dragon symbolizes wisdom, power and wealth. On Lunar New Year's Day, people model a dragon with bamboo strips and clothes, raise them with rods, and hold the rods high and low to resemble a flying dragon.A performer holding the rod low is represented by a1, while one holding it high is represented by a2. Thus, the line of performers can be represented by a sequencea1,a2, ...,an.Little Tommy is among them. He would like to choose an interval[l,r](1 ≤l≤r≤n), then reverseal,al+ 1, ...,arso that the length of the longest non-decreasing subsequence of the new sequence is maximum.A non-decreasing subsequence is a sequence of indicesp1,p2, ...,pk, such thatp1<p2< ... <pkandap1≤ap2≤ ... ≤apk. The length of the subsequence isk.InputThe first line contains an integern(1 ≤n≤ 2000), denoting the length of the original sequence.The second line containsnspace-separated integers, describing the original sequencea1,a2, ...,an(1 ≤ai≤ 2,i= 1, 2, ...,n).OutputPrint a single integer, which means the maximum possible length of the longest non-decreasing subsequence of the new sequence.ExamplesInput41 2 1 2Output4Input101 1 2 2 2 1 1 2 2 1Output9NoteIn the first example, after reversing[2, 3], the array will become[1, 1, 2, 2], where the length of the longest non-decreasing subsequence is4.In the second example, after reversing[3, 7], the array will become[1, 1, 1, 1, 2, 2, 2, 2, 2, 1], where the length of the longest non-decreasing subsequence is9.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d7683e39", "template_md5": "35d339e4", "result": "You are given a sequence of numbers, where each number is either 1 or 2.  You can choose a sub-sequence within the sequence and reverse it.  What is the maximum length of a non-decreasing subsequence in the modified sequence?\n\nA non-decreasing subsequence is a sequence of numbers within the original sequence where each number is greater than or equal to the previous number. \n\n\nFor example:\n\nInput: [1, 2, 1, 2]\n\nOutput: 4 \n\nExplanation:\n\nReversing the sub-sequence [2, 1] results in [1, 1, 2, 2]. The longest non-decreasing subsequence in this modified sequence is [1, 1, 2, 2] with a length of 4."}, {"prompt_md5": "6d5da4d9", "template_md5": "465699a0", "result": "You are given a sequence of 0s and 1s. You can choose a segment of the sequence and reverse it. What is the longest possible increasing subsequence you can create after reversing a segment?"}]}