{"uid": "933-D", "url": "https://codeforces.com/contest/933/problem/D", "tags": ["brute force", " combinatorics", " math"], "title": "933-D", "statement": "D. A Creative Cutouttime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEverything red frightens Nian the monster. So do red paper and... you, red on Codeforces, potential or real.Big Banban has got a piece of paper with endless lattice points, where lattice points form squares with the same area. His most favorite closed shape is the circle because of its beauty and simplicity. Once he had obtained this piece of paper, he prepares it for paper-cutting.He drewnconcentric circles on it and numbered these circles from1tonsuch that the center of each circle is the same lattice point and the radius of thek-th circle istimes the length of a lattice edge.Define the degree of beauty of a lattice point as the summation of theindicesof circles such that this lattice point is inside them, or on their bounds. Banban wanted to ask you the total degree of beauty of all the lattice points, but changed his mind.Defining the total degree of beauty of all the lattice points on a piece of paper withncircles asf(n), you are asked to figure out.InputThe first line contains one integerm(1 ≤m≤ 1012).OutputIn the first line print one integer representing.ExamplesInput5Output387Input233Output788243189NoteA piece of paper with5circles is shown in the following.There are5types of lattice points where the degree of beauty of each red point is1 + 2 + 3 + 4 + 5 = 15, the degree of beauty of each orange point is2 + 3 + 4 + 5 = 14, the degree of beauty of each green point is4 + 5 = 9, the degree of beauty of each blue point is5and the degree of beauty of each gray point is0. Therefore,f(5) = 5·15 + 4·14 + 4·9 + 8·5 = 207.Similarly,f(1) = 5,f(2) = 23,f(3) = 50,f(4) = 102and consequently.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "dfff7df6", "template_md5": "35d339e4", "result": "You are given an integer $m$.  \n\nCalculate the total degree of beauty of all lattice points on a piece of paper with $m$ concentric circles.\n\nThe circles are centered at the same lattice point and the radius of the $k$-th circle is $k$ times the length of a lattice edge.\n\nThe degree of beauty of a lattice point is the sum of the indices of the circles that contain the point (either inside or on the boundary).\n\nLet $f(n)$ represent the total degree of beauty of all lattice points on a piece of paper with $n$ circles.  Find $f(m)$."}, {"prompt_md5": "27049498", "template_md5": "465699a0", "result": "You are given a number *m*. Calculate the sum of a specific function for all integers from 1 to *m*. The function's value for a given integer *n* is the total degree of beauty of all lattice points on a piece of paper with *n* concentric circles. The degree of beauty of a lattice point is the sum of the indices of the circles that contain it."}]}