{"uid": "934-A", "url": "https://codeforces.com/contest/934/problem/A", "tags": ["brute force", " games"], "title": "934-A", "statement": "A. A Compatible Pairtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputNian is a monster which lives deep in the oceans. Once a year, it shows up on the land, devouring livestock and even people. In order to keep the monster away, people fill their villages with red colour, light, and cracking noise, all of which frighten the monster out of coming.Little Tommy hasnlanterns and Big Banban hasmlanterns. Tommy's lanterns have brightnessa1,a2, ...,an, and Banban's have brightnessb1,b2, ...,bmrespectively.Tommy intends to hide one of his lanterns, then Banban picks one of Tommy's non-hidden lanterns and one of his own lanterns to form a pair. The pair's brightness will be the product of the brightness of two lanterns.Tommy wants to make the product as small as possible, while Banban tries to make it as large as possible.You are asked to find the brightness of the chosen pair if both of them choose optimally.InputThe first line contains two space-separated integersnandm(2 ≤n,m≤ 50).The second line containsnspace-separated integersa1,a2, ...,an.The third line containsmspace-separated integersb1,b2, ...,bm.All the integers range from- 109to109.OutputPrint a single integer — the brightness of the chosen pair.ExamplesInput2 220 182 14Output252Input5 3-1 0 1 2 3-1 0 1Output2NoteIn the first example, Tommy will hide20and Banban will choose18from Tommy and14from himself.In the second example, Tommy will hide3and Banban will choose2from Tommy and1from himself.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f300d929", "template_md5": "35d339e4", "result": "You are given two arrays of integers,  $a$ of length $n$ and $b$ of length $m$.  \n\n*  One player chooses one element from array $a$ to hide.\n* The other player chooses one element from the remaining elements in array $a$ and one element from array $b$.\n* The players want to minimize and maximize the product of the chosen elements, respectively.\n\nFind the product of the chosen elements when both players play optimally."}, {"prompt_md5": "cba4c969", "template_md5": "465699a0", "result": "Two people have lists of numbers. One person hides one number from their list. The other person chooses one number from the hidden list and one from their own list. They want to make the product of the two numbers as small (person 1) or as large (person 2) as possible. Find the resulting product."}]}