{"uid": "935-A", "url": "https://codeforces.com/contest/935/problem/A", "tags": ["brute force", " implementation"], "title": "935-A", "statement": "A. Fafa and his Companytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputFafa owns a company that works on huge projects. There arenemployees in Fafa's company. Whenever the company has a new project to start working on, Fafa has to divide the tasks of this project among all the employees.Fafa finds doing this every time is very tiring for him. So, he decided to choose the bestlemployees in his company as team leaders. Whenever there is a new project, Fafa will divide the tasks among only the team leaders and each team leader will be responsible of some positive number of employees to give them the tasks. To make this process fair for the team leaders, each one of them should be responsible for the same number of employees. Moreover, every employee, who is not a team leader, has to be under the responsibility of exactly one team leader, and no team leader is responsible for another team leader.Given the number of employeesn, find in how many ways Fafa could choose the number of team leaderslin such a way that it is possible to divide employees between them evenly.InputThe input consists of a single line containing a positive integern(2 ≤n≤ 105) — the number of employees in Fafa's company.OutputPrint a single integer representing the answer to the problem.ExamplesInput2Output1Input10Output3NoteIn the second sample Fafa has 3 ways:choose only1employee as a team leader with9employees under his responsibility.choose2employees as team leaders with4employees under the responsibility of each of them.choose5employees as team leaders with1employee under the responsibility of each of them.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4ec3cef5", "template_md5": "35d339e4", "result": "Given a positive integer $n$ representing the number of employees, find the number of ways to choose a number of team leaders $l$ such that:\n\n* Each team leader is responsible for the same number of employees.\n* Every employee is under the responsibility of exactly one team leader.\n* No team leader is responsible for another team leader."}, {"prompt_md5": "5461f201", "template_md5": "465699a0", "result": "You are given a number of people.  Find the number of ways to divide them into groups of equal size, where each group is led by one person."}]}