{"uid": "936-D", "url": "https://codeforces.com/contest/936/problem/D", "tags": ["dp", " greedy"], "title": "936-D", "statement": "D. World of Tanktime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputVitya loves programming and problem solving, but sometimes, to distract himself a little, he plays computer games. Once he found a new interesting game about tanks, and he liked it so much that he went through almost all levels in one day. Remained only the last level, which was too tricky. Then Vitya remembered that he is a programmer, and wrote a program that helped him to pass this difficult level. Try do the same.The game is organized as follows. There is a long road, two cells wide andncells long. Some cells have obstacles. You control a tank that occupies one cell. Initially, the tank is located before the start of the road, in a cell with coordinates(0, 1). Your task is to move the tank to the end of the road, to the cell(n+ 1, 1)or(n+ 1, 2).Every second the tank moves one cell to the right: the coordinatexis increased by one. When you press the up or down arrow keys, the tank instantly changes the lane, that is, theycoordinate. When you press the spacebar, the tank shoots, and the nearest obstacle along the lane in which the tank rides is instantly destroyed. In order to load a gun, the tank needstseconds. Initially, the gun is not loaded, that means, the first shot can be made only aftertseconds after the tank starts to move.If at some point the tank is in the same cell with an obstacle not yet destroyed, it burns out. If you press the arrow exactly at the moment when the tank moves forward, the tank will first move forward, and then change the lane, so it will not be possible to move diagonally.Your task is to find out whether it is possible to pass the level, and if possible, to find the order of actions the player need to make.InputThe first line contains four integersn,m1,m2andt, the length of the field, the number of obstacles in the first lane, the number of obstacles in the second lane and the number of tank steps before reloading, respectively (1 ≤n≤ 109;0 ≤m1,m2≤n;0 ≤m1+m2≤ 106;1 ≤t≤n).The next two lines contain a description of the obstacles. The first of these lines containsm1numbersxi— the obstacle coordinates in the first lane (1 ≤xi≤n;xi<xi+ 1). Theycoordinate for all these obstacles will be1.The second line containsm2numbers describing the obstacles of the second lane in the same format. Theycoordinate of all these obstacles will be2.OutputIn the first line print «Yes», if it is possible to pass the level, or «No», otherwise.If it is possible, then in the second line print the number of times the tank moves from one lane to another, and in the next line print the coordinates of the transitions, one number per transition: the coordinatex(0 ≤x≤n+ 1). All transition coordinates coordinates must be distinct and should be output in strictly increasing order.The number of transitions should not exceed2·106. If the tank can pass the level, then it can do it using no more than2·106transitions.In the fourth line print the number of shots that the tank makes during the movement, in the following lines print two numbers,xandycoordinates of the point (1 ≤x≤n,1 ≤y≤ 2), from which the tank fired a shot, the number of shots must not exceedm1+m2. Shots must be output in the order in which they are fired.If there are several solutions, output any one.ExamplesInput6 2 3 22 63 5 6OutputYes20 322 24 1Input1 1 1 111OutputNoInput9 5 2 51 2 7 8 94 6OutputYes40 3 5 1015 2NotePicture for the first sample test.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3059de5b", "template_md5": "35d339e4", "result": "You control a tank on a road of length $n$ cells, two cells wide. Some cells have obstacles. The tank starts before the road, at coordinates $(0,1)$. Your goal is to move the tank to the end of the road, at either $(n+1,1)$ or $(n+1,2)$.\n\nHere's how the tank moves:\n\n* **Movement:** The tank moves one cell to the right each second (increasing the $x$ coordinate).\n* **Lane Change:** Pressing up or down arrow keys instantly changes the tank's lane (the $y$ coordinate).\n* **Shooting:** Pressing the spacebar shoots, destroying the nearest obstacle in the tank's current lane. The tank needs $t$ seconds to reload after shooting.\n\n**Rules:**\n\n* The tank cannot move diagonally.\n* If the tank lands on a cell with an obstacle, it is destroyed.\n\n**Your task:**\n\n1. Determine if it's possible to move the tank to the end of the road without being destroyed.\n2. If possible, output the sequence of actions (lane changes and shots) needed to reach the end.\n\n**Input:**\n\n* Four integers: $n$, $m_1$, $m_2$, $t$\n    * $n$: Length of the road\n    * $m_1$: Number of obstacles in the first lane\n    * $m_2$: Number of obstacles in the second lane\n    * $t$: Seconds to reload after shooting\n* Two lines:\n    * First line: $m_1$ integers, the $x$ coordinates of obstacles in the first lane.\n    * Second line: $m_2$ integers, the $x$ coordinates of obstacles in the second lane.\n\n**Output:**\n\n* \"Yes\" if the tank can reach the end, \"No\" otherwise.\n* If \"Yes\":\n    * Number of lane changes\n    * List of $x$ coordinates where lane changes occur (in increasing order)\n    * Number of shots fired\n    * For each shot, output the $x$ and $y$ coordinates of the shot location."}, {"prompt_md5": "35f0c50e", "template_md5": "465699a0", "result": "A tank must travel across a road with obstacles. The tank can move one cell to the right each second, change lanes using up/down arrows, and shoot to destroy obstacles using a spacebar (after a delay). The goal is to reach the end of the road without hitting an obstacle. Determine if this is possible and, if so, provide a sequence of moves (lane changes and shots) to achieve it."}]}