{"uid": "937-B", "url": "https://codeforces.com/contest/937/problem/B", "tags": ["brute force", " math", " number theory"], "title": "937-B", "statement": "B. Vile Grasshopperstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe weather is fine today and hence it's high time to climb the nearby pine and enjoy the landscape.The pine's trunk includes several branches, located one above another and numbered from2toy. Some of them (more precise, from2top) are occupied by tiny vile grasshoppers which you're at war with. These grasshoppers are known for their awesome jumping skills: the grasshopper at branchxcan jump to branches.Keeping this in mind, you wisely decided to choose such a branch that none of the grasshoppers could interrupt you. At the same time you wanna settle as high as possible since the view from up there is simply breathtaking.In other words, your goal is to find the highest branch that cannot be reached by any of the grasshoppers or report that it's impossible.InputThe only line contains two integerspandy(2 ≤p≤y≤ 109).OutputOutput the number of the highest suitable branch. If there are none, print-1instead.ExamplesInput3 6Output5Input3 4Output-1NoteIn the first sample case grasshopper from branch2reaches branches2,4and6while branch3is initially settled by another grasshopper. Therefore the answer is5.It immediately follows that there are no valid branches in second sample case.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "30ba0044", "template_md5": "35d339e4", "result": "You are given two integers, $p$ and $y$ ($2 \\le p \\le y \\le 10^9$).  There are branches numbered from $2$ to $y$.  Some branches, from $2$ to $top$, have grasshoppers on them. Each grasshopper on branch $x$ can jump to branches $x+1$, $x+2$, ..., $x+k$ where $k$ is a positive integer.\n\nFind the highest branch number that does not have a grasshopper that can jump to it. If there is no such branch, output $-1$."}, {"prompt_md5": "87ef8383", "template_md5": "465699a0", "result": "You are given a number of levels, some of which have enemies.  Find the highest level that does not have an enemy, or report that there are none."}]}