{"uid": "938-C", "url": "https://codeforces.com/contest/938/problem/C", "tags": ["binary search", " brute force", " constructive algorithms"], "title": "938-C", "statement": "C. Constructing Teststime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLet's denote am-free matrix as a binary (that is, consisting of only1's and0's) matrix such that every square submatrix of sizem×mof this matrix contains at least one zero.Consider the following problem:You are given two integersnandm. You have to construct anm-free square matrix of sizen×nsuch thatthe number of1's in this matrix is maximum possible. Print the maximum possible number of1's in such matrix.You don't have to solve this problem. Instead, you have to construct a few tests for it.You will be giventnumbersx1,x2, ...,xt. For every, find two integersniandmi(ni≥mi) such that the answer for the aforementioned problem is exactlyxiif we setn=niandm=mi.InputThe first line contains one integert(1 ≤t≤ 100) — the number of tests you have to construct.Thentlines follow,i-th line containing one integerxi(0 ≤xi≤ 109).Note that in hacks you have to sett= 1.OutputFor each test you have to construct, output two positive numbersniandmi(1 ≤mi≤ni≤ 109) such that the maximum number of1's in ami-freeni×nimatrix is exactlyxi. If there are multiple solutions, you may output any of them; and if this is impossible to construct a test, output a single integer- 1.ExampleInput32101Output5 21 1-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "0817cb74", "template_md5": "35d339e4", "result": "You are given a number $t$. For each of the following $t$ numbers, you need to find two integers $n$ and $m$ ($m \\le n$) such that the maximum number of 1's in an $n \\times n$ matrix with the following property is equal to the given number:\n\n* Every square submatrix of size $m \\times m$ in the matrix must contain at least one 0.\n\n**Input:**\n\n* The first line contains the number $t$.\n* The next $t$ lines each contain a single integer.\n\n**Output:**\n\n* For each input integer, output two integers $n$ and $m$ that satisfy the condition. If no such $n$ and $m$ exist, output -1."}, {"prompt_md5": "507147ff", "template_md5": "465699a0", "result": "You are given a number.  Find two numbers, n and m, where n is greater than or equal to m, such that the maximum number of \"1\"s you can put in an n x m grid of squares, with the rule that every square subgrid of size m x m must have at least one \"0\", equals the given number. If no such n and m exist, output -1."}]}