{"uid": "938-D", "url": "https://codeforces.com/contest/938/problem/D", "tags": ["data structures", " graphs", " shortest paths"], "title": "938-D", "statement": "D. Buy a Tickettime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMusicians of a popular band \"Flayer\" have announced that they are going to \"make their exit\" with a world tour. Of course, they will visit Berland as well.There arencities in Berland. People can travel between cities using two-directional train routes; there are exactlymroutes,i-th route can be used to go from cityvito cityui(and fromuitovi), and it costswicoins to use this route.Each city will be visited by \"Flayer\", and the cost of the concert ticket ini-th city isaicoins.You have friends in every city of Berland, and they, knowing about your programming skills, asked you to calculate the minimum possible number of coins they have to pay to visit the concert. For every cityiyou have to compute the minimum number of coins a person from cityihas to spend to travel to some cityj(or possibly stay in cityi), attend a concert there, and return to cityi(ifj≠i).Formally, for everyyou have to calculate, whered(i,j)is the minimum number of coins you have to spend to travel from cityito cityj. If there is no way to reach cityjfrom cityi, then we considerd(i,j)to be infinitely large.InputThe first line contains two integersnandm(2 ≤n≤ 2·105,1 ≤m≤ 2·105).Thenmlines follow,i-th contains three integersvi,uiandwi(1 ≤vi,ui≤n,vi≠ui,1 ≤wi≤ 1012) denotingi-th train route. There are no multiple train routes connecting the same pair of cities, that is, for each(v,u)neither extra(v,u)nor(u,v)present in input.The next line containsnintegersa1,a2, ...ak(1 ≤ai≤ 1012) — price to attend the concert ini-th city.OutputPrintnintegers.i-th of them must be equal to the minimum number of coins a person from cityihas to spend to travel to some cityj(or possibly stay in cityi), attend a concert there, and return to cityi(ifj≠i).ExamplesInput4 21 2 42 3 76 20 1 25Output6 14 1 25Input3 31 2 12 3 11 3 130 10 20Output12 10 12", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3f2b3987", "template_md5": "35d339e4", "result": "There are $n$ cities and $m$ train routes connecting them. Each route connects two distinct cities and has a cost $w_i$ to travel.  The $i$-th city has a concert ticket price of $a_i$.\n\nYou need to find the minimum cost for each city $i$ to:\n\n1. Travel to a city (possibly the same city)\n2. Attend the concert in that city\n3. Return to city $i$.\n\nIf there is no way to reach a city from city $i$, the cost is considered infinite. \n\n\n\nOutput $n$ integers, where the $i$-th integer is the minimum cost for a person in city $i$."}, {"prompt_md5": "cd6c1ac5", "template_md5": "465699a0", "result": "You have a map with cities connected by roads. Each road has a cost to travel.  In each city, there is a concert with a ticket price.  Find the minimum cost for someone in each city to attend a concert (in any city) and return home."}]}