{"uid": "939-E", "url": "https://codeforces.com/contest/939/problem/E", "tags": ["binary search", " greedy", " ternary search", " two pointers"], "title": "939-E", "statement": "E. Maximize!time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a multisetSconsisting of positive integers (initially empty). There are two kind of queries:Add a positive integer toS, the newly added integer is not less than any number in it.Find a subsetsof the setSsuch that the valueis maximum possible. Heremax(s)means maximum value of elements ins,— the average value of numbers ins. Output this maximum possible value of.InputThe first line contains a single integerQ(1 ≤Q≤ 5·105) — the number of queries.Each of the nextQlines contains a description of query. For queries of type1two integers1andxare given, wherex(1 ≤x≤ 109) is a number that you should add toS. It's guaranteed thatxis not less than any number inS. For queries of type2, a single integer2is given.It's guaranteed that the first query has type1, i. e.Sis not empty when a query of type2comes.OutputOutput the answer for each query of the second type in the order these queries are given in input. Each number should be printed in separate line.Your answer is considered correct, if each of your answers has absolute or relative error not greater than10- 6.Formally, let your answer bea, and the jury's answer beb. Your answer is considered correct if.ExamplesInput61 321 421 82Output0.00000000000.50000000003.0000000000Input41 11 41 52Output2.0000000000", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "debf1d1c", "template_md5": "35d339e4", "result": "You are given a set of positive integers. You can add new positive integers to the set, but each new integer must be greater than or equal to all existing integers in the set.\n\nYou need to process a series of queries. Some queries will ask you to add a new integer to the set. Other queries will ask you to find the largest possible average value of a subset of the integers in the set. \n\nOutput the largest possible average value for each query of this type. \n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "6a7cf41d", "template_md5": "465699a0", "result": "You are given a set of numbers. You can add new numbers to the set, but each new number must be larger than all existing numbers.  You need to repeatedly find the subset of numbers in the set that has the largest average value. Output the largest average value for each request."}]}