{"uid": "94-B", "url": "https://codeforces.com/contest/94/problem/B", "tags": ["graphs", " implementation", " math"], "title": "94-B", "statement": "B. Friendstime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutOne day Igor K. stopped programming and took up math. One late autumn evening he was sitting at a table reading a book and thinking about something.The following statement caught his attention: \"Among any six people there are either three pairwise acquainted people or three pairwise unacquainted people\"Igor just couldn't get why the required minimum is 6 people. \"Well, that's the same for five people, too!\" — he kept on repeating in his mind. — \"Let's take, say, Max, Ilya, Vova — here, they all know each other! And now let's add Dima and Oleg to Vova — none of them is acquainted with each other! Now, that math is just rubbish!\"Igor K. took 5 friends of his and wrote down who of them is friends with whom. Now he wants to check whether it is true for the five people that among them there are either three pairwise acquainted or three pairwise not acquainted people.InputThe first line contains an integerm(0 ≤m≤ 10), which is the number of relations of acquaintances among the five friends of Igor's.Each of the followingmlines contains two integersaiandbi(1 ≤ai,bi≤ 5;ai≠bi), where (ai,bi) is a pair of acquainted people. It is guaranteed that each pair of the acquaintances is described exactly once. The acquaintance relation is symmetrical, i.e. ifxis acquainted withy, thenyis also acquainted withx.OutputPrint \"FAIL\", if among those five people there are no either three pairwise acquainted or three pairwise unacquainted people. Otherwise print \"WIN\".ExamplesInput41 32 31 45 3OutputWINInput51 22 33 44 55 1OutputFAIL", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5b7dad7d", "template_md5": "35d339e4", "result": "You are given a set of $5$ people and information about which pairs of people are friends.  Determine if there are either:\n\n*  Three people in the set who are all friends with each other.\n*  Three people in the set who are not friends with each other. \n\nIf either of these conditions is true, print \"WIN\". Otherwise, print \"FAIL\"."}, {"prompt_md5": "27d89867", "template_md5": "465699a0", "result": "You are given a list of friendships between 5 people. Determine if there are either three people who all know each other, or three people who don't know each other."}]}