{"uid": "940-C", "url": "https://codeforces.com/contest/940/problem/C", "tags": ["constructive algorithms", " implementation", " strings"], "title": "940-C", "statement": "C. Phone Numberstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAnd where the are the phone numbers?You are given a stringsconsisting of lowercase English letters and an integerk. Find the lexicographically smallest stringtof lengthk, such that its set of letters is a subset of the set of letters ofsandsis lexicographically smaller thant.It's guaranteed that the answer exists.Note that the set of letters is a set, not a multiset. For example, the set of letters ofabadabais{a,b,d}.Stringpis lexicographically smaller than stringq, ifpis a prefix ofq, is not equal toqor there existsi, such thatpi<qiand for allj<iit is satisfied thatpj=qj. For example,abcis lexicographically smaller thanabcd,abdis lexicographically smaller thanabec,afais notlexicographically smaller thanabandais notlexicographically smaller thana.InputThe first line of input contains two space separated integersnandk(1 ≤n,k≤ 100 000) — the length ofsand the required length oft.The second line of input contains the stringsconsisting ofnlowercase English letters.OutputOutput the stringtconforming to the requirements above.It's guaranteed that the answer exists.ExamplesInput3 3abcOutputacaInput3 2abcOutputacInput3 3ayyOutputyaaInput2 3baOutputbaaNoteIn the first example the list of stringstof length 3, such that the set of letters oftis a subset of letters ofsis as follows:aaa,aab,aac,aba,abb,abc,aca,acb,.... Among them, those are lexicographically greater thanabc:aca,acb,.... Out of those the lexicographically smallest isaca.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "98351147", "template_md5": "35d339e4", "result": "You are given a string $s$ of lowercase letters and an integer $k$. Find the lexicographically smallest string $t$ of length $k$ such that all the letters in $t$ are also present in $s$. \n\n**Example:**\n\nIf $s = \"abc\"$ and $k = 3$, the answer is \"aca\"."}, {"prompt_md5": "8da5b149", "template_md5": "465699a0", "result": "You are given a word and a number k. Find the shortest word of length k that uses only letters from the original word, and is alphabetically smaller than the original word."}]}