{"uid": "946-F", "url": "https://codeforces.com/contest/946/problem/F", "tags": ["combinatorics", " dp", " matrices"], "title": "946-F", "statement": "F. Fibonacci String Subsequencestime limit per test3.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a binary strings(each character of this string is either0or1).Let's denote the cost of stringtas the number of occurences ofsint. For example, ifsis11andtis111011, then the cost oftis3.Let's also denote the Fibonacci strings sequence as follows:F(0)is0;F(1)is1;F(i) =F(i- 1) +F(i- 2)ifi> 1, where+means the concatenation of two strings.Your task is to calculate the sum of costs of all subsequences of the stringF(x). Since answer may be large, calculate it modulo109+ 7.InputThe first line contains two integersnandx(1 ≤n≤ 100,0 ≤x≤ 100) — the length ofsand the index of a Fibonacci string you are interested in, respectively.The second line containss— a string consisting ofncharacters. Each of these characters is either0or1.OutputPrint the only integer — the sum of costs of all subsequences of the stringF(x), taken modulo109+ 7.ExamplesInput2 411Output14Input10 1001010101010Output553403224", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "63daaddd", "template_md5": "35d339e4", "result": "You are given a binary string of length $n$ consisting of 0s and 1s.  The cost of a string is the number of times the substring \"11\" appears in it.\n\nThe Fibonacci sequence is defined as follows:\n\n* $F(0) = 0$\n* $F(1) = 1$\n* $F(i) = F(i-1) + F(i-2)$ for $i > 1$\n\nwhere \"+\" means concatenation of strings.\n\nYou are given an index $x$. Calculate the sum of the costs of all subsequences of the Fibonacci string $F(x)$.  The answer may be large, so calculate it modulo $10^9 + 7$."}, {"prompt_md5": "ffedbdb1", "template_md5": "465699a0", "result": "You are given a binary string.  Calculate the sum of how many times a specific pattern appears in all possible subsequences of a Fibonacci string of a given length. The answer should be given modulo 10^9 + 7."}]}