{"uid": "946-C", "url": "https://codeforces.com/contest/946/problem/C", "tags": ["greedy", " strings"], "title": "946-C", "statement": "C. String Transformationtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a stringsconsisting of|s|small english letters.In one move you can replace any character of this string to the next character in alphabetical order (awill be replaced withb,swill be replaced witht, etc.). You cannot replace letterzwith any other letter.Your target is to make some number of moves (not necessary minimal) to get stringabcdefghijklmnopqrstuvwxyz(english alphabet) as a subsequence. Subsequence of the string is the string that is obtained by deleting characters at some positions. You need to print the string that will be obtained from the given string and will be contain english alphabet as a subsequence or say that it is impossible.InputThe only one line of the input consisting of the stringsconsisting of|s|(1 ≤ |s| ≤ 105) small english letters.OutputIf you can get a string that can be obtained from the given string and will contain english alphabet as a subsequence, print it. Otherwise print «-1» (without quotes).ExamplesInputaacceeggiikkmmooqqssuuwwyyOutputabcdefghijklmnopqrstuvwxyzInputthereisnoanswerOutput-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7b395af5", "template_md5": "35d339e4", "result": "You are given a string of lowercase English letters. You can change each letter to the next letter in the alphabet (a becomes b, s becomes t, etc.). You cannot change z to any other letter.  \n\nYour goal is to make changes to the string so that the English alphabet (a to z) appears somewhere within the modified string, even if some letters are missing. \n\nPrint the modified string if you can achieve this. If it's impossible, print \"-1\"."}, {"prompt_md5": "1aca8cb7", "template_md5": "465699a0", "result": "You are given a string of lowercase letters. You can change each letter to the next letter in the alphabet (a to b, s to t, etc.).  You cannot change z to any other letter.  \n\nYour goal is to change the string so that it contains all the letters of the alphabet in any order.  If this is possible, print the resulting string. If it's not possible, print \"-1\"."}]}