{"uid": "95-E", "url": "https://codeforces.com/contest/95/problem/E", "tags": ["dp", " dsu", " graphs"], "title": "95-E", "statement": "E. Lucky Countrytime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutPetya loves lucky numbers. Everybody knows that positive integers areluckyif their decimal representation doesn't contain digits other than4and7. For example, numbers47,744,4are lucky and5,17,467are not.One night Petya was sleeping. He was dreaming of being the president of some island country. The country is represented by islands connected by two-way roads. Between some islands there is no road way, even through other islands, that's why the country is divided into several regions. More formally, each island belongs to exactly one region, there is a path between any two islands located in the same region; there is no path between any two islands from different regions. A region is lucky if the amount of islands in it is a lucky number.As a real president, Petya first decided to build a presidential palace. Being a lucky numbers' fan, Petya wants to position his palace in one of the lucky regions. However, it is possible that initially the country has no such regions. In this case Petya can build additional roads between different regions, thus joining them. Find the minimum number of roads needed to build to create a lucky region.InputThe first line contains two integersnandm(1 ≤n,m≤ 105). They are the number of islands and the number of roads correspondingly. Nextmlines contain road descriptions. Each road is defined by the numbers of islands that it connects: that is, by two integersuandv(1 ≤u,v≤n). Some roads can connect an island with itself; there can be more than one road between a pair of islands. Numbers in each line are separated by exactly one space character.OutputIf there's no solution, output the only number \"-1\" (without the quotes). Otherwise, output the minimum number of roadsrthat need to be built to get a lucky region.ExamplesInput4 31 22 31 3Output1Input5 41 23 44 53 5Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3c61e501", "template_md5": "35d339e4", "result": "There are $n$ islands and $m$ roads connecting them. Each road connects two islands.  \n\nAn island group (region) is considered \"lucky\" if the number of islands in the group is a lucky number. A lucky number is a number that only contains the digits 4 and 7.\n\nFind the minimum number of roads that need to be built to connect islands and create at least one lucky region. If it's impossible to create a lucky region, output -1."}, {"prompt_md5": "59f8ea52", "template_md5": "465699a0", "result": "You are given a map of islands connected by roads.  Some islands form groups (regions) where you can travel between any island in the group.  A group is \"lucky\" if the number of islands in it is a number made only of the digits 4 and 7.  \n\nYou can build new roads to connect groups. What is the fewest roads you need to build to create at least one lucky group? If it's impossible, say -1."}]}