{"uid": "952-B", "url": "https://codeforces.com/contest/952/problem/B", "tags": ["brute force", " interactive"], "title": "952-B", "statement": "B. A Map of the Cattime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIf you have ever interacted with a cat, you have probably noticed that they are quite particular about how to pet them. Here is an approximate map of a normal cat.However, some cats won't tolerate this nonsense from the humans. Here is a map of a grumpy cat.You have met a cat. Can you figure out whether it's normal or grumpy?InteractionThis is an interactive problem. Initially you're not given any information about the cat. Instead, the cat is divided into ten areas, indexed from 0 to 9.In one query you can choose which area you'll pet and print the corresponding index to standard out. You will get the cat's response, as depicted on the corresponding map, via standard in. For simplicity all responses are written in lowercase.Once you're certain what type of cat you're dealing with, output \"normal\" or \"grumpy\" to standard out.NotePlease make sure to use the stream flushing operation after each query in order not to leave part of your output in some buffer.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "52c193c5", "template_md5": "35d339e4", "result": "You need to determine if a cat is normal or grumpy by interacting with it. \n\nThe cat is divided into 10 areas, numbered 0 to 9. You can choose one area to pet at a time.\n\nAfter petting an area, the cat will respond with a character indicating its reaction.\n\nYou need to figure out the cat's personality (normal or grumpy) based on its reactions to petting different areas. \n\nYou can ask up to 10 questions (petting different areas) to determine the cat's personality. \n\n\nAfter you determine the cat's personality, output \"normal\" or \"grumpy\"."}, {"prompt_md5": "8aed0ed4", "template_md5": "465699a0", "result": "You need to determine if a cat is normal or grumpy by petting different areas of its body.  You can ask the cat about each area one at a time. The cat will respond with a specific reaction for each area. After enough interactions, you must determine if the cat is normal or grumpy based on its reactions."}]}