{"uid": "954-A", "url": "https://codeforces.com/contest/954/problem/A", "tags": ["implementation"], "title": "954-A", "statement": "A. Diagonal Walkingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMikhail walks on a 2D plane. He can go either up or right. You are given a sequence of Mikhail's moves. He thinks that this sequence is too long and he wants to make it as short as possible.In the given sequence moving up is described by characterUand moving right is described by characterR. Mikhail can replace any pair of consecutive movesRUorURwith a diagonal move (described as characterD). After that, he can go on and do some other replacements, until there is no pair of consecutive movesRUorURleft.Your problem is to print the minimum possible length of the sequence of moves after the replacements.InputThe first line of the input contains one integern(1 ≤n≤ 100) — the length of the sequence. The second line contains the sequence consisting ofncharactersUandR.OutputPrint the minimum possible length of the sequence of moves after all replacements are done.ExamplesInput5RUURUOutput3Input17UUURRRRRUUURURUUUOutput13NoteIn the first test the shortened sequence of moves may beDUD(its length is3).In the second test the shortened sequence of moves can beUUDRRRDUDDUUU(its length is13).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b619b331", "template_md5": "35d339e4", "result": "You are given a sequence of characters, where 'U' represents moving up and 'R' represents moving right.  The goal is to find the shortest possible length of the sequence after replacing any consecutive pair of 'RU' or 'UR' with a single 'D' (representing a diagonal move). \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), representing the length of the sequence.\n* The second line contains the sequence of 'U' and 'R' characters.\n\nOutput:\n\n* Print the minimum possible length of the sequence after all replacements."}, {"prompt_md5": "b8cf7b34", "template_md5": "465699a0", "result": "You are given a sequence of \"U\" and \"R\" characters.  You can replace any pair of consecutive \"RU\" or \"UR\" with \"D\".  Find the shortest possible sequence after making all possible replacements."}]}