{"uid": "954-I", "url": "https://codeforces.com/contest/954/problem/I", "tags": ["fft", " math"], "title": "954-I", "statement": "I. Yet Another String Matching Problemtime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputSuppose you have two stringssandt, and their length is equal. You may perform the following operation any number of times: choose two different charactersc1andc2, and replace every occurence ofc1in both strings withc2. Let's denote thedistancebetween stringssandtas the minimum number of operations required to make these strings equal. For example, ifsisabcdandtisddcb, thedistancebetween them is2— we may replace every occurence ofawithb, sosbecomesbbcd, and then we may replace every occurence ofbwithd, so both strings becomeddcd.You are given two stringsSandT. For every substring ofSconsisting of|T|characters you have to determine thedistancebetween this substring andT.InputThe first line contains the stringS, and the second — the stringT(1 ≤ |T| ≤ |S| ≤ 125000). Both strings consist of lowercase Latin letters fromatof.OutputPrint|S| - |T| + 1integers. Thei-th of these integers must be equal to thedistancebetween the substring ofSbeginning ati-th index with length|T|and the stringT.ExampleInputabcdefaddcbOutput2 3 3 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3813c3f9", "template_md5": "35d339e4", "result": "You are given two strings, S and T, where the length of T is less than or equal to the length of S.  \n\nFor every substring of S that has the same length as T, calculate the minimum number of operations needed to make that substring equal to T. \n\nAn operation consists of replacing all occurrences of one character in both S and T with another character.\n\nOutput the result for each substring of S."}, {"prompt_md5": "b6e2944b", "template_md5": "465699a0", "result": "Given two strings, S and T, where T is shorter than or equal to S, find the minimum number of times you need to replace characters in each of the substrings of S that are the same length as T to make them equal to T.  Output the minimum number of replacements for each substring of S."}]}