{"uid": "955-E", "url": "https://codeforces.com/contest/955/problem/E", "tags": [], "title": "955-E", "statement": "E. Iciclestime limit per test2.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAndrew's favourite Krakozyabra has recenly fled away and now he's eager to bring it back!At the moment the refugee is inside an icy cave withnicicles dangling from the ceiling located in integer coordinates numbered from1ton. The distance between floor and thei-th icicle is equal toai.Andrew is free to choose an arbitrary integer pointTin range from1toninclusive and at time instant0launch a sound wave spreading into both sides (left and right) at the speed of one point per second. Any icicle touched by the wave starts falling at the same speed (that means that in a second the distance from floor to icicle decreases by one but cannot become less that zero). While distance from icicle to floor is more than zero, it is considered passable; as soon as it becomes zero, the icicle blocks the path and prohibits passing.Krakozyabra is initially (i.e. at time instant0) is located at pointand starts running in the right direction at the speed of one point per second. You can assume that events in a single second happen in the following order: first Krakozyabra changes its position, and only then the sound spreads and icicles fall; in particular, that means that if Krakozyabra is currently at pointand the falling (i.e. already touched by the sound wave) icicle at pointiis1point from the floor, then Krakozyabra will pass it and find itself atand only after that the icicle will finally fall and block the path.Krakozyabra is considered entrapped if there are fallen (i.e. withai= 0) icicles both to the left and to the right of its current position. Help Andrew find the minimum possible time it takes to entrap Krakozyabra by choosing the optimal value ofTor report that this mission is impossible.InputThe first line contains the number of iciclesn(2 ≤n≤ 105).The next line containsnspace-separated numbersai(1 ≤ai≤ 105)— the distances from floor to icicles.OutputPrint an only integer — the minimum time it takes to entrap Krakozyabra between two fallen icicles. If it is impossible, print- 1.ExamplesInput51 4 3 5 1Output3Input41 2 1 1Output2Input22 1Output3Input21 2Output-1NoteIn sample case one it's optimal to launch the sound wave from point3. Then in two seconds icicles1and5will start falling, and in one more seconds they will block the paths. Krakozyabra will be located atat that time. Note that icicle number3will also be fallen, so there will actually be two icicles blocking the path to the left.In sample case two it is optimal to launch the wave from point2and entrap Krakozyabra in2seconds.In sample case four the answer is impossible.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "517df2e8", "template_md5": "35d339e4", "result": "There are $n$ icicles hanging from the ceiling at integer coordinates numbered from 1 to $n$. The distance from the floor to the $i$-th icicle is $a_i$.\n\nYou can launch a sound wave from an integer point $T$ (between 1 and $n$) at time $t=0$. The sound wave spreads one unit to the left and right each second.  \n\nAn icicle touched by the sound wave starts falling at a speed of one unit per second. An icicle cannot fall below the floor.\n\nA person starts at point $x$ and moves one unit to the right each second.\n\nThe goal is to find the minimum time it takes to trap the person between two fallen icicles.  \n\n**Input:**\n\n* The first line contains the number of icicles, $n$.\n* The second line contains $n$ space-separated integers, $a_1, a_2, ..., a_n$, representing the distances from the floor to each icicle.\n\n**Output:**\n\n* Print a single integer representing the minimum time to trap the person. If it's impossible, print -1."}, {"prompt_md5": "230a293f", "template_md5": "465699a0", "result": "You are given a number of points representing the height of icicles hanging from a ceiling. A sound wave can be launched from a point on the floor, causing icicles to fall at a rate of one point per second.  A person is moving rightward at one point per second.  Find the minimum time it takes for the person to be trapped between two fallen icicles, or determine if it's impossible."}]}