{"uid": "957-A", "url": "https://codeforces.com/contest/957/problem/A", "tags": ["implementation"], "title": "957-A", "statement": "A. Tritonic Iridescencetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputOverlooking the captivating blend of myriads of vernal hues, Arkady the painter lays out a long, long canvas.Arkady has a sufficiently large amount of paint of three colours: cyan, magenta, and yellow. On the one-dimensional canvas split intonconsecutive segments, each segment needs to be painted in one of the colours.Arkady has already painted some (possibly none or all) segments and passes the paintbrush to you. You are to determine whether there are at least two ways of colouring all the unpainted segments so that no two adjacent segments are of the same colour. Two ways are considered different if and only if a segment is painted in different colours in them.InputThe first line contains a single positive integern(1 ≤n≤ 100) — the length of the canvas.The second line contains a stringsofncharacters, thei-th of which is either 'C' (denoting a segment painted in cyan), 'M' (denoting one painted in magenta), 'Y' (one painted in yellow), or '?' (an unpainted one).OutputIf there are at least two different ways of painting, output \"Yes\"; otherwise output \"No\" (both without quotes).You can print each character in any case (upper or lower).ExamplesInput5CY??YOutputYesInput5C?C?YOutputYesInput5?CYC?OutputYesInput5C??MMOutputNoInput3MMYOutputNoNoteFor the first example, there are exactly two different ways of colouring:CYCMYandCYMCY.For the second example, there are also exactly two different ways of colouring:CMCMYandCYCMY.For the third example, there are four ways of colouring:MCYCM,MCYCY,YCYCM, andYCYCY.For the fourth example, no matter how the unpainted segments are coloured, the existing magenta segments will prevent the painting from satisfying the requirements. The similar is true for the fifth example.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "83393820", "template_md5": "35d339e4", "result": "You are given a canvas of length $n$. The canvas is divided into $n$ segments, and each segment can be painted with one of three colors: cyan, magenta, or yellow. Some segments are already painted, and the rest are unpainted.  \n\nYou need to determine if there are at least two different ways to paint the unpainted segments so that no two adjacent segments have the same color. \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 100), representing the length of the canvas.\n* The second line contains a string of $n$ characters, where each character is either 'C' (cyan), 'M' (magenta), 'Y' (yellow), or '?' (unpainted).\n\nOutput:\n\n* If there are at least two different ways to paint the unpainted segments, output \"Yes\".\n* Otherwise, output \"No\"."}, {"prompt_md5": "e4f8cd66", "template_md5": "465699a0", "result": "You are given a line of segments, some of which are already colored. You need to determine if you can color the remaining uncolored segments in a way that no two adjacent segments have the same color, and if there are at least two different ways to do this."}]}