{"uid": "958-A2", "url": "https://codeforces.com/contest/958/problem/A2", "tags": ["hashing", " strings"], "title": "958-A2", "statement": "A2. Death Stars (medium)time limit per test2.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe stardate is 1983, and Princess Heidi is getting better at detecting the Death Stars. This time, two Rebel spies have yet again given Heidi two maps with the possible locations of the Death Star. Since she got rid of all double agents last time, she knows that both maps are correct, and indeed show the map of the solar system that contains the Death Star. However, this time the Empire has hidden the Death Star very well, and Heidi needs to find a place that appears on both maps in order to detect the Death Star.The first map is anN×Mgrid, each cell of which shows some type of cosmic object that is present in the corresponding quadrant of space. The second map is anM×Ngrid. Heidi needs to align those two maps in such a way that they overlap over someM×Msection in which all cosmic objects are identical. Help Heidi by identifying where such anM×Msection lies within both maps.InputThe first line of the input contains two space-separated integersNandM(1 ≤N≤ 2000,1 ≤M≤ 200,M≤N). The nextNlines each containMlower-case Latin characters (a-z), denoting the first map. Different characters correspond to different cosmic object types. The nextMlines each containNcharacters, describing the second map in the same format.OutputThe only line of the output should contain two space-separated integersiandj, denoting that the section of sizeM×Min the first map that starts at thei-th row is equal to the section of the second map that starts at thej-th column. Rows and columns are numbered starting from 1.If there are several possible ways to align the maps, Heidi will be satisfied with any of those. It is guaranteed that a solution exists.ExampleInput10 5somerandomnoisemaytheforcebewithyouhctwoagainnoisesomermaythandomeforcnoiseebewiagainthyounoisehctwoOutput4 6NoteThe 5-by-5 grid for the first test case looks like this:maytheforcebewithyouhctwo", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e75ffb12", "template_md5": "35d339e4", "result": "You are given two grids, the first is of size $N \\times M$ and the second is of size $M \\times N$. Each cell in the grids contains a lowercase letter.  \n\nYou need to find a way to align the two grids so that a $M \\times M$ section in the first grid matches a $M \\times M$ section in the second grid, where the letters in the matching sections are the same. \n\nOutput the row number ($i$) in the first grid and the column number ($j$) in the second grid where this matching section starts."}, {"prompt_md5": "3741790c", "template_md5": "465699a0", "result": "You are given two grids of characters.  The grids represent maps of the same area but are rotated. Find the overlapping square section of the maps that have identical characters."}]}