{"uid": "958-C2", "url": "https://codeforces.com/contest/958/problem/C2", "tags": ["dp"], "title": "958-C2", "statement": "C2. Encryption (medium)time limit per test3 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard outputHeidi has now broken the first level of encryption of the Death Star plans, and is staring at the screen presenting her with the description of the next code she has to enter. It looks surprisingly similar to the first one – seems like the Empire engineers were quite lazy...Heidi is once again given a sequenceA, but now she is also given two integerskandp. She needs to find out what the encryption keySis.LetXbe a sequence of integers, andpa positive integer. We define thescoreofXto be the sum of the elements ofXmodulop.Heidi is given a sequenceAthat consists ofNintegers, and also given integerskandp. Her goal is to splitAintokpart such that:Each part contains at least1element ofA, and each part consists of contiguous elements ofA.No two parts overlap.The total sumSof the scores of those parts is maximized.Output the sumS– the encryption code.InputThe first line of the input contains three space-separated integerN,kandp(k≤N≤ 20 000,2 ≤k≤ 50,2 ≤p≤ 100) – the number of elements inA, the number of partsAshould be split into, and the modulo for computing scores, respectively.The second line containsNspace-separated integers that are the elements ofA. Each integer is from the interval[1, 1 000 000].OutputOutput the numberSas described in the problem statement.ExamplesInput4 3 103 4 7 2Output16Input10 5 1216 3 24 13 9 8 7 5 12 12Output37NoteIn the first example, if the input sequence is split as(3, 4),(7),(2), the total score would be. It is easy to see that this score is maximum.In the second example, one possible way to obtain score37is to make the following split:(16, 3, 24),(13, 9),(8),(7),(5, 12, 12).", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e573daf", "template_md5": "35d339e4", "result": "You are given a sequence of integers $A$ of length $N$, and two integers $k$ and $p$.  You need to split $A$ into $k$ non-overlapping sub-sequences (parts) such that each part contains at least one element of $A$.  \n\nThe score of a sub-sequence is the sum of its elements modulo $p$.  \n\nFind the maximum possible sum of the scores of all $k$ parts. \n\nOutput this maximum sum."}, {"prompt_md5": "ddaaecea", "template_md5": "465699a0", "result": "You are given a list of numbers and a target number of groups.  You need to divide the list into these groups so that the sum of the sums of each group (with each sum taken modulo a given number) is as large as possible.  Output the largest possible sum."}]}