{"uid": "958-C1", "url": "https://codeforces.com/contest/958/problem/C1", "tags": ["brute force"], "title": "958-C1", "statement": "C1. Encryption (easy)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputRebel spy Heidi has just obtained the plans for the Death Star from the Empire and, now on her way to safety, she is trying to break the encryption of the plans (of course they are encrypted – the Empire may be evil, but it is not stupid!). The encryption has several levels of security, and here is how the first one looks.Heidi is presented with a screen that shows her a sequence of integersAand a positive integerp. She knows that the encryption code is a single numberS, which is defined as follows:Define thescoreofXto be the sum of the elements ofXmodulop.Heidi is given a sequenceAthat consists ofNintegers, and also given an integerp. She needs to splitAinto2parts such that:Each part contains at least1element ofA, and each part consists of contiguous elements ofA.The two parts do not overlap.The total sumSof the scores of those two parts is maximized. This is the encryption code.Output the sumS, which is the encryption code.InputThe first line of the input contains two space-separated integerNandp(2 ≤N≤ 100 000,2 ≤p≤ 10 000) – the number of elements inA, and the modulo for computing scores, respectively.The second line containsNspace-separated integers which are the elements ofA. Each integer is from the interval[1, 1 000 000].OutputOutput the numberSas described in the problem statement.ExamplesInput4 103 4 7 2Output16Input10 1216 3 24 13 9 8 7 5 12 12Output13NoteIn the first example, the score is maximized if the input sequence is split into two parts as(3, 4),(7, 2). It gives the total score of.In the second example, the score is maximized if the first part consists of the first three elements, and the second part consists of the rest. Then, the score is.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "a971e3cd", "template_md5": "35d339e4", "result": "You are given a sequence of integers $A$ of length $N$ and a positive integer $p$. You need to split the sequence $A$ into two non-overlapping sub-sequences, each containing at least one element.  \n\nThe score of a sub-sequence is the sum of its elements modulo $p$.  \n\nFind the maximum possible sum of the scores of the two sub-sequences. \n\n\nLet me know if you'd like help with the algorithm to solve this problem!"}, {"prompt_md5": "0be50136", "template_md5": "465699a0", "result": "You are given a list of numbers and a target number.  You need to split the list into two non-overlapping sublists.  The goal is to find the split that maximizes the sum of the scores of the two sublists. The score of a sublist is the sum of its numbers, but each number is reduced to its remainder after division by the target number."}]}