{"uid": "958-D2", "url": "https://codeforces.com/contest/958/problem/D2", "tags": [], "title": "958-D2", "statement": "D2. Hyperspace Jump (hard)time limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputIt is now 125 years later, but humanity is still on the run from a humanoid-cyborg race determined to destroy it. Or perhaps we are getting some stories mixed up here... In any case, the fleet is now smaller. However, in a recent upgrade, all the navigation systems have been outfitted with higher-dimensional, linear-algebraic jump processors.Now, in order to make a jump, a ship's captain needs to specify asubspaceof thed-dimensional space in which the events are taking place. She does so by providing a generating set of vectors for that subspace.Princess Heidi has received such a set from the captain of each ofmships. Again, she would like to group up those ships whose hyperspace jump subspaces are equal. To do so, she wants to assign a group number between1andmto each of the ships, so that two ships have the same group number if and only if their corresponding subspaces are equal (even though they might be given using different sets of vectors).Help Heidi!InputThe first line of the input contains two space-separated integersmandd(2 ≤m≤ 30 000,1 ≤d≤ 5) – the number of ships and the dimension of the full underlying vector space, respectively. Next, themsubspaces are described, one after another. Thei-th subspace, which corresponds to thei-th ship, is described as follows:The first line contains one integerki(1 ≤ki≤d). Thenkilines follow, thej-th of them describing thej-th vector sent by thei-th ship. Each of thejlines consists ofdspace-separated integersaj,j= 1, ...,d, that describe the vector; it holds that|aj| ≤ 250. Thei-th subspace is the linear span of thesekivectors.OutputOutputmspace-separated integersg1, ...,gm, wheredenotes the group number assigned to thei-th ship. That is, for any1 ≤i<j≤m, the following should hold:gi=gjif and only if thei-th and thej-th subspaces are equal. In addition, the sequence(g1,g2, ...,gm)should be lexicographically minimal among all sequences with that property.ExampleInput8 215 010 110 120 60 120 11 02-5 -54 321 10 121 01 0Output1 2 2 2 3 3 3 1NoteIn the sample testcase, the first and the last subspace are equal, subspaces 2 to 4 are equal, and subspaces 5 to 7 are equal.Recall that two subspaces, one given as the span of vectorsand another given as the span of vectors, are equal if each vectorvican be written as a linear combination of vectorsw1, ...,wk(that is, there exist coefficientssuch thatvi= α1w1+ ... + αkwk) and, similarly, each vectorwican be written as a linear combination of vectorsv1, ...,vn.Recall that a sequence(g1,g2, ...,gm)is lexicographically smaller than a sequence(h1,h2, ...,hm)if there exists an indexi,1 ≤i≤m, such thatgi<hiandgj=hjfor allj<i.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "9862526a", "template_md5": "35d339e4", "result": "You are given $m$ subspaces of a $d$-dimensional space. Each subspace is defined by a set of vectors.  \n\nYour task is to group the subspaces together so that two subspaces are in the same group if and only if they are equal. Two subspaces are equal if every vector in one subspace can be expressed as a linear combination of the vectors in the other subspace, and vice versa.\n\nOutput the group assignments for each subspace, where each subspace is assigned a unique group number between 1 and $m$. The group assignments should be lexicographically minimal. \n\n**Input:**\n\n* The first line contains two integers, $m$ and $d$ (2 ≤ $m$ ≤ 30,000, 1 ≤ $d$ ≤ 5), representing the number of subspaces and the dimension of the space.\n* Each of the following $m$ lines describes a subspace:\n    * The first line of each subspace description contains an integer $k_i$ (1 ≤ $k_i$ ≤ $d$), representing the number of vectors in the subspace.\n    * The next $k_i$ lines describe the vectors in the subspace. Each vector is represented by $d$ space-separated integers.\n\n**Output:**\n\n* A line containing $m$ space-separated integers, where each integer represents the group assignment for the corresponding subspace."}, {"prompt_md5": "c5081787", "template_md5": "465699a0", "result": "You are given a list of sets of vectors. Each set represents a subspace.  Your task is to group the sets together so that two sets are in the same group if and only if they represent the same subspace.  The groups should be numbered consecutively and the order of the groups should be as small as possible."}]}