{"uid": "958-D1", "url": "https://codeforces.com/contest/958/problem/D1", "tags": ["expression parsing", " math"], "title": "958-D1", "statement": "D1. Hyperspace Jump (easy)time limit per test5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe Rebel fleet is on the run. It consists ofmships currently gathered around a single planet. Just a few seconds ago, the vastly more powerful Empire fleet has appeared in the same solar system, and the Rebels will need to escape into hyperspace. In order to spread the fleet, the captain of each ship has independently come up with the coordinate to which that ship will jump. In the obsolete navigation system used by the Rebels, this coordinate is given as the value of an arithmetic expression of the form.To plan the future of the resistance movement, Princess Heidi needs to know, for each ship, how many ships are going to end up at the same coordinate after the jump. You are her only hope!InputThe first line of the input contains a single integerm(1 ≤m≤ 200 000) – the number of ships. The nextmlines describe one jump coordinate each, given as an arithmetic expression. An expression has the form(a+b)/c. Namely, it consists of: an opening parenthesis(, a positive integeraof up to two decimal digits, a plus sign+, a positive integerbof up to two decimal digits, a closing parenthesis), a slash/, and a positive integercof up to two decimal digits.OutputPrint a single line consisting ofmspace-separated integers. Thei-th integer should be equal to the number of ships whose coordinate is equal to that of thei-th ship (including thei-th ship itself).ExampleInput4(99+98)/97(26+4)/10(12+33)/15(5+1)/7Output1 2 2 1NoteIn the sample testcase, the second and the third ship will both end up at the coordinate3.Note that this problem has only two versions – easy and hard.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e5041a45", "template_md5": "35d339e4", "result": "You are given a list of  *m*  arithmetic expressions, each of the form $(a+b)/c$.  Each expression represents the jump coordinate of a ship.  \n\nDetermine how many ships will end up at each unique jump coordinate. \n\n**Input:**\n\n* The first line contains an integer *m* (1 ≤ *m* ≤ 200,000), the number of ships.\n* The next *m* lines each contain a jump coordinate expression in the format $(a+b)/c$.\n\n**Output:**\n\n* Print a single line of *m* space-separated integers. The *i*-th integer represents the number of ships that will jump to the same coordinate as the *i*-th ship (including the *i*-th ship itself)."}, {"prompt_md5": "e7d43506", "template_md5": "465699a0", "result": "You are given a list of numbers, each representing a destination.  Count how many times each destination appears in the list."}]}