{"uid": "958-A3", "url": "https://codeforces.com/contest/958/problem/A3", "tags": [], "title": "958-A3", "statement": "A3. Death Stars (hard)time limit per test7 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe stardate is 2015, and Death Stars are bigger than ever! This time, two rebel spies have yet again given Heidi two maps with the possible locations of the Death Stars.Heidi has now received two maps with possible locations ofNDeath Stars. She knows that each of the maps is possibly corrupted, and may contain some stars that are not Death Stars. Furthermore, each of the maps was created from a different point of view. Hence, stars that are shown in one of the maps are rotated and translated with respect to the other map. Now Heidi wants to find out which of the stars shown in both maps are actually Death Stars, and the correspondence between the Death Stars on the two maps.InputThe first line of the input contains an integerN(1000 ≤N≤ 50000) – the number of Death Stars. The second line of the input contains an integerN1(N≤N1≤ 1.5·N) – the number of stars in the first map. The nextN1lines specify the coordinates of the stars in the first map. Thei-th line contains two space-separated floating-point numbersxiandyiwith two decimal digits of precision each, representing the coordinates of thei-th star in the first map.The next line of the input contains an integerN2(N≤N2≤ 1.5·N) – the number of stars in the second map. The nextN2lines contain locations of the stars in the second map, given in the same format as for the first map.OutputYou should output exactlyNlines, each containing a space-separated pair of integersi1andi2. Each such line should indicate that the star numberedi1in the first map corresponds to the star numberedi2in the second map. Your answer will be considered correct if over 90% of the distinct pairs listed in your output are indeed correct.NoteThe tests are generated in the following way:The number of Death StarsNis pre-selected in some way.The numbers of stars on the first and on the second map,N1andN2, are selected uniformly at random between1.0 ×Nand1.5 ×N.NDeath Stars are generated at random, with coordinates between- 10000and10000.AdditionalN1-NandN2 -Nstars for the first and for the second map respectively are generated in the same way.A translation vector(dx,dy)is generated, withdxanddyselected uniformly at random between- 10000and10000. Each point in the first map is translated by(dx,dy).A rotation angleθis generated, withθselected uniformly at random between0and2π. Each point in the first map is rotated by an angle ofθaround the origin.Translations and rotations for the second map are generated and applied in the same way.The order of points is randomly permuted for both maps.The test case is saved, with each point written with two decimal digits of precision.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "3b726ddc", "template_md5": "35d339e4", "result": "You are given two lists of star locations. Each list may contain some stars that are not actual Death Stars. The lists are rotated and translated versions of each other.  \n\n* The first list has $N_1$ stars, where $N$ is the actual number of Death Stars.\n* The second list has $N_2$ stars, where $N$ is the actual number of Death Stars.\n\nYour task is to determine which stars in both lists are Death Stars and find the corresponding pairs of Death Stars between the two lists. \n\n**Input:**\n\n* The first line contains the number of Death Stars, $N$ ($1000 \\le N \\le 50000$).\n* The second line contains the number of stars in the first list, $N_1$ ($N \\le N_1 \\le 1.5N$).\n* The next $N_1$ lines each contain the x and y coordinates of a star in the first list (two decimal places).\n* The next line contains the number of stars in the second list, $N_2$ ($N \\le N_2 \\le 1.5N$).\n* The next $N_2$ lines each contain the x and y coordinates of a star in the second list (two decimal places).\n\n**Output:**\n\n* Output $N$ lines, each containing two integers $i_1$ and $i_2$. \n* Each line should indicate that the star numbered $i_1$ in the first list corresponds to the star numbered $i_2$ in the second list.\n\n\n\nLet me know if you'd like me to elaborate on any part of the problem statement."}, {"prompt_md5": "9a95d323", "template_md5": "465699a0", "result": "You are given two lists of star locations. Each list may contain some non-Death Star locations. The lists are rotated and shifted versions of each other. Find the matching Death Stars between the two lists."}]}