{"uid": "958-F2", "url": "https://codeforces.com/contest/958/problem/F2", "tags": ["binary search", " two pointers"], "title": "958-F2", "statement": "F2. Lightsabers (medium)time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere is unrest in the Galactic Senate. Several thousand solar systems have declared their intentions to leave the Republic. Master Heidi needs to select the Jedi Knights who will go on peacekeeping missions throughout the galaxy. It is well-known that the success of any peacekeeping mission depends on the colors of the lightsabers of the Jedi who will go on that mission.Heidi hasnJedi Knights standing in front of her, each one with a lightsaber of one ofmpossible colors. She knows that for the mission to be the most effective, she needs to select some contiguous interval of knights such that there are exactlyk1knights with lightsabers of the first color,k2knights with lightsabers of the second color,...,kmknights with lightsabers of them-th color.However, since the last time, she has learned that it is not always possible to select such an interval. Therefore, she decided to ask some Jedi Knights to go on an indefinite unpaid vacation leave near certain pits on Tatooine, if you know what I mean. Help Heidi decide what is the minimum number of Jedi Knights that need to be let go before she is able to select the desired interval from the subsequence of remaining knights.InputThe first line of the input containsn(1 ≤n≤ 2·105) andm(1 ≤m≤n). The second line containsnintegers in the range{1, 2, ...,m}representing colors of the lightsabers of the subsequent Jedi Knights. The third line containsmintegersk1,k2, ...,km(with) – the desired counts of Jedi Knights with lightsabers of each color from1tom.OutputOutput one number: the minimum number of Jedi Knights that need to be removed from the sequence so that, in what remains, there is an interval with the prescribed counts of lightsaber colors. If this is not possible, output- 1.ExampleInput8 33 3 1 2 2 1 1 33 1 1Output1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bb85fe25", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ integers, where each integer represents the color of a lightsaber. There are $m$ distinct colors. You need to find the minimum number of integers you need to remove from the sequence so that the remaining sequence contains a contiguous sub-sequence with exactly $k_1$ integers of color 1, $k_2$ integers of color 2, ..., $k_m$ integers of color $m$. If it's impossible to achieve this, output -1. \n\nInput:\n\n* The first line contains two integers, $n$ and $m$ ($1 \\le n \\le 2 \\cdot 10^5$, $1 \\le m \\le n$).\n* The second line contains $n$ integers in the range {1, 2, ..., $m$}, representing the colors of the lightsabers.\n* The third line contains $m$ integers, $k_1$, $k_2$, ..., $k_m$ ($k_i \\ge 0$).\n\nOutput:\n\n* Output a single integer, the minimum number of integers to remove. If it's impossible, output -1."}, {"prompt_md5": "f3fdcb35", "template_md5": "465699a0", "result": "You are given a sequence of numbers representing colors. You need to find the minimum number of elements to remove from the sequence so that the remaining sequence contains a sub-sequence with a specific number of each color. If this is not possible, output -1."}]}