{"uid": "959-E", "url": "https://codeforces.com/contest/959/problem/E", "tags": ["bitmasks", " dp", " graphs", " implementation", " math"], "title": "959-E", "statement": "E. Mahmoud and Ehab and the xor-MSTtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputEhab is interested in the bitwise-xor operation and the special graphs. Mahmoud gave him a problem that combines both. He has a complete graph consisting ofnvertices numbered from0ton- 1. For all0 ≤u<v<n, vertexuand vertexvare connected with an undirected edge that has weight(whereis thebitwise-xor operation). Can you find the weight of the minimum spanning tree of that graph?You can read about complete graphs inhttps://en.wikipedia.org/wiki/Complete_graphYou can read about the minimum spanning tree inhttps://en.wikipedia.org/wiki/Minimum_spanning_treeThe weight of the minimum spanning tree is the sum of the weights on the edges included in it.InputThe only line contains an integern(2 ≤n≤ 1012), the number of vertices in the graph.OutputThe only line contains an integerx, the weight of the graph's minimum spanning tree.ExampleInput4Output4NoteIn the first sample:The weight of the minimum spanning tree is 1+2+1=4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8e5111c1", "template_md5": "35d339e4", "result": "You are given a complete graph with $n$ vertices numbered from 0 to $n-1$.  Each pair of distinct vertices $u$ and $v$ is connected by an edge with weight $u \\oplus v$, where $\\oplus$ is the bitwise XOR operation. Find the sum of the weights of the edges in the minimum spanning tree of this graph. \n\nInput:\n\n* A single integer $n$ (2 ≤ $n$ ≤ 10<sup>12</sup>), the number of vertices.\n\nOutput:\n\n* A single integer, the weight of the minimum spanning tree."}, {"prompt_md5": "6eddf5d9", "template_md5": "465699a0", "result": "You are given a complete graph with a number of nodes. Each pair of nodes is connected by an edge with a weight calculated by performing a bitwise XOR operation on the node numbers. Find the sum of the weights of the edges in the minimum spanning tree of this graph."}]}