{"uid": "959-A", "url": "https://codeforces.com/contest/959/problem/A", "tags": ["games", " math"], "title": "959-A", "statement": "A. Mahmoud and Ehab and the even-odd gametime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMahmoud and Ehab play a game called the even-odd game. Ehab chooses his favorite integernand then they take turns, starting from Mahmoud. In each player's turn, he has to choose an integeraand subtract it fromnsuch that:1 ≤a≤n.If it's Mahmoud's turn,ahas to be even, but if it's Ehab's turn,ahas to be odd.If the current player can't choose any number satisfying the conditions, he loses. Can you determine the winner if they both play optimally?InputThe only line contains an integern(1 ≤n≤ 109), the number at the beginning of the game.OutputOutput \"Mahmoud\" (without quotes) if Mahmoud wins and \"Ehab\" (without quotes) otherwise.ExamplesInput1OutputEhabInput2OutputMahmoudNoteIn the first sample, Mahmoud can't choose any integerainitially because there is no positive even integer less than or equal to1so Ehab wins.In the second sample, Mahmoud has to choosea= 2and subtract it fromn. It's Ehab's turn andn= 0. There is no positive odd integer less than or equal to0so Mahmoud wins.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "4e97efbd", "template_md5": "35d339e4", "result": "Two players take turns in a game.  \n\n* Player 1 starts.\n* The current player must choose a positive integer $a$ and subtract it from a shared number $n$.\n* Player 1 can only choose even numbers for $a$.\n* Player 2 can only choose odd numbers for $a$.\n* If a player cannot make a valid move, they lose.\n\nDetermine the winner if both players play optimally. \n\nThe input is a single integer $n$ (1 ≤ $n$ ≤ 10⁹). The output is \"Player 1\" if Player 1 wins and \"Player 2\" otherwise."}, {"prompt_md5": "c8d0566b", "template_md5": "465699a0", "result": "Two players take turns subtracting a number from a starting value.  The first player must subtract an even number, the second player must subtract an odd number.  If a player cannot make a legal move, they lose. Determine the winner if both players play optimally."}]}