{"uid": "959-B", "url": "https://codeforces.com/contest/959/problem/B", "tags": ["dsu", " greedy", " implementation"], "title": "959-B", "statement": "B. Mahmoud and Ehab and the messagetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputMahmoud wants to send a message to his friend Ehab. Their language consists ofnwords numbered from1ton. Some words have the same meaning so there arekgroups of words such that all the words in some group have the same meaning.Mahmoud knows that thei-th word can be sent with costai. For each word in his message, Mahmoud can either replace it with another word of the same meaning or leave it as it is. Can you help Mahmoud determine the minimum cost of sending the message?The cost of sending the message is the sum of the costs of sending every word in it.InputThe first line of input contains integersn,kandm(1 ≤k≤n≤ 105, 1 ≤m≤ 105)— the number of words in their language, the number of groups of words, and the number of words in Mahmoud's message respectively.The second line containsnstrings consisting of lowercase English letters of length not exceeding 20 which represent the words. It's guaranteed that the words aredistinct.The third line containsnintegersa1,a2,...,an(1 ≤ai≤ 109)whereaiis the cost of sending thei-th word.The nextklines describe the groups of words of same meaning. The nextklines each start with an integerx(1 ≤x≤n)which means that there arexwords in this group, followed byxintegers which represent the indices of words in this group. It's guaranteed that each word appears in exactly one group.The next line containsmspace-separated words which represent Mahmoud's message. Each of these words appears in the list of language's words.OutputThe only line should contain the minimum cost to send the message after replacing some words (maybe none) with some words of the same meaning.ExamplesInput5 4 4i loser am the second100 1 1 5 101 11 32 2 51 4i am the secondOutput107Input5 4 4i loser am the second100 20 1 5 101 11 32 2 51 4i am the secondOutput116NoteIn the first sample, Mahmoud should replace the word \"second\" with the word \"loser\" because it has less cost so the cost will be 100+1+5+1=107.In the second sample, Mahmoud shouldn't do any replacement so the cost will be 100+1+5+10=116.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ae16135c", "template_md5": "35d339e4", "result": "There are $n$ words in a language, grouped into $k$ sets where all words in a set have the same meaning.  You are given a message of $m$ words. The cost of sending each word is given. You can replace a word in the message with any other word in its meaning group. What is the minimum cost to send the message?\n\nInput:\n\n* Line 1: $n$, $k$, $m$ (number of words, number of groups, message length)\n* Line 2: $n$ words (the words in the language)\n* Line 3: $n$ integers (the cost of sending each word)\n* Next $k$ lines: each line starts with an integer $x$ (number of words in a group) followed by $x$ integers (indices of words in the group)\n* Line $k+4$: $m$ words (the message)\n\nOutput:\n\n* Line 1: the minimum cost to send the message"}, {"prompt_md5": "9be2026b", "template_md5": "465699a0", "result": "You have a list of words, and some words have the same meaning and are grouped together. You also have a cost associated with each word. You need to send a message using some of these words, and you can choose to replace a word with a synonym from its group to minimize the total cost. What is the minimum cost to send the message?"}]}