{"uid": "960-F", "url": "https://codeforces.com/contest/960/problem/F", "tags": ["data structures", " dp", " graphs"], "title": "960-F", "statement": "F. Pathwalkstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a directed graph withnnodes andmedges, with all edges having a certain weight.There might be multiple edges and self loops, and the graph can also be disconnected.You need to choose a path (possibly passing through same vertices multiple times) in the graph such that the weights of the edges are in strictly increasing order, and these edges come in the order of input. Among all such paths, you need to find the the path that has the maximum possible number of edges, and report this value.Please note that the edges picked don't have to be consecutive in the input.InputThe first line contains two integersnandm(1 ≤n≤ 100000,1 ≤m≤ 100000) — the number of vertices and edges in the graph, respectively.mlines follows.Thei-th of these lines contains three space separated integersai,biandwi(1 ≤ai,bi≤n,0 ≤wi≤ 100000), denoting an edge from vertexaito vertexbihaving weightwiOutputPrint one integer in a single line — the maximum number of edges in the path.ExamplesInput3 33 1 31 2 12 3 2Output2Input5 51 3 23 2 33 4 55 4 04 5 8Output3NoteThe answer for the first sample input is2:. Note that you cannot traversebecause edgeappears earlier in the input than the other two edges and hence cannot be picked/traversed after either of the other two edges.In the second sample, it's optimal to pick1-st,3-rd and5-th edges to get the optimal answer:.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "72b1d806", "template_md5": "35d339e4", "result": "You are given a directed graph with $n$ nodes and $m$ edges. Each edge has a weight.  You need to find the longest path in the graph where the edges are visited in increasing order of their weights.  The path can visit the same nodes multiple times.  Output the maximum number of edges in such a path."}, {"prompt_md5": "349c7106", "template_md5": "465699a0", "result": "You are given a list of connections between points, each with a weight.  Find the longest path you can make by connecting points, where the weights of the connections must increase as you go along the path.  You can visit points multiple times."}]}