{"uid": "960-C", "url": "https://codeforces.com/contest/960/problem/C", "tags": ["bitmasks", " constructive algorithms", " greedy", " implementation"], "title": "960-C", "statement": "C. Subsequence Countingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPikachu had an array with him. He wrote down all the non-empty subsequences of the array on paper. Note that an array of sizenhas2n- 1non-empty subsequences in it.Pikachu being mischievous as he always is, removed all the subsequences in whichMaximum_element_of_the_subsequence-Minimum_element_of_subsequence≥dPikachu was finally left withXsubsequences.However, he lost the initial array he had, and now is in serious trouble. He still remembers the numbersXandd. He now wants you to construct any such array which will satisfy the above conditions. All the numbers in the final array should be positive integers less than1018.Note the number of elements in the output array should not be more than104. If no answer is possible, print- 1.InputThe only line of input consists of two space separated integersXandd(1 ≤X,d≤ 109).OutputOutput should consist of two lines.First line should contain a single integern(1 ≤n≤ 10 000)— the number of integers in the final array.Second line should consist ofnspace separated integers —a1,a2, ... ,an(1 ≤ai< 1018).If there is no answer, print a single integer-1. If there are multiple answers, print any of them.ExamplesInput10 5Output65 50 7 15 6 100Input4 2Output410 100 1000 10000NoteIn the output of the first example case, the remaining subsequences after removing those withMaximum_element_of_the_subsequence-Minimum_element_of_subsequence≥ 5are[5], [5, 7], [5, 6], [5, 7, 6], [50], [7], [7, 6], [15], [6], [100]. There are10of them. Hence, the array[5, 50, 7, 15, 6, 100]is valid.Similarly, in the output of the second example case, the remaining sub-sequences after removing those withMaximum_element_of_the_subsequence-Minimum_element_of_subsequence≥ 2are[10], [100], [1000], [10000]. There are4of them. Hence, the array[10, 100, 1000, 10000]is valid.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "916ca936", "template_md5": "35d339e4", "result": "You are given two integers $X$ and $d$.  You need to find an array of integers with a length of at most 100,000 that satisfies the following conditions:\n\n* The number of non-empty subsequences in the array is equal to $X$.\n* For every subsequence in the array, the difference between the maximum element and the minimum element is less than $d$.\n\nIf no such array exists, print -1. Otherwise, print the length of the array followed by the array elements."}, {"prompt_md5": "36945f5a", "template_md5": "465699a0", "result": "Given two numbers X and d, find an array of numbers with at most 100,000 elements where the number of subsequences with a maximum element minus a minimum element less than d is equal to X. If no such array exists, print -1."}]}