{"uid": "962-B", "url": "https://codeforces.com/contest/962/problem/B", "tags": ["constructive algorithms", " greedy", " implementation"], "title": "962-B", "statement": "B. Students in Railway Carriagetime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ consecutive seat places in a railway carriage. Each place is either empty or occupied by a passenger.The university team for the Olympiad consists of $$$a$$$ student-programmers and $$$b$$$ student-athletes. Determine the largest number of students from all $$$a+b$$$ students, which you can put in the railway carriage so that:no student-programmer is sitting next to the student-programmer;and no student-athlete is sitting next to the student-athlete.In the other words, there should not be two consecutive (adjacent) places where two student-athletes or two student-programmers are sitting.Consider that initially occupied seat places are occupied by jury members (who obviously are not students at all).InputThe first line contain three integers $$$n$$$, $$$a$$$ and $$$b$$$ ($$$1 \\\\le n \\\\le 2\\\\cdot10^{5}$$$, $$$0 \\\\le a, b \\\\le 2\\\\cdot10^{5}$$$, $$$a + b > 0$$$) — total number of seat places in the railway carriage, the number of student-programmers and the number of student-athletes.The second line contains a string with length $$$n$$$, consisting of characters \".\" and \"*\". The dot means that the corresponding place is empty. The asterisk means that the corresponding place is occupied by the jury member.OutputPrint the largest number of students, which you can put in the railway carriage so that no student-programmer is sitting next to a student-programmer and no student-athlete is sitting next to a student-athlete.ExamplesInput5 1 1*...*Output2Input6 2 3*...*.Output4Input11 3 10.*....**.*.Output7Input3 2 3***Output0NoteIn the first example you can put all student, for example, in the following way:*.AB*In the second example you can put four students, for example, in the following way:*BAB*BIn the third example you can put seven students, for example, in the following way:B*ABAB**A*BThe letterAmeans a student-programmer, and the letterB— student-athlete.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "da319c55", "template_md5": "35d339e4", "result": "There are $n$ seats in a train carriage. Some seats are already occupied. You have $a$ programmers and $b$ athletes who want to sit in the carriage.  \n\nProgrammers cannot sit next to each other, and athletes cannot sit next to each other. \n\nFind the maximum number of programmers and athletes you can seat together in the carriage, respecting the rule about not sitting next to people of the same group. \n\n\nInput:\n\n* The first line contains three integers: $n$, $a$, and $b$.\n* The second line contains a string of length $n$ with \".\" representing an empty seat and \"*\" representing an occupied seat.\n\nOutput:\n\n* Print the maximum number of students (programmers and athletes) that can be seated."}, {"prompt_md5": "68ea1130", "template_md5": "465699a0", "result": "You have a row of seats. Some seats are already taken. You need to place programmers and athletes in the remaining seats so that no two programmers sit next to each other and no two athletes sit next to each other. Find the maximum number of programmers and athletes you can place."}]}