{"uid": "962-F", "url": "https://codeforces.com/contest/962/problem/F", "tags": ["dfs and similar", " graphs", " trees"], "title": "962-F", "statement": "F. Simple Cycles Edgestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an undirected graph, consisting of $$$n$$$ vertices and $$$m$$$ edges. The graph does not necessarily connected. Guaranteed, that the graph does not contain multiple edges (more than one edges between a pair of vertices) or loops (edges from a vertex to itself).A cycle in a graph is called a simple, if it contains each own vertex exactly once. So simple cycle doesn't allow to visit a vertex more than once in a cycle.Determine the edges, which belong toexactly on onesimple cycle.InputThe first line contain two integers $$$n$$$ and $$$m$$$ $$$(1 \\\\le n \\\\le 100\\\\,000$$$, $$$0 \\\\le m \\\\le \\\\min(n \\\\cdot (n - 1) / 2, 100\\\\,000))$$$ — the number of vertices and the number of edges.Each of the following $$$m$$$ lines contain two integers $$$u$$$ and $$$v$$$ ($$$1 \\\\le u, v \\\\le n$$$, $$$u \\\\neq v$$$) — the description of the edges.OutputIn the first line print the number of edges, which belong to exactly one simple cycle.In the second line print the indices of edges, which belong to exactly one simple cycle, inincreasingorder. The edges are numbered from one in the same order as they are given in the input.ExamplesInput3 31 22 33 1Output31 2 3Input6 72 33 44 21 21 55 66 1Output61 2 3 5 6 7Input5 61 22 32 44 32 55 3Output0", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "e71d75fc", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices and $m$ edges.  The graph may not be connected.  \n\nDetermine the number of edges that are part of exactly one simple cycle in the graph. A simple cycle is a path that visits each vertex exactly once.\n\nOutput the number of such edges, followed by a list of the indices of those edges in increasing order."}, {"prompt_md5": "f92d94e3", "template_md5": "465699a0", "result": "You are given a list of connections between points.  Find the connections that are part of exactly one loop (a closed path where you visit each point exactly once).  Output the number of such connections and list them in order."}]}