{"uid": "962-G", "url": "https://codeforces.com/contest/962/problem/G", "tags": ["data structures", " dsu", " geometry", " trees"], "title": "962-G", "statement": "G. Visible Black Areastime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPetya has a polygon consisting of $$$n$$$ vertices. All sides of the Petya's polygon are parallel to the coordinate axes, and each two adjacent sides of the Petya's polygon are perpendicular. It is guaranteed that the polygon is simple, that is, it doesn't have self-intersections and self-touches. All internal area of the polygon (borders are not included) was painted in black color by Petya.Also, Petya has a rectangular window, defined by its coordinates, through which he looks at the polygon. A rectangular window can not be moved. The sides of the rectangular window are parallel to the coordinate axes.Blue color represents the border of a polygon, red color is the Petya's window. The answer in this case is 2.Determine the number of black connected areas of Petya's polygon, which can be seen through the rectangular window.InputThe first line contain four integers $$$x_1, y_1, x_2, y_2$$$ ($$$x_1 < x_2$$$, $$$y_2 < y_1$$$) — the coordinates of top-left and bottom-right corners of the rectangular window.The second line contains a single integer $$$n$$$ ($$$4 \\\\le n \\\\le 15\\\\,000$$$) — the number of vertices in Petya's polygon.Each of the following $$$n$$$ lines contains two integers — the coordinates of vertices of the Petya's polygon in counterclockwise order. Guaranteed, that the given polygon satisfies the conditions described in the statement.All coordinates of the rectangular window and all coordinates of the vertices of the polygon are non-negative and do not exceed $$$15\\\\,000$$$.OutputPrint the number of black connected areas of Petya's polygon, which can be seen through the rectangular window.ExampleInput5 7 16 3160 018 018 616 616 110 110 47 47 22 22 612 612 1210 1210 80 8Output2NoteThe example corresponds to the picture above.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fbe8da5b", "template_md5": "35d339e4", "result": "You are given a polygon with $n$ vertices. All sides of the polygon are parallel to the coordinate axes, and each two adjacent sides are perpendicular. The polygon is simple (no self-intersections or self-touches). The area inside the polygon is black.\n\nYou are also given a rectangular window defined by its top-left corner $(x_1, y_1)$ and bottom-right corner $(x_2, y_2)$. The window cannot be moved.\n\nDetermine the number of connected black areas of the polygon that are visible through the window.\n\n**Input:**\n\n* Four integers: $x_1$, $y_1$, $x_2$, $y_2$ (where $x_1 < x_2$ and $y_2 < y_1$) representing the coordinates of the window's corners.\n* An integer $n$ representing the number of vertices in the polygon.\n* $n$ lines, each containing two integers representing the coordinates of a vertex of the polygon in counterclockwise order.\n\n**Output:**\n\n* An integer representing the number of connected black areas visible through the window."}, {"prompt_md5": "35c53eb1", "template_md5": "465699a0", "result": "You are given a window and a polygon. The polygon is made of squares connected at right angles.  Determine how many separate black areas inside the polygon are visible through the window."}]}