{"uid": "962-E", "url": "https://codeforces.com/contest/962/problem/E", "tags": ["constructive algorithms", " greedy"], "title": "962-E", "statement": "E. Byteland, Berland and Disputed Citiestime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe cities of Byteland and Berland are located on the axis $$$Ox$$$. In addition, on this axis there are also disputed cities, which belong to each of the countries in their opinion. Thus, on the line $$$Ox$$$ there are three types of cities:the cities of Byteland,the cities of Berland,disputed cities.Recently, the project BNET has been launched — a computer network of a new generation. Now the task of the both countries is to connect the cities so that the network of this country isconnected.The countries agreed to connectthe pairsof cities with BNET cables in such a way that:If you look at theonlycities of Byteland and the disputed cities, then in the resulting set of cities, any city should be reachable from any other one by one or more cables,If you look at theonlycities of Berland and the disputed cities, then in the resulting set of cities, any city should be reachable from any other one by one or more cables.Thus, it is necessary to choose a set of pairs of cities to connect by cables in such a way that both conditions are satisfied simultaneously. Cables allow bi-directional data transfer. Each cable connects exactly two distinct cities.The cost of laying a cable from one city to another is equal to the distance between them. Find the minimum total cost of laying a set of cables so that two subsets of cities (Byteland and disputed cities, Berland and disputed cities) are connected.Each city is a point on the line $$$Ox$$$. It is technically possible to connect the cities $$$a$$$ and $$$b$$$ with a cable so that the city $$$c$$$ ($$$a < c < b$$$) is not connected to this cable, where $$$a$$$, $$$b$$$ and $$$c$$$ are simultaneously coordinates of the cities $$$a$$$, $$$b$$$ and $$$c$$$.InputThe first line contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 2 \\\\cdot 10^{5}$$$) — the number of cities.The following $$$n$$$ lines contains an integer $$$x_i$$$ and the letter $$$c_i$$$ ($$$-10^{9} \\\\le x_i \\\\le 10^{9}$$$) — the coordinate of the city and its type. If the city belongs to Byteland, $$$c_i$$$ equals to 'B'. If the city belongs to Berland, $$$c_i$$$ equals to «R». If the city is disputed, $$$c_i$$$ equals to 'P'.All cities have distinct coordinates. Guaranteed, that the cities are given in the increasing order of their coordinates.OutputPrint the minimal total length of such set of cables, that if we delete all Berland cities ($$$c_i$$$='R'), it will be possible to find a way from any remaining city to any other remaining city, moving only by cables. Similarly, if we delete all Byteland cities ($$$c_i$$$='B'), it will be possible to find a way from any remaining city to any other remaining city, moving only by cables.ExamplesInput4-5 R0 P3 P7 BOutput12Input510 R14 B16 B21 R32 ROutput24NoteIn the first example, you should connect the first city with the second, the second with the third, and the third with the fourth. The total length of the cables will be $$$5 + 3 + 4 = 12$$$.In the second example there are no disputed cities, so you need to connect all the neighboring cities of Byteland and all the neighboring cities of Berland. The cities of Berland have coordinates $$$10, 21, 32$$$, so to connect them you need two cables of length $$$11$$$ and $$$11$$$. The cities of Byteland have coordinates $$$14$$$ and $$$16$$$, so to connect them you need one cable of length $$$2$$$. Thus, the total length of all cables is $$$11 + 11 + 2 = 24$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "39004b18", "template_md5": "35d339e4", "result": "You are given a line with $n$ cities, where each city has a coordinate $x_i$ and a type: 'B' for Byteland, 'R' for Berland, or 'P' for disputed.  \n\nThe goal is to connect the cities with cables so that:\n\n* All Byteland cities and disputed cities are connected.\n* All Berland cities and disputed cities are connected.\n\nThe cost of a cable is the distance between the two cities it connects. Find the minimum total cost of the cables needed to satisfy these conditions."}, {"prompt_md5": "8978be2b", "template_md5": "465699a0", "result": "You are given a line with cities of different types.  You need to connect the cities with cables so that:\n\n1. All cities of one type can reach each other.\n2. All cities of the other type can reach each other.\n\nThe cost of a cable is the distance between the two cities it connects. Find the minimum total cost to connect the cities."}]}