{"uid": "963-B", "url": "https://codeforces.com/contest/963/problem/B", "tags": ["constructive algorithms", " dfs and similar", " dp", " greedy", " trees"], "title": "963-B", "statement": "B. Destruction of a Treetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a tree (a graph withnvertices andn- 1edges in which it's possible to reach any vertex from any other vertex using only its edges).A vertex can be destroyed if this vertex has even degree. If you destroy a vertex, all edges connected to it are also deleted.Destroy all vertices in the given tree or determine that it is impossible.InputThe first line contains integern(1 ≤n≤ 2·105) — number of vertices in a tree.The second line containsnintegersp1,p2, ...,pn(0 ≤pi≤n). Ifpi≠ 0there is an edge between verticesiandpi. It is guaranteed that the given graph is a tree.OutputIf it's possible to destroy all vertices, print \"YES\" (without quotes), otherwise print \"NO\" (without quotes).If it's possible to destroy all vertices, in the nextnlines print the indices of the vertices in order you destroy them. If there are multiple correct answers, print any.ExamplesInput50 1 2 1 2OutputYES12354Input40 1 2 3OutputNONoteIn the first example at first you have to remove the vertex with index 1 (after that, the edges (1, 2) and (1, 4) are removed), then the vertex with index 2 (and edges (2, 3) and (2, 5) are removed). After that there are no edges in the tree, so you can remove remaining vertices in any order.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c5061258", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices and $n-1$ edges.  A vertex can be destroyed if it has an even number of connections (edges).  \n\nIf you destroy a vertex, all the edges connected to it are also removed.\n\nDetermine if it is possible to destroy all the vertices in the tree. If it is possible, list the order in which you would destroy them. \n\n**Input:**\n\n* The first line contains the number of vertices, $n$ ($1 \\le n \\le 2 \\cdot 10^5$).\n* The second line contains $n$ integers $p_1, p_2, ..., p_n$ ($0 \\le p_i \\le n$). If $p_i \\neq 0$, there is an edge between vertices $i$ and $p_i$.\n\n**Output:**\n\n* If it is possible to destroy all vertices, print \"YES\". Otherwise, print \"NO\".\n* If it is possible to destroy all vertices, print the indices of the vertices in the order you would destroy them, one per line."}, {"prompt_md5": "c80e3643", "template_md5": "465699a0", "result": "You are given a connected network of points. Some points are connected by lines.  If a point has an even number of connecting lines, it can be removed along with its connecting lines.  Determine if it is possible to remove all points from the network. If so, list the order in which you would remove them."}]}