{"uid": "97-A", "url": "https://codeforces.com/contest/97/problem/A", "tags": ["brute force", " implementation"], "title": "97-A", "statement": "A. Dominotime limit per test0.5 secondmemory limit per test256 megabytesinputstdinoutputstdoutLittle Gennady was presented with a set of domino for his birthday. The set consists of28different dominoes of size2 × 1. Both halves of each domino contain one digit from0to6.0-0 0-1 0-2 0-3 0-4 0-5 0-61-1 1-2 1-3 1-4 1-5 1-62-2 2-3 2-4 2-5 2-63-3 3-4 3-5 3-64-4 4-5 4-65-5 5-66-6The figure that consists of28dominoes is calledmagic, if it can be fully covered with14non-intersecting squares of size2 × 2so that each square contained four equal numbers. Every time Gennady assembles a magic figure, some magic properties of the set appear — he wins the next contest. Gennady noticed that he can't assemble a figure that has already been assembled, otherwise someone else wins the contest.Gennady chose a checked field of sizen×mand put there rectangular chips of sizes1 × 2and2 × 1. Each chip fully occupies exactly two neighboring squares of the field. Those chips do not overlap but they can touch each other. Overall the field has exactly28chips, equal to the number of dominoes in the set. Now Gennady wants to replace each chip with a domino so that a magic figure appeared as a result. Different chips should be replaced by different dominoes. Determine in what number of contests Gennady can win over at the given position of the chips. You are also required to find one of the possible ways of replacing chips with dominoes to win the next Codeforces round.InputThe first line contains two positive integersnandm(1 ≤n,m≤ 30). Each of the followingnlines containsmcharacters, which is the position of chips on the field. The dots stand for empty spaces, Latin letters from \"a\" to \"z\" and \"A\", \"B\" stand for the positions of the chips. There are exactly 28 chips on the field. The squares covered by the same chip are marked by the same letter, different chips are marked by different letters. It is guaranteed that the field's description is correct.It is also guaranteed that at least one solution exists.OutputPrint on the first line the number of ways to replace chips with dominoes to get a magic figure. That is the total number of contests that can be won using this arrangement of the chips. Nextnlines containingmcharacters each, should contain a field from dots and numbers from0to6— any of the possible solutions. All dominoes should be different.ExamplesInput8 8.aabbcc..defghi.kdefghijklmnopqj.lmnopq..rstuvw.xrstuvwyxzzAABByOutput10080.001122..001122.3344005533440055.225566..225566.6611334466113344", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "08616233", "template_md5": "35d339e4", "result": "You are given a rectangular grid of size $n \\times m$. The grid is partially filled with chips, each chip occupying two adjacent squares.  The goal is to replace each chip with a domino (a 2x1 tile with two equal digits from 0 to 6) in a way that the entire grid can be covered by 14 non-overlapping 2x2 squares, where each square contains four identical digits.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the dimensions of the grid.\n* The following $n$ lines each contain $m$ characters:\n    * '.' represents an empty square.\n    * Letters from 'a' to 'z' and 'A' to 'Z' represent the positions of the chips.\n\n**Output:**\n\n* The first line should contain the number of ways to replace the chips with dominoes to form a valid magic figure.\n* The following $n$ lines should each contain $m$ characters, representing one possible solution. Each character should be a digit from 0 to 6, representing a domino.\n\n\n\nLet me know if you'd like me to elaborate on any part of the problem statement."}, {"prompt_md5": "c4b18d7c", "template_md5": "465699a0", "result": "You are given a rectangular grid partially filled with chips.  The goal is to replace each chip with a domino tile in a way that the entire grid can be covered by non-overlapping 2x2 squares, where each square contains the same number.  Find the number of ways to do this and show one possible solution."}]}