{"uid": "97-C", "url": "https://codeforces.com/contest/97/problem/C", "tags": ["binary search", " graphs", " math", " shortest paths"], "title": "97-C", "statement": "C. Winning Strategytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutOne university has just found out about a sport programming contest called ACM ICPC v2.0. This contest doesn't differ much from the well-known ACM ICPC, for example, the participants are not allowed to take part in the finals more than two times. However, there is one notable difference: the teams in the contest should consist of exactlynparticipants.Having taken part in several ACM ICPC v2.0 finals and having not won any medals, the students and the university governors realized that it's high time they changed something about the preparation process. Specifically, as the first innovation it was decided to change the teams' formation process. Having spent considerable amount of time on studying the statistics of other universities' performance, they managed to receive some interesting information: the dependence between the probability of winning a medal and the number of team members that participated in the finals in the past. More formally, we known+ 1real numbersp0≤p1≤ ... ≤pn, wherepiis the probability of getting a medal on the finals if the team hasiparticipants of previous finals, and othern-iparticipants arrived to the finals for the first time.Despite such useful data, the university governors are unable to determine such team forming tactics that would provide the maximum probability of winning a medal at ACM ICPC v2.0 finals on average (we are supposed to want to provide such result to the far future and we are also supposed to have an endless supply of students). And how about you, can you offer such optimal tactic? At the first stage the university governors want to know the value of maximum average probability.More formally, suppose that the university sends a team to thek-th world finals. The team hasakparticipants of previous finals (0 ≤ak≤n). Since each person can participate in the finals no more than twice, the following condition must be true:. Your task is to choose sequenceso that the limitΨexists and it's value is maximal:Asis an infinite sequence, you should only print the maximum value of theΨlimit.InputThe first line contains an integern(3 ≤n≤ 100),nis the number of team participants. The second line containsn+ 1real numbers with no more than 6 digits after decimal pointpi(0 ≤i≤n, 0 ≤pi≤ 1) — the probability of that the team will win a medal if it containsiparticipants who has already been on the finals. Also the conditionpi≤pi+ 1should be fulfilled for all0 ≤i≤n- 1.OutputPrint the only real number — the expected average number of medals won per year if the optimal strategy is used. The result may have absolute or relative error10- 6.ExamplesInput30.115590 0.384031 0.443128 0.562356Output0.4286122500Input31 1 1 1Output0.9999999999NoteIn the second test, no matter what participants the team contains, it is doomed to be successful.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "36104544", "template_md5": "35d339e4", "result": "You are given $n$ probabilities, $p_0, p_1, ..., p_n$, where $p_i$ represents the probability of winning a medal if a team has $i$ members who have previously participated in a competition, and the remaining $n-i$ members are first-timers.\n\nThe goal is to determine the optimal strategy for forming teams over an infinite number of competitions.  Each person can participate in the competition a maximum of two times.\n\nYou need to find the maximum possible average probability of winning a medal per competition, considering all possible team formations over time. \n\nFormally, you need to find the maximum value of the following limit:\n\n$$\\lim_{k \\to \\infty} \\frac{1}{k} \\sum_{i=0}^{k-1} p_{a_i}$$\n\nwhere $a_i$ represents the number of returning members in the team for the $i$-th competition. \n\n\n\nLet me know if you'd like me to elaborate on any part of the problem statement."}, {"prompt_md5": "1e625d4b", "template_md5": "465699a0", "result": "You are given a list of probabilities representing the chance of winning a medal based on how many team members have competed before.  Find the best way to build teams over time to maximize the average chance of winning a medal."}]}