{"uid": "975-B", "url": "https://codeforces.com/contest/975/problem/B", "tags": ["brute force", " implementation"], "title": "975-B", "statement": "B. Mancalatime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMancala is a game famous in the Middle East. It is played on a board that consists of 14 holes.Initially, each hole has $$$a_i$$$ stones. When a player makes a move, he chooses a hole which contains apositivenumber of stones. He takes all the stones inside it and then redistributes these stones one by one in the next holes in a counter-clockwise direction.Note that the counter-clockwise order means if the player takes the stones from hole $$$i$$$, he will put one stone in the $$$(i+1)$$$-th hole, then in the $$$(i+2)$$$-th, etc. If he puts a stone in the $$$14$$$-th hole, the next one will be put in the first hole.After the move, the player collects all the stones from holes that contain even number of stones. The number of stones collected by player is the score, according to Resli.Resli is a famous Mancala player. He wants to know the maximum score he can obtain after one move.InputThe only line contains 14 integers $$$a_1, a_2, \\\\ldots, a_{14}$$$ ($$$0 \\\\leq a_i \\\\leq 10^9$$$) — the number of stones in each hole.It is guaranteed that for any $$$i$$$ ($$$1\\\\leq i \\\\leq 14$$$) $$$a_i$$$ is either zero or odd, and there is at least one stone in the board.OutputOutput one integer, the maximum possible score after one move.ExamplesInput0 1 1 0 0 0 0 0 0 7 0 0 0 0Output4Input5 1 1 1 1 0 0 0 0 0 0 0 0 0Output8NoteIn the first test case the board after the move from the hole with $$$7$$$ stones will look like1 2 2 0 0 0 0 0 0 0 1 1 1 1. Then the player collects the even numbers and ends up with a score equal to $$$4$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "1c8bf913", "template_md5": "35d339e4", "result": "You are given 14 numbers, $a_1, a_2, ..., a_{14}$, representing the number of stones in each of 14 holes.  \n\nYou can choose one hole with a positive number of stones. Take all the stones from that hole and distribute them one by one into the next holes in a counter-clockwise direction (wrapping around to the first hole after the last one).\n\nAfter this distribution, collect all the stones from the holes that have an even number of stones.\n\nWhat is the maximum number of stones you can collect?"}, {"prompt_md5": "7e762da9", "template_md5": "465699a0", "result": "You are given a row of 14 containers, each containing a number of objects.  You can choose any container with objects in it, take all the objects, and distribute one object into each of the following containers (wrapping around to the beginning if you reach the end). After distributing, collect all the objects in containers with an even number. What is the maximum number of objects you can collect?"}]}