{"uid": "975-A", "url": "https://codeforces.com/contest/975/problem/A", "tags": ["implementation", " strings"], "title": "975-A", "statement": "A. Aramic scripttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputIn Aramic language words can only represent objects.Words in Aramic have special properties:A word is arootif it does not contain the same letter more than once.Arootand all its permutations represent the same object.Theroot$$$x$$$ of a word $$$y$$$ is the word that contains all letters that appear in $$$y$$$ in a way that each letter appears once. For example, therootof \"aaaa\", \"aa\", \"aaa\" is \"a\", therootof \"aabb\", \"bab\", \"baabb\", \"ab\" is \"ab\".Any word in Aramic represents the same object as itsroot.You have an ancient script in Aramic. What is the number ofdifferent objectsmentioned in the script?InputThe first line contains one integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 10^3$$$) — the number of words in the script.The second line contains $$$n$$$ words $$$s_1, s_2, \\\\ldots, s_n$$$ — the script itself. The length of each string does not exceed $$$10^3$$$.It is guaranteed that all characters of the strings are small latin letters.OutputOutput one integer — the number of different objects mentioned in the given ancient Aramic script.ExamplesInput5a aa aaa ab abbOutput2Input3amer arem mreaOutput1NoteIn the first test, there are two objects mentioned. The roots that represent them are \"a\",\"ab\".In the second test, there is only one object, its root is \"amer\", the other strings are just permutations of \"amer\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5228bdfa", "template_md5": "35d339e4", "result": "You are given a list of words.  Each word represents an object.  Two words represent the same object if they have the same letters, even if the letters are in a different order.\n\nFind the number of unique objects in the list.\n\n**Input:**\n\n* The first line contains an integer $n$ ($1 \\le n \\le 10^3$) representing the number of words.\n* The second line contains $n$ words. Each word consists of lowercase letters and has a length of at most $10^3$.\n\n**Output:**\n\n* Output a single integer representing the number of unique objects."}, {"prompt_md5": "c9dd24cd", "template_md5": "465699a0", "result": "You are given a list of words.  Each word represents an object.  Two words represent the same object if they have the same letters, even if the letters are in a different order. Find the number of unique objects in the list."}]}