{"uid": "976-A", "url": "https://codeforces.com/contest/976/problem/A", "tags": ["implementation"], "title": "976-A", "statement": "A. Minimum Binary Numbertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputString can be calledcorrectif it consists of characters \"0\" and \"1\" and there are no redundant leading zeroes. Here are some examples: \"0\", \"10\", \"1001\".You are given acorrectstrings.You can perform two different operations on this string:swap any pair of adjacent characters (for example, \"101\"\"110\");replace \"11\" with \"1\" (for example, \"110\"\"10\").Letval(s)be such a number thatsis its binary representation.Correctstringais less than some othercorrectstringbiffval(a) <val(b).Your task is to find the minimumcorrectstring that you can obtain from the given one using the operations described above. You can use these operations any number of times in any order (or even use no operations at all).InputThe first line contains integer numbern(1 ≤n≤ 100) — the length of strings.The second line contains the stringsconsisting of characters \"0\" and \"1\". It is guaranteed that the stringsiscorrect.OutputPrint one string — the minimumcorrectstring that you can obtain from the given one.ExamplesInput41001Output100Input11Output1NoteIn the first example you can obtain the answer by the following sequence of operations: \"1001\"\"1010\"\"1100\"\"100\".In the second example you can't obtain smaller answer no matter what operations you use.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d00b770b", "template_md5": "35d339e4", "result": "You are given a binary string (a string consisting only of 0s and 1s with no leading zeros).  Your task is to find the smallest possible binary string you can create from the given string by performing the following operations:\n\n* Swap any two adjacent characters (e.g., change \"101\" to \"110\").\n* Replace the substring \"11\" with \"1\".\n\nThe goal is to find the smallest binary number that can be represented by the resulting string."}, {"prompt_md5": "871b362e", "template_md5": "465699a0", "result": "You are given a binary string (a string made up of only 0s and 1s with no leading zeros).  Find the smallest possible binary string you can make from this one by swapping adjacent characters or replacing \"11\" with \"1\"."}]}