{"uid": "976-F", "url": "https://codeforces.com/contest/976/problem/F", "tags": ["flows", " graphs"], "title": "976-F", "statement": "F. Minimal k-coveringtime limit per test1.5 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a bipartite graphG= (U,V,E),Uis the set of vertices of the first part,Vis the set of vertices of the second part andEis the set of edges. There might be multiple edges.Let's call some subset of its edgesk-coveringiff the graphhas each of its vertices incident to at leastkedges.Minimalk-coveringis such ak-covering that the size of the subsetis minimal possible.Your task is to find minimalk-covering for each, whereminDegreeis the minimal degree of any vertex in graphG.InputThe first line contains three integersn1,n2andm(1 ≤n1,n2≤ 2000,0 ≤m≤ 2000) — the number of vertices in the first part, the number of vertices in the second part and the number of edges, respectively.Thei-th of the nextmlines contain two integersuiandvi(1 ≤ui≤n1, 1 ≤vi≤n2) — the description of thei-th edge,uiis the index of the vertex in the first part andviis the index of the vertex in the second part.OutputFor eachprint the subset of edges (minimalk-covering) in separate line.The first integercntkof thek-th line is the number of edges in minimalk-covering of the graph. Thencntkintegers follow — original indices of the edges which belong to the minimalk-covering, these indices should be pairwise distinct. Edges are numbered1throughmin order they are given in the input.ExamplesInput3 3 71 22 31 33 23 32 12 1Output03 3 7 46 1 3 6 7 4 5Input1 1 51 11 11 11 11 1Output01 52 4 53 3 4 54 2 3 4 55 1 2 3 4 5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "529a44b5", "template_md5": "35d339e4", "result": "You are given a graph with two sets of vertices, U and V, connected by edges.  The goal is to find the smallest set of edges that ensures every vertex in the graph is connected to at least *k* edges. \n\n**Input:**\n\n* The first line contains three integers:  *n1* (number of vertices in U), *n2* (number of vertices in V), and *m* (number of edges).\n* The next *m* lines each contain two integers, *ui* and *vi*, representing an edge between vertex *ui* in U and vertex *vi* in V.\n\n**Output:**\n\nFor each value of *k*, print:\n\n* The number of edges in the minimum *k*-covering.\n* A list of the indices of those edges (from the input).\n\n\n**Example:**\n\n**Input:**\n\n```\n3 3 7\n1 2\n2 3\n1 3\n3 2\n3 3\n2 1\n1 2\n```\n\n**Output:**\n\n```\n0 \n3 3 7 4\n``` \n\n\n\nLet me know if you'd like me to clarify any part of the problem!"}, {"prompt_md5": "12f6c95f", "template_md5": "465699a0", "result": "You are given a graph with two sets of points connected by lines.  Find the smallest set of lines that ensures every point is connected to at least 'k' other points. Output the indices of these lines."}]}