{"uid": "976-D", "url": "https://codeforces.com/contest/976/problem/D", "tags": ["constructive algorithms", " graphs", " implementation"], "title": "976-D", "statement": "D. Degree Settime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a sequence ofnpositive integersd1,d2, ...,dn(d1<d2< ... <dn). Your task is to construct an undirected graph such that:there are exactlydn+ 1vertices;there are no self-loops;there are no multiple edges;there are no more than106edges;itsdegree setis equal tod.Vertices should be numbered1through(dn+ 1).Degree sequenceis an arrayawith length equal to the number of vertices in a graph such thataiis the number of vertices adjacent toi-th vertex.Degree setis a sorted in increasing order sequence of all distinct values from thedegree sequence.It is guaranteed that there exists such a graph that all the conditions hold, and it contains no more than106edges.Print the resulting graph.InputThe first line contains one integern(1 ≤n≤ 300) — the size of the degree set.The second line containsnintegersd1,d2, ...,dn(1 ≤di≤ 1000,d1<d2< ... <dn) — the degree set.OutputIn the first line print one integerm(1 ≤m≤ 106) — the number of edges in the resulting graph. It is guaranteed that there exists such a graph that all the conditions hold and it contains no more than106edges.Each of the nextmlines should contain two integersviandui(1 ≤vi,ui≤dn+ 1) — the description of thei-th edge.ExamplesInput32 3 4Output83 14 24 52 55 13 22 15 3Input31 2 3Output41 21 31 42 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "027f1944", "template_md5": "35d339e4", "result": "You are given a sequence of $n$ positive integers $d_1, d_2, ..., d_n$ ($d_1 < d_2 < ... < d_n$).  \n\nYour task is to create a graph with the following properties:\n\n*  $n+1$ vertices numbered 1 through $n+1$.\n*  No loops (an edge connecting a vertex to itself).\n*  No multiple edges (no two edges connecting the same pair of vertices).\n*  At most $10^6$ edges.\n*  The degree sequence of the graph is $d_1, d_2, ..., d_n$.\n\nThe degree sequence of a graph is a list of the number of edges connected to each vertex, sorted in increasing order.\n\nOutput the graph by listing the number of edges ($m$) followed by $m$ pairs of integers, where each pair represents an edge between two vertices."}, {"prompt_md5": "39b3e960", "template_md5": "465699a0", "result": "You are given a list of numbers representing the desired number of connections for each node in a graph.  Your task is to create a graph with these connection counts, ensuring no node connects to itself, no connections are duplicated, and the total number of connections doesn't exceed 10^6.  Output the list of connections in the graph."}]}