{"uid": "977-E", "url": "https://codeforces.com/contest/977/problem/E", "tags": ["dfs and similar", " dsu", " graphs"], "title": "977-E", "statement": "E. Cyclic Componentstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an undirected graph consisting of $$$n$$$ vertices and $$$m$$$ edges. Your task is to find the number of connected components which are cycles.Here are some definitions of graph theory.An undirected graph consists of two sets: set of nodes (called vertices) and set of edges. Each edge connects a pair of vertices. All edges are bidirectional (i.e. if a vertex $$$a$$$ is connected with a vertex $$$b$$$, a vertex $$$b$$$ is also connected with a vertex $$$a$$$). An edge can't connect vertex with itself, there is at most one edge between a pair of vertices.Two vertices $$$u$$$ and $$$v$$$ belong to the same connected component if and only if there is at least one path along edges connecting $$$u$$$ and $$$v$$$.A connected component is a cycle if and only if its vertices can be reordered in such a way that:the first vertex is connected with the second vertex by an edge,the second vertex is connected with the third vertex by an edge,...the last vertex is connected with the first vertex by an edge,all the described edges of a cycle are distinct.A cycle doesn't contain any other edges except described above. By definition any cycle contains three or more vertices.There are $$$6$$$ connected components, $$$2$$$ of them are cycles: $$$[7, 10, 16]$$$ and $$$[5, 11, 9, 15]$$$.InputThe first line contains two integer numbers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$0 \\\\le m \\\\le 2 \\\\cdot 10^5$$$) — number of vertices and edges.The following $$$m$$$ lines contains edges: edge $$$i$$$ is given as a pair of vertices $$$v_i$$$, $$$u_i$$$ ($$$1 \\\\le v_i, u_i \\\\le n$$$, $$$u_i \\\\ne v_i$$$). There is no multiple edges in the given graph, i.e. for each pair ($$$v_i, u_i$$$) there no other pairs ($$$v_i, u_i$$$) and ($$$u_i, v_i$$$) in the list of edges.OutputPrint one integer — the number of connected components which are also cycles.ExamplesInput5 41 23 45 43 5Output1Input17 151 81 125 1111 99 1515 54 133 134 310 167 1016 714 314 417 6Output2NoteIn the first example only component $$$[3, 4, 5]$$$ is also a cycle.The illustration above corresponds to the second example.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8fed3efc", "template_md5": "35d339e4", "result": "You are given a graph with $n$ vertices and $m$ edges.  Each edge connects two vertices.  \n\nYour task is to count the number of connected components in the graph that form a cycle. A cycle is a group of vertices where you can visit each vertex exactly once and return to the starting vertex, following the edges of the graph. \n\n\nInput:\n\n* The first line contains two integers, $n$ and $m$, representing the number of vertices and edges, respectively.\n* The following $m$ lines each contain two integers, $v_i$ and $u_i$, representing an edge between vertices $v_i$ and $u_i$.\n\nOutput:\n\n* Print a single integer representing the number of connected components that are cycles."}, {"prompt_md5": "2d5603ea", "template_md5": "465699a0", "result": "You are given a network of points connected by lines.  Find the number of groups of points where every point is connected to every other point in the group by lines, and there are no extra lines connecting points outside the group."}]}