{"uid": "977-A", "url": "https://codeforces.com/contest/977/problem/A", "tags": ["implementation"], "title": "977-A", "statement": "A. Wrong Subtractiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputLittle girl Tanya is learning how to decrease a number by one, but she does it wrong with a number consisting of two or more digits. Tanya subtracts one from a number by the following algorithm:if the last digit of the number is non-zero, she decreases the number by one;if the last digit of the number is zero, she divides the number by 10 (i.e. removes the last digit).You are given an integer number $$$n$$$. Tanya will subtract one from it $$$k$$$ times. Your task is to print the result after all $$$k$$$ subtractions.It is guaranteed that the result will be positive integer number.InputThe first line of the input contains two integer numbers $$$n$$$ and $$$k$$$ ($$$2 \\\\le n \\\\le 10^9$$$, $$$1 \\\\le k \\\\le 50$$$) — the number from which Tanya will subtract and the number of subtractions correspondingly.OutputPrint one integer number — the result of the decreasing $$$n$$$ by one $$$k$$$ times.It is guaranteed that the result will be positive integer number.ExamplesInput512 4Output50Input1000000000 9Output1NoteThe first example corresponds to the following sequence: $$$512 \\\\rightarrow 511 \\\\rightarrow 510 \\\\rightarrow 51 \\\\rightarrow 50$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "6033be26", "template_md5": "35d339e4", "result": "You are given a positive integer $n$ and a positive integer $k$.  \n\nTanya has a special way of decreasing a number by one:\n\n* If the last digit of the number is not zero, subtract 1 from the number.\n* If the last digit of the number is zero, remove the last digit.\n\nApply this process to $n$ for $k$ times. What is the final result?"}, {"prompt_md5": "b5e256cd", "template_md5": "465699a0", "result": "You are given a number and a number of times to subtract from it.  Each subtraction works like this: if the last digit is not zero, subtract 1. If the last digit is zero, remove the last digit. What is the final number after all the subtractions?"}]}