{"uid": "978-G", "url": "https://codeforces.com/contest/978/problem/G", "tags": ["greedy", " implementation", " sortings"], "title": "978-G", "statement": "G. Petya's Examstime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPetya studies at university. The current academic year finishes with $$$n$$$ special days. Petya needs to pass $$$m$$$ exams in those special days. The special days in this problem are numbered from $$$1$$$ to $$$n$$$.There are three values about each exam:$$$s_i$$$ — the day, when questions for the $$$i$$$-th exam will be published,$$$d_i$$$ — the day of the $$$i$$$-th exam ($$$s_i < d_i$$$),$$$c_i$$$ — number of days Petya needs to prepare for the $$$i$$$-th exam. For the $$$i$$$-th exam Petya should prepare in days between $$$s_i$$$ and $$$d_i-1$$$, inclusive.There are three types of activities for Petya in each day: to spend a day doing nothing (taking a rest), to spend a day passing exactly one exam or to spend a day preparing for exactly one exam. So he can't pass/prepare for multiple exams in a day. He can't mix his activities in a day. If he is preparing for the $$$i$$$-th exam in day $$$j$$$, then $$$s_i \\\\le j < d_i$$$.It is allowed to have breaks in a preparation to an exam and to alternate preparations for different exams in consecutive days. So preparation for an exam is not required to be done in consecutive days.Find the schedule for Petya to prepare for all exams and pass them, or report that it is impossible.InputThe first line contains two integers $$$n$$$ and $$$m$$$ $$$(2 \\\\le n \\\\le 100, 1 \\\\le m \\\\le n)$$$ — the number of days and the number of exams.Each of the following $$$m$$$ lines contains three integers $$$s_i$$$, $$$d_i$$$, $$$c_i$$$ $$$(1 \\\\le s_i < d_i \\\\le n, 1 \\\\le c_i \\\\le n)$$$ — the day, when questions for the $$$i$$$-th exam will be given, the day of the $$$i$$$-th exam, number of days Petya needs to prepare for the $$$i$$$-th exam.Guaranteed, that all the exams will be in different days. Questions for different exams can be given in the same day. It is possible that, in the day of some exam, the questions for other exams are given.OutputIf Petya can not prepare and pass all the exams, print-1. In case of positive answer, print $$$n$$$ integers, where the $$$j$$$-th number is:$$$(m + 1)$$$, if the $$$j$$$-th day is a day of some exam (recall that in each day no more than one exam is conducted),zero, if in the $$$j$$$-th day Petya will have a rest,$$$i$$$ ($$$1 \\\\le i \\\\le m$$$), if Petya will prepare for the $$$i$$$-th exam in the day $$$j$$$ (the total number of days Petya prepares for each exam should bestrictlyequal to the number of days needed to prepare for it).Assume that the exams are numbered in order of appearing in the input, starting from $$$1$$$.If there are multiple schedules, print any of them.ExamplesInput5 21 3 11 5 1Output1 2 3 0 3Input3 21 3 11 2 1Output-1Input10 34 7 21 10 38 9 1Output2 2 2 1 1 0 4 3 4 4NoteIn the first example Petya can, for example, prepare for exam $$$1$$$ in the first day, prepare for exam $$$2$$$ in the second day, pass exam $$$1$$$ in the third day, relax in the fourth day, and pass exam $$$2$$$ in the fifth day. So, he can prepare and pass all exams.In the second example, there are three days and two exams. So, Petya can prepare in only one day (because in two other days he should pass exams). Then Petya can not prepare and pass all exams.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b67c6844", "template_md5": "35d339e4", "result": "There are $n$ days and $m$ exams. Each exam has three attributes:\n\n* $s_i$: The day the questions for the $i$-th exam are released.\n* $d_i$: The day the $i$-th exam is taken.\n* $c_i$: The number of days needed to prepare for the $i$-th exam.\n\nPetya can do one of three things each day:\n\n* Rest\n* Take one exam\n* Prepare for one exam\n\nPreparation for an exam can happen on any day between $s_i$ (inclusive) and $d_i$ (exclusive).  \n\nDetermine a schedule for Petya to prepare for and take all the exams, or report that it is impossible.\n\nOutput the schedule as a sequence of $n$ integers:\n\n* $(m+1)$ if the $j$-th day is an exam day\n* 0 if the $j$-th day is a rest day\n* $i$ if Petya prepares for the $i$-th exam on the $j$-th day."}, {"prompt_md5": "8a2fe4d6", "template_md5": "465699a0", "result": "You have a set number of days and a set number of tasks that need to be completed over those days. Each task has a start date, an end date, and a preparation time. You can only do one thing per day: rest, take a test, or prepare for a test.  Find a schedule to complete all the tasks. If it's impossible, say so."}]}