{"uid": "978-D", "url": "https://codeforces.com/contest/978/problem/D", "tags": ["brute force", " implementation", " math"], "title": "978-D", "statement": "D. Almost Arithmetic Progressiontime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputPolycarp likes arithmetic progressions. A sequence $$$[a_1, a_2, \\\\dots, a_n]$$$ is called an arithmetic progression if for each $$$i$$$ ($$$1 \\\\le i < n$$$) the value $$$a_{i+1} - a_i$$$ is the same. For example, the sequences $$$[42]$$$, $$$[5, 5, 5]$$$, $$$[2, 11, 20, 29]$$$ and $$$[3, 2, 1, 0]$$$ are arithmetic progressions, but $$$[1, 0, 1]$$$, $$$[1, 3, 9]$$$ and $$$[2, 3, 1]$$$ are not.It follows from the definition that any sequence of length one or two is an arithmetic progression.Polycarp found some sequence of positive integers $$$[b_1, b_2, \\\\dots, b_n]$$$. He agrees to change each element by at most one. In the other words, for each element there are exactly three options: an element can be decreased by $$$1$$$, an element can be increased by $$$1$$$, an element can be left unchanged.Determine a minimum possible number of elements in $$$b$$$ which can be changed (by exactly one), so that the sequence $$$b$$$ becomes an arithmetic progression, or report that it is impossible.It is possible that the resulting sequence contains element equals $$$0$$$.InputThe first line contains a single integer $$$n$$$ $$$(1 \\\\le n \\\\le 100\\\\,000)$$$ — the number of elements in $$$b$$$.The second line contains a sequence $$$b_1, b_2, \\\\dots, b_n$$$ $$$(1 \\\\le b_i \\\\le 10^{9})$$$.OutputIf it is impossible to make an arithmetic progression with described operations, print-1. In the other case, print non-negative integer — the minimum number of elements to change to make the given sequence becomes an arithmetic progression. The only allowed operation is to add/to subtract one from an element (can't use operation twice to the same position).ExamplesInput424 21 14 10Output3Input2500 500Output0Input314 5 1Output-1Input51 3 6 9 12Output1NoteIn the first example Polycarp should increase the first number on $$$1$$$, decrease the second number on $$$1$$$, increase the third number on $$$1$$$, and the fourth number should left unchanged. So, after Polycarp changed three elements by one, his sequence became equals to $$$[25, 20, 15, 10]$$$, which is an arithmetic progression.In the second example Polycarp should not change anything, because his sequence is an arithmetic progression.In the third example it is impossible to make an arithmetic progression.In the fourth example Polycarp should change only the first element, he should decrease it on one. After that his sequence will looks like $$$[0, 3, 6, 9, 12]$$$, which is an arithmetic progression.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "afb9f1aa", "template_md5": "35d339e4", "result": "You are given a sequence of positive integers. You can change each element in the sequence by at most one (increase it by 1, decrease it by 1, or leave it unchanged).  \n\nDetermine the minimum number of elements you need to change so that the sequence becomes an arithmetic progression. An arithmetic progression is a sequence where the difference between consecutive terms is constant.\n\nIf it's impossible to make the sequence an arithmetic progression, output -1. \n\n\nInput:\n\n* The first line contains an integer  $n$ ($1 \\le n \\le 100,000$) representing the number of elements in the sequence.\n* The second line contains $n$ integers $b_1, b_2, ..., b_n$ ($1 \\le b_i \\le 10^9$) representing the sequence.\n\nOutput:\n\n* Output a non-negative integer representing the minimum number of changes needed to make the sequence an arithmetic progression. If it's impossible, output -1."}, {"prompt_md5": "cd754d96", "template_md5": "465699a0", "result": "You are given a list of numbers. You can change each number by adding or subtracting 1. Find the minimum number of changes needed to make the list form an arithmetic progression (where the difference between consecutive numbers is constant). If it's impossible, output -1."}]}