{"uid": "979-B", "url": "https://codeforces.com/contest/979/problem/B", "tags": ["greedy"], "title": "979-B", "statement": "B. Treasure Hunttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAfter the big birthday party, Katie still wanted Shiro to have some more fun. Later, she came up with a game calledtreasure hunt. Of course, she invited her best friends Kuro and Shiro to play with her.The three friends are very smart so they passed all the challenges very quickly and finally reached the destination. But the treasure can only belong to one cat so they started to think of something which can determine who is worthy of the treasure. Instantly, Kuro came up with some ribbons.A random colorful ribbon is given to each of the cats. Each color of the ribbon can be represented as an uppercase or lowercase Latin letter. Let's call a consecutive subsequence of colors that appears in the ribbon asubribbon. Thebeautyof a ribbon is defined as the maximum number of times one of its subribbon appears in the ribbon. The more the subribbon appears, the more beautiful is the ribbon. For example, the ribbonaaaaaaahas the beauty of $$$7$$$ because its subribbonaappears $$$7$$$ times, and the ribbonabcdabchas the beauty of $$$2$$$ because its subribbonabcappears twice.The rules are simple. The game will have $$$n$$$ turns. Every turn, each of the cats must change strictlyonecolor (at one position) in his/her ribbon to an arbitrary color which isdifferentfrom the unchanged one. For example, a ribbonaaabcan be changed intoacabin one turn. The one having the most beautiful ribbon after $$$n$$$ turns wins the treasure.Could you find out who is going to be the winner if they all play optimally?InputThe first line contains an integer $$$n$$$ ($$$0 \\\\leq n \\\\leq 10^{9}$$$) — the number of turns.Next 3 lines contain 3 ribbons of Kuro, Shiro and Katie one per line, respectively. Each ribbon is a string which contains no more than $$$10^{5}$$$ uppercase and lowercase Latin letters and is not empty. It is guaranteed that the length of all ribbons are equal for the purpose of fairness. Note that uppercase and lowercase letters are considered different colors.OutputPrint the name of the winner (\"Kuro\", \"Shiro\" or \"Katie\"). If there are at least two cats that share the maximum beauty, print \"Draw\".ExamplesInput3KurooShiroKatieOutputKuroInput7treasurehuntthreefriendshiCodeforcesOutputShiroInput1abcabccbabacababcaOutputKatieInput15foPaErcvJmZaxowpbtmkuOlaHREOutputDrawNoteIn the first example, after $$$3$$$ turns, Kuro can change his ribbon intoooooo, which has the beauty of $$$5$$$, while reaching such beauty for Shiro and Katie is impossible (both Shiro and Katie can reach the beauty of at most $$$4$$$, for example by changing Shiro's ribbon intoSSiSSand changing Katie's ribbon intoKaaaa). Therefore, the winner is Kuro.In the fourth example, since the length of each of the string is $$$9$$$ and the number of turn is $$$15$$$, everyone can change their ribbons in some way to reach the maximal beauty of $$$9$$$ by changing their strings intozzzzzzzzzafter 9 turns, and repeatedly change their strings intoazzzzzzzzand then intozzzzzzzzzthrice. Therefore, the game ends in a draw.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b462176c", "template_md5": "35d339e4", "result": "There are three players. Each player has a string of uppercase and lowercase letters.  \n\nThe beauty of a string is the maximum number of times any consecutive subsequence of letters (a sub-string) appears in the string.\n\nOver $n$ turns, each player can change one letter in their string to a different letter.\n\nDetermine which player will have the most beautiful string after $n$ turns. If two or more players have the same maximum beauty, it's a draw. \n\n\n\nInput:\n\n* The first line contains an integer $n$ ($0 \\leq n \\leq 10^9$) representing the number of turns.\n* The next three lines contain the strings for each player, one per line. Each string has no more than $10^5$ uppercase and lowercase letters and is not empty. All strings have the same length.\n\nOutput:\n\nPrint the name of the winner (\"Player 1\", \"Player 2\", or \"Player 3\"). If there is a draw, print \"Draw\"."}, {"prompt_md5": "e1c14b70", "template_md5": "465699a0", "result": "Three players each have a string of letters. Over a set number of turns, each player can change one letter in their string to a different letter. The goal is to have the string with the most repeating consecutive letter sequences (substrings) after the turns are over.  Who will win?"}]}