{"uid": "98-A", "url": "https://codeforces.com/contest/98/problem/A", "tags": ["brute force", " implementation"], "title": "98-A", "statement": "A. Help Victoria the Wisetime limit per test1 secondmemory limit per test256 megabytesinputstdinoutputstdoutVasilisa the Wise from a far away kingdom got a present from her friend Helga the Wise from a farther away kingdom. The present is a surprise box, yet Vasilisa the Wise doesn't know yet what the surprise actually is because she cannot open the box. She hopes that you can help her in that.The box's lock is constructed like that. The box itself is represented by an absolutely perfect black cube with the identical deepening on each face (those are some foreign nanotechnologies that the far away kingdom scientists haven't dreamt of). The box is accompanied by six gems whose form matches the deepenings in the box's faces. The box can only be opened after it is correctly decorated by the gems, that is, when each deepening contains exactly one gem. Two ways of decorating the box are considered the same if they can be obtained one from the other one by arbitrarily rotating the box (note that the box is represented by a perfect nanotechnological cube)Now Vasilisa the Wise wants to know by the given set of colors the following: in how many ways would she decorate the box in the worst case to open it? To answer this question it is useful to know that two gems of one color are indistinguishable from each other. Help Vasilisa to solve this challenging problem.InputThe first line contains exactly6characters without spaces from the set {R,O,Y,G,B,V} — they are the colors of gems with which the box should be decorated.OutputPrint the required number of different ways to decorate the box.ExamplesInputYYYYYYOutput1InputBOOOOBOutput2InputROYGBVOutput30", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d3fd3252", "template_md5": "35d339e4", "result": "You are given a set of 6 gems, each with a distinct color (R, O, Y, G, B, V).  You need to place these gems onto the faces of a cube, with one gem on each face.  \n\nThe order in which you place the gems matters, but rotations of the cube are considered the same arrangement.\n\nHow many unique ways are there to place the gems on the cube?"}, {"prompt_md5": "eead99b1", "template_md5": "465699a0", "result": "You are given six distinct colors.  How many ways are there to arrange these colors into six slots, where the order matters?"}]}