{"uid": "98-E", "url": "https://codeforces.com/contest/98/problem/E", "tags": ["dp", " games", " math", " probabilities"], "title": "98-E", "statement": "E. Help Shrek and Donkeytime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutShrek and the Donkey (as you can guess, they also live in the far away kingdom) decided to play a card game called YAGame. The rules are very simple: initially Shrek holdsmcards and the Donkey holdsncards (the players do not see each other's cards), and one more card lies on the table face down so that both players cannot see it as well. Thus, at the beginning of the game there are overallm+n+ 1cards. Besides, the players know which cards the pack of cards consists of and their own cards (but they do not know which card lies on the table and which ones the other player has). The players move in turn and Shrek starts. During a move a player can:Try to guess which card is lying on the table. If he guesses correctly, the game ends and he wins. If his guess is wrong, the game also ends but this time the other player wins.Name any card from the pack. If the other player has such card, he must show it and put it aside (so that this card is no longer used in the game). If the other player doesn't have such card, he says about that.Recently Donkey started taking some yellow pills and winning over Shrek. Now Shrek wants to evaluate his chances to win if he too starts taking the pills.Help Shrek assuming the pills are good in quality and that both players using them start playing in the optimal manner.InputThe first line contains space-separated integersmandn(0 ≤m,n≤ 1000).OutputPrint space-separated probabilities that Shrek wins and Donkey wins correspondingly; the absolute error should not exceed10- 9.ExamplesInput0 3Output0.25 0.75Input1 0Output1 0Input1 1Output0.5 0.5", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c3c2e485", "template_md5": "35d339e4", "result": "Two players, Player 1 and Player 2, play a card game.  \n\n* Initially, Player 1 has $m$ cards, Player 2 has $n$ cards, and there is 1 unknown card face down. \n* Both players know the total number of cards in the deck and their own cards, but not the unknown card or the other player's cards.\n* Players take turns. On a turn, a player can:\n    * **Guess the unknown card:** If correct, they win. If incorrect, the other player wins.\n    * **Name a card:** If the other player has that card, they must show it and remove it from the game. If not, the other player says so.\n\nDetermine the probability that Player 1 wins and the probability that Player 2 wins, assuming both players play optimally."}, {"prompt_md5": "78772c37", "template_md5": "465699a0", "result": "Two players take turns in a card game.  \n\nThe players know the total number of cards and their own cards, but not the cards held by the other player or the single face-down card.\n\nOn a turn, a player can:\n\n1. Guess the face-down card. If correct, they win. If incorrect, the other player wins.\n2. Name a card. If the other player has it, they must show it. If not, nothing happens.\n\nThe game ends when one player guesses correctly or when one player has no cards left.\n\nGiven the number of cards each player starts with, what is the probability that each player will win?"}]}