{"uid": "980-F", "url": "https://codeforces.com/contest/980/problem/F", "tags": ["dp", " graphs", " trees"], "title": "980-F", "statement": "F. Cactus to Treetime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a special connected undirected graph where each vertex belongs to at most one simple cycle.Your task is to remove as many edges as needed to convert this graph into a tree (connected graph with no cycles).For each node, independently, output the maximum distance between it and a leaf in the resulting tree, assuming you were to remove the edges in a way that minimizes this distance.InputThe first line of input contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\leq n \\\\leq 5\\\\cdot 10^5$$$), the number of nodes and the number of edges, respectively.Each of the following $$$m$$$ lines contains two integers $$$u$$$ and $$$v$$$ ($$$1 \\\\leq u,v \\\\leq n$$$, $$$u \\\\ne v$$$), and represents an edge connecting the two nodes $$$u$$$ and $$$v$$$. Each pair of nodes is connected by at most one edge.It is guaranteed that the given graph is connected and each vertex belongs to at most one simple cycle.OutputPrint $$$n$$$ space-separated integers, the $$$i$$$-th integer represents the maximum distance between node $$$i$$$ and a leaf if the removed edges were chosen in a way that minimizes this distance.ExamplesInput9 107 29 21 63 14 34 77 69 85 85 9Output5 3 5 4 5 4 3 5 4Input4 41 22 33 44 1Output2 2 2 2NoteIn the first sample, a possible way to minimize the maximum distance from vertex $$$1$$$ is by removing the marked edges in the following image:Note that to minimize the answer for different nodes, you can remove different edges.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ac68ff8c", "template_md5": "35d339e4", "result": "You are given a connected graph with $n$ nodes and $m$ edges. Each node is part of at most one cycle.  Your task is to remove edges from the graph to transform it into a tree (a connected graph with no cycles).\n\nFor each node, find the maximum distance between that node and a leaf node in the resulting tree.  You should remove edges in a way that minimizes this maximum distance for all nodes.\n\n**Input:**\n\n* The first line contains two integers, $n$ and $m$, representing the number of nodes and edges, respectively.\n* Each of the following $m$ lines contains two integers, $u$ and $v$, representing an edge between nodes $u$ and $v$.\n\n**Output:**\n\nPrint $n$ space-separated integers. The $i$-th integer represents the maximum distance between node $i$ and a leaf in the resulting tree."}, {"prompt_md5": "f1b5a770", "template_md5": "465699a0", "result": "You are given a connected graph where each node is part of at most one loop.  Your task is to remove edges to turn the graph into a tree (a connected graph with no loops). For each node, find the longest distance to a leaf node in the resulting tree, assuming you remove edges to minimize this distance for all nodes."}]}