{"uid": "980-E", "url": "https://codeforces.com/contest/980/problem/E", "tags": ["data structures", " greedy", " trees"], "title": "980-E", "statement": "E. The Number Gamestime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThe nation of Panel holds an annual show called The Number Games, where each district in the nation will be represented by one contestant.The nation has $$$n$$$ districts numbered from $$$1$$$ to $$$n$$$, each district has exactly one path connecting it to every other district. The number of fans of a contestant from district $$$i$$$ is equal to $$$2^i$$$.This year, the president decided to reduce the costs. He wants to remove $$$k$$$ contestants from the games. However, the districts of the removed contestants will be furious and will not allow anyone to cross through their districts.The president wants to ensure that all remaining contestants are from districts that can be reached from one another. He also wishes to maximize the total number of fans of the participating contestants.Which contestants should the president remove?InputThe first line of input contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\leq k < n \\\\leq 10^6$$$) — the number of districts in Panel, and the number of contestants the president wishes to remove, respectively.The next $$$n-1$$$ lines each contains two integers $$$a$$$ and $$$b$$$ ($$$1 \\\\leq a, b \\\\leq n$$$, $$$a \\\\ne b$$$), that describe a road that connects two different districts $$$a$$$ and $$$b$$$ in the nation. It is guaranteed that there is exactly one path between every two districts.OutputPrint $$$k$$$ space-separated integers: the numbers of the districts of which the contestants should be removed,in increasing order of district number.ExamplesInput6 32 12 64 25 62 3Output1 3 4Input8 42 62 77 81 23 12 47 5Output1 3 4 5NoteIn the first sample, the maximum possible total number of fans is $$$2^2 + 2^5 + 2^6 = 100$$$. We can achieve it by removing the contestants of the districts 1, 3, and 4.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "425cbb07", "template_md5": "35d339e4", "result": "There are $n$ districts. Each district has a contestant, and the number of fans of a contestant from district $i$ is $2^i$. \n\nYou need to remove $k$ contestants so that the remaining contestants can all reach each other.  \n\nFind the $k$ districts to remove to maximize the total number of fans of the remaining contestants.\n\nInput:\n\n* Two integers $n$ and $k$ ($1 \\le k < n \\le 10^6$)\n* $n-1$ lines, each with two integers $a$ and $b$ ($1 \\le a, b \\le n$, $a \\ne b$), representing a road connecting districts $a$ and $b$.\n\nOutput:\n\n* $k$ integers, the numbers of the districts to remove, in increasing order."}, {"prompt_md5": "a51417f6", "template_md5": "465699a0", "result": "You are given a list of cities connected by roads. Each city has a certain number of supporters. You need to remove some cities to minimize the total number of supporters, but you must ensure that the remaining cities are still connected. What cities should you remove?"}]}