{"uid": "981-D", "url": "https://codeforces.com/contest/981/problem/D", "tags": ["bitmasks", " dp", " greedy"], "title": "981-D", "statement": "D. Bookshelvestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMr Keks is a typical white-collar in Byteland.He has a bookshelf in his office with some books on it, each book has an integer positive price.Mr Keks defines the value of a shelf as the sum of books prices on it.Miraculously, Mr Keks was promoted and now he is moving into a new office.He learned that in the new office he will have not a single bookshelf, but exactly $$$k$$$ bookshelves. He decided that the beauty of the $$$k$$$ shelves is thebitwise ANDof the values of all the shelves.He also decided that he won't spend time on reordering the books, so he will place several first books on the first shelf, several next books on the next shelf and so on. Of course, he will place at least one book on each shelf. This way he will put all his books on $$$k$$$ shelves in such a way that the beauty of the shelves is as large as possible. Compute this maximum possible beauty.InputThe first line contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\leq k \\\\leq n \\\\leq 50$$$) — the number of books and the number of shelves in the new office.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots a_n$$$, ($$$0 < a_i < 2^{50}$$$) — the prices of the books in the order they stand on the old shelf.OutputPrint the maximum possible beauty of $$$k$$$ shelves in the new office.ExamplesInput10 49 14 28 1 7 13 15 29 2 31Output24Input7 33 14 15 92 65 35 89Output64NoteIn the first example you can split the books as follows:$$$$$$(9 + 14 + 28 + 1 + 7) \\\\& (13 + 15) \\\\& (29 + 2) \\\\& (31) = 24.$$$$$$In the second example you can split the books as follows:$$$$$$(3 + 14 + 15 + 92) \\\\& (65) \\\\& (35 + 89) = 64.$$$$$$", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "26b55b31", "template_md5": "35d339e4", "result": "You are given $n$ books, each with a positive integer price. You need to arrange these books into $k$ shelves.  The beauty of the arrangement is defined as the bitwise AND of the sum of prices of books on each shelf.  Find the maximum possible beauty. \n\nInput:\n\n* The first line contains two integers $n$ and $k$ ($1 \\leq k \\leq n \\leq 50$) representing the number of books and the number of shelves.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ ($0 < a_i < 2^{50}$) representing the prices of the books.\n\nOutput:\n\nPrint the maximum possible beauty."}, {"prompt_md5": "fcb6ac11", "template_md5": "465699a0", "result": "You have a number of items with given values. You need to divide these items into groups and place each group on a shelf. The goal is to maximize the bitwise AND of the sum of values in each shelf."}]}