{"uid": "981-A", "url": "https://codeforces.com/contest/981/problem/A", "tags": ["brute force", " implementation", " strings"], "title": "981-A", "statement": "A. Antipalindrometime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputA string is a palindrome if it reads the same from the left to the right and from the right to the left. For example, the strings \"kek\", \"abacaba\", \"r\" and \"papicipap\" are palindromes, while the strings \"abb\" and \"iq\" are not.A substring $$$s[l \\\\ldots r]$$$ ($$$1 \\\\leq l \\\\leq r \\\\leq |s|$$$) of a string $$$s = s_{1}s_{2} \\\\ldots s_{|s|}$$$ is the string $$$s_{l}s_{l + 1} \\\\ldots s_{r}$$$.Anna does not like palindromes, so she makes her friends call her Ann. She also changes all the words she reads in a similar way. Namely, each word $$$s$$$ is changed into its longest substring that is not a palindrome. If all the substrings of $$$s$$$ are palindromes, she skips the word at all.Some time ago Ann read the word $$$s$$$. What is the word she changed it into?InputThe first line contains a non-empty string $$$s$$$ with length at most $$$50$$$ characters, containing lowercase English letters only.OutputIf there is such a substring in $$$s$$$ that is not a palindrome, print the maximum length of such a substring. Otherwise print $$$0$$$.Note that there can be multiple longest substrings that are not palindromes, but their length is unique.ExamplesInputmewOutput3InputwuffuwOutput5InputqqqqqqqqOutput0Note\"mew\" is not a palindrome, so the longest substring of it that is not a palindrome, is the string \"mew\" itself. Thus, the answer for the first example is $$$3$$$.The string \"uffuw\" is one of the longest non-palindrome substrings (of length $$$5$$$) of the string \"wuffuw\", so the answer for the second example is $$$5$$$.All substrings of the string \"qqqqqqqq\" consist of equal characters so they are palindromes. This way, there are no non-palindrome substrings. Thus, the answer for the third example is $$$0$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "8cc94015", "template_md5": "35d339e4", "result": "Given a string $s$, find the length of the longest substring that is not a palindrome. If no such substring exists, output 0. \n\nA palindrome reads the same backward as forward (e.g., \"racecar\")."}, {"prompt_md5": "2d14ee2a", "template_md5": "465699a0", "result": "Given a string, find the length of the longest substring that is not a palindrome. If no such substring exists, output 0."}]}