{"uid": "982-C", "url": "https://codeforces.com/contest/982/problem/C", "tags": ["dfs and similar", " dp", " graphs", " greedy", " trees"], "title": "982-C", "statement": "C. Cut 'em all!time limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou're given a tree with $$$n$$$ vertices.Your task is to determine the maximum possible number of edges that can be removed in such a way that all the remaining connected components will have even size.InputThe first line contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le 10^5$$$) denoting the size of the tree.The next $$$n - 1$$$ lines contain two integers $$$u$$$, $$$v$$$ ($$$1 \\\\le u, v \\\\le n$$$) each, describing the vertices connected by the $$$i$$$-th edge.It's guaranteed that the given edges form a tree.OutputOutput a single integer $$$k$$$ — the maximum number of edges that can be removed to leave all connected components with even size, or $$$-1$$$ if it is impossible to remove edges in order to satisfy this property.ExamplesInput42 44 13 1Output1Input31 21 3Output-1Input107 18 48 104 76 59 33 52 102 5Output4Input21 2Output0NoteIn the first example you can remove the edge between vertices $$$1$$$ and $$$4$$$. The graph after that will have two connected components with two vertices in each.In the second example you can't remove edges in such a way that all components have even number of vertices, so the answer is $$$-1$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ce6ec198", "template_md5": "35d339e4", "result": "You are given a tree with $n$ vertices.  A tree is a connected graph with no cycles.  \n\nYour task is to find the maximum number of edges you can remove from the tree so that all the remaining connected components have an even number of vertices.  \n\n**Input:**\n\n* The first line contains an integer $n$ ($1 \\le n \\le 10^5$) representing the number of vertices in the tree.\n* The next $n-1$ lines each contain two integers $u$ and $v$ ($1 \\le u, v \\le n$) representing an edge between vertices $u$ and $v$.\n\n**Output:**\n\n* Output a single integer $k$ representing the maximum number of edges you can remove. If it is impossible to remove edges so that all components have an even number of vertices, output $-1$."}, {"prompt_md5": "bda77706", "template_md5": "465699a0", "result": "You are given a connected network of points.  Find the maximum number of connections you can remove so that each remaining group of connected points has an even number of points. If this is impossible, output -1."}]}