{"uid": "984-A", "url": "https://codeforces.com/contest/984/problem/A", "tags": ["sortings"], "title": "984-A", "statement": "A. Gametime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputTwo players play a game.Initially there are $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ written on the board. Each turn a player selects one number and erases it from the board. This continues until there is only one number left on the board, i. e. $$$n - 1$$$ turns are made. The first player makes the first move, then players alternate turns.The first player wants to minimize the last number that would be left on the board, while the second player wants to maximize it.You want to know what number will be left on the board after $$$n - 1$$$ turns if both players make optimal moves.InputThe first line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 1000$$$) — the number of numbers on the board.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$1 \\\\le a_i \\\\le 10^6$$$).OutputPrint one number that will be left on the board.ExamplesInput32 1 3Output2Input32 2 2Output2NoteIn the first sample, the first player erases $$$3$$$ and the second erases $$$1$$$. $$$2$$$ is left on the board.In the second sample, $$$2$$$ is left on the board regardless of the actions of the players.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7923f257", "template_md5": "35d339e4", "result": "Two players take turns removing numbers from a list.  The list starts with $n$ numbers ($1 \\le n \\le 1000$). Each number is between 1 and $10^6$ inclusive. The first player goes first. The goal of the first player is to leave the smallest possible number on the list after all but one number is removed. The goal of the second player is to leave the largest possible number. \n\nWhat number will be left on the list after all but one number is removed if both players play optimally?"}, {"prompt_md5": "3887450f", "template_md5": "465699a0", "result": "Two players take turns removing numbers from a list. The player who removes the last number wins.  The first player wants to remove the smallest possible number, while the second player wants to remove the largest possible number. What number will be left?"}]}