{"uid": "985-B", "url": "https://codeforces.com/contest/985/problem/B", "tags": ["implementation"], "title": "985-B", "statement": "B. Switches and Lampstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are givennswitches andmlamps. Thei-th switch turns on some subset of the lamps. This information is given as the matrixaconsisting ofnrows andmcolumns whereai,j= 1if thei-th switch turns on thej-th lamp andai,j= 0if thei-th switch is not connected to thej-th lamp.Initially allmlamps are turned off.Switches change state only from \"off\" to \"on\". It means that if you press two or more switches connected to the same lamp then the lamp will be turned on after any of this switches is pressed and will remain its state even if any switch connected to this lamp is pressed afterwards.It is guaranteed that if you push allnswitches thenallmlamps will be turned on.Your think that you have too many switches and you would like to ignore one of them.Your task is to say if there exists such a switch that if you will ignore (not use) it but press all the othern- 1switches then all themlamps will be turned on.InputThe first line of the input contains two integersnandm(1 ≤n,m≤ 2000) — the number of the switches and the number of the lamps.The followingnlines containmcharacters each. The characterai,jis equal to '1' if thei-th switch turns on thej-th lamp and '0' otherwise.It is guaranteed that if you press allnswitchesallmlamps will be turned on.OutputPrint \"YES\" if there is a switch that if you will ignore it and press all the othern- 1switches then allmlamps will be turned on. Print \"NO\" if there is no such switch.ExamplesInput4 510101010000011110000OutputYESInput4 510100010000011000101OutputNO", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "676b072e", "template_md5": "35d339e4", "result": "You are given $n$ switches and $m$ lamps. Each switch can turn on a subset of the lamps. This information is represented by a matrix $a$ where $a_{i,j} = 1$ if the $i$-th switch turns on the $j$-th lamp, and $a_{i,j} = 0$ otherwise. Initially, all lamps are off.\n\nA switch can only be turned on, not off. If multiple switches are connected to the same lamp, the lamp will turn on if any of those switches are turned on and will remain on even if those switches are turned off later.\n\nIt is guaranteed that if you turn on all $n$ switches, all $m$ lamps will turn on.\n\nYour task is to determine if there exists a switch that, if ignored (not turned on), will still allow all lamps to turn on if you turn on all the other $n-1$ switches.\n\nIf such a switch exists, print \"YES\". Otherwise, print \"NO\"."}, {"prompt_md5": "b8ba9449", "template_md5": "465699a0", "result": "You have a set of switches that control a set of lights. Each switch can turn on multiple lights.  You want to find out if there's a switch that, if you ignore it, you can still turn on all the lights by using the other switches."}]}