{"uid": "985-F", "url": "https://codeforces.com/contest/985/problem/F", "tags": ["hashing", " strings"], "title": "985-F", "statement": "F. Isomorphic Stringstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a stringsof lengthnconsisting of lowercase English letters.For two given stringssandt, saySis the set of distinct characters ofsandTis the set of distinct characters oft. The stringssandtareisomorphicif their lengths are equal and there is a one-to-one mapping (bijection)fbetweenSandTfor whichf(si) =ti. Formally:f(si) =tifor any indexi,for any characterthere is exactly one characterthatf(x) =y,for any characterthere is exactly one characterthatf(x) =y.For example, the strings \"aababc\" and \"bbcbcz\" are isomorphic. Also the strings \"aaaww\" and \"wwwaa\" are isomorphic. The following pairs of strings are not isomorphic: \"aab\" and \"bbb\", \"test\" and \"best\".You have to handlemqueries characterized by three integersx,y,len(1 ≤x,y≤n-len+ 1). For each query check if two substringss[x...x+len- 1]ands[y...y+len- 1]are isomorphic.InputThe first line contains two space-separated integersnandm(1 ≤n≤ 2·105,1 ≤m≤ 2·105) — the length of the stringsand the number of queries.The second line contains stringsconsisting ofnlowercase English letters.The followingmlines contain a single query on each line:xi,yiandleni(1 ≤xi,yi≤n,1 ≤leni≤n-max(xi,yi) + 1) — the description of the pair of the substrings to check.OutputFor each query in a separate line print \"YES\" if substringss[xi...xi+leni- 1]ands[yi...yi+leni- 1]are isomorphic and \"NO\" otherwise.ExampleInput7 4abacaba1 1 11 4 22 1 32 4 3OutputYESYESNOYESNoteThe queries in the example are following:substrings \"a\" and \"a\" are isomorphic:f(a) =a;substrings \"ab\" and \"ca\" are isomorphic:f(a) =c,f(b) =a;substrings \"bac\" and \"aba\" are not isomorphic sincef(b)andf(c)must be equal toaat same time;substrings \"bac\" and \"cab\" are isomorphic:f(b) =c,f(a) =a,f(c) =b.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "7d5e0276", "template_md5": "35d339e4", "result": "You are given a string of length $n$ consisting of lowercase English letters.  \n\nFor two strings $s$ and $t$, say $S$ is the set of distinct characters of $s$ and $T$ is the set of distinct characters of $t$. The strings $s$ and $t$ are isomorphic if their lengths are equal and there is a one-to-one mapping (bijection) $f$ between $S$ and $T$ for which $f(s_i) = t_i$. \n\nYou have to handle $m$ queries characterized by three integers $x$, $y$, and $len$ ($1 \\le x, y \\le n - len + 1$). For each query, check if two substrings $s[x...x+len-1]$ and $s[y...y+len-1]$ are isomorphic.\n\nOutput \"YES\" if the substrings are isomorphic and \"NO\" otherwise."}, {"prompt_md5": "b67b61cc", "template_md5": "465699a0", "result": "You are given two strings of equal length.  You need to determine if any two substrings of the same length within the strings are \"isomorphic\". Two substrings are isomorphic if there's a way to match up their characters one-to-one so that the matching characters always stay the same."}]}