{"uid": "985-C", "url": "https://codeforces.com/contest/985/problem/C", "tags": ["greedy"], "title": "985-C", "statement": "C. Liebig's Barrelstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou havem=n·kwooden staves. Thei-th stave has lengthai. You have to assemblenbarrels consisting ofkstaves each, you can use anykstaves to construct a barrel. Each stave must belong to exactly one barrel.Let volumevjof barreljbe equal to the length of theminimalstave in it.You want to assemble exactlynbarrels with the maximal total sum of volumes. But you have to make themequal enough, so a difference between volumes of any pair of the resulting barrels must not exceedl, i.e.|vx-vy| ≤lfor any1 ≤x≤nand1 ≤y≤n.Print maximal total sum of volumes ofequal enoughbarrels or0if it's impossible to satisfy the condition above.InputThe first line contains three space-separated integersn,kandl(1 ≤n,k≤ 105,1 ≤n·k≤ 105,0 ≤l≤ 109).The second line containsm=n·kspace-separated integersa1,a2, ...,am(1 ≤ai≤ 109) — lengths of staves.OutputPrint single integer — maximal total sum of the volumes of barrels or0if it's impossible to construct exactlynbarrels satisfying the condition|vx-vy| ≤lfor any1 ≤x≤nand1 ≤y≤n.ExamplesInput4 2 12 2 1 2 3 2 2 3Output7Input2 1 010 10Output20Input1 2 15 2Output2Input3 2 11 2 3 4 5 6Output0NoteIn the first example you can form the following barrels:[1, 2],[2, 2],[2, 3],[2, 3].In the second example you can form the following barrels:[10],[10].In the third example you can form the following barrels:[2, 5].In the fourth example difference between volumes of barrels in any partition is at least2so it is impossible to make barrels equal enough.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b438926a", "template_md5": "35d339e4", "result": "You have $m = n \\cdot k$ wooden staves. The $i$-th stave has length $a_i$. You need to assemble $n$ barrels, each consisting of $k$ staves.  \n\n* You can use any $k$ staves to construct a barrel.\n* Each stave must belong to exactly one barrel.\n* The volume of barrel $j$ is equal to the length of the shortest stave in it.\n\nYou want to assemble $n$ barrels with the maximum total sum of volumes, but the difference in volume between any two barrels must not exceed $l$.  \n\nIn other words, for any barrels $x$ and $y$,  $|v_x - v_y| \\le l$.\n\nPrint the maximum total sum of volumes of the barrels or 0 if it's impossible to satisfy the condition."}, {"prompt_md5": "116ca94e", "template_md5": "465699a0", "result": "You have a set of wooden pieces of different lengths. You need to divide these pieces into groups of a fixed size to make barrels. The volume of each barrel is determined by the shortest piece in that group.  \n\nYou want to make as many barrels as possible, but the difference in volume between any two barrels must be no more than a given limit. What is the maximum total volume of barrels you can make while meeting this condition?"}]}