{"uid": "985-A", "url": "https://codeforces.com/contest/985/problem/A", "tags": ["implementation"], "title": "985-A", "statement": "A. Chess Placingtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given a chessboard of size1 ×n. It is guaranteed thatnis even. The chessboard is painted like this: \"BWBW...BW\".Some cells of the board are occupied by the chess pieces. Each cell contains no more than one chess piece. It is known that the total number of pieces equals to.In one step you can move one of the pieces one cell to the left or to the right. You cannot move pieces beyond the borders of the board. You also cannot move pieces to the cells that are already occupied.Your task is to place all the pieces in the cells of the same colorusing the minimum number of moves(all the pieces must occupy only the black cells or only the white cells after all the moves are made).InputThe first line of the input contains one integern(2 ≤n≤ 100,nis even) — the size of the chessboard.The second line of the input containsinteger numbers(1 ≤pi≤n) — initial positions of the pieces. It is guaranteed that all the positions are distinct.OutputPrint one integer —the minimum number of movesyou have to make to place all the pieces in the cells of the same color.ExamplesInput61 2 6Output2Input101 2 3 4 5Output10NoteIn the first example the only possible strategy is to move the piece at the position6to the position5and move the piece at the position2to the position3. Notice that if you decide to place the pieces in the white cells the minimum number of moves will be3.In the second example the possible strategy is to movein 4 moves, thenin 3 moves,in 2 moves andin 1 move.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "bb42b532", "template_md5": "35d339e4", "result": "You are given a chessboard of size $1 \\times n$ where $n$ is an even number. The chessboard has a pattern of alternating black and white squares (\"BWBW...BW\"). Some squares on the board have chess pieces, and each square can have at most one piece. You know the total number of pieces.\n\nYou can move one piece one square to the left or right in one step. You cannot move pieces off the board or onto squares that already have a piece.\n\nYour goal is to move all the pieces so that they are all on the same color squares (either all black or all white) using the fewest moves possible.\n\n**Input:**\n\n* The first line contains the size of the chessboard, $n$.\n* The second line contains $k$ numbers, where $k$ is the number of pieces. Each number represents the initial position of a piece on the board.\n\n**Output:**\n\n* Print the minimum number of moves required to place all the pieces on the same color squares."}, {"prompt_md5": "6b12016a", "template_md5": "465699a0", "result": "You have a chessboard with an even number of squares. Some squares have pieces on them. You can move each piece one square left or right, but not off the board or onto a square with another piece.  Find the fewest moves needed to get all the pieces on squares of the same color."}]}