{"uid": "985-G", "url": "https://codeforces.com/contest/985/problem/G", "tags": ["combinatorics"], "title": "985-G", "statement": "G. Team Playerstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ players numbered from $$$0$$$ to $$$n-1$$$ with ranks. The $$$i$$$-th player has rank $$$i$$$.Players can form teams: the team should consist of three players andno pairof players in the team should have a conflict. The rank of the team is calculated using the following algorithm: let $$$i$$$, $$$j$$$, $$$k$$$ be the ranks of players in the team and $$$i < j < k$$$, then the rank of the team is equal to $$$A \\\\cdot i + B \\\\cdot j + C \\\\cdot k$$$.You are given information about the pairs of players whohavea conflict. Calculate the total sum of ranks over all possible valid teams modulo $$$2^{64}$$$.InputThe first line contains two space-separated integers $$$n$$$ and $$$m$$$ ($$$3 \\\\le n \\\\le 2 \\\\cdot 10^5$$$, $$$0 \\\\le m \\\\le 2 \\\\cdot 10^5$$$) — the number of players and the number of conflicting pairs.The second line contains three space-separated integers $$$A$$$, $$$B$$$ and $$$C$$$ ($$$1 \\\\le A, B, C \\\\le 10^6$$$) — coefficients for team rank calculation.Each of the next $$$m$$$ lines contains two space-separated integers $$$u_i$$$ and $$$v_i$$$ ($$$0 \\\\le u_i, v_i < n, u_i \\\\neq v_i$$$) — pair of conflicting players.It's guaranteed that each unordered pair of players appears in the input file no more than once.OutputPrint single integer — the total sum of ranks over all possible teams modulo $$$2^{64}$$$.ExamplesInput4 02 3 4Output64Input4 12 3 41 0Output38Input6 41 5 30 33 55 44 3Output164NoteIn the first example all $$$4$$$ teams are valid, i.e. triples: {0, 1, 2}, {0, 1, 3}, {0, 2, 3} {1, 2, 3}.In the second example teams are following: {0, 2, 3}, {1, 2, 3}.In the third example teams are following: {0, 1, 2}, {0, 1, 4}, {0, 1, 5}, {0, 2, 4}, {0, 2, 5}, {1, 2, 3}, {1, 2, 4}, {1, 2, 5}.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "775ce2cb", "template_md5": "35d339e4", "result": "You are given $n$ players, each with a rank from 0 to $n-1$.  Players can form teams of three, but no two players in a team can be in conflict.  The rank of a team is calculated as $A \\cdot i + B \\cdot j + C \\cdot k$, where $i$, $j$, and $k$ are the ranks of the players in the team, and $i < j < k$.\n\nYou are given a list of conflicting player pairs.  Find the total sum of ranks over all possible valid teams, modulo $2^{64}$. \n\n\nLet me know if you'd like help with the solution!"}, {"prompt_md5": "295d0b21", "template_md5": "465699a0", "result": "You have a group of people with assigned ranks.  They can form teams of three, but no two people on a team can be enemies.  Each team's score is calculated based on the ranks of its members.  Find the total sum of all possible team scores, considering all valid teams, and output the result modulo 2^64."}]}