{"uid": "986-B", "url": "https://codeforces.com/contest/986/problem/B", "tags": ["combinatorics", " math"], "title": "986-B", "statement": "B. Petr and Permutationstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputPetr likes to come up with problems about randomly generated data. This time problem is about random permutation. He decided to generate a random permutation this way: he takes identity permutation of numbers from $$$1$$$ to $$$n$$$ and then $$$3n$$$ times takes a random pair of different elements and swaps them. Alex envies Petr and tries to imitate him in all kind of things. Alex has also come up with a problem about random permutation. He generates a random permutation just like Petr but swaps elements $$$7n+1$$$ times instead of $$$3n$$$ times. Because it is more random, OK?!You somehow get a test from one of these problems and now you want to know from which one.InputIn the first line of input there is one integer $$$n$$$ ($$$10^{3} \\\\le n \\\\le 10^{6}$$$).In the second line there are $$$n$$$ distinct integers between $$$1$$$ and $$$n$$$ — the permutation of size $$$n$$$ from the test.It is guaranteed that all tests except for sample are generated this way: First we choose $$$n$$$ — the size of the permutation. Then we randomly choose a method to generate a permutation — the one of Petr or the one of Alex. Then we generate a permutation using chosen method.OutputIf the test is generated via Petr's method print \"Petr\" (without quotes). If the test is generated via Alex's method print \"Um_nik\" (without quotes).ExampleInput52 4 5 1 3OutputPetrNotePlease note that the sample is not a valid test (because of limitations for $$$n$$$) and is given only to illustrate input/output format. Your programstill has to print correct answer to this testto get AC.Due to randomness of input hacks in this problem are forbidden.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f89e6c56", "template_md5": "35d339e4", "result": "Given a permutation of $n$ distinct integers, determine if it was generated by one of two methods:\n\n* **Method 1:** Start with the identity permutation (1, 2, ..., n) and swap pairs of elements $3n$ times.\n* **Method 2:** Start with the identity permutation (1, 2, ..., n) and swap pairs of elements $7n+1$ times.\n\n**Input:**\n\n* The first line contains an integer $n$ ($1 \\le n \\le 10^6$).\n* The second line contains $n$ distinct integers between 1 and $n$, representing the permutation.\n\n**Output:**\n\n* Print \"Petr\" if the permutation was generated by Method 1.\n* Print \"Um_nik\" if the permutation was generated by Method 2."}, {"prompt_md5": "45096d84", "template_md5": "465699a0", "result": "Given a permutation of numbers, determine if it was generated by swapping elements  3n times or 7n+1 times."}]}