{"uid": "986-D", "url": "https://codeforces.com/contest/986/problem/D", "tags": ["fft", " math"], "title": "986-D", "statement": "D. Perfect Encodingtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are working as an analyst in a company working on a new system for big data storage. This system will store $$$n$$$ different objects. Each object should have a unique ID.To create the system, you choose the parameters of the system — integers $$$m \\\\ge 1$$$ and $$$b_{1}, b_{2}, \\\\ldots, b_{m}$$$. With these parameters an ID of some object in the system is an array of integers $$$[a_{1}, a_{2}, \\\\ldots, a_{m}]$$$ where $$$1 \\\\le a_{i} \\\\le b_{i}$$$ holds for every $$$1 \\\\le i \\\\le m$$$.Developers say that production costs are proportional to $$$\\\\sum_{i=1}^{m} b_{i}$$$. You are asked to choose parameters $$$m$$$ and $$$b_{i}$$$ so that the system will be able to assign unique IDs to $$$n$$$ different objects and production costs are minimized. Note that you don't have to use all available IDs.InputIn the only line of input there is one positive integer $$$n$$$. The length of the decimal representation of $$$n$$$ is no greater than $$$1.5 \\\\cdot 10^{6}$$$. The integer does not contain leading zeros.OutputPrint one number — minimal value of $$$\\\\sum_{i=1}^{m} b_{i}$$$.ExamplesInput36Output10Input37Output11Input12345678901234567890123456789Output177", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "5b6b0850", "template_md5": "35d339e4", "result": "You need to design a system to store $n$ unique items. Each item is identified by a code consisting of $m$ integers.  The $i$-th integer in the code must be between 1 and $b_i$ (inclusive).  \n\nYour goal is to find the smallest possible sum of $b_1 + b_2 + ... + b_m$  while still being able to create unique codes for all $n$ items. \n\nInput:\n\n* A single line containing the number $n$.\n\nOutput:\n\n* A single number representing the minimum possible sum of $b_1 + b_2 + ... + b_m$."}, {"prompt_md5": "7b48ecbe", "template_md5": "465699a0", "result": "You need to assign unique codes to a given number of items. Each code is a sequence of numbers, where each number in the sequence must be within a specific range.  Find the smallest possible total of all the upper bounds of these ranges that still allows you to assign unique codes to all the items."}]}