{"uid": "988-A", "url": "https://codeforces.com/contest/988/problem/A", "tags": ["brute force", " implementation"], "title": "988-A", "statement": "A. Diverse Teamtime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ students in a school class, the rating of the $$$i$$$-th student on Codehorses is $$$a_i$$$. You have to form a team consisting of $$$k$$$ students ($$$1 \\\\le k \\\\le n$$$) such that the ratings of all team membersare distinct.If it is impossible to form a suitable team, print \"NO\" (without quotes). Otherwise print \"YES\", and then print $$$k$$$ distinct numbers which should be the indices of students in the team you form. If there are multiple answers, print any of them.InputThe first line contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 100$$$) — the number of students and the size of the team you have to form.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 100$$$), where $$$a_i$$$ is the rating of $$$i$$$-th student.OutputIf it is impossible to form a suitable team, print \"NO\" (without quotes). Otherwise print \"YES\", and then print $$$k$$$ distinct integers from $$$1$$$ to $$$n$$$ which should be the indices of students in the team you form. All the ratings of the students in the team should be distinct. You may print the indices in any order. If there are multiple answers, print any of them.Assume that the students are numbered from $$$1$$$ to $$$n$$$.ExamplesInput5 315 13 15 15 12OutputYES1 2 5Input5 415 13 15 15 12OutputNOInput4 420 10 40 30OutputYES1 2 3 4NoteAll possible answers for the first example:{1 2 5}{2 3 5}{2 4 5}Note that the order does not matter.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "efc2b599", "template_md5": "35d339e4", "result": "You are given a list of $n$ students and their ratings on a coding platform. You need to form a team of $k$ students ($1 \\le k \\le n$) where each student's rating is unique. \n\nIf you can form such a team, print \"YES\" followed by the indices of the $k$ students in the team. If it's impossible to form a team with distinct ratings, print \"NO\". \n\n**Input:**\n\n* The first line contains two integers, $n$ and $k$.\n* The second line contains $n$ integers, $a_1, a_2, ..., a_n$, representing the ratings of the students.\n\n**Output:**\n\n* If a team with distinct ratings can be formed, print \"YES\" followed by $k$ distinct indices of students.\n* If not, print \"NO\"."}, {"prompt_md5": "e05cf186", "template_md5": "465699a0", "result": "You have a group of people with different scores.  Choose a team of a specific size from the group, making sure each person on the team has a unique score.  If you can form such a team, say \"YES\" and list the team members. If not, say \"NO\"."}]}