{"uid": "988-D", "url": "https://codeforces.com/contest/988/problem/D", "tags": ["brute force", " math"], "title": "988-D", "statement": "D. Points and Powers of Twotime limit per test4 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ distinct points on a coordinate line, the coordinate of $$$i$$$-th point equals to $$$x_i$$$. Choose a subset of the given set of points such that the distance between each pair of points in a subset is an integral power of two. It is necessary to consider each pair of points, not only adjacent. Note that any subset containing one element satisfies the condition above. Among all these subsets, choose a subset with maximum possible size.In other words, you have to choose the maximum possible number of points $$$x_{i_1}, x_{i_2}, \\\\dots, x_{i_m}$$$ such that for each pair $$$x_{i_j}$$$, $$$x_{i_k}$$$ it is true that $$$|x_{i_j} - x_{i_k}| = 2^d$$$ where $$$d$$$ is some non-negative integer number (not necessarily the same for each pair of points).InputThe first line contains one integer $$$n$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5$$$) — the number of points.The second line contains $$$n$$$ pairwise distinct integers $$$x_1, x_2, \\\\dots, x_n$$$ ($$$-10^9 \\\\le x_i \\\\le 10^9$$$) — the coordinates of points.OutputIn the first line print $$$m$$$ — the maximum possible number of points in a subset that satisfies the conditions described above.In the second line print $$$m$$$ integers — the coordinates of points in the subset you have chosen.If there are multiple answers, print any of them.ExamplesInput63 5 4 7 10 12Output37 3 5Input5-1 2 5 8 11Output18NoteIn the first example the answer is $$$[7, 3, 5]$$$. Note, that $$$|7-3|=4=2^2$$$, $$$|7-5|=2=2^1$$$ and $$$|3-5|=2=2^1$$$. You can't find a subset having more points satisfying the required property.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "ebfdfb38", "template_md5": "35d339e4", "result": "You are given $n$ distinct points on a number line, with coordinates $x_1, x_2, ..., x_n$.  \n\nFind the largest possible subset of these points such that the distance between any two points in the subset is a power of two (e.g., 2, 4, 8, 16, etc.).\n\nOutput the size of the largest subset and the coordinates of the points in that subset."}, {"prompt_md5": "b94150e7", "template_md5": "465699a0", "result": "You are given a set of numbers. Find the largest group of these numbers where the difference between any two numbers in the group is a power of two (e.g., 2, 4, 8, 16, etc.)."}]}