{"uid": "988-B", "url": "https://codeforces.com/contest/988/problem/B", "tags": ["sortings", " strings"], "title": "988-B", "statement": "B. Substrings Sorttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given $$$n$$$ strings. Each string consists of lowercase English letters. Rearrange (reorder) the given strings in such a way that for every string, all strings that are placed before it are itssubstrings.String $$$a$$$ is asubstringof string $$$b$$$ if it is possible to choose severalconsecutiveletters in $$$b$$$ in such a way that they form $$$a$$$. For example, string \"for\" is contained as asubstringin strings \"codeforces\", \"for\" and \"therefore\", but is not contained as asubstringin strings \"four\", \"fofo\" and \"rof\".InputThe first line contains an integer $$$n$$$ ($$$1 \\\\le n \\\\le 100$$$) — the number of strings.The next $$$n$$$ lines contain the given strings. The number of letters in each string is from $$$1$$$ to $$$100$$$, inclusive. Each string consists of lowercase English letters.Some strings might be equal.OutputIf it is impossible to reorder $$$n$$$ given strings in required order, print \"NO\" (without quotes).Otherwise print \"YES\" (without quotes) and $$$n$$$ given strings in required order.ExamplesInput5aabaabacababaabaOutputYESabaabaabaabacabaInput5aabacababaabaababOutputNOInput3qwertyqwertyqwertyOutputYESqwertyqwertyqwertyNoteIn the second example you cannot reorder the strings because the string \"abab\" is not asubstringof the string \"abacaba\".", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d5c27cfb", "template_md5": "35d339e4", "result": "You are given $n$ strings.  Rearrange the strings so that for each string, all the strings that come before it are substrings of it.  \n\nA string $a$ is a substring of a string $b$ if you can find a sequence of consecutive letters in $b$ that form $a$.\n\nIf it's impossible to rearrange the strings this way, print \"NO\". Otherwise, print \"YES\" and then list the strings in the correct order."}, {"prompt_md5": "660ba78a", "template_md5": "465699a0", "result": "You are given a list of words. Rearrange the words so that for each word, all the words that come before it are substrings of that word.  If this is possible, print \"YES\" followed by the rearranged list. Otherwise, print \"NO\"."}]}