{"uid": "989-A", "url": "https://codeforces.com/contest/989/problem/A", "tags": ["implementation", " strings"], "title": "989-A", "statement": "A. A Blend of Springtimetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputWhen the curtains are opened, a canvas unfolds outside. Kanno marvels at all the blonde colours along the riverside — not tangerines, but blossoms instead.\"What a pity it's already late spring,\" sighs Mino with regret, \"one more drizzling night and they'd be gone.\"\"But these blends are at their best, aren't they?\" Absorbed in the landscape, Kanno remains optimistic.The landscape can be expressed as a row of consecutive cells, each of which either contains a flower of colour amber or buff or canary yellow, or is empty.When a flower withers, it disappears from the cell that it originally belonged to, and it spreads petals of its colour in its two neighbouring cells (or outside the field if the cell is on the side of the landscape). In case petals fall outside the given cells, they simply become invisible.You are to help Kanno determine whether it's possible that after some (possibly none or all) flowers shed their petals, at least one of the cells contains all three colours, considering both petals and flowers. Note that flowers can wither in arbitrary order.InputThe first and only line of input contains a non-empty string $$$s$$$ consisting of uppercase English letters 'A', 'B', 'C' and characters '.' (dots) only ($$$\\\\lvert s \\\\rvert \\\\leq 100$$$) — denoting cells containing an amber flower, a buff one, a canary yellow one, and no flowers, respectively.OutputOutput \"Yes\" if it's possible that all three colours appear in some cell, and \"No\" otherwise.You can print each letter in any case (upper or lower).ExamplesInput.BAC.OutputYesInputAA..CBOutputNoNoteIn the first example, the buff and canary yellow flowers can leave their petals in the central cell, blending all three colours in it.In the second example, it's impossible to satisfy the requirement because there is no way that amber and buff meet in any cell.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "582bff0b", "template_md5": "35d339e4", "result": "You are given a row of cells, each containing either an amber flower, a buff flower, a canary yellow flower, or no flower.  When a flower withers, it disappears and spreads its color to the two cells next to it.  Colors can spread outside the row, but this is ignored.\n\nDetermine if it is possible for a cell to contain all three colors (amber, buff, and canary yellow) after some flowers wither and spread their colors. \n\nThe input is a string where:\n\n* 'A' represents an amber flower\n* 'B' represents a buff flower\n* 'C' represents a canary yellow flower\n* '.' represents an empty cell\n\nOutput \"Yes\" if it is possible for a cell to contain all three colors, and \"No\" otherwise."}, {"prompt_md5": "ef973764", "template_md5": "465699a0", "result": "You are given a row of cells, each containing one of three colors or being empty.  Each cell can hold a flower of one of the colors. When a flower dies, it spreads its color to the two cells next to it.  Can any cell end up containing all three colors?"}]}