{"uid": "99-A", "url": "https://codeforces.com/contest/99/problem/A", "tags": ["strings"], "title": "99-A", "statement": "A. Help Far Away Kingdomtime limit per test2 secondsmemory limit per test256 megabytesinputstdinoutputstdoutIn a far away kingdom lived the King, the Prince, the Shoemaker, the Dressmaker and many other citizens. They lived happily until great trouble came into the Kingdom. The ACMers settled there.Most damage those strange creatures inflicted upon the kingdom was that they loved high precision numbers. As a result, the Kingdom healers had already had three appointments with the merchants who were asked to sell, say, exactly0.273549107beer barrels. To deal with the problem somehow, the King issued an order obliging rounding up all numbers to the closest integer to simplify calculations. Specifically, the order went like this:If a number's integer part does not end with digit9and its fractional part is strictly less than0.5, then the rounded up number coincides with the number’s integer part.If a number's integer part does not end with digit9and its fractional part is not less than0.5, the rounded up number is obtained if we add1to the last digit of the number’s integer part.If the number’s integer part ends with digit9, to round up the numbers one should go to Vasilisa the Wise. In the whole Kingdom she is the only one who can perform the tricky operation of carrying into the next position.Merchants found the algorithm very sophisticated and they asked you (the ACMers) to help them. Can you write a program that would perform the rounding according to the King’s order?InputThe first line contains a single number to round up — the integer part (a non-empty set of decimal digits that do not start with0— with the exception of a case when the set consists of a single digit — in this case 0 can go first), then follows character «.» (a dot), and then follows the fractional part (any non-empty set of decimal digits). The number's length does not exceed1000characters, including the dot. There are no other characters in the input data.OutputIf the last number of the integer part is not equal to9, print the rounded-up number without leading zeroes. Otherwise, print the message \"GOTO Vasilisa.\" (without the quotes).ExamplesInput0.0Output0Input1.49Output1Input1.50Output2Input2.71828182845904523536Output3Input3.14159265358979323846Output3Input12345678901234567890.1Output12345678901234567890Input123456789123456789.999OutputGOTO Vasilisa.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "84c38ed5", "template_md5": "35d339e4", "result": "Given a decimal number, round it up according to the following rules:\n\n1. If the integer part does not end in 9 and the fractional part is less than 0.5, the rounded number is the integer part.\n2. If the integer part does not end in 9 and the fractional part is 0.5 or greater, add 1 to the last digit of the integer part.\n3. If the integer part ends in 9, print \"GOTO Vasilisa\".\n\nInput: A decimal number (up to 1000 characters long).\n\nOutput: The rounded-up number (without leading zeros) or \"GOTO Vasilisa\"."}, {"prompt_md5": "55c1803a", "template_md5": "465699a0", "result": "Given a decimal number, round it up according to these rules:\n\n1. If the decimal part is less than 0.5, round to the integer part.\n2. If the decimal part is 0.5 or greater, round up the integer part by adding 1 to its last digit.\n3. If the integer part ends in 9, output \"GOTO Vasilisa\". \n\n\nOutput the rounded number or the message \"GOTO Vasilisa\"."}]}