{"uid": "990-E", "url": "https://codeforces.com/contest/990/problem/E", "tags": ["brute force", " greedy"], "title": "990-E", "statement": "E. Post Lampstime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAdilbek's house is located on a street which can be represented as the OX axis. This street is really dark, so Adilbek wants to install some post lamps to illuminate it. Street has $$$n$$$ positions to install lamps, they correspond to the integer numbers from $$$0$$$ to $$$n - 1$$$ on the OX axis. However, some positions are blocked and no post lamp can be placed there.There are post lamps of different types which differ only by their power. When placed in position $$$x$$$, post lamp of power $$$l$$$ illuminates the segment $$$[x; x + l]$$$. The power of each post lamp is always a positive integer number.The post lamp shop provides an infinite amount of lamps of each type from power $$$1$$$ to power $$$k$$$. Though each customer is only allowed to order post lamps ofexactly onetype. Post lamps of power $$$l$$$ cost $$$a_l$$$ each.What is the minimal total cost of the post lamps ofexactly onetype Adilbek can buy to illuminate the entire segment $$$[0; n]$$$ of the street? If some lamps illuminate any other segment of the street, Adilbek does not care, so, for example, he may place a lamp of power $$$3$$$ in position $$$n - 1$$$ (even though its illumination zone doesn't completely belong to segment $$$[0; n]$$$).InputThe first line contains three integer numbers $$$n$$$, $$$m$$$ and $$$k$$$ ($$$1 \\\\le k \\\\le n \\\\le 10^6$$$, $$$0 \\\\le m \\\\le n$$$) — the length of the segment of the street Adilbek wants to illuminate, the number of the blocked positions and the maximum power of the post lamp available.The second line contains $$$m$$$ integer numbers $$$s_1, s_2, \\\\dots, s_m$$$ ($$$0 \\\\le s_1 < s_2 < \\\\dots s_m < n$$$) — the blocked positions.The third line contains $$$k$$$ integer numbers $$$a_1, a_2, \\\\dots, a_k$$$ ($$$1 \\\\le a_i \\\\le 10^6$$$) — the costs of the post lamps.OutputPrint the minimal total cost of the post lamps ofexactly onetype Adilbek can buy to illuminate the entire segment $$$[0; n]$$$ of the street.If illumintaing the entire segment $$$[0; n]$$$ is impossible, print-1.ExamplesInput6 2 31 31 2 3Output6Input4 3 41 2 31 10 100 1000Output1000Input5 1 503 3 3 3 3Output-1Input7 4 32 4 5 63 14 15Output-1", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "84cf41ee", "template_md5": "35d339e4", "result": "You are given a street of length $n$ that needs to be illuminated with post lamps.  There are $m$ blocked positions on the street where lamps cannot be placed.  \n\nLamps come in different powers, from 1 to $k$. A lamp of power $l$ illuminates a segment of length $l$ starting at its position.  Each lamp of power $l$ costs $a_l$ dollars.\n\nYou can only buy lamps of a single power.  \n\nFind the minimum cost to illuminate the entire street from position 0 to $n-1$. If it's impossible to illuminate the entire street, output -1. \n\n**Input:**\n\n* The first line contains three integers: $n$, $m$, and $k$.\n* The second line contains $m$ integers: the blocked positions.\n* The third line contains $k$ integers: the cost of each lamp power.\n\n**Output:**\n\n* The minimum cost to illuminate the entire street.\n* -1 if it's impossible to illuminate the entire street."}, {"prompt_md5": "529dea48", "template_md5": "465699a0", "result": "You need to illuminate a segment of length 'n'. You have lamps of different powers (1 to 'k') that illuminate a consecutive section of the segment.  Some positions are blocked.  Each lamp type has a different cost. Find the minimum cost to illuminate the entire segment using only one type of lamp. If it's impossible, output -1."}]}