{"uid": "991-E", "url": "https://codeforces.com/contest/991/problem/E", "tags": ["brute force", " combinatorics", " math"], "title": "991-E", "statement": "E. Bus Numbertime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputThis night wasn't easy on Vasya. His favorite team lost, and he didn't find himself victorious either — although he played perfectly, his teammates let him down every time. He had to win at least one more time, but the losestreak only grew longer and longer... It's no wonder he didn't get any sleep this night at all.In the morning, Vasya was waiting the bus to the university on the bus stop. Vasya's thoughts were hazy and so he couldn't remember the right bus' number quite right and got onto the bus with the number $$$n$$$.In the bus, Vasya thought that he could get the order of the digits in the number of the bus wrong. Futhermore, he could \"see\" some digits several times, but the digits he saw were definitely in the real number of the bus. For example, if Vasya saw the number2028, it could mean that the real bus number could be2028,8022,2820or just820. However, numbers80,22208,52definitely couldn't be the number of the bus. Also, real bus number couldn't start with the digit0, this meaning that, for example, number082couldn't be the real bus number too.Given $$$n$$$, determine the total number of possible bus number variants.InputThe first line contains one integer $$$n$$$ ($$$1 \\\\leq n \\\\leq 10^{18}$$$) — the number of the bus that was seen by Vasya. It is guaranteed that this number does not start with $$$0$$$.OutputOutput a single integer — the amount of possible variants of the real bus number.ExamplesInput97Output2Input2028Output13NoteIn the first sample, only variants $$$97$$$ and $$$79$$$ are possible.In the second sample, the variants (in the increasing order) are the following: $$$208$$$, $$$280$$$, $$$802$$$, $$$820$$$, $$$2028$$$, $$$2082$$$, $$$2208$$$, $$$2280$$$, $$$2802$$$, $$$2820$$$, $$$8022$$$, $$$8202$$$, $$$8220$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "c804d4c5", "template_md5": "35d339e4", "result": "You are given an integer $n$ representing a number seen by someone. This number could be a permutation of the digits in the actual bus number.  \n\nDetermine the total number of possible bus number variants.\n\n**Constraints:**\n\n* $1 \\le n \\le 10^{18}$\n* The bus number cannot start with 0. \n\n\n**Example:**\n\n* Input: 97\n* Output: 2  (Possible bus numbers: 97, 79)"}, {"prompt_md5": "d3dae786", "template_md5": "465699a0", "result": "You are given a number.  Determine the number of different possible numbers that could have been seen if the digits were in a different order, and some digits were repeated.  The number cannot start with 0."}]}