{"uid": "992-A", "url": "https://codeforces.com/contest/992/problem/A", "tags": ["implementation", " sortings"], "title": "992-A", "statement": "A. Nastya and an Arraytime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputNastya owns too many arrays now, so she wants to delete the least important of them. However, she discovered that this array is magic! Nastya now knows that the array has the following properties:In one second we can add an arbitrary (possibly negative) integer to all elements of the array that are not equal to zero.When all elements of the array become equal to zero, the array explodes.Nastya is always busy, so she wants to explode the array as fast as possible. Compute the minimum time in which the array can be exploded.InputThe first line contains a single integern(1 ≤n≤ 105) — the size of the array.The second line containsnintegersa1,a2, ...,an(- 105≤ai≤ 105) — the elements of the array.OutputPrint a single integer — the minimum number of seconds needed to make all elements of the array equal to zero.ExamplesInput51 1 1 1 1Output1Input32 0 -1Output2Input45 -6 -5 1Output4NoteIn the first example you can add- 1to all non-zero elements in one second and make them equal to zero.In the second example you can add- 2on the first second, then the array becomes equal to[0, 0,  - 3]. On the second second you can add3to the third (the only non-zero) element.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "df4f4b8a", "template_md5": "35d339e4", "result": "You are given an array of integers. You can add the same integer to all the elements of the array that are not zero, in each second.  Find the minimum number of seconds it takes to make all the elements of the array equal to zero. \n\nInput:\n\n* The first line contains an integer $n$ (1 ≤ $n$ ≤ 10⁵) representing the size of the array.\n* The second line contains $n$ integers $a_1, a_2, ..., a_n$ (-10⁵ ≤ $a_i$ ≤ 10⁵) representing the elements of the array.\n\nOutput:\n\n* Print a single integer representing the minimum number of seconds needed to make all elements of the array equal to zero."}, {"prompt_md5": "39b0eccd", "template_md5": "465699a0", "result": "You are given a list of numbers. You can add the same number to all the numbers in the list that are not zero, in one step. What is the fewest steps it takes to make all the numbers in the list zero?"}]}