{"uid": "992-C", "url": "https://codeforces.com/contest/992/problem/C", "tags": ["math"], "title": "992-C", "statement": "C. Nastya and a Wardrobetime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputNastya received a gift on New Year — a magic wardrobe. It is magic because in the end of each month the number of dresses in it doubles (i.e. the number of dresses becomes twice as large as it is in the beginning of the month).Unfortunately, right after the doubling the wardrobe eats one of the dresses (if any) with the50%probability. It happens every month except the last one in the year.Nastya ownsxdresses now, so she became interested in theexpected numberof dresses she will have in one year. Nastya lives in Byteland, so the year lasts fork+ 1months.Nastya is really busy, so she wants you to solve this problem. You are the programmer, after all. Also, you should find the answer modulo109+ 7, because it is easy to see that it is always integer.InputThe only line contains two integersxandk(0 ≤x,k≤ 1018), wherexis the initial number of dresses andk+ 1is the number of months in a year in Byteland.OutputIn the only line print a single integer — the expected number of dresses Nastya will own one year later modulo109+ 7.ExamplesInput2 0Output4Input2 1Output7Input3 2Output21NoteIn the first example a year consists on only one month, so the wardrobe does not eat dresses at all.In the second example after the first month there are3dresses with50%probability and4dresses with50%probability. Thus, in the end of the year there are6dresses with50%probability and8dresses with50%probability. This way the answer for this test is(6 + 8) / 2 = 7.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "f05f196e", "template_md5": "35d339e4", "result": "You are given an integer $x$ representing the initial number of dresses.  Each month, the number of dresses doubles.  With a 50% probability, one dress is then removed. This process happens for $k$ months.  \n\nFind the expected number of dresses after $k+1$ months, modulo $10^9 + 7$."}, {"prompt_md5": "6aa58456", "template_md5": "465699a0", "result": "You start with a number of items. Each month, the number of items doubles, but there's a 50% chance one item is removed. This happens for every month except the last.  Calculate the expected number of items you'll have after a year (which has a specific number of months).  The answer should be a whole number."}]}