{"uid": "993-A", "url": "https://codeforces.com/contest/993/problem/A", "tags": ["geometry", " implementation"], "title": "993-A", "statement": "A. Two Squarestime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given two squares, one with sides parallel to the coordinate axes, and another one with sides at 45 degrees to the coordinate axes. Find whether the two squares intersect.The interior of the square is considered to be part of the square, i.e. if one square is completely inside another, they intersect. If the two squares only share one common point, they are also considered to intersect.InputThe input data consists of two lines, one for each square, both containing 4 pairs of integers. Each pair represents coordinates of one vertex of the square. Coordinates within each line are either in clockwise or counterclockwise order.The first line contains the coordinates of the square with sides parallel to the coordinate axes, the second line contains the coordinates of the square at 45 degrees.All the values are integer and between $$$-100$$$ and $$$100$$$.OutputPrint \"Yes\" if squares intersect, otherwise print \"No\".You can print each letter in any case (upper or lower).ExamplesInput0 0 6 0 6 6 0 61 3 3 5 5 3 3 1OutputYESInput0 0 6 0 6 6 0 67 3 9 5 11 3 9 1OutputNOInput6 0 6 6 0 6 0 07 4 4 7 7 10 10 7OutputYESNoteIn the first example the second square lies entirely within the first square, so they do intersect.In the second sample squares do not have any points in common.Here are images corresponding to the samples:", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "aeca274d", "template_md5": "35d339e4", "result": "You are given two squares. One square has sides that are parallel to the x and y axes. The other square has sides that are at a 45-degree angle to the x and y axes.  \n\nDetermine if the two squares intersect.  \n\n**Input:**\n\n* Two lines of input, one for each square.\n* Each line contains 4 pairs of integers representing the coordinates of each square's vertices. The coordinates are either in clockwise or counterclockwise order.\n* All values are integers between -100 and 100.\n\n**Output:**\n\n* Print \"Yes\" if the squares intersect, otherwise print \"No\"."}, {"prompt_md5": "3701f9f2", "template_md5": "465699a0", "result": "You are given two squares. One square has sides that line up with the x and y axes. The other square has sides that are at a 45-degree angle to the axes. Determine if the squares overlap."}]}