{"uid": "995-F", "url": "https://codeforces.com/contest/995/problem/F", "tags": ["combinatorics", " dp", " math", " trees"], "title": "995-F", "statement": "F. Cowmpany Cowmpensationtime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputAllen, having graduated from the MOO Institute of Techcowlogy (MIT), has started a startup! Allen is the president of his startup. He also hires $$$n-1$$$ other employees, each of which is assigned a direct superior. If $$$u$$$ is a superior of $$$v$$$ and $$$v$$$ is a superior of $$$w$$$ then also $$$u$$$ is a superior of $$$w$$$. Additionally, there are no $$$u$$$ and $$$v$$$ such that $$$u$$$ is the superior of $$$v$$$ and $$$v$$$ is the superior of $$$u$$$. Allen himself has no superior. Allen is employee number $$$1$$$, and the others are employee numbers $$$2$$$ through $$$n$$$.Finally, Allen must assign salaries to each employee in the company including himself. Due to budget constraints, each employee's salary is an integer between $$$1$$$ and $$$D$$$. Additionally, no employee can make strictly more than his superior.Help Allen find the number of ways to assign salaries. As this number may be large, output it modulo $$$10^9 + 7$$$.InputThe first line of the input contains two integers $$$n$$$ and $$$D$$$ ($$$1 \\\\le n \\\\le 3000$$$, $$$1 \\\\le D \\\\le 10^9$$$).The remaining $$$n-1$$$ lines each contain a single positive integer, where the $$$i$$$-th line contains the integer $$$p_i$$$ ($$$1 \\\\le p_i \\\\le i$$$). $$$p_i$$$ denotes the direct superior of employee $$$i+1$$$.OutputOutput a single integer: the number of ways to assign salaries modulo $$$10^9 + 7$$$.ExamplesInput3 211Output5Input3 312Output10Input2 51Output15NoteIn the first sample case, employee 2 and 3 report directly to Allen. The three salaries, in order, can be $$$(1,1,1)$$$, $$$(2,1,1)$$$, $$$(2,1,2)$$$, $$$(2,2,1)$$$ or $$$(2,2,2)$$$.In the second sample case, employee 2 reports to Allen and employee 3 reports to employee 2. In order, the possible salaries are $$$(1,1,1)$$$, $$$(2,1,1)$$$, $$$(2,2,1)$$$, $$$(2,2,2)$$$, $$$(3,1,1)$$$, $$$(3,2,1)$$$, $$$(3,2,2)$$$, $$$(3,3,1)$$$, $$$(3,3,2)$$$, $$$(3,3,3)$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "fa925420", "template_md5": "35d339e4", "result": "You are given a company with $n$ employees numbered from 1 to $n$. Employee 1 is the president and has no superior. The other employees each have one direct superior.  \n\nYou need to assign an integer salary to each employee between 1 and $D$, inclusive.  The salary of an employee must be less than or equal to the salary of their superior.\n\nFind the number of ways to assign salaries to all employees, and output the result modulo $10^9 + 7$."}, {"prompt_md5": "a7dbbfff", "template_md5": "465699a0", "result": "You have a company with  'n' employees, where each employee reports to exactly one other employee (except for the CEO who reports to no one).  You need to assign each employee a salary between 1 and 'D', where a subordinate's salary can't be higher than their superior's.  Find the number of ways to do this.  The answer can be very large, so give it modulo 10^9 + 7."}]}