{"uid": "996-B", "url": "https://codeforces.com/contest/996/problem/B", "tags": ["binary search", " math"], "title": "996-B", "statement": "B. World Cuptime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputAllen wants to enter a fan zone that occupies a round square and has $$$n$$$ entrances.There already is a queue of $$$a_i$$$ people in front of the $$$i$$$-th entrance. Each entrance allows one person from its queue to enter the fan zone in one minute.Allen uses the following strategy to enter the fan zone:Initially he stands in the end of the queue in front of the first entrance.Each minute, if he is not allowed into the fan zone during the minute (meaning he is not the first in the queue), he leaves the current queue and stands in the end of the queue of the next entrance (or the first entrance if he leaves the last entrance).Determine the entrance through which Allen will finally enter the fan zone.InputThe first line contains a single integer $$$n$$$ ($$$2 \\\\le n \\\\le 10^5$$$) — the number of entrances.The second line contains $$$n$$$ integers $$$a_1, a_2, \\\\ldots, a_n$$$ ($$$0 \\\\le a_i \\\\le 10^9$$$) — the number of people in queues. These numbers do not include Allen.OutputPrint a single integer — the number of entrance that Allen will use.ExamplesInput42 3 2 0Output3Input210 10Output1Input65 2 6 5 7 4Output6NoteIn the first example the number of people (not including Allen) changes as follows: $$$[\\\\textbf{2}, 3, 2, 0] \\\\to [1, \\\\textbf{2}, 1, 0] \\\\to [0, 1, \\\\textbf{0}, 0]$$$. The number in bold is the queue Alles stands in. We see that he will enter the fan zone through the third entrance.In the second example the number of people (not including Allen) changes as follows: $$$[\\\\textbf{10}, 10] \\\\to [9, \\\\textbf{9}] \\\\to [\\\\textbf{8}, 8] \\\\to [7, \\\\textbf{7}] \\\\to [\\\\textbf{6}, 6] \\\\to \\\\\\\\ [5, \\\\textbf{5}] \\\\to [\\\\textbf{4}, 4] \\\\to [3, \\\\textbf{3}] \\\\to [\\\\textbf{2}, 2] \\\\to [1, \\\\textbf{1}] \\\\to [\\\\textbf{0}, 0]$$$.In the third example the number of people (not including Allen) changes as follows: $$$[\\\\textbf{5}, 2, 6, 5, 7, 4] \\\\to [4, \\\\textbf{1}, 5, 4, 6, 3] \\\\to [3, 0, \\\\textbf{4}, 3, 5, 2] \\\\to \\\\\\\\ [2, 0, 3, \\\\textbf{2}, 4, 1] \\\\to [1, 0, 2, 1, \\\\textbf{3}, 0] \\\\to [0, 0, 1, 0, 2, \\\\textbf{0}]$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "b7eab59a", "template_md5": "35d339e4", "result": "There are $n$ entrances to a fan zone, each with a queue of people waiting to enter. The number of people in each queue is given by the array $a_1, a_2, ..., a_n$.  \n\nA person starts at the end of the queue at the first entrance. Each minute, the person at the front of each queue enters the fan zone. If the person is not at the front of their queue, they leave that queue and join the end of the next queue (or the first queue if they were at the last entrance).\n\nDetermine which entrance the person will eventually enter the fan zone through."}, {"prompt_md5": "70725b1e", "template_md5": "465699a0", "result": "There are multiple lines. Each line has a number of people waiting. You start at the first line. Every minute, you can move to the next line if you are not at the front of your current line.  What line will you enter from?"}]}