{"uid": "999-D", "url": "https://codeforces.com/contest/999/problem/D", "tags": ["data structures", " greedy", " implementation"], "title": "999-D", "statement": "D. Equalize the Remainderstime limit per test3 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputYou are given an array consisting of $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$, and a positive integer $$$m$$$. It is guaranteed that $$$m$$$ is a divisor of $$$n$$$.In a single move, you can choose any position $$$i$$$ between $$$1$$$ and $$$n$$$ and increase $$$a_i$$$ by $$$1$$$.Let's calculate $$$c_r$$$ ($$$0 \\\\le r \\\\le m-1)$$$ — the number of elements having remainder $$$r$$$ when divided by $$$m$$$. In other words, for each remainder, let's find the number of corresponding elements in $$$a$$$ with that remainder.Your task is to change the array in such a way that $$$c_0 = c_1 = \\\\dots = c_{m-1} = \\\\frac{n}{m}$$$.Find the minimum number of moves to satisfy the above requirement.InputThe first line of input contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\\\le n \\\\le 2 \\\\cdot 10^5, 1 \\\\le m \\\\le n$$$). It is guaranteed that $$$m$$$ is a divisor of $$$n$$$.The second line of input contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$0 \\\\le a_i \\\\le 10^9$$$), the elements of the array.OutputIn the first line, print a single integer — the minimum number of moves required to satisfy the following condition: for each remainder from $$$0$$$ to $$$m - 1$$$, the number of elements of the array having this remainder equals $$$\\\\frac{n}{m}$$$.In the second line, printanyarray satisfying the condition and can be obtained from the given arraywith the minimum number of moves. The values of the elements of the resulting array must not exceed $$$10^{18}$$$.ExamplesInput6 33 2 0 6 10 12Output33 2 0 7 10 14Input4 20 1 2 3Output00 1 2 3", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "cbfda571", "template_md5": "35d339e4", "result": "You are given an array of $n$ integers and a positive integer $m$.  You know that $m$ divides $n$.\n\nYou can increase any element in the array by 1.\n\nThe goal is to find the minimum number of times you need to increase elements in the array so that the following is true:\n\n* There are $\\frac{n}{m}$ elements in the array that leave a remainder of 0 when divided by $m$.\n* There are $\\frac{n}{m}$ elements in the array that leave a remainder of 1 when divided by $m$.\n* ...\n* There are $\\frac{n}{m}$ elements in the array that leave a remainder of $m-1$ when divided by $m$.\n\n\n\n\nYou need to output:\n\n1. The minimum number of times you need to increase elements.\n2. One possible array that satisfies the conditions."}, {"prompt_md5": "9bc3f554", "template_md5": "465699a0", "result": "You have a list of numbers.  You can increase any number in the list by 1.  The goal is to make sure that each possible remainder (when dividing by a given number) appears the same number of times in the list. What is the fewest changes needed to do this?"}]}