{"uid": "999-A", "url": "https://codeforces.com/contest/999/problem/A", "tags": ["brute force", " implementation"], "title": "999-A", "statement": "A. Mishka and Contesttime limit per test1 secondmemory limit per test256 megabytesinputstandard inputoutputstandard outputMishka started participating in a programming contest. There are $$$n$$$ problems in the contest. Mishka's problem-solving skill is equal to $$$k$$$.Mishka arranges all problems from the contest into a list. Because of his weird principles, Mishka only solves problems from one of the ends of the list. Every time, he chooses which end (left or right) he will solve the next problem from. Thus, each problem Mishka solves is either the leftmost or the rightmost problem in the list.Mishka cannot solve a problem with difficulty greater than $$$k$$$. When Mishka solves the problem, it disappears from the list, so the length of the list decreases by $$$1$$$. Mishka stops when he is unable to solve any problem from any end of the list.How many problems can Mishka solve?InputThe first line of input contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n, k \\\\le 100$$$) — the number of problems in the contest and Mishka's problem-solving skill.The second line of input contains $$$n$$$ integers $$$a_1, a_2, \\\\dots, a_n$$$ ($$$1 \\\\le a_i \\\\le 100$$$), where $$$a_i$$$ is the difficulty of the $$$i$$$-th problem. The problems are given in order from the leftmost to the rightmost in the list.OutputPrint one integer — the maximum number of problems Mishka can solve.ExamplesInput8 44 2 3 1 5 1 6 4Output5Input5 23 1 2 1 3Output0Input5 10012 34 55 43 21Output5NoteIn the first example, Mishka can solve problems in the following order: $$$[4, 2, 3, 1, 5, 1, 6, 4] \\\\rightarrow [2, 3, 1, 5, 1, 6, 4] \\\\rightarrow [2, 3, 1, 5, 1, 6] \\\\rightarrow [3, 1, 5, 1, 6] \\\\rightarrow [1, 5, 1, 6] \\\\rightarrow [5, 1, 6]$$$, so the number of solved problems will be equal to $$$5$$$.In the second example, Mishka can't solve any problem because the difficulties of problems from both ends are greater than $$$k$$$.In the third example, Mishka's solving skill is so amazing that he can solve all the problems.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "d6fc6073", "template_md5": "35d339e4", "result": "There are $n$ problems, each with a difficulty level from 1 to 100. You can only solve problems from either the left or right end of the list. You can only solve problems with a difficulty level less than or equal to your skill level, $k$.  You remove a problem from the list each time you solve it.  What is the maximum number of problems you can solve?"}, {"prompt_md5": "07b5f418", "template_md5": "465699a0", "result": "You are given a list of items with difficulty levels. You can only pick items from either the beginning or end of the list.  You can only pick items with a difficulty level less than or equal to your skill level.  What is the maximum number of items you can pick?"}]}