{"uid": "999-F", "url": "https://codeforces.com/contest/999/problem/F", "tags": ["dp"], "title": "999-F", "statement": "F. Cards and Joytime limit per test2 secondsmemory limit per test256 megabytesinputstandard inputoutputstandard outputThere are $$$n$$$ players sitting at the card table. Each player has a favorite number. The favorite number of the $$$j$$$-th player is $$$f_j$$$.There are $$$k \\\\cdot n$$$ cards on the table. Each card contains a single integer: the $$$i$$$-th card contains number $$$c_i$$$. Also, you are given a sequence $$$h_1, h_2, \\\\dots, h_k$$$. Its meaning will be explained below.The players have to distribute all the cards in such a way that each of them will hold exactly $$$k$$$ cards. After all the cards are distributed, each player counts the number of cards he has that contains his favorite number. The joy level of a player equals $$$h_t$$$ if the player holds $$$t$$$ cards containing his favorite number. If a player gets no cards with his favorite number (i.e., $$$t=0$$$), his joy level is $$$0$$$.Print the maximum possible total joy levels of the players after the cards are distributed. Note that the sequence $$$h_1, \\\\dots, h_k$$$ is the same for all the players.InputThe first line of input contains two integers $$$n$$$ and $$$k$$$ ($$$1 \\\\le n \\\\le 500, 1 \\\\le k \\\\le 10$$$) — the number of players and the number of cards each player will get.The second line contains $$$k \\\\cdot n$$$ integers $$$c_1, c_2, \\\\dots, c_{k \\\\cdot n}$$$ ($$$1 \\\\le c_i \\\\le 10^5$$$) — the numbers written on the cards.The third line contains $$$n$$$ integers $$$f_1, f_2, \\\\dots, f_n$$$ ($$$1 \\\\le f_j \\\\le 10^5$$$) — the favorite numbers of the players.The fourth line contains $$$k$$$ integers $$$h_1, h_2, \\\\dots, h_k$$$ ($$$1 \\\\le h_t \\\\le 10^5$$$), where $$$h_t$$$ is the joy level of a player if he gets exactly $$$t$$$ cards with his favorite number written on them. It is guaranteed that the condition $$$h_{t - 1} < h_t$$$ holds for each $$$t \\\\in [2..k]$$$.OutputPrint one integer — the maximum possible total joy levels of the players among all possible card distributions.ExamplesInput4 31 3 2 8 5 5 8 2 2 8 5 21 2 2 52 6 7Output21Input3 39 9 9 9 9 9 9 9 91 2 31 2 3Output0NoteIn the first example, one possible optimal card distribution is the following:Player $$$1$$$ gets cards with numbers $$$[1, 3, 8]$$$;Player $$$2$$$ gets cards with numbers $$$[2, 2, 8]$$$;Player $$$3$$$ gets cards with numbers $$$[2, 2, 8]$$$;Player $$$4$$$ gets cards with numbers $$$[5, 5, 5]$$$.Thus, the answer is $$$2 + 6 + 6 + 7 = 21$$$.In the second example, no player can get a card with his favorite number. Thus, the answer is $$$0$$$.", "source": "CF", "vjudge": false, "processed": [{"prompt_md5": "97d7d66f", "template_md5": "35d339e4", "result": "There are $n$ players. Each player has a favorite number $f_j$. There are $k \\cdot n$ cards, each with a number $c_i$ on it.  You are also given a sequence $h_1, h_2, ..., h_k$.\n\nThe players need to divide the cards so that each player gets $k$ cards.  The joy level of a player is determined by how many of their $k$ cards have their favorite number on them.  The joy level is given by the sequence $h_1, h_2, ..., h_k$ where $h_t$ is the joy level if a player has $t$ cards with their favorite number.\n\nFind the maximum total joy level of all the players."}, {"prompt_md5": "ef050e5f", "template_md5": "465699a0", "result": "You have a set of cards with numbers on them and a set of people, each with a favorite number.  Each person must receive the same number of cards.  The happiness of each person depends on how many of their favorite numbers are on their cards.  Find the highest total happiness you can achieve."}]}